{
  "metadata": {
    "filename": "dc-appendix-13.000.pdf_id7830",
    "extracted_at": "2025-05-22T06:15:22.725773",
    "num_pages": 4,
    "title": "Section Title",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 11 for Word",
    "producer": "Adobe PDF Library 11.0",
    "creation_date": "D:20181231093852-08'00'",
    "modification_date": "D:20181231093853-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[A.13]-1 \nCity of Gresham Development Code \n \n(01/19) \nAPPENDIX 13.000 \nSTREET NAMING AND PROPERTY NUMBERING \nGeneral \nA13.001  Purpose and Authority   \nA13.002  Responsibility   \nA13.003  Application   \nProcedures and Standards \nA13.010  New Street Names   \nA13.011  Renaming of Existing Public Streets or Assignment of a Name to a Public Street Platted and \nRecorded without a Name   \nA13.012  Property Numbering   \nA13.013  Posting of Site, Property, or Building Address    \nPenalties \nA13.020  Violation and Penalties   \n \nGeneral \nA13.001  Purpose and Authority \nA. \nThe City of Gresham is responsible for determining new street names, re-naming City-owned \nstreets, and making logical address assignments and re-assignments as policy recommends within \nthe City limits.  Address assignments within the incorporated City are not the responsibility of the \nPostal Service but of the incorporated City. \nB. \nThe City has developed standards, procedures, and guidelines to meet this responsibility.  Street \nnaming and property addressing shall conform to the City of Gresham Street Naming and Property \nAddressing Guidelines, a document published separately. \nC. \nThe Manager shall make property address assignments and street naming assignments in \naccordance with the requirements of this ordinance.  The City Council shall rename existing \nstreets in accordance with the requirements of this ordinance. \nA13.002  Responsibility \nA. \nThe Manager or his/her designee, shall make property address assignments and street naming \nassignments utilizing, as appropriate, the City of Gresham Grid and the Portland Metropolitan \n(Metro) Grid. \nB. \nThe Manager is responsible for maintaining a log of address/street name conflicts.  The Planning \nCommission shall review the street name log annually and shall make recommendations for \ncorrection to the Council. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[A.13]-2 \nCity of Gresham Development Code \n \n(01/19) \nC. \nThe City is responsible for posting and maintaining public street signs reflecting the commonly \nused name for all City-owned streets unless the intersection abuts a County street or State \nhighway. \nD. \nThe property owner (or homeowner’s association, when applicable) is responsible for posting and \nmaintaining the property number (address) and for posting and maintaining any private street \nsigns. \nA13.003  Application \nThe Gresham City Council shall adopt by Resolution the City of Gresham Street Naming and Property \nAddressing Guidelines which shall apply to all property addresses and street naming assignments and \nreassignments within the Gresham city limits.  Regardless of original assignment, all properties annexed by \nthe City of Gresham are subject to this ordinance. \nProcedures and Standards \nA13.010  Purpose and Authority \nA. \nNames for new public and private streets shall be determined by the Manager in accordance with \nthe policies as set forth in the City of Gresham Street Naming and Property Addressing Guidelines. \nB. \nNames for new streets shall be assigned by the City under the Type I procedure in conjunction \nwith approval of construction drawings and Final Plat for a land division or by separate recorded \nstreet dedication document when there is no plat to be recorded.  Such names shall be recorded \nonly after prior written approval or signature by the Manager. \nA13.011  Renaming of Existing Public Streets or Assignment of a Name to a \nPublic Street Platted without a Name \nA. \nA public City street may be named or renamed following a Type IV procedure. \nB. \nA proposed street re-naming may be initiated by either of the following: \n1. \nResolution of the Council \n2. \nResolution of the Planning Commission \nA13.012  Property Numbering \nProperty numbering and building identification shall be determined by the Manager according to the \npolicies as set forth in the City of Gresham Street Naming and Property Addressing Guidelines. \nA13.013  Posting of Site, Property, or Building Address \nA. \nA property owner shall post the address as assigned by the City. \n1. \nFor new construction, the property and/or individual building address shall be posted on a \ntemporary sign of a size as determined by the Manager prior to or at the time of Building \npermit issuance. \n2. \nSuch temporary posting shall be consistent with the provisions of Section A6.060, with the \nexception of time limit, which may be extended until final approval of the affected building. \n3. \nThe permanent address shall be posted prior to occupancy of the building in a location and \nmanner as approved by the Manager.  No occupancy shall be issued until the address is \nposted in accordance with the approved addressing plan. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[A.13]-3 \nCity of Gresham Development Code \n \n(01/19) \nB. \nAn assigned property and/or building number shall be posted on the building. \n1. \nIf a number is painted with reflective paint on the curb, it shall be located no further than 3 \nfeet away from the driveway apron. \n2. \nPosting of the address on a mailbox or curb shall be considered supplementary to the posting \non a building wall and shall not be considered a complete posting of the property address. \nC. \nA corrected address shall be posted within 15 days either before or after the effective date on the \nOfficial Notification. \nPenalties \nA13.020  Violation and Penalties \nA. \nNo property may be occupied, no Certificate of Occupancy may be knowingly issued, and no final \ninspection may be performed until the subject property has been properly assigned an address and \nthe address has been correctly and clearly posted in accordance with this ordinance. \nB. \nA person violating a provision of this ordinance shall be subject to a fine of not more than $500.  A \nviolation shall be considered a separate violation for each day it continues. \nC. \nViolations of this ordinance shall constitute a nuisance, which may be abated by appropriate \nproceedings. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[A.13]-4 \nCity of Gresham Development Code \n \n(01/19) \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.725986",
  "extractor_version": "1.0.0"
}