{
  "metadata": {
    "filename": "dc-article-2.pdf_id7831",
    "extracted_at": "2025-05-22T06:15:25.445571",
    "num_pages": 4,
    "title": "Microsoft Word - Article 2.DOC",
    "author": "Richardson",
    "creator": "PScript5.dll Version 5.2.2",
    "producer": "Acrobat Distiller 9.5.5 (Windows)",
    "creation_date": "D:20140813113824-07'00'",
    "modification_date": "D:20140813113824-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[2.00]-1 \nCity of Gresham Development Code \n \n(8/14) \n \nARTICLE 2 \nINTRODUCTORY PROVISIONS \nGeneral \n2.0001  Title and Code Designation \n2.0002  Publication   \n2.0003  Purpose   \n2.0004  Scope and Compliance  \n2.0005  Conditions   \n2.0006  Interpretation   \n2.0007  Severability   \n2.0008  Abatement and Penalty   \n2.0009  Fees and Deposits \n \nGeneral \n2.0001  Title and Code Designation \nAll ordinances included in this and the following articles are Volume 3, Code, of the Community \nDevelopment Plan and are designated the “Gresham Community Development Code” and will be referred \nto as “code” or “Community Development Code.”  When referring to specific sections of the Community \nDevelopment Code, the letters “GCDC” shall precede the numerical designation. \n2.0002  Publication \nIn preparing revisions of the code for publication and distribution, the manager shall not alter the sense, \nmeaning, effect, or substance of the code or an ordinance.  With regard to the code and ordinances the \nmanager may renumber or re-letter sections and parts of sections, change the wording of catch lines, \nrearrange sections, change reference numbers to agree with renumbered articles, chapters, sections, or other \nparts, substitute the proper subsection, section, chapter, article or other division numbers, strike out figures \nor words that are merely repetitious, change capitalization for the purpose of uniformity and correct clerical \nor typographical errors. \n2.0003  Purpose   \nThese regulations are adopted for the following purposes: \nA. \nTo protect and provide for the public health, safety, and general welfare of the City. \nB. \nTo guide the future growth and development of the City, in accordance with the Community \nDevelopment Plan. \nC. \nTo provide for adequate light, air, and privacy, to secure safety from fire, flood, and other danger, \nand to prevent overcrowding of the land and undue congestion of population. \nD. \nTo protect the character and the social and economic stability and to encourage the orderly and \nbeneficial development of all parts of the City. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[2.00]-2 \nCity of Gresham Development Code \n \n(8/14) \n \nE. \nTo protect and conserve the value of land throughout the City and the value of buildings and \nimprovements upon the land, and to minimize the conflicts among the uses of land and buildings. \nF. \nTo guide public and private policy and action in order to provide adequate and efficient \ntransportation, water, sewerage, schools, parks, playgrounds, recreation and other public \nrequirements and facilities. \nG. \nTo provide the most beneficial relationship between the uses of land and buildings and the \ncirculation of traffic throughout the City by promoting a variety of transportation choices including \nwalking, bicycling, transit and automobile and by reducing parking space requirements, with \nparticular regard to the avoidance of congestion in the streets and highways as well as pedestrian \ntraffic movements appropriate to the various uses of land and buildings, and to provide for the \nproper location and width of streets and building lines. \nH. \nTo establish reasonable standards of design and procedures for land division in order to further the \norderly layout of use of land; and to ensure proper legal descriptions and monumenting of \nsubdivided land. \nI. \nTo ensure that public facilities are available and/or provisions have been made so public facilities \nwill have sufficient capacity to serve the proposed development. \nJ. \nTo prevent the pollution of air, streams, and ponds; to assure the adequacy of drainage facilities; to \nsafeguard the water table; and to encourage the wise use and management of natural resources \nthroughout the city in order to preserve the integrity, stability, and beauty of the community and \nthe value of the land. \nK. \nTo preserve the natural beauty and topography of the city and to ensure appropriate development \nwith regard to these natural features. \nL. \nTo provide for open spaces through the most efficient design and layout of the land while \npreserving the density of land as established in the Community Development Plan. \n2.0004  Scope and Compliance   \nA parcel of land may be used, developed by land division or otherwise, and a structure may be used or \ndeveloped by construction, reconstruction alteration, occupancy, or otherwise only as this ordinance \npermits. In addition to complying with the criteria and other provisions within this ordinance, each \ndevelopment shall comply with the applicable procedures set forth in the Community Development Code \nordinance. The requirements of this ordinance and approvals of land use applications under this ordinance \nrun with the land and are transferred with ownership. The approval, including any conditions, time limits, \nor restrictions, apply to all persons undertaking a development on the land, the proprietor of a use or \ndevelopment on the land, or the owner of the land underlying a development, or their successors in interest. \n2.0005  Conditions  \nThe applicant has the duty to comply with reasonable conditions laid down by the approval authority for \ndesign, dedication, improvement, and restrictions on use. \n2.0006  Interpretation   \nWhere the conditions imposed by a provision of this ordinance are less restrictive than comparable \nconditions imposed by any other provisions of this ordinance or any other ordinance, the provisions which \nare more restrictive shall govern. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[2.00]-3 \nCity of Gresham Development Code \n \n(8/14) \n \n2.0007  Severability   \nThe provisions of this ordinance are severable. If any section, sentence, clause or phase of this ordinance is \nadjudged by a court of competent jurisdiction to be invalid, the decision shall not affect the validity of the \nremaining portions of this ordinance. \n2.0008  Abatement and Penalty   \nA. \nA person violating a provision of this Code is subject to a fine of not more than $500.  A violation \nis considered a separate violation for each day it continues. \nB. \nViolation of this code constitutes a nuisance. In addition to any other remedies, the Manager may \nenforce this Code by compliance order, stop work order, abatement proceedings, or civil action as \nprovided in GRC Article 7.50, or as otherwise authorized by law. \n2.0009  Fees and Deposits \nAll fees and deposits shall be set and adjusted by Council resolution. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[2.00]-4 \nCity of Gresham Development Code \n \n(8/14) \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.445910",
  "extractor_version": "1.0.0"
}