{
  "metadata": {
    "filename": "dc-appendix-7.000.pdf_id7827",
    "extracted_at": "2025-05-22T06:15:22.962453",
    "num_pages": 2,
    "title": "Section Title",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 11 for Word",
    "producer": "Adobe PDF Library 11.0",
    "creation_date": "D:20170913100040-07'00'",
    "modification_date": "D:20180622133301-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[A.7]-1 \nCity of Gresham Development Code  \n \n(09/17) \nAPPENDIX 7.000 \nVACATIONS \nGeneral \nA7.001  Vacation Procedures   \nA7.002  Submittal Requirements  \nA7.003  Vacation Criteria  \nA7.004  Reservation and Conditions Attached to a Vacation \n \nGeneral \nA7.001  Vacation Procedures   \nA. \nA proposal to vacate all or part of any street, alley, plat, greenway, or public place shall be \nconducted under the Type IV procedure.  \nB. \nNotice of the hearing shall be mailed to owners of all property situated within 300 feet of the \nboundaries of the property to be vacated and the Multnomah County Tax Assessor’s Office.  \nNotice shall be posted pursuant to Section 11.0602. \nC. \nA proposal may be initiated by the council.  If the council initiates a proposal, the requirements, of \nsubsection A7.002(D) do not apply. \n \nA7.002  Submittal Requirements   \nA proposal may be initiated by petition of the affected property owners.  The petition shall include the \nfollowing: \nA. \nA description of the property to be vacated. \nB. \nThe reason for the vacation. \nC. \nThe proposed use of the property once vacated. \nD. \nThe petitioner must attach to the petition the written consents of all the abutting property owners. \n \nA7.003  Vacation Criteria   \nThe council shall base its decision to vacate property on the following criteria: \nA. \nWhether the proposal is consistent with the Gresham Community Development Plan. \nB. \nWhether the vacation will substantially reduce the market value of abutting property.  This \ncriterion need not be considered if the owners of the property affected consent to the vacation or \nprovisions have been made to pay damages. \nC. \nWhether the public interest will be prejudiced by the vacation. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[A.7]-2 \nCity of Gresham Development Code  \n \n(09/17) \nA7.004  Reservation and Conditions Attached to a Vacation   \nThe council may attach the following reservations and conditions to the approval of a vacation: \nA. \nThat an easement for a public facility, publicly owned utility or other utility be reserved. \nB. \nThat a public facility, publicly owned utility or other utility be constructed, relocated or removed. \nC. \nThat a plat to be vacated be replatted. \nD. \nIf applicable, back taxes shall be paid. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.962594",
  "extractor_version": "1.0.0"
}