{
  "metadata": {
    "filename": "dc-appendix-5.000.pdf_id7825",
    "extracted_at": "2025-05-22T06:15:20.767663",
    "num_pages": 33,
    "title": "DC Appendix 5.000",
    "subject": "Development Code Appendix 5.000 Public Facilities",
    "creator": "Acrobat PDFMaker 25 for Word",
    "producer": "Adobe PDF Library 25.1.211",
    "creation_date": "D:20250416121211-07'00'",
    "modification_date": "D:20250416170137-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[A.5]-1 \nCity of Gresham Development Code \n(04/25) \nAPPENDIX 5.000 \nPUBLIC FACILITIES \nA5.000  General \nA5.001  Policy   \nA5.002  Design and Construction Standards   \nA5.003  Guarantee of Completion  \nA5.004  Warranty Guarantee  \nA5.005  Utility Easements Owned by the Public \nA5.006  Subdivisions and Land Partitions   \nA5.007  Commercial, Mixed Use, Industrial, Institutional, and Moderate and High Density Residential Building \nPermits Development   \nA5.008  Suspension and Stop Work   \nA5.009  Deferral or In-Lieu-Of Payments for Public Improvements   \nA5.010  Plan Check, Inspection    \nA5.011  Standards for Utilities, Utility Lines, Stormwater Facilities and Rights-of-Way and Public Access Easements \nin the Pleasant Valley Environmentally Sensitive/Restoration Areas (ESRA-PV) and the Springwater \nEnvironmentally Sensitive Resource Areas (ESRA-SW)    \nA5.100  Sanitary Sewer Facilities \nA5.101  General Provisions  \nA5.102  Separate Sewer Connections   \nA5.103  Sewage Pumps/Lift Stations  \nA5.104  System Design   \nA5.105  Subsurface Sewage Disposal  \nA5.106  Termination of the Use of a Subsurface Sewage Disposal System   \nA5.107  Use of Public Sewers   \nA5.200  Surface Water Management Systems \nA5.201  General Provisions   \nA5.202  Accommodation of Upstream Drainage   \nA5.203  Effect on Downstream Drainage   \nA5.204  Data Requirements   \nA5.205  Drainage Management Practices   \nA5.206  Detention Requirements   \nA5.207  Subsurface Storm Drainage Facilities   \nA5.208  Minimum Design Criteria   \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[A.5]-2 \nCity of Gresham Development Code \n(04/25) \nA5.210  Private Drainage Systems   \nA5.220 Stormwater Quality Control Requirements \nA5.300  Water Facilities \nA5.301  General Provisions   \nA5.302  System Design  \nA5.303  Grid System  \nA5.304  Connection to Public Water Lines   \nA5.305  Water Line Oversizing and Reimbursement   \nA5.400  Streets \nA5.401  General Provisions   \nA5.402  General Design Requirements   \nA5.403  Truck Restrictions   \nA5.404  Residential Lot Access to Major and Standard Arterials \nA5.405  Street Surfacing and Improvements   \nA5.406  Street Lighting   \nA5.407  Street and Traffic Control Sign Standards  \nA5.408  Half Streets  \nA5.409  Additional Right-of-Way and Street Improvements   \nA5.410  Street Names   \nA5.411  Traffic Analysis \nA5.412  Utility License Required     \nA5.500  Transportation System Description and Function \nA5.501  Streets   \nA5.502  Intersections   \nA5.503  Driveways   \nA5.504  Transit Facility Standards  \nA5.505  Transitway Standards for Light Rail   \nA5.506  Sidewalks   \nA5.507  Bicycle Facilities   \nA5.508  Public Paths  \nA5.509  Public Trails \nA5.510  Underground Utilities   \nA5.511  Street Trees   \nA5.512  Additional Public Facilities Requirements   \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[A.5]-3 \nCity of Gresham Development Code \n(04/25) \nA5.000  GENERAL \nA5.001  POLICY   \nDevelopment shall coincide with provision of adequate public facilities and services including access, drainage, \nwater and sewerage services. \nTo meet this policy, a development shall be required to provide the above public facilities to serve the site and to \nextend the public facilities to provide for the logical continuation of the City's utility and street systems. A \ndevelopment may be required to modify or replace existing off-site systems to provide adequate public facilities. \nThe Manager shall have the authority to review designs, approve plans, inspect construction and accept public \nimprovements, for City ownership, operation and maintenance. The Manager may establish administrative \nprocedures for the above process in order to protect the life, safety, and welfare of the public. \nA5.002  DESIGN AND CONSTRUCTION STANDARDS   \nDesign and construction of all public facility improvements shall be in accordance with the Gresham Community \nDevelopment Code, Gresham Public Works Standards and the approval conditions of the applicable development \npermit(s). The Gresham City Council shall adopt the Gresham Public Works Standards by Resolution. \nA5.003  GUARANTEE OF COMPLETION   \nA. \nPrior to approval of any final map or plat, the required public improvements must be completed and all \ndevelopment fees and charges must be paid, or a Guarantee of Completion shall be required to ensure \nthe completion of or payment for: public improvements; all required private water quality and detention \nfacilities; and payment of development fees and charges.  Prior to construction of any privately financed \npublic improvement, a Guarantee of Completion shall be required for all improvement costs, including \ngrading and erosion prevention, other than those improvements constructed on private property which \nwill become public upon City approval of a final map or plat.  The Guarantee of Completion shall be for \n110% of the estimated costs of the public improvements.  The estimated costs shall be determined by \nthe Manager based on the Engineer's estimate, the tabulation of bids or other method acceptable to the \nManager. \nB. \nThe Manager may allow reduction of the guarantee amount as portions of the public improvements are \nsatisfactorily constructed and inspected. 10% percent of the cost of those portions constructed shall be \nretained as the guarantee amount is reduced. Upon acceptance for ownership and operation, the \nguarantee shall be released or returned unless required to satisfy the warranty guarantee requirement in \nSection A5.004. \nC. \nThe Manager shall establish standard forms for the Guarantee of Completion and an administrative \nprocedure for reduction of guarantee amount when permitted. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[A.5]-4 \nCity of Gresham Development Code \n(04/25) \nA5.004  WARRANTY GUARANTEE   \nA. \nA guarantee of completion for warranty work shall be required prior to City acceptance for ownership \nand operation of privately financed public improvements. The warranty guarantee shall be for 10% of the \nestimated construction cost of the public improvements, but in no case will be less than $2,500 and will \nbe in effect from the date of acceptance for ownership and operation for a period of two years.  \nB. \nRepairs required within the warranty period shall be guaranteed for two years from the date of \ncompletion of such repair.  The warranty guarantee may be incorporated as part of the guarantee of \ncompletion for construction or provided separately.  The City may require a separate warranty guarantee \nfor any repairs done pursuant to the warranty obligation.  Such separate warranty guarantee shall be for \na period of two years from the date of completion of such repairs.  The Manager shall establish standard \nforms and procedures for the warranty guarantee. \nA5.005  UTILITY EASEMENTS OWNED BY THE PUBLIC \nA. \nPrior to construction of utilities owned by the public outside the public right-of-way or prior to the \napproval of a final plat or final map on a development for which such off-site utilities are required, \napplicant shall provide the City with easement documents for the construction, operation and \nmaintenance of such utilities.  The easements shall be substantially in the form provided by the City and \nfurnished to the City for review and approval prior to recording.  All applicable recording fees shall be the \nresponsibility of the developer and the City shall record the easements. All easements must be shown on \nthe public facilities construction drawings. \nB. \nFor utilities owned by the public serving lots or parcels within a subdivision or partition, descriptions, \nconditions, the location, purpose, grantee and width of the easement shall be shown on the plat map.  \nC. \nIf the utility owned by the public is outside the plat boundaries or serves areas outside the plat \nboundary, recordation of a separate instrument for the easement shall be required. \nD. \nSize of the easements shall be in accordance with the Public Works Standards.  \nA5.006  SUBDIVISIONS AND LAND PARTITIONS \nA. \nIn all subdivisions and land partitions approved under this document, public streets and other public \ntransportation facilities, sewer, water and storm drainage facilities shall be designed and constructed in \naccordance with Public Works Standards.  All construction within the public right-of-way, and publicly \nowned utility easements shall be in conformance with the above standards. \nB. \nWhen required for continuation of City transportation and utility systems, streets, storm drains, sanitary \nsewers and waterlines shall be extended to the plat boundaries or to a terminus approved by the \nManager where physical constraints prohibit extension to the plat boundary. Improvements outside the \nboundary of a phased subdivision may be staged as determined by the Manager. \nC.  \nThe plat shall be recorded prior to the issuance of any building permits. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[A.5]-5 \nCity of Gresham Development Code \n(04/25) \nD. \nSubject to the following conditions, building permits for model homes may be approved prior to the \nrelease of subsequent permits in accordance with A5.006(E) & (F): \n1. \nOne model home is permitted for a land division with a total of 20 or fewer lots in all phases. For a \nsubdivision with a total of more than 20 lots in all phases, the maximum number of model homes \npermitted for each phase shall be 10% of the total number of lots in that phase, rounded down to \nthe nearest whole number. \n2. \nThe final plat must be recorded prior to issuance of the model building permit. \n3. \nThe applicant must select the lot or lots for the model homes and the Manager must approve the \nselection. \n4. \nFire coverage, including emergency access and water supply, must be approved by the Fire \nDepartment. Connection to the sewer, water and storm drain systems will not be permitted until \nthose systems are complete and approved by the Manager. \n \nE. \nThe Manager may approve issuance of up to 50% of the building permits after the public improvements \nare completed as described below:  \n1. \nSewer, water and stormwater facilities, except for planting requirements, are complete and \noperational, constructed to City standards and ready for acceptance (“Final” inspection corrections \ncompleted). \n2. \nStreets are curbed and at least one lift (2-inch minimum section) of asphalt is installed. Streetlight \ninstallations shall be completed and ready for energizing. \n3. \nAll site grading is completed and approved in accordance with the Public Works Standards, the City \nof Gresham Community Development Code and the Gresham Revised Code. \nF. \n100% release of building permit shall not be allowed until: \n1. \nAll public improvements necessary to serve structures that could be built pursuant to such building \npermits have been accepted by the Manager, \n2. \nAll fees and charges related to such public improvements have been paid, and \n3. \nAll work is completed in accordance with applicable standards including but not limited to this \nCode and Public Works Standards, the Gresham Revised Code, and applicable conditions of \napproval. \n4. \nIf plantings, including but not limited to those in stormwater facilities, are not complete, the \nManager may release 100% of the building permits if: \na. \nThe City has been paid for and agreed to take over the responsibility for the plantings, or \nb. \nThe developer has provided a separate performance guarantee in an amount of 200% of the \nestimated cost of the plantings with a date certain when that work will be complete to \ncoincide with the Spring or Fall planting seasons, not to exceed 12 months past the date of \nacceptance of the public facilities for ownership and operation by the City. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[A.5]-6 \nCity of Gresham Development Code \n(04/25) \nG. \nIf the criteria for 50% release has been met but criteria for 100% release of building permits have not \nbeen met, the Manager may elect, if it is in the best interest of the City, to approve release of additional \nbuilding permits.  The Manager shall ensure that the City’s and public’s interests are adequately \nprotected before releasing any additional permits. \nA5.007  COMMERCIAL, MIXED USE, INDUSTRIAL, INSTITUTIONAL, AND \nMODERATE AND HIGH DENSITY RESIDENTIAL BUILDING PERMITS DEVELOPMENT  \nA. \nCommercial, mixed use, industrial, institutional, and moderate and high density residential building \npermits shall not be issued until the receipt of engineered drawings and a Guarantee of Completion as \nper Section A5.003 for any required public improvements.  \nB. \nGenerally, any required public improvements must be completed before occupancy is permitted. \nCompletion of the required public improvements may be required prior to issuance of building permits \nwhere Manager determines that it is necessary for the public health, safety and welfare. \nC. \nPublic improvements required for site design and land partition permits in the above districts may be \nstaged to coincide with the staging of private improvements to the property when the following \nconditions exist: \n1. \nIt is impractical to construct all public facilities at the time of the initial development permit due to \nthe scale of development, conflict with planned public improvement projects, or physical \nconstraints. \n2. \nStaging will not jeopardize the logical extension of public facilities or result in significantly \nincreased costs to the public. \n3. \nThe staging of public improvements will occur in increments practical for construction. \n4. \nThe required off-site public facilities are provided to the original proposed for development. \n5. \nThe public facilities provided will be adequate to serve each building permit as it is issued.  Staging \nof public improvements may be allowed for the following permit applications:  \na. \nPartition and design review where less than all lots created are included in the application \nfor design review;  \nb. \nDesign review which is staged under Article 7 of the Development Code;  \nc. \nDesign review which does not include the total parcel;  \nd. \nA partition without design review. \nD. \nThe Manager may elect to withhold final inspection or the issuance of a certificate of occupancy until: \n1. \nAll public improvements necessary to serve the structures have been accepted by the Manager, \nand \n2. All fees and charges related to such public improvements have been paid. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[A.5]-7 \nCity of Gresham Development Code \n(04/25) \nA5.008  SUSPENSION AND STOP WORK   \nFor public facilities to be installed in compliance with the Public Works Standards of the City of Gresham, the \nsuspension of work shall be in accordance with the Public Works Standards. In addition, the Manager may issue a \nstop work order pursuant to GRC 7.50.100 et. seq. at any time the work is not in compliance with such standards. \nThe stop work order may apply to work in the public right-of-way, erosion control work, and work pursuant to a \nbuilding permit except as limited by building code.   \nA5.009  DEFERRAL OR IN-LIEU-OF PAYMENTS FOR PUBLIC IMPROVEMENTS   \nThe Manager may determine that physical conditions make the required public improvements impractical; there \nis a lack of rough proportionality between the nature and extent of the required work and the nature and extent \nof the projected impacts caused by the proposed development; or it would be appropriate to coordinate the \nrequired work with improvements funded by other development or the City.  In such a case, the Manager may \nelect to defer the work or require the payment of a cash-in-lieu-of improvement charge in an amount \ndetermined by the Manager.  If the work is deferred, the property owner shall sign an agreement that commits \nthe property to participate in the future cost of the work. \nA5.010  PLAN CHECK, INSPECTION \nIn order to carry out the provisions of Appendix 5, the City shall review and approve plans for, inspect the \nconstruction of and accept public improvements in accordance with the following provisions: \nA. \nAll development shall be subject to the plan check and inspection.  This includes, but is not limited to:  1) \nthe review and approval of public improvement plans; 2) the inspection of public improvements \nconstructed; 3) the testing of materials; 4) project administration; and 5) any review provided by City \ndepartments related to the project. \nB. \nA person required to construct the public improvements shall pay a fee in the amount of actual costs \nincurred by the City to provide plan check and inspection.  The City shall require an advance deposit of \nthe fee and, if costs are anticipated to exceed the deposit, the City may require additional deposit(s) to \ncover incurred and anticipated costs.  The person required to construct the public improvements shall \nmake the required deposit within ten days of the request.  Failure to make the additional deposit may \nresult in a suspension of plan check and inspection by the City. \nC. \nNotice to proceed shall be obtained within one year from the date of approval of the plan, unless the \nManager approves a longer period of time.  Thereafter, a Notice to Proceed shall not be issued unless the \npublic improvement plan is resubmitted in compliance with the Public Works Standards in effect at the \ntime the plan is resubmitted.  All public improvements shall be completed within two years of the \nissuance of the Notice to Proceed unless the Manager approves a longer period of time. \nD. \nIn addition to any other remedy allowed by law, in the event of a breach of any agreement relating to the \npayment of System Development Charges for the development or if any money is owed to the City \npursuant to this section, the City may suspend plan check and inspection.  The City shall not accept the \npublic improvements for ownership and operation until the breach is cured or the money paid. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[A.5]-8 \nCity of Gresham Development Code \n(04/25) \nE. \nAs used herein, “public improvement” includes work related to plans submitted pursuant to Section \nA5.202.  \nA5.011  STANDARDS FOR UTILITIES, UTILITY LINES, STORMWATER FACILITIES \nAND RIGHTS-OF-WAY AND PUBLIC ACCESS EASEMENTS IN THE PLEASANT VALLEY \nENVIRONMENTALLY SENSITIVE/RESTORATION AREAS (ESRA-PV) AND THE \nSPRINGWATER ENVIRONMENTALLY SENSITIVE RESOURCE AREAS (ESRA-SW) \nESRA-PV utilities, utility line and stormwater facility standards are located in Section 4.1441. ESRA-PV right-of-\nway and public access easement standards are found in Section 4.1442. \nESRA-SW utilities, utility line and stormwater facility standards are located in Section 4.1581. ESRA-SW right-of-\nway and public access easement standards are found in Section 4.1582. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n[A.5]-9 \nCity of Gresham Development Code \n(04/25) \nA5.100  SANITARY SEWER FACILITIES \nA5.101  GENERAL PROVISIONS   \nA. \nThe applicant shall install sanitary sewerage facilities in a manner prescribed by the Department of \nEnvironmental Quality (DEQ) and the City of Gresham. Connection to sewerage lines shall be permitted if \nthe Manager determines that the following facilities have adequate additional capacity to serve the \ndevelopment: \n1. \nThe interceptor, trunk and feeder lines to the wastewater treatment plant; and \n2. \nThe wastewater treatment plant. \nB. \nAll connections to and uses of the sanitary sewer system shall be made in accordance with the Gresham \nRevised Code.  The DEQ requirements shall be as detailed in the latest OAR, Chapter 340, Division 52 \nexcept that the City of Gresham minimum requirements shall be per OAR 340-52 Appendices A, \n“Guidelines for Public Sewers,” and B, “Guidelines for Raw Sewage Lift Stations”. \nC. \nSanitary sewer facilities shall be designed and constructed in conformance to the Public Works \nStandards. \nD. \nWhen sewer availability or topographic constraints prohibit installation of public sewers within public \nrights-of-way (i.e. streets), the public sewer line shall be placed in a public easement. Except with the \nconsent of the Engineer, the easement shall be placed on a single property, so as to minimize the \ndisruption of adjacent properties. The easement must comply with Section A5.005. \nA5.102  SEPARATE SEWER CONNECTIONS   \nAll lots must have separate connections to the public sanitary sewer system in accordance with all of Chapter 4. \nWastewater of the Gresham Revised Code (in particular, see Article 4.05.010 Definitions – Sanitary Sewer Main, \nArticle 4.15. Connection to Sanitary Sewerage System Required, and Article 4.20. Building Sewers). \nA5.103  SEWAGE PUMPS/LIFT STATIONS   \nAll public sewer improvements for lands divisions and other developments shall be designed to provide gravity \nservice to potential building envelopes for all lots. This shall apply except where topographical and/or \njurisdictional limitations exist and gravity sewer service cannot be obtained. \nA5.104  SYSTEM DESIGN   \nSanitary sewer system shall be designed for the ultimate population, which shall be determined by the land uses \nidentified by the Community Development Plan. System design shall comply with the Sewer Master Plan. System \nlocation, capacity and grade shall allow for extension of future development. Sewer capacities within a \nsubdivision or partition shall be adequate to handle the sewage contributed by that subdivision or partition. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": " \n[A.5]-10 \nCity of Gresham Development Code \n(04/25) \nSewer lines through a subdivision or partition shall be sized to be adequate in capacity for ultimate tributary \nareas outside of the subdivision or partition. \nA5.105  SUBSURFACE SEWAGE DISPOSAL   \nA. \nNew subsurface disposal systems may be permitted in those portions of the City outside the mid-\nMultnomah County sewer implementation plan affected area, subject to the following conditions: \n1. \nOnly one single detached dwelling (with or without an accessory dwelling unit) or duplex can be \nserved. \n2. \nThe parcel must be an existing lot of record. \n3. \nParcel and proposed subsurface system must conform to all County and State standards. \n4. \nA public sewer line is not within the vicinity of the property as provided by Chapter Four of the \nGresham Revised Code, nor are there plans to extend sewer service through a project identified in \nthe City's Capital Improvement Plan, a proposed sanitary sewer local improvement district, or in \nconjunction with an approved development permit. \n5. \nNo new commercial, industrial, institutional, or multifamily use may be served by a subsurface \nsewage disposal system. \n6. \nThe property must not be within the boundaries of a proposed sanitary sewer LID. \n7. \nThe applicant must agree to connect to the sewer when it becomes available. \nAn existing commercial, industrial or institutional use which is currently using subsurface disposal may expand, if \nits existing subsurface disposal system can accommodate the increased loading without modification. A licensed \nsanitarian must confirm the adequacy of the existing system for the proposed expansion of use. An existing single \ndetached dwelling or duplex presently using subsurface sewage disposal may be remodeled provided that such \nremodel results in no more than two units on the lot. \nAn existing subsurface disposal system within a parcel being developed which does not fit the above criteria must \nbe abandoned in accordance with Chapter 4 of the Gresham Revised Code, County and DEQ administrative rules, \nand any buildings remaining as part of the development must be connected to the public sewer system. \nA5.106  TERMINATION OF THE USE OF A SUBSURFACE SEWAGE DISPOSAL \nSYSTEM  \nTermination of subsurface sewage disposal systems will be in accordance with Gresham Revised Code Chapter 4 \nand DEQ regulations. \nA5.107  USE OF PUBLIC SEWERS   \nUse of the public sewer shall be subject to the conditions and restrictions of Chapter 4 of the Gresham Revised \nCode. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": " \n[A.5]-11 \nCity of Gresham Development Code \n(04/25) \nA5.200  SURFACE WATER MANAGEMENT SYSTEMS \nA5.201  GENERAL PROVISIONS  \nA. \nStormwater Drainage System \n1. \nThe Manager shall issue a development permit only where there is adequate capacity in the storm \ndrainage system to accommodate the runoff from the site. \n2. \nAll storm water from the site shall be conveyed to a point of disposal approved by the Manager. \n3. \nThe applicant is responsible for extension of the storm drainage system. \n4. \nStorm drainage facilities shall be designed and constructed in conformance with the Stormwater \nManagement Manual. \nB. \nStormwater Treatment System \n1. \nThe Manager shall issue a development permit only where stormwater treatment controls have \nbeen incorporated into site design for all developments specified in Section 9.0520.  \n2. \nStormwater quality facilities shall be designed and constructed in conformance with the City of \nGresham Stormwater Management Manual and Public Works Standards. \nC. \nWhen storm drain availability or topographic constraints prohibit installation of public storm drains \nwithin public rights-of-way (i.e. streets), the public storm drain line shall be placed in a public easement. \nExcept with the consent of the Engineer, the easement shall be placed on a single property, so as to \nminimize the disruption of adjacent properties. Easements may also be required for public stormwater \nretention, detention and public stormwater quality facilities. The easement must comply with Section \nA5.005. \nA5.202  ACCOMMODATION OF UPSTREAM DRAINAGE   \nAny extension of the public storm drainage facilities shall be designed to accommodate all potential runoff from \nthe upstream tributary areas, whether such areas are inside or outside the development. The quantity of runoff \nto be accommodated shall be based upon the ultimate potential watershed of all upstream development. \nUpstream development shall be as permitted by the ultimate land use in the Community Development Plan. The \nbasis for the design of all public system improvements shall be the design storm(s) as set forth in the Stormwater \nManagement Manual and/or as required by the conditions of approval for the project. \nA5.203  EFFECT ON DOWNSTREAM DRAINAGE   \nWhere it is anticipated that the additional runoff incident to the development will overload an existing drainage \nfacility, the approval authority shall withhold approval of the development until provisions have been made for \nimprovement of said potential condition. If development will increase or concentrate runoff across an adjacent \nprivate property, written permission must be obtained from the affected property owner. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": " \n[A.5]-12 \nCity of Gresham Development Code \n(04/25) \nA5.204  DATA REQUIREMENTS   \nA. \nAll applications shall include sufficient information for the Manager to evaluate the applicant's intent to \nconvey the site's storm water to an acceptable point of disposal in accordance with Section 9.0500 of this \ndocument, and the feasibility of his proposed methods to do so. This information, unless otherwise \nstated in this document, may be included as part of the site development plan, preliminary map or \npreliminary plat. \nB. \nIf the site lies within, or partially within, the Hillside Constraint District, the special reports described in \nSection 5.0200 will be required as part of the application. If the property contains terrain over 15% slope \nwhich is outside the mapped Hillside Physical Constraint Overlay District, the Manager may require some \nor all of those reports be submitted to show the feasibility of the applicant's proposal.   \nC. \nSufficient data shall be included with any building permit application to show compliance with Sections \n9.0510, 9.0513, 9.0514 and A5.200 of this document. The Manager may require that a grading and \ndrainage plan meeting the requirements of Section 9.0502 be submitted with the building permit \napplication. This requirement shall be based on scale of development, significant cuts and fills or \nlikelihood of serious drainage problems. \nD. \nAn approved grading and drainage plan meeting the requirements of Section 9.0502 will be required \nprior to start of construction or final plat approval for any subdivision. \nE. \nFloodplain information, delineating the 100-year floodplain limits, shall be shown where it occurs within \nthe development. Floodplain limits shall be based on maps prepared by the U.S. Army Corps of Engineers \nand the Federal Emergency Management Agency (FEMA). Where more accurate information is available, \nit shall be used by the design engineer. \nA5.205  DRAINAGE MANAGEMENT PRACTICES   \nStorm drainage systems shall comply with the recommendations and requirements of accepted basin stormwater \nMaster Plans.  In the absence of a basin stormwater master plan, or where specific recommendations or \nrequirements do not exist in an accepted master plan, or where downstream facilities are deemed inadequate by \nthe Manager, a development may be required to employ drainage management practices which minimize the \namount and rate of surface water runoff into the public stormwater system. Such storm drainage systems shall \ncomply with the City of Gresham Stormwater Management Manual until stormwater master plans are adopted \nand long-term management systems/structures are available.  Drainage management practices may include, but \nare not limited to: \nA. \nEmphasizing natural groundwater infiltration recharge (where supported by soil analysis) and natural \ndrainageways;  \nB. \nMinimization of impervious surfaces;   \nC. \nPrevention of uncontrolled runoff from developments; \nD. \nTemporary Ponding of Water;  \nE. \nPermanent Storage basins; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": " \n[A.5]-13 \nCity of Gresham Development Code \n(04/25) \nF. \nStabilization of natural drainageways as necessary below drainage and culvert discharge points for a \ndistance sufficient to convey the discharge without channel erosion; runoff from impervious surfaces \nshall be collected and transported to a natural drainageway with sufficient capacity to accept the \ndischarge. \nA5.206  DETENTION REQUIREMENTS  \nRequirements for detention, in accordance with Public Works Design Standards Section 4.0000 – Storm Drainage, \nshall apply with the following exception: \nA. \nDevelopment that will add or replace less than 1,000 square feet of impervious area. \nA5.207  SUBSURFACE STORM DRAINAGE FACILITIES   \nThe requirement for public storm drains may be met by the use of private, on-site, infiltration-groundwater \nrecharge storm water disposal under the following conditions: \nA. \nA geotechnical investigation is provided which shows the suitability of the soils for the permanent use of \ninfiltration-groundwater recharge systems.  Such investigations shall include one or more in-situ, \npercolation tests conducted in conformance with City of Gresham requirements for such tests and as set \nforth in the Public Works Design Standards, Section 4.0000 – Storm Drainage. \nB. \nThe use of infiltration-groundwater recharge disposal will not jeopardize the implementation of a Basin \nMaster Plan or preclude the extension of required major storm drain improvements. \nC. \nThe use of infiltration-groundwater recharge stormwater disposal complies with the regulatory \nrequirements of the Oregon Department of Environmental Quality (DEQ) Underground Injection Control \n(UIC) Program.  Refer to Chapter 340, Division 44 et. Seq. Oregon Administrative Rules, Construction and \nUse of Waste Disposal Wells or Other Underground Injection Activities (Underground Injection Control). \nOn-site systems proposed under this section shall be designed and constructed to meet public facility \nperformance standards in accordance with the Public Works Design Standards, Section 4.0000 – Storm Drainage.  \nOnce constructed, the on-site system shall be privately owned, operated and maintained. It shall be the owner's \nresponsibility to maintain or replace the system to prevent runoff to the public right-of-way or other properties. \nA5.208  MINIMUM DESIGN CRITERIA   \nDesign Storm - The design storm recurrence interval, and duration, to be used in the design of all public \nstormwater systems shall be in accordance with the Public Works Design Standards. \nA5.210  PRIVATE DRAINAGE SYSTEMS   \nWhen subdivision lots drain to the rear, it may be necessary to provide a private drainage system in private \neasements.  This system shall be for the collection of runoff from roof drains, footing drains, and surface runoff. \nThis system shall be designed to meet the Oregon Plumbing Specialty Code requirements.  Maintenance of \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": " \n[A.5]-14 \nCity of Gresham Development Code \n(04/25) \nprivate drainage systems shall be the responsibility of the property owner and/or homeowners association or \nequivalent.  Maintenance responsibility shall include all elements of the system up to the point of connection \nwith a public stormwater system. Such connection shall be subject to the City approval. \nA5.220  STORMWATER QUALITY CONTROL REQUIREMENTS  \nStormwater quality control requirements shall be in accordance with Sections 9.0520, 9.0521, and the \nStormwater Management Manual. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": " \n[A.5]-15 \nCity of Gresham Development Code \n(04/25) \nA5.300 – WATER FACILITIES \nA5.301  GENERAL PROVISIONS   \nA. \nWater distribution systems shall be designed to meet State Water Administrative Rules, and the \nguidelines of the current adopted Water System Master Plan. \nB. \nExcept as authorized by Subsection (C), an applicant for a development permit shall provide for \ninstallation of water distribution and fire protection facilities necessary to directly serve the proposed \ndevelopment. Required water system demands shall be met by maintaining the minimum operating \npressures required by the City. For low density residential areas, the minimum static pressure shall be 35 \npsi (pounds per square inch) and the minimum fire flow shall be 1,000 gpm (gallons per minute). The \nfacilities shall be connected to an approved existing water system. All water lines shall be located within \nthe public right-of-way or as directed by the City Engineer. The applicant must demonstrate that \nadequate facilities are available to properly serve the development. \nC. \nAn applicant for a development permit to construct a single detached dwelling unit (with or without an \naccessory dwelling unit) or duplex on an existing lot of record, when the property is more than 300 feet \nfrom a public water main, may construct an on-site private well for water service until a public water \nmain is available to serve the site. Such development shall be exempt from the fire protection facilities \nrequirement when the property is more than 600 feet from a public water main. When a water line is \ngreater than 300 feet but less than 600 feet from the lot, the property owner shall pay for the cost of a \nfire hydrant and its installation at the terminus of the existing water line prior to issuance of a \ndevelopment permit if a hydrant is needed. The construction of the private well shall meet State of \nOregon well standards. Upon construction of a public water main to a lot which abuts a property that is \nserved by a well, the owner will be required to connect to the water system within 12 months from the \ndate the new water main is extended to the abutting lot. Connection to the private well shall be severed \nupon connection to the public water system unless the property owner installs a City approved backflow \nprevention device on the public water system. The property owner shall pay the property's fair share of \nthe public water system along the lot's street frontage or through the property in order to provide for \nthe logical continuation of the water system. Prior to the issuance of a development permit, the property \nowners shall sign an agreement to pay the appropriate share of the waterline construction costs at the \ntime it is constructed. \nD. \nConnections to public water systems shall be made in accordance with Chapter 5 of the Gresham Revised \nCode. \nE. \nWater distribution systems shall be in conformance with the Public Works Standards. \nF. \nWhen water availability or topographic constraints prohibit installation of public water mains within \npublic rights-of-way (i.e. streets), the public water main shall be placed in a public easement. Except with \nthe consent of the Engineer, the easement shall be placed on a single property, so as to minimize the \ndisruption of adjacent properties. The easement must comply with Section A5.005. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": " \n[A.5]-16 \nCity of Gresham Development Code \n(04/25) \nA5.302  SYSTEM DESIGN \nDesign of a water system to serve a development shall take into account future extensions beyond the \ndevelopment and shall be consistent with the Water Master Plan. Except for a private well water system, as \nauthorized by Section A5.301(C), a water system shall have the proper pressure to assure adequate fire \nprotection and fulfill consumer demand. A water system shall provide the minimum fire flows and pressures \nrequired under the Gresham Revised Code Chapter 5. These requirements do not apply to a single detached \ndwelling unit or duplex on an existing lot of record, when the property is more than 300 feet from a public water \nmain, as provided in Section A5.301(C). \nA5.303  GRID SYSTEM \nThe distribution system mains shall be looped at all possible locations. All developments will be required to \nextend mains across existing or proposed streets for future extensions by the City or other developments. All \nterminations shall be planned and located such that new or existing pavement will not have to be cut in the \nfuture when the main is extended. Permanent dead-end mains that provide fire protection shall not exceed 250 \nfeet in length. Single mains serving relatively large areas will not be permitted. \nA5.304  CONNECTION TO PUBLIC WATER LINES   \nIf more than one water line exists to which a new development may connect, the new development must \nconnect to the City of Gresham water line. A City of Gresham water line is considered available if the City water \nline is located at the property's boundary, and the property is identified within the same service level as the \nadjacent water line. \nA5.305  WATER LINE OVERSIZING AND REIMBURSEMENT   \nA development shall be required to build water line facilities in accordance with the Master Plan. If the water line \nsize exceeds the minimum size needed to provide fire, domestic, and irrigation flows to the development, the \napplicant may be reimbursed by the City for oversizing of the water line. A deferred reimbursement may be \npermitted, if adjoining properties can connect to the water line. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 17,
      "text": " \n[A.5]-17 \nCity of Gresham Development Code \n(04/25) \nA5.400  STREETS \nA5.401  GENERAL PROVISIONS  \nThe City’s transportation policies assure public street connectivity in general, and specifically require public street \nfrontage and access for residential parcels.  No development permit shall be issued unless the development has \nfrontage or approved access to a public street.  Abutting streets shall be dedicated and improved to the Public \nWorks Standards. No development will be permitted where it will cause traffic generation and an unacceptable \nLevel of Service beyond the street's current carrying capacity including pavement width and signalization. No \ndevelopment permits will be granted where such development will create dangerous or hazardous traffic \nconditions. Approved access may be appropriate as an alternative to the preferred public street frontage for \nqualified residential flag lots, mixed use and commercial centers, and industrial business parks where access \neasements promote an acceptable level of public access and street system connectivity. \nAs used in this section, for development in Heavy Industrial (HI) and General Industrial (GI) land use districts, \n“current carrying capacity” includes capacity from a transportation improvement that: i) is included in the \nCity of Gresham adopted Five-Year Capital Improvement Plan as a funded project; and ii) is included in the \nCity-approved project list for the Transportation System Development Charge; and iii) there is a City-\napproved mechanism in place to fund the transportation improvement; and iv) the schedule to complete the \ntransportation improvement has been approved by the City Manager. \nA5.402  GENERAL DESIGN REQUIREMENTS  \nA. \nPerformance Standards - All street designs shall provide for the safe and efficient travel of motor \nvehicles, bicycles, and pedestrians.  Streets shall be designed to carry the recommended traffic volumes \nidentified for each street classification.  Street classifications are set forth in Section A5.501. \n \nStreets shall be designed to meet or exceed minimum guidelines. These guidelines are set forth in the \n\"AASHTO Policy on Geometric Design of Highways and Streets\" (latest edition) and the Public Works \nStandards. Traffic Control Devices shall conform to the Manual on Uniform Traffic Control Devices for \nStreets and Highways\", Federal Highway Administration, with Oregon Supplements, Oregon Dept. of \nTransportation (latest edition). \nB. \nIdentification - Development plans shall depict which streets are proposed to be the listed classifications \nin Section A5.501.  The plan shall also identify which street section is proposed for each street. \nC. \nLevel of Service Criteria – Minimum performance must be maintained at city intersections. The \nstandards are based on the ratio of the measured turning movement volumes to the calculated \nintersection capacity (volume to capacity ratio or V/C). Different standards apply depending on where \nthe intersection is located. Most city intersections require an overall V/C of 0.90 or less, with no \nindividual movement having a V/C larger than 0.95. At intersections that are within Metro-designated \nRegional or Town Centers (such as Downtown Gresham or Central Rockwood), the overall V/C must be \nbelow 0.99 and there is no maximum V/C for individual movements. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 18,
      "text": " \n[A.5]-18 \nCity of Gresham Development Code \n(04/25) \nD. \nFor Residential Subdivisions and for Multifamily  \n \nThe primary local street shall be the local queuing street.  The local transitional street shall be used only \nwhen consistent with Section A5.501(B) or when exceptions are allowed to the maximum 400-foot block \nlength due to topographic or physical constraints, existing development patterns. \n \nStreet layouts shall be generally rectilinear and may be aligned as physically proper to adapt streets to \ntopographic or other natural conditions; or to provide a variety of alignments or grid patterns within an \ninterconnected street system.  Street layouts should discourage the use of local streets by non-local \ntraffic from adjacent collectors and arterials. \n \nBlock lengths for local streets shall not exceed 400 feet. Any collector or arterials shall not exceed 530 feet \nbetween intersecting streets measured along the nearside right-of-way line.  The maximum perimeter of \nthe blocks formed by local and collector streets shall not exceed 1800 feet measured along the nearside \nright-of-way line.   \nBlock and perimeter lengths may be exceeded where precluded by topographic or other physical \nconstraints, or existing development patterns, or as approved through an adopted Pleasant Valley Master \nPlan; average perimeter of the blocks formed by local and collector streets should be 1000 feet to 1500 \nfeet. Local street block lengths may exceed 400 feet where precluded by topographic or other physical \nconstraints, or existing development patterns, or as approved through an adopted master plan but in no \ncase shall they exceed 530 feet. When the block length is permitted to exceed 400 feet, a mid-block public \npath and street crossing is required. The public path shall be 14-foot wide in a 20-foot wide easement and \nshall be constructed in accordance with the Public Works Standards. The mid-block street crossing shall be \n10-foot wide. \n \nAlleys are encouraged pursuant to Section A5.501(H)(6). \nE. \nThe Manager may approve a cul-de-sac, a minor access street, or the termination of an existing \ntemporary dead-end street when in an adopted master plan or the following criteria are met: \n1. \nWhere construction of a through street is impractical due to topography, or existing development \npatterns, or arterial and collector intersection spacing restrictions, or significant physical \nconstraints such as a jurisdictional wetland, a natural resource area, dedicated open space, a \ndetention facility or waters of the state; and \n2. \nEmergency vehicle access and fire protection are provided satisfactory to the Manager, and \nNeighborhood circulation is not adversely impacted.   \n3. \nA cul-de-sac shall also be consistent with Section A5.501(E) and a minor access street with Section \nA5.501(F). \nNote:  The criteria in this section is not intended to preclude the use of curvilinear \"eyebrow\" \nwidening of a local street where needed to provide adequate lot frontage.  An eyebrow is not \nconsidered a cul-de-sac. \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 19,
      "text": " \n[A.5]-19 \nCity of Gresham Development Code \n(04/25) \nF. \nNo land division shall be approved which accesses a permanent dead end street system when: \n1. \nThe street is in excess of 200 feet, or \n2. \nMore than 25 units would access the street, or \n3. \nThe street exceeds the allowable grade in the Public Works Standards. \nA5.403  TRUCK RESTRICTIONS  \nFor Minor Arterial streets, trucks will be allowed if the trip destination is on a connecting residential or \ncommercial local street. \n \nFor Local: Queuing Street, Minor Access Street and Cul-de-sac streets, no trucks will be allowed in residential or \ncommercial areas except local delivery or service vehicles. \nA5.404  RESIDENTIAL LOT ACCESS TO MAJOR AND STANDARD ARTERIALS  \nA. \nWhen single detached or middle housing development abuts an existing or proposed major or standard \narterial, the approval authority shall require that access to such streets be limited to one of the following \nmeans: \n1. \nThe lots of the development have access to a local street or alley running parallel to the major or \nstandard arterial. \n2. \nThe lots access cul-de-sacs, lanes or shared driveways.  No lots shall derive direct vehicle access to \nthe major, standard or minor arterial. \n3. \nLots adjacent to a major or standard arterial, but with frontage on a lower classification street, \nshall be restricted to access to the lower classification street unless otherwise approved by the \nManager. \nB. \nWhen driveway access from major or standard arterials is necessary for several adjoining lots, the \nManager shall require that such lots be served by a combined access driveway in order to limit possible \ntraffic hazards. The driveway design shall avoid requiring vehicles to back into traffic on major or \nstandard arterials.  \nA5.405  STREET SURFACING AND IMPROVEMENTS   \nA. \nPublic streets, including alleys, within the development shall be improved in accordance with the \nrequirements of the Community Development Code, the Public Works Standards, and the requirements \nof the City Engineer. \nB. \nUnless approved by the Manager, building permits shall not be approved for structures within a future \nright-of-way. Future right-of-way location and width is determined by Section A5.501, an adopted future \nstreet plan or the Transportation Master Plan. If staging is permitted, setbacks for adjoining development \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 20,
      "text": " \n[A.5]-20 \nCity of Gresham Development Code \n(04/25) \nshall also be determined by the right-of-way requirements for the full street standards found in Sections \nA5.501.  \nA5.406  STREET LIGHTING   \nA. \nA complete lighting system (including, but not limited to: conduits, wiring, bases, poles, arms, and \nfixtures), shall be the financial responsibility of the applicant on all streets upon which the development \nhas frontage. \nB. \nAll future street lighting shall be in accordance with Public Works Standards. \nA5.407  STREET AND TRAFFIC CONTROL SIGN STANDARDS  \nRequired signing shall be in accordance with the “Manual on Uniform Traffic Control Devices for Streets and \nHighways\" published by the Federal Highway Administration, U.S. Dept. of Transportation, and as designated by \nthe Manager. The applicant is responsible for the cost and installation of street and traffic control signage \nrequired for their development. \nA5.408  HALF STREETS   \nHalf-streets will only be approved where development of the remainder of the street has a reasonable chance of \noccurring with future development. Existing development patterns and topography are examples of possible \nconstraints that would disqualify a half street proposal. Where such a street is justified, the right-of-way and \npavement width shall be approved by the City Engineer.  In no case shall the pavement width required be less \nthan that required to provide two lanes of traffic to pass at a safe distance.  For any local street, the half-street \nimprovement shall be at least 20 feet.   \nA5.409  ADDITIONAL RIGHT-OF-WAY AND STREET IMPROVEMENTS   \nExcept for alterations that do not add dwelling units to single detached dwellings, middle housing dwellings, and \naccessory dwellings, whenever existing public street improvements including public streets adjacent to or within \na development do not meet city standards, the property owner or developer must construct the public street \nimprovements, including dedication of rights-of-way, to the Public Works Standards. \nA development on an unimproved street shall be responsible for constructing a continuous City standard street \nto a connection with the nearest (publicly-maintained) street. \nA5.410  STREET NAMES   \nStreet names and property numbers shall be assigned by the City and shall conform to the City of Gresham Street \nNaming and Property Addressing Guidelines, a document published separately. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 21,
      "text": " \n[A.5]-21 \nCity of Gresham Development Code \n(04/25) \nA5.411  TRAFFIC ANALYSIS  \nThe City Engineer will require a traffic analysis report as determined by the type of development and its potential \nimpact to existing street systems. A traffic analysis will generally be required for a development 1) when it will \ngenerate 1,000 vehicle trips or more per weekday, or 2) when a development's location, proposed site plan, \ntraffic characteristics could affect traffic safety, access management, street capacity, or known traffic problems \nor deficiencies in a development's study area. \nThe report will be prepared by a licensed traffic engineer in the State of Oregon and shall be prepared in \naccordance with the Public Works Standards.  \nA5.412  UTILITY LICENSE REQUIRED   \nA. \nThe Manager shall not accept a public street improvement for ownership and operation if, within the \ndedicated public right-of-way or general utility easement, there are any utility facilities that are not \nauthorized by a utility license issued pursuant to GRC Article 6.30. \nB. \nNo development shall exclude any person who has a utility license issued pursuant to GRC Article 6.30 \nfrom installing utility facilities within the dedicated public right-of-way or general utility easement.  Such \ninstallation shall be coordinated with the developer and other utilities. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 22,
      "text": " \n[A.5]-22 \nCity of Gresham Development Code \n(04/25) \nA5.500  TRANSPORTATION SYSTEM DESCRIPTION AND FUNCTION \nA5.501  STREETS   \nStreet functional classification refers to the design of streets to accommodate various levels of traffic demand, \nadjacent land uses, transit service, and bicycle and pedestrian travel.  The Functional Classification System Map, \nfound in the current Transportation System Plan, depicts the classification of all streets designated Freeway \nthrough Collector Street. The Civic and Downtown plan areas have street cross sections that may supplement the \nFunctional Classification Map. All other streets are local streets.  Additional Collector Streets may be identified \nthrough development or City initiated Future Street Plans.   \nStreets shall be designed in accordance with the Public Works Standards. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 23,
      "text": " \n[A.5]-23 \nCity of Gresham Development Code \n(04/25) \nTable A5.501 A \nStreet \nClassification \nTypical Average \nDaily Trips \nMotorist Travel \nLanes \nBicycle \nLane \nParking \nMedian \nLandscape \nStrip \nSidewalk \nPaveme\nnt \nWidth \nRight-\nof-Way \nWidth \nMajor Arterial \n25,000-60,000 \n4 lanes \nYes  \nNot allowed, \nexcept where \ndesignated \nboulevard, \nthen optional \nYes \nYes \nYes  \n74’ \n104’ \nStandard \nArterial \n15,000-40,000 \n4 lanes \nYes  \nNot allowed, \nexcept where \ndesignated \nboulevard, \nthen optional \nYes \nYes \nYes  \n66’ \n96’ \nMinor Arterial \n10,000-20,000 \n2 lanes  \nYes  \nNo \nYes \nYes  \nYes  \n48’ \n74’ \nMajor Collector \n1,000-10,000 \n2 lanes  \nYes  \nYes \nNo \nYes \nYes  \n48’ \n74’ \nStandard \nCollector \n1,000-10,000 \n2 lanes  \nYes \nNo \nNo \nYes \nYes  \n36’ \n60’ \nMinor Collector  1,000-10,000 \n2 lanes \nNo \nYes \nNo \nYes \nYes  \n36’ \n60’ \nLocal Queuing \n800 or fewer \n2 lanes  \nNo \nYes \nNo \nYes \nYes \n26’ \n46’ \nLocal \nTransitional \n1000 or fewer \n2 lanes  \nNo \nYes \nNo \nYes \nYes \n32’ \n52’ \nLocal Industrial \n1000 or fewer \n2 lanes  \nNo \nYes \nNo \nYes \nYes \n40’ \n60’ \nLocal \nCommercial \n1000 or fewer \n2 lanes  \nNo \nYes \nNo \nYes \nYes \n36’ \n56’ \nMinor Access \nStreet \n58 or fewer \n2 lanes  \nNo \nNo \nNo \nNo \nNo \n20’ \n25’ \n \nA. \nLocal Queuing Streets  \nLocal queuing streets have a 52-foot-wide right-of-way with a 26-foot-wide pavement width. The \nfollowing standards apply: \n1. \nMaximum Block Length: The maximum block length for a queuing street is 400 feet.  A queuing \nstreet may not terminate in a cul-de-sac, but may temporarily dead end with a planned future \nstreet extension. \n2. \nParking:  \"No Parking\" shall be posted within 30 feet of curb return. \nB. \nTransitional Street  \nLocal transitional streets have a 46-foot-wide right-of-way, 32-foot-wide pavement width and applies in \nthe following areas:  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 24,
      "text": " \n[A.5]-24 \nCity of Gresham Development Code \n(04/25) \n1. Continuation of existing local streets in established neighborhoods to the next intersection. \n2. In multifamily or mixed-use neighborhoods where density precludes queuing street due to \ninsufficient off-street parking and breaks in on street parking, as determined by the Manager. \n3. On primary emergency response routes. \n4. On local streets where volumes are expected to exceed 800 ADT. \nC. \nIndustrial \nThe local industrial street standard, with a 60-foot-wide right-of-way and 40-foot-wide pavement width, \napplies in industrial districts. \nD. \nCommercial \nThe local commercial street standard, with a 56-foot-wide right-of-way and 36-foot-wide pavement \nwidth, applies in commercial districts. \nE. \nCul-de-sac \nIn accordance with A5.402(E)&(F), a cul-de-sac is only to be used as a short, low speed, low volume \nstreet with two travel lanes, terminating in a dead-end turnaround. \nF. \nMinor Access Streets  \nIn accordance with A5.402(E)&(F), a minor access street is intended to provide public street access to \nlots created as part of an infill process where; a cul-de-sac turnaround is not warranted; and there is no \nopportunity for connection to another public street by a local street. \n1. Limits:  The maximum length of a minor access street shall be 150 feet.  No more than six residential \nunits can have frontage and/or access to a minor access street.  No more than two residential units \nmay be built beyond the end of the street.  The maximum setback from the end of the street to the \nfront of the building shall be pursuant to Table 4.0131, Note 5. \n2. Building Orientation:  All buildings shall be oriented to and access the minor access street. Additional \non-site parking for one car per dwelling unit must be provided.  Public parking for visitors (3-4 \nspaces) and a branch-type turnaround designed to AASHTO Fig. V-2 shall be provided at the end of \nthe minor access street.  A dead-end sign shall be posted at the entrance to the street. \n3. Pavement:  The pavement section shall be 20 feet wide within a 25 feet right-of-way.  If the 25 feet \nright-of-way standard precludes the development due to lot depth standard, a reduction to 20 feet \nwith a utility easement may be approved.  No sidewalks are required due to the extremely low traffic \nvolumes on the street.  Design Speed is 15 mph. \n4. Parking:  \"No Parking\" shall be posted for the entire minor access street. \nG. \nOther Classifications \nSeveral other specialized classifications have been created to indicate streets with specialized \ncharacteristics of major transit routes, private local streets, and scenic routes. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 25,
      "text": " \n[A.5]-25 \nCity of Gresham Development Code \n(04/25) \n1. \nTransit Street \nA street which serves a significant function of carrying high volume transit service. The traffic \ncarrying function is secondary to its transit service function.  Ease of pedestrian movement and \npedestrian safety and transit-supportive development are primary considerations on this type of \nstreet.  This designation is applied in addition to the basic street classification.  \n \nTransit streets are designated on selected streets which currently or are planned to have a high \nfrequency of weekday transit service and some service seven days a week.  The criteria for transit \nstreet designation are: \na. \nCurrent 20 minute (or better) frequency of service, weekday peaks, and; Daytime and \nevening service, weekdays and; Weekend service on both Saturday and Sunday; or \nb. \nA street designated as a regional transit corridor in a regional growth plan or \ntransportation plan, or designated a high capacity or primary transit route in the Gresham \nTransportation System Plan. \nFuture refinement of transit service levels and network may occur through future regional \nand local transportation system planning processes. \n2. \nTransitway \nA transitway serves as an exclusive right-of-way for transit use, either bus or light rail. A transitway \nwill provide regional trunk route service which will be supported by a network of local feeder \nbuses, transit centers, and park-and-ride facilities. \n3. \nTransit Route \nTransit routes are designated on all streets with current but infrequent transit service (that do not \nmeet transit street service criteria).  Transit routes are subject to future designation as transit \nstreets, as future refinement of transit service levels and network occurs through the regional and \nlocal transportation system planning processes. \n4. \nPrivate Access \nA private access serves a number of dwelling units under condominium unit ownership, or within a \nmanufactured home park, or apartments in those areas where a continuation of a public street \nsystem is not needed. \n \nIf the use of private access may create conflicts with efficient local circulation and emergency \naccess needs, public streets may be required. \n5. \nScenic Routes \nA street which offers unique scenic views and is used as a scenic or recreational drive. Access and \ntraffic restrictions may be imposed to preserve the scenic character. This designation may be \napplied in addition to the basic street classification (arterial, collector, or local). \n6. \nAlleys \na. \nAlleys, with a 21-foot-wide right-of-way and 20-foot-wide pavement width, are allowed in \nresidential developments and can provide efficient lot use, support front yard pedestrian \norientation and landscape spaces and reduced lot coverage by driveways.  Alleys serve as a \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 26,
      "text": " \n[A.5]-26 \nCity of Gresham Development Code \n(04/25) \ncommon driveway, for access, utilities, and deliveries.  Alleys may be provided in \ncommercial and industrial developments with approval by the Manager.   \nb. \nAlleys must be constructed continuously from one street to a parallel or intersecting street.  \nAll lots must have frontage to a public street.  If there are parking restrictions on the public \nstreet, additional parking spaces must be provided off of the alley. \n7. \nPublic Access Road \n \nThe access road is a limited purpose classification to address the access needs and requirements \nwithin the City’s park and recreation facilities, including but not limited to parks, open space, \nnatural areas, and trails. This standard would be applied when the full standard public street design \nis not necessary due to the limited nature of the access needed to or through park or open space \nareas. The circumstances of the surrounding land use shall be considered when applying this \nspecial function classification. \n \nThe intent of this special function is to minimize the impact and intrusion on the natural systems \nthat exist while providing a minimum level of access for emergency services, maintenance and user \nneeds. \na. \nLimits: The park road standard is principally intended to provide emergency service or park \nuser access to an area that does not possess neighborhood circulation requirements. The \nroad may provide public access to a terminal trailhead, allow ingress and egress for \nmaintenance and operation purposes or to be used for emergency services purposes. \nThe road may be designed with removal traffic control bollards at the entrances to the \nopen space, dependent upon use patterns, to prevent unwanted vehicular traffic. \nb. \nVehicular control devices may be installed to deter vehicular intrusion into the park, open \nspace and natural areas. These include but are not limited to bollards, berms, or 6 inches \nextruded curb, and should be compatible with the surrounding environment and resistant \nto vandalism. \nc. \nParking: Parking shall be permitted only in designed and designated turnouts and parking \nareas. \nd. \nSignage: Signs shall be designed to be compatible with natural character of the site. \nA5.502  INTERSECTIONS   \nConnecting street intersections shall be located to provide for traffic flow, safety, and turning movements, as \nconditions warrant. \nArterial Intersections: Exclusive left and right turn lanes will be provided; bus turnouts will be provided if traffic \nflow and safety conditions warrant; designated crosswalks will be provided at controlled locations; street \nalignments across intersections shall be continuous. \nCollector Street and Local Street Intersections: Street and intersection alignments should facilitate local \ncirculation but avoid alignments that encourage non-local through traffic. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 27,
      "text": " \n[A.5]-27 \nCity of Gresham Development Code \n(04/25) \nStreets shall be aligned so as to intersect at right angles (90 degrees).  Angles of less than 75 will not be \npermitted. Intersection of more than two streets at one point will not be permitted. \nNew streets shall intersect with existing street intersections so that centerlines are not offset, except as provided \nin the Public Works Standards.  Where existing streets adjacent to a proposed development do not align \nproperly, conditions may be required of the development to provide for proper alignment or prohibit some \ntraffic movements. \nA5.503  DRIVEWAYS \nAccess to private property shall be permitted with the use of driveway curb cuts.  The access points with the \nstreet shall be the minimum necessary to provide access while not inhibiting the safe circulation and carrying \ncapacity of the street and shall be constructed in accordance with the Public Works Standards. \nA5.504  TRANSIT FACILITY STANDARDS   \nThe following provisions are to ensure access to transit services.  All developments shall meet the following \nstandards for transit facilities: \nA. \nWhen development is proposed adjacent to Transit Streets or existing and future Transit Routes. \nDevelopment shall be reviewed by Tri-Met which may recommend transit-related facilities to be \nconstructed at the time of development. \n \nTransit facilities recommended by Tri-Met and required by the Manager shall be identified on the site \nplan to be submitted prior to final approval. \nB. \nTransit facilities shall be provided if any portion of a site's major or standard arterial street frontage is \ngreater than 600 feet from a controlled intersection or other transit improvements.  \n \nTransit facilities shall be located at controlled street intersections, where possible.  Transit improvement \nshall also be provided on streets which are transit streets, current or future transit routes, or other \ntransit routes.   \nC. \nAt a minimum, transit facilities shall include a paved waiting area and signage complying with current \ntransit agency design standards.  Sidewalks may serve as a waiting area.  The Manager may require \nadditional improvements based on anticipated ridership.  These improvements may include bus turnouts, \ncurb extensions, median refuges for pedestrian crossings, bus shelters, public telephones, benches, or \npedestrian lights.   \n \nFactors which determine the level of transit facility improvements include street classification, length of \nblock, proximity of major pedestrian destinations, and level of Transit Service in adjacent streets, and \ntransit needs of a development. \n1. \nWhere a transit stop has already been established within 500 feet of the affected development, a \nnew transit stop shall only be provided if recommended by Tri-Met and required by the Manager.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 28,
      "text": " \n[A.5]-28 \nCity of Gresham Development Code \n(04/25) \nOtherwise, the developer shall upgrade the existing stop through provisions of improved waiting \nfacilities (i.e. installation of benches, shelters or landscaping). \n2. \nDevelopments that are estimated to generate over 1,000 average daily vehicle trips may be \nrequired to provide a transit improvement dedication along the frontage of the transit street for \nthe installation of a bus turnout and other facilities.  The need for a turnout will be evaluated by \nTri-Met. \n3. \nA bus stop shall consist of at least a bus stop pad designed in compliance with the Americans with \nDisabilities Act. \nA bus stop pad shall have a minimum clear length of 8 feet (measured from the curb or roadway \nedge) and a minimum clear width of 5 feet (measured parallel to the roadway) to the maximum \nextent allowed by legal or site constraints.  This passenger area should be located 1 foot from the \nstopping distance of the bus.  The bus stop sign shall be placed 3 feet in front of where the front of \nthe bus stops.  The slope of the parallel bus stop pad shall be the same as the roadway. \n4. \nThe location of the bus stop shall be chosen so that there is a connection to an accessible route.  \nA5.505  TRANSITWAY STANDARDS FOR LIGHT RAIL   \nA. \nLight Rail Transitways should be located on major arterial streets (or less) or within separate rights of \nway. \nB. \nIn the event that a Light Rail Transitway must be located on a standard arterial due to infeasibility of \nalternative routes, the right-of-way shall be designed as a continuous tree-lined boulevard with \npedestrian paths. \nC. \nLight Rail Transitway Stations shall be located, when possible, at locations with 24 hour activity. \nD. \nThe location of curb ramps, elevators and other parts of the circulation path in new light rail stations shall \nbe placed to minimize the distance wheelchair users have to travel. \nE. \nPedestrian crossings for light rail tracks shall have different paving material to distinguish light rail \ncrossing areas from street pavement or exclusively pedestrian areas. \nF. \nPlatform edges bordering a drop-off and not protected by screens or guard rails shall have a detectable \nwarning. \nG. \nAll light rail stations areas, entrances and exits shall be well lighted. \n1. \nExterior lighting should be an integral part of architectural and landscape design. \n2. \nThe minimum lighting level for station walkways is 4  footcandles.  Lighting shall be pedestrian \nscale 3 feet to 12 feet and the source of light shall be shielded to reduce glare.   \nH. \nAll light rail stations shall have telephones installed in an easily seen and accessible area. \nI. \nLight Rail shelters shall be designed with public safety in mind.  Shelters must be designed so that people \ncan be easily recognized and be seen inside the structure from adjacent streets and designed with two \naccess points/escape routes from both ends or through the structure. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 29,
      "text": " \n[A.5]-29 \nCity of Gresham Development Code \n(04/25) \nA5.506  SIDEWALKS  \nA. \nPublic sidewalks are required on the public street frontage of all new residential construction, all \ncommercial and industrial construction that requires a development permit and residential remodeling \nthat involves substantial improvement as defined in Section 3.0103 of this document.  Sidewalks will be \nrequired along street frontage of dedicated greenway areas.  If required, their construction will be the \nresponsibility of the applicant.  Construction of sidewalks and driveways will be in accordance with the \nPublic Works Standards.  In a subdivision the applicant shall provide a guarantee of completion equal to \n110% of the estimated cost to complete construction of sidewalks to assure complete construction of all \npublic sidewalks within two years of the date the street is accepted for ownership and operation. \nB. \nSidewalks are generally buffered from the roadway to provide for the safety and comfort of pedestrians \nin accordance with Public Works Standards.  \nC. \nAll utilities and other facilities in the sidewalk area shall locate their facilities to be in conformance with \nthe 48-inch minimum horizontal clearance.   A 7-foot vertical clearance above the sidewalk shall be \nmaintained.  Federal Americans with Disabilities Act (ADA) requirements shall supersede when in conflict \nwith City standards. \nD. \nThe Manager may allow modifications to standard sidewalk design and location for the following \nreasons: \n1. \nTopography  \n2. \nTo match existing sidewalks  \n3. \nTo preserve existing trees that are found to be of significant value \n4. \nRight-of-way constraints. \nE. \nSidewalks may meander within the dedicated right-of-way or outside of the right-of-way within an \neasement with the approval of the Manager. \nA5.507  BICYCLE FACILITIES   \nBicycle lanes are required on all new or improved arterial, and major and standard collector streets as required \nby the Public Works Standards.  In addition, the City has adopted the Gresham Transportation System Plan. This \nplan summarizes the City’s policy and implementation strategies for bicycle facilities within the City and for \nconnection with metropolitan bikeways.  The City's plan has adopted both AASHTO and ODOT standards and \ncriteria as the minimum guidelines for bicycle facility design, construction and control. \nThe City's adopted guidelines for bicycle facilities are found in the current editions of the following: \nA. \nAASHTO, Oregon Supplements and Exceptions to AASHTO Guide \nB. \nODOT, Oregon Bicycle and Pedestrian Plan \nC. \nManual on Uniform Traffic Control Devices with Oregon supplements by Oregon Transportation \nCommission \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 30,
      "text": " \n[A.5]-30 \nCity of Gresham Development Code \n(04/25) \nA5.508  PUBLIC PATHS   \nIf required as a condition of the development approval, construction will be the responsibility of the applicant. \nDesign and construction of paths will be in accordance with the City of Gresham Public Works Standards.  \nPaths are intended to link the following uses:  A residential area, neighborhood activity center, an industrial or \ncommercial center, a transit facility, a park, a school, open space, or a trail facility.  \nPublic street connections for cars, pedestrians and bicycle circulation are preferable to paths.  Paths should only \nbe used to ensure connectivity to nearby activities in areas where no other public street options are available.   \nA. \nCriteria - Paths shall be provided in the following situations: \n1. \nMulti-modal connections are required between discontinuous street rights-of-way, where a new \nstreet is not feasible; through excessively long blocks; or wherever the lack of street continuity \ncreates inconvenient or out of direction travel patterns for local pedestrian or bicycle trips. \n2. \nMulti-use access shall be provided as follows for all development: \na. \nTo provide direct access to nearby pedestrian/bicycle destination, transit streets or transit \nfacilities to connect with all existing or approved paths that abut the development site. \nb. \nTo provide direct connection of cul-de-sacs and dead-end streets to the nearest available \nstreet or pedestrian/bicycle destinations. \nc. \nTo provide connections from local or cul-de-sac streets to collector or arterial streets.  \nd. \nSpacing between full street or path connections shall be no more than 330 feet for \nresidential and mixed-use development, and no more than 530 feet for commercial and \nindustrial development. \n3. \nPath Type and Purpose.   When required, one of the following path types will be deemed \nappropriate by the Manager during development review: \na. \nNeighborhood Path:  Provides neighborhood connections through blocks, links various \nuses, and promotes direct non-motorized travel. \nb. \nPublic/Private Integrated Path:  Provides dual purpose as part of a private, on-site \ncirculation pattern; with a public easement to link proximate streets, uses, and activities. \nc. \nPark/Natural Area Path:  Provides neighborhood access to park and natural areas. \n4. \nAn exception may be made when the Manager determines that construction of a separate path is \nnot feasible due to physical or jurisdictional constraints.  Such evidence may include, but is not \nlimited to: \na. \nOther Federal, State, or Local requirements prevent construction of a path; \nb. \nThe nature of abutting existing development makes construction of a path impractical; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 31,
      "text": " \n[A.5]-31 \nCity of Gresham Development Code \n(04/25) \nc. \nThe path would cross an area affected by a special purpose district overlay and the path is \nincompatible with the purposes of the special purpose district; \nd. \nThe path would cross topography where slopes exceed 30%; and/or \ne. \nThe path would terminate at the urban growth boundary and extension to another public \nright-of-way is not part of an adopted plan. \nB. \nStreet Entry:  Except at the end of a cul-de-sac, entry points shall align where possible with safe \npedestrian crossing points along adjacent streets and with adjacent street intersections. \nC. \nPaths are subject to the following Design Standards: \n1. \nAll rights-of-way for pedestrian and bicycle paths shall be dedicated to the City for public use or \nmay be approved as public access easements on private property.  \n2. \nRight-of-Way or Easement Width \na. \nShall be 20 feet. \nb. \nApproved easement width may be reduced to a minimum 8-foot width with the approval \nof the Manager. \n3. \nA clear-vision triangle, the same as for a Residential Driveway, Section 9.0200, shall be provided at \nthe ends of all paths.  On-street parking shall be prohibited within 15 feet of the intersection of a \npath and a public street to preserve safe sight distance. \n4. \nPaths shall be lighted by pedestrian-scale lighting along the path unless existing on-site lighting or \nadjacent street lighting provides adequate path illumination as approved by the Manager.  Lighting \nshall not shine into adjacent residences. Path lighting shall comply with the Public Works \nStandards. \n5. \nThe construction of stairways shall be avoided whenever possible.  Where the path grade would \nexceed 12% slope, a path will be constructed as stairs for pedestrians.   Based on local conditions, \nthe Manager may approve alternatives to stairs, including the use of switchbacks and alternative \nmaterials.  If stairways are needed, they shall be at least 5 feet wide with handrails on both sides. \n6. \nFencing & Screening:  When required for buffering, paths shall be fenced and screened along \nadjacent property lines.  The area between the pathway and fences shall be planted with a \ncombination of ground cover or low growing shrubs that will reach no more than 2 feet at \nmaturity.  \n7. \nPaths shall be designed to prohibit motorized traffic.  \n8. \nPath surfaces shall be designed to drain stormwater run-off to the side or sides of the path.  \n9. \nPavement width shall generally be 14 feet.  The Manager may approve a path of minimum 8-foot \nwidth based on specific site constraints. Park/natural area paths may be hard or soft surface, based \non natural area constraints and anticipated level of use.    \n10. \nPaths shall be constructed in accordance with the Public Works Standard Drawings. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 32,
      "text": " \n[A.5]-32 \nCity of Gresham Development Code \n(04/25) \nA5.509  PUBLIC TRAILS   \nIf required as a condition of the development approval, construction will be the responsibility of the applicant. \nConstruction of paths and trails will be in accordance with the Public Works Standards. \nA. \nIn granting an easement for public trails, the owner shall demonstrate compliance with the following \ncriteria: \n1. \nTrail easements shall allow for future construction of trails in accordance with specifications as to \nwidth and surfacing as contained in the Public Works Standards. \n2. \nTrail easements shall be located within a site in such a manner as to allow the trail to be buffered \nfrom existing and proposed dwellings on the site and on adjacent properties, and to maintain the \nmaximum feasible privacy for residents. \n3. \nTrail easements shall be located within a site so that future trails construction will avoid parking \nand driveway areas and other activity areas which might conflict with pedestrian movements. \nB. \nSite area included within a public access easement shall be counted as a portion of the landscaped and \nopen space area required for the proposed development. \nA5.510  UNDERGROUND UTILITIES   \nA. \nPurpose: Overhead utilities and associated poles clutter the streetscape and pose significant obstacles to \npedestrian circulation, transit access, and the provision of pedestrian and transit facilities.  Placement of \nutilities underground reduces these obstacles and provides an enhanced environment. \nB. \nApplicability and Standards: \n1. \nAll developments required to obtain a development permit pursuant to Section 11.0101 shall, at \nthe development’s own cost, install underground all new utility facilities needed for the \ndevelopment  \n2. \nThe following developments shall, at the development’s own cost, relocate underground all \nexisting utility facilities along each of the development’s public street frontages or provide \nPayment-in-lieu of undergrounding in accordance with A5.510(D). \na. Developments required to obtain a Type II or greater development permit pursuant to Section \n11.0101 for a residential land division \nb. Developments required to obtain a Type II or greater development permit pursuant to Section \n11.0101 for construction of a new building \nc. Developments required to obtain a Type II or greater development permit pursuant to Section \n11.0101 for expansion of a building \nd. Tenant improvements which require Building Permits for initially occupying spaces in buildings \nUtility facilities to be undergrounded include, but are not limited to, electrical, communication \nfacilities and lines connecting traffic signals, including all utility lines crossing the street along the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 33,
      "text": " \n[A.5]-33 \nCity of Gresham Development Code \n(04/25) \ndevelopment’s public street frontages. Developers are still subject to undergrounding \nrequirements of Fire Code. \nThese requirements do not apply to publicly funded capital improvements. \n3. \nUnless an owner of the property has previously placed underground the overhead facilities along \ntheir frontage, all applicable development as described in A5.510(B)(2) that do not have overhead \nutilities located along the development’s public street frontages will be required to provide a \nPayment-in-lieu of undergrounding. \nC. \nExemptions: \n1. \nThe undergrounding requirement shall not apply to development permits obtained by utilities to \nestablish, construct, maintain or terminate electrical power distribution lines and telephone and \ntelevision cable transmission lines in the Flood Plain Overlay District, Hillside and Geologic Risk \nOverlay District, Natural Resource Overlay District or where the utility would be exempt from \nobtaining a development permit pursuant to Section 11.0102. \n2. \nElectric power lines 50,000 volts and above, surface-mounted transformers, and other similar \nutility facilities that the Manager determines to be technically infeasible to underground are \nexempted from these requirements. In cases where a portion of the facilities are technically \ninfeasible to underground, the remaining overhead facilities shall still be subject to undergrounding \nor Payment-in-lieu requirements in accordance with A5.510. \nD. \nPayment-in-lieu of Undergrounding: \n1. \nDevelopers providing a Payment-in-lieu of undergrounding shall pay an amount set by City Council \nby separate resolution. \n2. \nThe funds collected in-lieu of undergrounding overhead utilities shall be used for undergrounding \noverhead utilities within the city at large. \nA5.511  STREET TREES  \nStreet trees located within public rights of way shall comply with standards provided in Section 9.1000. \nA5.512  ADDITIONAL PUBLIC FACILITIES REQUIREMENTS  \nAdditional public facilities requirements exceeding those in Appendix 5.000 are required by some land use \ndistricts for implementation as part of design review.  Refer to individual districts for such requirements as are \napplicable. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.768637",
  "extractor_version": "1.0.0"
}