{
  "metadata": {
    "filename": "dc-appendix-6.000.pdf_id7826",
    "extracted_at": "2025-05-22T06:15:23.969174",
    "num_pages": 22,
    "title": "DC Appendix 6.000",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.58",
    "creation_date": "D:20230105093544-08'00'",
    "modification_date": "D:20230105093611-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[A.6]-1 \nCity of Gresham Development Code \n \n(01/23) \n \nAPPENDIX 6.000 \nSIGN REGULATIONS \nGeneral \nA6.001  General Provisions  \nSign Development Permit \nA6.010  Permit Requirement \nA6.011  Permit Application  \nA6.012  Installation Inspections   \nA6.013  Construction   \nSpecific Sign Development Provisions \nA6.020  Measurements   \nA6.021  Placement   \nA6.022  Fascia Sign  \nA6.023  Projecting Sign   \nA6.024  Marquees and Awnings   \nA6.025  Illuminated Awning Sign   \nSigning of Nonconforming Uses \nA6.030  Provisions  \nVariance \nA6.040  Sign Requirement Variance   \nExemptions \nA6.050  Sign Requirement Exemptions   \nTemporary Signs \nA6.060  General Limitations  \nA6.061  Sign Types  \nProhibited Signs \nA6.070  Prohibited Signs   \nA6.071  Hazardous Signs   \nA6.072  Other Prohibited Signs   \nNonconforming Signs \nA6.080  Nonconforming Signs  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[A.6]-2 \nCity of Gresham Development Code \n \n(01/23) \n \nSigns in Residential Land Use Districts \nA6.090  Residential Districts   \nA6.091  Subdivision Signs   \nA6.092  Multi-Family Dwelling Signs   \nA6.093  Manufactured Dwelling Park Signs  \nA6.094  Signs for Permitted Commercial Uses in the OFR District  \nA6.095  Temporary Signs  \nSigns in Commercial, Mixed Use & Industrial Land Use Districts \nA6.100  Commercial, Mixed Use and Industrial Districts   \nA6.101  Signs for Outdoor Commercial Uses in the MC and CC Districts and in Multi-Business Complexes   \nSigns for Institutions and Uses Subject to Special Use Review \nA6.110  Signs for Institutional Uses and Uses Subject to Special Use Review  \nSigns for Temporary Uses \nA6.120  Signs for Temporary, Intermittent and Interim Uses and Food Carts   \nA-Board Signs \nA6.130  Sidewalk A-Board Signs   \nA6.131  Residential District A-Board Signs   \nA6.132  Commercial/Industrial District A-Board Signs   \nA6.133  Limited Duration Event A-Board Signs   \nAbatement of Substandard and Dangerous Signs \nA6.140  Abatement of Substandard and Dangerous Signs  \nMaintenance \nA6.150  Maintenance   \n \nGeneral \nA6.001  General Provisions   \nThe installation of all signs within the City of Gresham shall be subject to the issuance of a development \npermit, establishing compliance with the Community Development Code.  See Section 4.1101(A)(6) in the \nDowntown Plan District and Section 4.1250(B)(6) in the Civic Neighborhood Plan District for additional \nsignage standards. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[A.6]-3 \nCity of Gresham Development Code \n \n(01/23) \n \nSign Development Permit \nA6.010  Permit Requirement \nAn applicant for a sign shall obtain a development permit pursuant to Article 11 of the Community \nDevelopment Code.  The application shall be reviewed by the Manager under a Type I procedure.  A \ncampus sign master plan is also reviewed under a Type I procedure.  All sign proposals shall conform to \nthe approved master plan or as amended under the Type I procedure.  Campus sign master plans do not \nexpire and are not subject to the expiration provisions of Section 11.0105.  A sign proposal need not \ncomply with Appendix A5.000, Public Facilities Standards, of the Community Development Code. \nA6.011  Permit Application   \nApplications for the installation of a sign within the City shall include at a minimum the following: \nA. \nPermit Form.  Application for a sign development permit shall be made on forms provided by the \nCity.  The application shall include the location of the sign by street number and legal description; \nthe name, address and telephone number of the sign owner and of the applicant. \nB. \nSign Plans.   The applicant shall submit two copies of plans.  These plans must be detailed enough \nto show compliance with the sign code.  The plan is to include: \n1. \nA drawing to scale showing the design of the sign, including dimension, sign size, method of \nattachment, source of illumination and showing the relationship to any building or structure \nto which it is, or is proposed to be, installed or affixed, or to which it relates, to include \nelevations. \n2. \nA fully dimensioned plot plan, drawn to scale, indicating the location of the sign relative to \nproperty line, rights-of-way, streets, sidewalks, vehicle area and other buildings or structures \non the premises. \n3. \nThe maximum and minimum heights and clearances of the sign. \n4. \nNumber, size and location of all existing signs on the same building, lot or premises. \n5. \nStructural and mechanical design and engineering data sufficient to ensure the sign's \nstructural stability. \nA6.012  Installation Inspections  \nA. \nAll work for signs requiring a development permit shall be inspected in the following stages: \n1. \nWhen excavations for supporting footings, pilings, poles or columns have been made and \nbefore such excavations have been filled with earth or building materials of any kind. \n2. \nWhen connecting elements have been installed on supporting buildings or structures, and \nbefore the sign is attached to these elements. \n3. \nWhen electrical work is completed.  Electrical signs shall not be energized until the final \nelectrical inspection has been approved. \n4. \nAfter installation is completed. \nB. \nEvery permanent sign shall display the name of the sign installer. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[A.6]-4 \nCity of Gresham Development Code \n \n(01/23) \n \nA6.013  Construction   \nA. \nThe construction of all signs or sign structures shall conform to applicable provisions of the \nBuilding Code. \nB. \nAll illuminated signs must be installed by a licensed sign contractor, subject to provisions of the \nOregon State Electrical Code.  All electrically illuminated signs shall bear the Underwriters \nLaboratory label or equivalent, manufacturer's label, and the installing contractor's label. \n \nSpecific Sign Development Provisions \nA6.020  Measurements   \nA. \nSign Area. \n1. \nThe area of sign faces enclosed in frames or cabinets is determined based on the outer \ndimensions of the frame or cabinet surrounding the sign face.  Sign area does not include \nfoundations, supports or other essential structures which are not serving as a backdrop or \nborder to the sign.  Only one face of a double-faced sign is counted.  If a sign has more than \ntwo faces, the total area may not exceed twice the area permitted. \n2. \nWhen a sign is on a base material and attached without a frame, such as a wood board or \nplexiglas panel, the dimensions of the base material are to be used unless it is clear that part \nof the base contains no sign, related display or decoration . \n3. \nWhen signs are constructed of individual pieces attached to a building wall, sign area is \ndetermined by a perimeter drawn (the greater height multiplied by the greater width) around \nall the pieces. \n4. \nFor sign structures containing multiple modules oriented in the same direction, the modules \ntogether are counted as one sign face. \n5. \nFree standing signs in the RTC, SC, CC, MC, NC, GI and HI Districts:  If a site has frontage \non more than one street (e.g., a corner lot or a double frontage lot), the street frontage on \nwhich the sign is to be located shall be used to determine the maximum area of the sign face.  \nNo more than one frontage may be used for this measurement.  For a sign located on the \ncorner of a corner lot, the applicant shall choose one frontage to use for this measurement. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[A.6]-5 \nCity of Gresham Development Code \n \n(01/23) \n \nFigure A6.020 - Sign Area Measurements \nDIAGRAM “A” \n \n \nDIAGRAM “B” \n \n \nDIAGRAM “C” \n          \n         \n \nA6.021  Placement   \nA. \nPlacement.  All signs and sign structures shall be erected and attached totally within the site except \nwhen allowed to extend into or over the right-of-way. \nB. \nFrontages.  Signs allowed based on the length of one site frontage may not be placed on another \nsite frontage.  Signs allowed based on a building frontage may not be placed on another building \nfrontage. \nC. \nClear Vision Area.  No sign shall be located in the clear vision area as defined in Section 9.0200.  \nNo support structure(s) shall be located in the clear vision area unless the combined total width is \n12 inches or less and the combined total depth is 12 inches or less. \nD. \nVehicle Area Clearances.  When a sign extends over a private area where vehicles travel or are \nparked, there shall be a minimum 14 foot clearance.  Exception: the bottom of an electric sign or an \noutline lighting enclosure shall have not less than a 16 foot clearance unless such enclosures are \nprotected from physical damage.  In no cases shall the vehicle area clearance be less than 14 feet.  \nVehicle areas include driveways, alleys, parking lots and loading and maneuvering areas. \nE. \nPedestrian Area Clearances.  When a sign extends over private sidewalks, walkways or other \nspaces accessible to pedestrians, there shall be a minimum 8 foot 6 inch clearance. \nF. \nRequired Yards.  Signs may be erected in required yards. \nA6.022  Fascia Sign  \nNo point on the face of a fascia sign may extend more than 18 inches from the wall to which it is attached, \nexcept for permitted electronic message signs which may be up to 24 inches in thickness.  Fascia signs may \nnot extend beyond the corner of buildings. \nA6.023  Projecting Sign   \nThe support structure for a projecting sign shall be designed so that there is the minimum visible support \nstructure above the sign face.  There shall be no more than 1foot of support structure between the building \nwall and the sign. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[A.6]-6 \nCity of Gresham Development Code \n \n(01/23) \n \nA6.024  Marquees and Awnings   \nA. \nSigns may be placed on or incorporated into marquees and awnings provided they do not extend \nabove the upper surfaces of the structure. \nB. \nMarquees and awnings containing signs may extend into the right-of-way the same distance as \nallowed for those that do not contain signs, in accordance with the Building Code. \nA6.025  Illuminated Awning Sign    \nA. \nIlluminated awning signs may extend into the right-of-way the same distance as is allowed for \nawnings. In accordance with the Building Code. \nB. \nThe projection of an illuminated awning sign shall not be less than 3 feet. \nC. \nAn illuminated awning sign shall be limited to a wall facing a street or adjacent to a pedestrian \nwalkway. \n \nSigning of Nonconforming Uses \nA6.030  Provisions    \nThe following provisions for signs shall apply when a use has been found to be lawfully existing within the \nprovisions of Section 8.0200; the provisions of this section are not intended to allow a sign to exceed the \nrequirements set forth in the sign district within which the subject nonconforming use would be a permitted \nuse. \nA. \nFree Standing Sign.  Any existing free standing sign on the premises of a nonconforming use can \nbe maintained, improved or relocated on the premises as long as the change does not increase the \ntotal sign area or exceed the height of the existing sign. \nB. \nWall Sign.  Any existing wall sign on the premises of a nonconforming use can be maintained, \nimproved or relocated on the premises as long as the maximum area of a wall sign does not exceed \n5 percent of the wall area upon which the sign is located.  Only one wall sign shall be permitted. \nC. \nProjecting Sign.  Any existing projecting sign on the premises of a nonconforming use can be \nmaintained, improved, or relocated on the premises as long as the change does not increase the \ntotal sign area or exceed the height of the existing sign. \nD. \nReaderboard.  A permanent readerboard may be incorporated into any one, but not more than one, \nof the above permitted signs provided that the readerboard assembly is an integral part of the sign \nand the readerboard portion of the sign does not exceed 40 inches in height.  The readerboard may \nbe no more than 60% of the face of the sign. \nE. \nReplacement.  Existing signs for non-conforming uses found in the Commercial, Mixed-Use and \nIndustrial Districts identified in Section A6.100 may be replaced by signs as allowed in that \nsection.  Existing signs for non-conforming uses found in the Residential Districts as identified in \nSection A6.090 - A6.097 may be replaced with signs as allowed in that section or as allowed in \nSection A6.110. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[A.6]-7 \nCity of Gresham Development Code \n \n(01/23) \n \nF. \nA-board Signs.  Two A-board signs are allowed on a site fronting on a State Highway and having \nat least 300 feet of linear State Highway frontage.  Such A-board signs are not to exceed 32 square \nfeet in area, must be anchored and are to be displayed only during the hours of operation. \n \nVariance \nA6.040  Sign Requirement Variance   \nUnder the provisions of Section 10.1500, Community Development Code, a variance may be requested for \nall sign regulations except for prohibited signs. \n \nExemptions \nA6.050  Sign Requirement Exemptions   \nThe following signs shall not require a Development Permit but shall conform to all other applicable \nprovisions of the Gresham Development Code.  \nA. \nSigns not exceeding one square foot in area and bearing only property numbers, post box numbers, \nname of occupants or premises, or other identification of premises. \nB. \nProfessional non-illuminated nameplates not exceeding two square feet in area identifying the \nname and occupation or profession of the occupant of the premises on which the sign is located. \nC. \nSigns directing traffic into off-street parking areas.  An on-site directional sign(s) shall not exceed \n3 square feet in area.  A free-standing sign may not exceed 42 inches in height.  A wall sign may \nnot exceed 8 feet in height above grade. \nD. \nTraffic or other municipal signs, public trail signage, directional signs for hospital or emergency \nservices, legal notices, railroad signs, and danger signs. \nE. \nMemorial signs or tablets, names of buildings, and date of erection when cut into any masonry \nsurface, or constructed of bronze or other non-combustible surface or when constructed of bronze \nor other non-combustible material not to exceed eight square feet in area. \nF. \nFlags displayed from permanently located free-standing or wall-mounted flagpoles which are \ndesigned to allow raising and lowering of flags.  The number of such flags shall be limited in \nnumber to one per 100 feet of linear frontage, with a maximum of 6 per premises.  Such displays \nshall be kept neat, clean and in good repair. \nG. \nPainted wall decorations and painted wall highlights. \nH. \nHoliday decorations in season; provided that such decorations shall be removed within 15 days of \nthe passing holiday to which they pertain. \nI. \nOne time clock and/or scoreboard sign shall be permitted at each athletic field.  Such signs shall: \n1. \nHave a maximum height of 15 feet above grade in the LDR-5, LDR-7, TLDR, TR, LDR-GB, \nLDR-PV, VLDR-SW, and LDR-SW land use districts; or \n2. \nHave a maximum height of 18 feet above grade in all other districts. \nJ. \nAthletic Field Signs.  Banners or temporary rigid signs located on the outfield fence of athletic \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[A.6]-8 \nCity of Gresham Development Code \n \n(01/23) \n \nfields may be installed.  Each individual sign shall be no more than 32 square feet in area.  There \nshall be no more than 32 square feet of area for any 8 linear feet of fence.  The maximum height \nshall not exceed 8 feet above grade.  The sign shall not project above the fence. \nK. \nA menu board sign in conjunction with a drive through window shall not be considered a free \nstanding sign or an on site direction sign.  It shall be located adjacent to an on site driveway and \nshall not exceed 6 feet in height and/or 8 feet in width. \nL. \nA sign placed on an amateur radio or citizen band antenna support structure provided that the sign \nis no higher than 10 feet above grade and no larger than 4 square feet in area and which warns:  \npersons not to climb, trespass upon or interfere with the structure; advises of potential radio \nfrequency burn or hazards; bears the FCC-assigned call sign(s) of any amateur station(s) utilizing \nthe structure; and/or advises that damaging the structure is a federal offense and violation of state \nand local criminal laws. \nM. \nAn illuminated representation of a multi-family complex which shows the location of the visitor \nand the unit designations within the complex.  The sign(s) shall be positioned at a driveway, shall \nbe free-standing, have a 3 feet to 5 feet 6 inches height, a 7 to 32 square foot area, and be located a \nminimum of 20 feet back from the property line at the street access point. \nN. \nA-board signs subject to Sections A6.030, A6.120 and A6.130. \nO. \nWindow signs in conjunction with a permitted commercial, industrial, institutional use, or, a sales \nor manager’s office associated with a permitted multi-family or PD facility, provided no more than \n50% of the window area is obscured by signage. \nP. \nInternal institutional campus signs (located within the boundaries of the campus) provided: \n1. \nThe sign area shall be no more than 20 square feet.  \n2. \nThe sign is placed at least 100 feet from the public right-of-way or the campus site boundary.  \n3. \nHeight of an internal institutional campus sign shall be limited to a maximum of 6 feet above \ngrade. \n4. \nNumber:  No limit. \n \nTemporary Signs \nA6.060  General Limitations    \nTemporary signs are generally prohibited, except as provided by this section.  Those temporary signs that \nare permitted are subject to the following limitations: \nA. \nIllumination.  No temporary sign shall be internally or externally illuminated. \nB. \nLocation.  No temporary sign shall extend into or over the public right-of-way or the clear vision \narea. \nC. \nMaintenance.  Temporary signs shall be kept neat, clean and in good repair.  Materials used should \nnot fade, tear, rip or otherwise become unsightly during the period of installation. \nD. \nPlacement.  Except as provided by this section, temporary signs may not be attached to fences, \ntrees, shrubbery, utility poles, or like items.  They shall not obstruct or obscure primary signs on \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n[A.6]-9 \nCity of Gresham Development Code \n \n(01/23) \n \nadjacent premises.  They shall not create a traffic hazard because of the distractive character to \nmotorists of any such device or the cumulative effect of all such devices. \nE. \nTemporary.  Temporary signs are limited to 90 days, except as otherwise specified. \nA6.061  Sign Types    \nA. \nLawn Signs.  Lawn signs shall be pole or wall mounted.  Temporary lawn signs and sign structures, \nif any, must be removed within six months of the date of installation.  Pole-mounted lawn signs \nshall not exceed 42 inches in height.  Wall mounted lawn signs shall not exceed 8 feet in height.   \n \nThe maximum area of a lawn sign shall be 6 square feet in area.  Lawn signs shall not require a \ndevelopment permit, but shall conform to all other provisions of the Community Development \nCode. \nB. \nRigid Signs.  Temporary rigid signs shall be pole or wall mounted.  Temporary rigid signs and sign \nstructures, if any must be removed within one year of the date of installation.  Pole mounted rigid \nsigns shall not exceed 8 feet in height.  Wall mounted rigid signs shall not extend above the roof \nline at the wall or above the top of a parapet wall.  The maximum area of a rigid sign shall be 16 \nsquare feet in area. Rigid signs shall not require a development permit, but shall conform to all \nother provisions of the Standards Document. \nC. \nBalloon Signs.  One balloon sign per site may be permitted.  Balloon signs shall be ground or roof \nmounted and air-filled.  The overall height of a ground mounted balloon sign shall not exceed 25 \nfeet above grade.  The overall height of a roof mounted balloon sign shall not exceed 25 feet above \nthe roof top.  The display period is limited to 14 days in any 180 day period and 28 days in any 360 \nday period. \nD. \nBanner Signs.  Banner signs attached to a building wall may be permitted.  Such banner signs are \nlimited to a total of 32 square feet in area per building wall per street frontage.  Banner signs shall \nnot require a development permit, but shall conform to all other provisions of the Community \nDevelopment Code.  For Temporary, Intermittent and Interim Uses and Food Carts, see Appendix \nA6.120 for additional standards. \nE. \nSpecial Event Banner Signs.  Permitted in all land use districts when in conformance with the \nfollowing criteria: \n1. \nNotarized, written consent from the property owner where the banner will be located.  The \nconsent shall identify any restrictions that the property owner requires of the permit holder.  \n2. \nPlans showing the location of the banner; banner height above the right-of-way; support \ndevices for the banner; and proposed dates.  \n3. \nThe display period shall not exceed 25 consecutive days in duration and no more than once \nin any 12-month period. For banners proposed in rights-of-way, the maximum duration shall \nbe set by the Manager. \n4. \nA copy of any liability and/or property damage insurance required by the property owner \nwhere the banner will be located. \n \nProhibited Signs \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": " \n[A.6]-10 \nCity of Gresham Development Code \n \n(01/23) \n \nA6.070  Prohibited Signs  \nIt shall be unlawful for any person to erect, display or maintain, any sign or advertising structure falling \nwithin any of the following descriptions: \nA6.071  Hazardous Signs  \nA. \nMoving signs, or any sign which has any visible moving part or visible mechanical movement of \nany description, including movement created by normal wind currents.  Clocks and barber poles \nare exceptions. \nB. \nFlashing and animated signs, or any signs which achieve apparent movement through electrical \npulsations, including strobe lights, and bead lighting, or through animation and/or real images. \nC. \nSigns that substantially obstruct free and clear vision of the traveling public at the intersection of \nany street or driveway. \nD. \nSigns that have the potential to distract drivers or interfere with the traveling public's perception of \ntraffic controls, including signs that use the words \"STOP\", \"LOOK\", \"DANGER\", or any other \nword, phrase, character, symbol, graphic, or use of lighting that is reasonably likely to distract or \nconfuse vehicle operators and impose safety hazards. \nE. \nSigns that incorporate reflective type bulbs, or par spot bulbs, or directly visible bulbs of greater \nthan 25 watts capacity.  Electronic message center signs are exceptions. \nF. \nSigns that incorporate white or blue neon tubing that exceeds 300 milliamperes rating, or other \nneon tubing that exceeds 120 milliamperes rating. \nG. \nSigns that incorporate fluorescent tubing that exceeds an illumination equivalent of 800 \nmilliamperes rating, or a spacing of less than 9 inches, center to center. \nH. \nTemporary readerboards, portable readerboards,  A-board or sandwich signs or any other portable \nsigns capable of blocking public right-of-way that are not expressly permitted in the Community \nDevelopment Code. \nI. \nSigns that obstruct in any way a fire escape, stairway or standpipe, or interfere with human exit \nthrough a window or any room located above the first floor of any building; or any door or required \nexit from a building, or required light or ventilation source. \nA6.072  Other Prohibited Signs   \nThe following signs or advertising structures are identified as having unnecessary and adverse visual \nimpact on the community: \nA. \nRoof signs, fin signs, or any sign structure that is attached to a building that does not conform to \nthe sign standards contained in the Community Development Code. \nB. \nTemporary signs, bench signs, banners, pennants, wind signs, balloon signs, flags or any other \ntemporary sign structure that does not conform to the sign standards contained in the Community \nDevelopment Code. \nC. \nNonconforming signs that have been modified in a manner which is not consistent with the \nCommunity Development Code. \nNonconforming Signs \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": " \n[A.6]-11 \nCity of Gresham Development Code \n \n(01/23) \n \nA6.080  Nonconforming Signs   \nA. \nNonconforming signs are those signs lawfully installed prior to July 1, 1989, or for which a \ndevelopment permit was issued on or after July 1, 1989, which do not conform to the requirements \nof the Community Development Code. \nB. \nAny nonconforming sign shall be made to comply with the Community Development Code when \nstructural alteration, changes of sign face, or relocation or replacement of a sign occur.  However, \nchanges in copy on readerboard or outdoor advertising signs shall be permitted without loss of non-\nconforming status.  On-site or off-site repairing or restoring any part of a sign or sign structure to a \nsafe condition, including normal maintenance, shall be permitted without loss of non-conforming \nstatus. \nC. \nAny non-conforming permanent sign installed prior to July 1, 1989, which does not comply with \nthe Community Development Code shall be made to comply, or be removed by July 1, 1999. Any \nnonconforming permanent sign installed on or after July 1, 1989, shall be made to comply, or be \nremoved by ten years from the date a permit was issued or, in the case that a sign becomes \nnonconforming after installation, shall be made to comply, or be removed by ten years from the \ndate the sign became nonconforming.  Any non-conforming temporary sign installed prior to July \n1, 1989, which does not comply with the Community Development Code shall be made to comply, \nor be removed by January 1, 1990.  Non-conforming outdoor advertising signs subject to federal \nlaw are not required to comply with this section. \nD. \nSigns identified by the Manager as hazardous shall be made to comply with the Community \nDevelopment Code, or be removed within 90 days of the adoption of this ordinance.  Other \nprohibited signs shall be made to comply with the Community Development Code, or be removed \nwithin one year of the adoption of this ordinance.  \nE. \nSigns located on property annexed to the City after July 1, 1989, and not included in the \nIntergovernmental Agreement on Planning Services (effective in June, 1986), shall be made to \ncomply with the Community Development Code, or be removed ten years after the effective date \nof annexation. \nF. \nSigns identified as hazardous by the Manager, and located on property annexed to the City after \nJuly 1, 1989, and not included in the Intergovernmental Agreement on Planning Services (effective \nJune, 1986), shall be made to comply with the Community Development Code, or be removed \nwithin 90 days of the effective date of annexation.  Other prohibited signs located on property \nannexed to the City shall be made to comply with the Community Development Code, or be \nremoved within one year of the effective date of annexation. \nG. \nUnder the Type III procedure, the hearing body may recognize exceptional non-conforming signs \nas provided by this section of the Community Development Code.  Exceptional signs shall meet all \nof the following criteria: \n1. \nThe entire sign structure was constructed at least twenty years prior to the date of application, \nand has been maintained in its original location, design, and appearance. \n2. \nThe entire sign structure is unique in appearance and design, and is clearly outstanding in its \nvisual impact. \n3. \nThe sign structure is recognized as a special feature in the city, and considered a unique \nvisual asset. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": " \n[A.6]-12 \nCity of Gresham Development Code \n \n(01/23) \n \n4. \nThe sign structure has been inspected and certified by a licensed sign contractor and a \nlicensed electrician to be in a safe condition. \nH. Exceptional signs recognized by the hearing body and signs associated with designated Historic \nLandmarks are exempt to amortization measures for non-conforming and prohibited signs included \nin subsections (C) through (F) of this section provided they comply with other applicable standards \nin the Community Development Code. \n \nSigns in Residential Land Use Districts \nA6.090  Residential Districts  \nSigns in the LDR-5, LDR-7, TLDR, TR, MDR-12, MDR-24, Corridor Multi-Family and OFR Districts and \nLDR-PV, MDR-PV, HDR-PV, VLDR-SW, LDR-SW and THR-SW sub-districts shall be subject to the \nprovision of this section and all other applicable provisions of this ordinance. \nA6.091  Subdivision Signs \nSigns located within a subdivision shall be subject to the following limitations: \nA. \nType.  Free-standing sign(s) are permitted for residential subdivisions. \nB. \nArea.  A subdivision sign shall be a maximum of 32 square feet. \nC. \nHeight.  A subdivision sign shall not exceed a height of four feet. \nD. \nNumber.  One subdivision sign is permitted for a subdivision containing up to 39 units.  A second \nsign is permitted for subdivisions containing 40 or more units. \nE. \nIllumination.  The sign may have external illumination if the lighting is oriented away from streets \nand adjacent properties.  No sign shall be illuminated between the hours of 12:00 a.m. and 7:00 \np.m.  Internally illuminated signs are not permitted. \nF. \nMaintenance.  The applicant shall submit a maintenance agreement for the sign.  The Manager may \napprove the sign permit if the agreement will ensure long term maintenance of the sign. \nA6.092  Multi-Family Dwelling Signs   \nSigns associated with multi-family developments shall be subject to the following limitations: \nA. \nFree-Standing Signs: \n1. \nArea.  Shall be limited to a maximum of 32 square feet. \n2. \nHeight.  Shall be limited to a maximum height of 8 feet above grade. \n3. \nNumber.  Shall be limited to one per site.  \n4. \nIllumination: \na. \nThe sign may have external illumination if the lighting is oriented away from streets \nand adjacent properties. \nb. \nThe sign may be internally illuminated when the illumination is confined to the \nlettering and logo.  The illuminated areas of the sign shall not exceed 50% of the \nsign face. \nc. \nNo sign shall be illuminated between the hours of 12:00 a.m. and 7:00 a.m. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": " \n[A.6]-13 \nCity of Gresham Development Code \n \n(01/23) \n \nB. \nWall Signs: \n1. \nArea.  Shall be limited to 32 square feet. \n2. \nTypes of Signs.  Fascia, awning and painted wall signs are permitted. \n3. \nHeight.  No wall sign shall extend above the roofline at the wall or the top of a parapet wall, \nwhichever is higher, but in no case shall the sign exceed a height of 25 feet above grade. \n4. \nNumber.  Shall be limited to one per site. \nA6.093  Manufactured Dwelling Park Signs   \nSigns located within a manufactured dwelling park shall be subject to the following limitations: \nFree-standing Signs: \nA.  Area.  Shall be limited to 2 square feet per dwelling unit up to a maximum of 32 square feet. \nB.  Height.  Shall be limited to a maximum height of 8 feet above grade. \nC.  Number.  Shall be limited to one per site. \nD.  Illumination: \n1. \nThe sign may have external illumination if the lighting is oriented away from street and \nadjacent properties. \n2. \nThe sign may be internally illuminated when the illumination is confined to the lettering and \nlogo.  The illuminated areas of the sign shall not exceed 50% of the sign face. \n3. \nNo sign shall be illuminated between the hours of 12:00 a.m. and 7:00 a.m. \nA6.094  Signs for Permitted Commercial Uses in the OFR District  \nSigns associated with permitted commercial uses in the OFR District shall be subject to the following \nlimitations: \nA. \nFree-Standing Signs \n1. \nArea.  Shall be limited to a maximum of 32 square feet. \n2. \nHeight.  Shall be limited to a maximum height of 8 feet above grade. \n3. \nNumber.  Shall be limited to one per site. \nB. \nWall Signs \n1. \nArea.  Shall be limited to a maximum of 32 square feet. \n2. \nTypes of Signs.  Shall be limited to fascia, awning and painted wall signs. \n3. \nHeight.  No wall sign shall extend above the roofline at the wall or the top of a parapet, \nwhichever is higher, but in no case shall the sign exceed a height of 25 feet above grade. \n4. \nNumber.  Shall be limited to one per premise. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": " \n[A.6]-14 \nCity of Gresham Development Code \n \n(01/23) \n \nC. \nSign Features \n1. \nIllumination.  Signs may be indirectly or internally illuminated. \n2. \nReaderboard.  A permanent readerboard may be incorporated either in a free-standing sign or \na wall sign but not both.  The readerboard shall be an integral part of the sign design and \nshall not exceed 40 inches in height. \nA6.095  Temporary Signs   \nPursuant to Section A6.060 the following temporary signs shall be permitted: \nA. \nLawn Signs. \nB. \nRigid Signs.  One rigid sign may be permitted on a frontage of at least 300 linear feet. \nC. \nBanner Signs.  Placement is limited to multiple-dwelling and commercial buildings. \n \nSigns in Commercial, Mixed Use & Industrial Land Use Districts \nA6.100  Commercial, Mixed Use and Industrial Districts  \nSigns in the NC, RTC, SC, CMU, CC, MC, GI and HI Districts and in the NC-PV, MUE-PV, TC-PV, EC-\nPV, VC-SW, RTI-SW, IND-SW and NC-SW sub-districts shall be subject to the following limitations, \nexcept for multi-business complexes (see Section A6.101 for multi-business complexes): \nA. \nFree-standing Signs: \n1. \nArea.  The maximum permitted area per sign face shall be 0.4 square feet of sign face area \nper linear foot of site frontage, up to a maximum of 100 square feet.  Regardless of site \nfrontage a minimum of 40 square feet of sign area may be permitted. \n2. \nHeight.  The maximum height of any portion of a sign or sign structure shall be 25 feet above \ngrade. \n3. \nNumber.  One sign per site shall be permitted, except in GI and HI districts and the EC-PV, \nRTI-SW and IND-SW sub-districts where industrial users on parcels of 10 acres or larger \nmay have one sign per street frontage.  However, no free-standing sign shall be permitted on \nthe same site where there is a projecting sign. \nB. \nWall Signs: \n1. \nArea.  The maximum permitted area of a wall sign shall be 10% of the wall area upon which \nthe sign is located. \n2. \nTypes of Signs.  Fascia, mansard wall, awning, illuminated awning, marquee and painted \nwall signs are permitted. \n3. \nHeight.  No wall sign shall extend above the roof line at the wall or the top of a parapet wall, \nwhichever is higher. \n4. \nNumber.  There is no limit on the number of signs if within the total permitted area limit. \nC. \nProjecting Signs: \n1. \nArea.  The maximum permitted area of a projecting sign shall be 18 square feet per sign face. \n2. \nHeight.  A projecting sign shall not extend above the roof line at the wall or above the top of \na parapet wall, whichever is higher.  In no case shall any portion of a projecting sign exceed \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": " \n[A.6]-15 \nCity of Gresham Development Code \n \n(01/23) \n \na height of 25 feet above grade. \n3. \nClearance.  Projecting signs shall have a minimum clearance of 8 feet between the bottom of \nthe sign and the ground. \n4. \nLocation.  Projecting signs may extend into the right-of-way 2 feet except that no portion of \nthe sign shall be closer than 30 feet from the centerline of an existing right-of-way. \n5. \nNumber.  One sign per site shall be permitted.  However, no projecting sign shall be \npermitted on the same site where there is a free-standing sign. \nD. \nUnder Marquee Signs: \n1.   \nArea.  The maximum permitted area of an under marquee sign shall be 8 square feet per sign \nface.  The maximum vertical height of a sign face shall be 2 feet. \n2.   \nClearance.  A minimum 8 foot, 6 inch clearance shall be maintained between the sign and the \nground.  No sign can project past the outer edge of the marquee. \n3.   \nNumber.  One sign per premise shall be permitted. \nE. \nOn-Site Directory Signs: \n1. \nArea.  A 3 square foot sign panel is permitted for each business or activity on the site. \n2. \nLocation.  On-site directory signs shall be located a minimum of 20 feet back from the \nproperty line at the street access point. \n3. \nNumber.  One on-site directory sign is permitted for each street access point to the \ndevelopment. \nF. \nSign Features \n1. \nIllumination.  Signs may be indirectly or internally illuminated. \n2. \nReaderboard.  A permanent readerboard may be incorporated either in a freestanding sign or \na wall sign but not both.  The readerboard shall be an integral part of the sign design and \nshall not exceed 40 inches in height. \n3. \nElectronic Message Center.  An electronic message center may be incorporated into either a \nfree-standing sign or wall sign, but not both.  The electronic message center shall be an \nintegral part of the sign design and shall not exceed 8 square feet in area. \nG. \nTemporary Signs.  Pursuant to Section A6.060 the following temporary signs shall be permitted. \n1. \nLawn Signs. \n2. \nRigid Signs.  One rigid sign per site frontage shall be permitted.  A site frontage of at least \n300 linear feet shall be permitted an additional rigid sign.  Rigid signs on the same frontage \nshall be spaced at least 50 feet apart. \n3. \nBanner Signs. \n4. \nBalloon Signs. \nA6.101  Signs for Outdoor Commercial Uses in the MC and CC Districts and \nin Multi-Business Complexes   \nSigns for outdoor commercial uses in the MC and CC Districts and in multi-business complexes shall be \nsubject to the following limitations: \nA. \nFree-standing Signs: \n1. \nArea.  The maximum permitted area per sign face shall be 0.4 square feet of sign face area \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": " \n[A.6]-16 \nCity of Gresham Development Code \n \n(01/23) \n \nper linear foot of site frontage, up to a maximum of 250 square feet.  Regardless of site \nfrontage a minimum of 40 square feet may be permitted. \n2. \nHeight.  The maximum height of any portion of a sign or sign structure shall be 25 feet above \ngrade. \n3. \nNumber.  One sign per site street frontage shall be permitted. \nB. \nWall Signs: \n1. \nArea.  The maximum permitted area of a wall sign shall be 10% of the wall area upon which \nthe wall is located. \n2. \nTypes of Signs.  Fascia, mansard wall, awning, illuminated awning, marquee and painted \nwall signs are permitted. \n3. \nHeight.  No wall sign shall extend above the roof line at the wall or the top of a parapet wall, \nwhichever is higher. \n4. \nNumber.  There is no limit on the number of signs if within the total permitted area limit. \nC. \nUnder Marquee Signs: \n1. \nArea.  The maximum permitted area of an under marquee sign shall be 8 square feet per sign \nface.  The maximum vertical height of a sign face shall be 2 feet. \n2. \nClearance.  A minimum 8 foot, 6 inch clearance shall be maintained between the sign and the \nground.  No sign can project past the outer edge of the marquee. \n3. \nNumber.  One sign per premise shall be permitted. \nD. \nOn-Site Directory Signs: \n1. \nArea.  A 3 square foot sign panel is permitted for each business or activity on the site. \n2. \nLocation.  On-site directory signs shall be located a minimum of 20 feet back from the \nproperty line at the street access point. \n3. \nNumber.  One on-site directory sign is permitted for each street access point to the \ndevelopment. \nE. \nSign Features: \n1. \nIllumination.  Signs may be indirectly or internally illuminated. \n2. \nReaderboard.  A permanent readerboard may be incorporated either in a freestanding sign or \na wall sign, but not both.  The readerboard shall be an integral part of the sign design and \nshall not exceed 40 inches in height. \n3. \nElectronic Message Center.  An electronic message center may be incorporated into either a \nfree-standing sign or wall sign, but not both.  The electronic message center shall be an \nintegral part of the sign design and shall not exceed 8 square feet in area. \nF. \nTemporary Signs:  Pursuant to Section A6.060 the following temporary signs shall be permitted. \n1. \nLawn Signs. \n2. \nRigid Signs.  One rigid sign per site frontage shall be permitted.  A site frontage of at least \n300 linear feet shall be permitted an additional rigid sign.  Rigid signs on the same frontage \nshall be spaced at least 50 feet apart. \n3. \nBanner Signs. \n4. \nBalloon Signs. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 17,
      "text": " \n[A.6]-17 \nCity of Gresham Development Code \n \n(01/23) \n \nSigns for Institutions and Uses Subject to Special Use Review \nA6.110  Signs for Institutional Uses and Uses Subject to Special Use Review   \nAll signs for Institutional Uses and uses subject to a Special Use Review shall conform to the sign \nstandards identified in the specific land use district of the property except for development in LDR-5, LDR-\n7, TLDR, TR, MDR-12, MDR-24, CMF and OFR Districts and LDR-PV, MDR-PV, HDR-PV, VLDR-\nSW, LDR-SW and THR-SW sub-districts.  Signs located in these districts shall comply with the following \nstandards, except that institutional campus signs are limited to the standards of A6.110(H): \nA. \nFree-standing Signs: \n1. \nArea.  Shall be limited to a maximum of 32 square feet per sign face unless the development \nis on a site which exceeds two acres in size, in which case the sign may be a maximum of 48 \nsquare feet. \n2. \nHeight.  Shall be limited to a maximum of 8 feet above grade. \n3. \nNumber.  One is permitted unless the development is on a site which exceeds 2 acres in size \narea and has frontage on 2 arterial streets, in which case another sign is permitted. \nB. \nWall Signs: \n1. \nArea.  Shall be limited to a maximum of 32 square feet. \n2. \nTypes of Signs.  Fascia, awning and painted wall signs shall be permitted. \n3. \nHeight.  Shall not extend above the roofline at the wall or the top of a parapet wall, \nwhichever is higher, but in no case shall it exceed a height of 25 feet above grade. \n4. \nNumber.  Shall be limited to one per premises. \nC. \nIllumination: \n1. \nMay be internally illuminated when the illumination is confined to the lettering and logo.  \nThe background of the sign face shall be opaque.  The illuminated areas of the sign shall not \nexceed 50% of the sign face. \n2. \nMay have external illumination if the lighting is oriented away from streets and adjacent \nproperties. \n3. \nUnless the use operates on a 24-hour basis or abuts nonresidential designed property, the sign \nshall not be illuminated between the hours of 10:00 p.m. and 7:00 a.m. \nD. \nReaderboard Sign.  Except as provided in Section A6.110(E), a permanent readerboard may be \nincorporated into either, but not both, a wall or free-standing sign provided the readerboard \nassembly is an integral part of the sign and the readerboard portion of the sign does not exceed 40 \ninches in height.  The readerboard may not be more than 60% of the face of the sign.  Readerboard \nsigns can also be electronic signs that do not have a change in message more than one time per 24 \nhours, except in the case of emergency notification. \nE. \nReaderboard Sign - Schools.   In addition to a free-standing sign allowed in Section A6.110(A), a \nfree-standing readerboard sign is also allowed for elementary schools, high schools or colleges that \ndo not meet the definition of institutional campus.  A permanent readerboard sign for these schools \nin any land use district may be free standing or incorporated into either a wall sign or free-standing \nsign. \n1. \nArea.  Shall be limited to a maximum of 32 square feet per sign face.  If the readerboard \nassembly is incorporated into another freestanding sign, the maximum area per sign face \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 18,
      "text": " \n[A.6]-18 \nCity of Gresham Development Code \n \n(01/23) \n \nshall be 52 square feet.  If the development is on a site that exceeds two acres in size, the sign \nmay be a maximum of 68 square feet.  If incorporated into a wall sign, the maximum sign \narea shall be 52 square feet. \n2. \nHeight.  Of a free-standing readerboard sign shall be limited to a maximum of 6 feet above \ngrade. \n3. \nNumber.  One is permitted per site. \nF. \nResidential Sign.  Notwithstanding the above, an institutional use subject to a Special Use Review \npermitted in a residential structure and fronting on a neighborhood collector or local street shall \nonly be permitted one 6 square foot, non-illuminated wall sign. \nG. \nTemporary Signs.  Pursuant to Section A6.060, lawn signs shall be permitted.  One rigid sign may \nbe permitted on a frontage of at least 300 linear feet. \nH. \nInstitutional Campus Signs.  Signs located in institutional campuses shall comply with the \nfollowing standards: \n1. \nCampus Sign Master Plan.  A campus sign master plan shall be submitted in conjunction \nwith a sign permit.  The plan shall include: \na. \nType of signs. \nb. \nLocation of signs. \nc. \nNumber of signs.    \n2. \nMonument Signs. \na. \nArea.  A monument sign shall be a maximum of 48 square feet in area. \nb. \nHeight.  A monument sign shall be a maximum of 8 feet above grade. \nc. \nNumber.  Up to a maximum of four monument signs are permitted on an institutional \ncampus. \nd. \nLocation.  Monument signs are permitted where the campus site abuts an arterial or \ncollector street.  They are to be located at least 500 feet apart.    \n3. \nInstitutional Campus Directional Signs. \na. \nArea.  A directional sign shall be to a maximum of 32 square feet in area. \nb. \nHeight.  A directional sign shall not exceed a height of 6 feet above grade. \nc. \nNumber.  One sign is permitted for each campus entrance.    \n4. \nWall Signs.  See Section A6.110(B). \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 19,
      "text": " \n[A.6]-19 \nCity of Gresham Development Code \n \n(01/23) \n \n5. \nReaderboard Signs. \na. \nDesign.  A permanent readerboard may be incorporated into either a monument or \ninstitutional campus directional sign provided the readerboard assembly is an \nintegral part of the sign and the readerboard portion of the sign does not exceed 40 \ninches in height.  The readerboard may not be more than 60% of the face of the sign. \nb. \nNumber.  No more than two readerboards shall be permitted per institutional \ncampus. \n6. \nIllumination.  See Section A6.110(C). \n \nSigns for Temporary, Intermittent and Interim Uses and Food Carts \nA6.120  Signs for Temporary, Intermittent and Interim Uses and Food Carts  \nTemporary, Intermittent and Interim Uses and Food Carts as allowed by Section 10.1400 and Section \n10.1600 of the Community Development Code shall be allowed the following signs: \nA. Temporary Uses except Temporary Dwellings and Special Events shall be allowed: \n1. One wall or banner sign per use per street frontage not to exceed 32 square feet each; and \n2. One temporary A-board or readerboard sign per use per street frontage. If more than one use \noccupies the same site: \na. The number of A-board or readerboard signs per street frontage shall not exceed three \nper 100 linear feet of frontage; and \nb. The site is allowed one additional A-board or readerboard sign to act as the site sign. \nB. Temporary Dwellings shall only be permitted signage allowed other residential uses, such as with \napplicable standards in Sections A6.090 through A6.095 and Section 10.0500. \nC. Intermittent uses except Farmers’ Markets and Special Events shall be allowed: \n1. One wall or banner sign per use per street frontage not to exceed 32 square feet each; and \n2. One temporary A-board or readerboard sign per use per street frontage. \nD. Farmers’ Markets and Special Events: \n1. The uses shall be allowed one wall or banner sign for each vendor booth or unit not to exceed \n32 square feet for each sign. \n2. The uses shall be allowed other banner signs on the site not to exceed 32 square feet that \ncomply with A6.060(A), (B) and (C). The banner signs shall not be attached to trees, \nshrubbery, utility poles or like items. Signs shall not obscure or obstruct permanent signs on \nadjacent premises. \n3. Signs shall not create a traffic hazard because of the distractive character to motorists of a sign \nor signs. \n4. For Intermittent Uses, signs placed under this subsection shall be removed on days when the \nFarmers’ Market or Special Event is not occurring. \nE. Interim Uses except for Commercial Stands shall be allowed: \n1. One wall or banner sign per use per street frontage not to exceed 32 square feet each; and \n2. One A-board or readerboard sign per use per street frontage. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 20,
      "text": " \n[A.6]-20 \nCity of Gresham Development Code \n \n(01/23) \n \n3. If more than one use occupies the same site: \na. The total number of A-board or readerboard signs per street frontage shall not exceed \nthree per 100 linear feet of frontage; and \nb. The site is allowed one additional banner or readerboard sign to act as the site sign. \nF. Interim uses that are Commercial Stands and Food Carts shall be allowed: \n1. One wall or banner sign for each side of each stand, cart or mobile unit. Each sign shall not \nexceed 50 percent of the square footage of the side of the stand or unit or a maximum of 48 \nsquare feet, whichever is smaller. If the 50 percent calculation results in less than 8 square feet \nof signage, an 8-square-foot sign is allowed. Signs that are part of the Commercial Stand or \ncart (such as vinyl wraps or signs painted on the stand or cart) are exempt from the size \nlimitations; and \n2. One readerboard or A-board sign per use per street frontage. \n3. If more than one use occupies the same site: \na. The number of readerboard and A-board signs per street frontage shall not exceed three \nper 100 linear feet of frontage; and \nb. The site is allowed one additional A-board or readerboard sign to act as the site sign. \nG. All signs shall be removed from the site within 5 days after expiration of the permit. \nH. Additional directional signage may be approved by the Manager as needed for traffic and \npedestrian safety. \nI. A-board and readerboard signs shall comply with applicable size and location standards in \nAppendix 6. If standards conflict, subsection A6.120 supersedes the other sections. A-board signs, \nfor example, shall follow size and location requirements in Sections A6.130 through A6.132. \nJ. A-board and readerboard signs shall be displayed outdoors during business hours only and shall be \nremoved from view at the end of the business day. \nK. A-board and readerboard signs shall not extend into or over the public right-of-way, clear vision \narea or active vehicular circulation areas. \nL. A-board and readerboard signs shall not be attached to fences, trees, shrubbery, utility poles or like \nitems and shall not obstruct or obscure primary signs on adjacent premises. \nM. A-board and readerboard signs shall not be illuminated. \nA-Board Signs \nA6.130  Sidewalk A-Board Signs  \nWithin the Downtown Plan District, the Rockwood Town Center District, the Station Center District, the \nCorridor Mixed-Use District, and Civic Neighborhood Plan District and the Pleasant Valley Town Center \nsub-district, the Pleasant Valley Mixed Use Employment sub-district and the Springwater Village Center \nsub-district on public sidewalks and within a multi-business complex on an internal private sidewalk, A-\nBoard signs shall be permitted subject to the following criteria: \nA. \nMay be displayed outdoors during business hours only and shall be removed at the end of the \nbusiness day. \nB. \nSign is placed within 4 feet of the main entrance to the building or individual business entry. \nC. \nSign placement shall not interfere with pedestrian or vehicular traffic nor with on-street parking \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 21,
      "text": " \n[A.6]-21 \nCity of Gresham Development Code \n \n(01/23) \n \nand shall have a minimum of 5 feet of unimpeded pedestrian sidewalk maneuvering space for \naccessibility.  It shall not extend into clear vision areas or vehicular circulation areas.  The sign \nshall not be attached to fences, trees, shrubbery, utility poles or like items and shall not obstruct or \nobscure primary signs on adjacent premises. \nD. \nSign area is limited to 12 square feet per face. \nE. \nThe applicant provides a notarized statement acceptable to the City assuming liability for a sign on \na public sidewalk. \nF. \nNo more than one per street level business is permitted. \nG. \nShall be constructed of wood, chalkboard and/or finished metal.  Lettering may be painted or \nhandwritten.  Readerboards are not permitted. \nH. \nShall be non-illuminated. \nA6.131  Residential District A-Board Signs   \nWithin the Moderate Density Residential-12, Moderate Density Residential-24, Corridor Multi-Family, and \nOffice/Residential Districts, and the LDR-PV, MDR-PV, HDR-PV, VLDR-SW, LDR-SW and THR-SW \nsub-districts, on-premise A-board signs shall be permitted subject to the following criteria. \nA. \nOne per site street frontage. \nB. \nSign area is limited to 12 square feet per face. \nC. \nMay be displayed outdoors during the hours of 8 a.m. to 8 p.m. only and shall be removed at the \nend of the business day and no later than 8 p.m. \nD. \nSign shall not extend into or over the public right-of-way, clear vision area or vehicular circulation \nareas.  If placed on an internal private sidewalk it shall have a minimum of 5 feet of unimpeded \npedestrian sidewalk maneuvering space for accessibility. \nE. \nThe sign shall not be attached to fences, trees, shrubbery, utility poles or like items and shall not \nobstruct or obscure primary signs on adjacent premises. \nF. \nShall be constructed of wood, chalkboard and/or finished metal.  Lettering may be painted or \nhandwritten.  Readerboards are not permitted. \nG. \nShall be non-illuminated. \nA6.132  Commercial/Industrial District A-Board Signs  \nWithin the Neighborhood, General, Moderate, and Community Commercial Districts, and the TC-PV, \nMUE-PV, NC-PV, NC-SW and VC-SW sub-districts, and for permitted retail sales in the General  \nIndustrial and Heavy Industrial Districts, and EC-PV, RTI-SW and IND-SW sub-districts, on-premise A-\nboard signs shall be permitted subject to the following criteria. \nA. \nOne per site street frontage. \nB. \nSign area is limited to 12 square feet per face. \nC. \nMay be displayed outdoors during business hours only and shall be removed at the end of the \nbusiness day. \nD. \nSign shall not extend into or over the public right-of-way, clear vision area or vehicular circulation \nareas.  If placed on an internal private sidewalk it shall have a minimum of 5 feet of unimpeded \npedestrian sidewalk maneuvering space for accessibility. \nE. \nThe sign shall not be attached to fences, trees, shrubbery, utility poles or like items and shall not \nobstruct or obscure primary signs on adjacent premises. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 22,
      "text": " \n[A.6]-22 \nCity of Gresham Development Code \n \n(01/23) \n \nF. \nShall be constructed of wood, chalkboard and/or finished metal.  Lettering may be painted or \nhandwritten.  Readerboards are not permitted. \nG. \nShall be non-illuminated. \nH. \nShall not be permitted in a multi-business complex except pursuant to Section A6.130. \nA6.133  Limited Duration Event A-Board Signs   \nIn Residential, Mixed Use and Plan Districts, A-board signs for limited duration events are permitted \nsubject to the following criteria. \nA. \nOne sign per site street frontage. \nB. \nSign area is limited to 12 square feet per face. \nC. \n May be displayed outdoors during the hours of 6 a.m. to 7 p.m. only and shall be displayed no \nmore than 2 consecutive days.  Examples of limited duration events are open houses and garage \nsales. \nD. \nSign shall not extend into or over the public right-of-way, clear vision area, pedestrian circulation \narea or vehicular circulation area. \nE. \nShall be constructed of wood and/or finished metal.  Lettering may be painted or handwritten.  \nReaderboards are not permitted. \n \nAbatement of Substandard and Dangerous Signs \nA6.140  Abatement of Substandard and Dangerous Signs   \nEvery sign identified by the Manager as being an abandoned and/or noncomplying sign, is substandard and \nsubject to abatement proceedings before the common council. Signs found by the Manager to be unsafe \nshall be subject to immediate civil action by the City.  \n \nMaintenance \nA6.150  Maintenance   \nAll signs, together with all of their supports, braces, guys and anchors, shall be kept in good repair and be \nmaintained in a safe, neat, clean and attractive condition, free from rust, corrosion, peeling paint or other \nsurface deterioration. Any sign structure or support that is not maintained is substandard and subject to the \nabatement procedures of Section A6.140. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.970543",
  "extractor_version": "1.0.0"
}