{
  "metadata": {
    "filename": "dc-section-7.0100.pdf_id7856",
    "extracted_at": "2025-05-22T06:15:23.058353",
    "num_pages": 52,
    "creator": "Adobe InDesign 17.2 (Windows)",
    "producer": "Adobe PDF Library 16.0.7",
    "creation_date": "D:20220615203927-07'00'",
    "modification_date": "D:20220615204355-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "Section 7.0100\nCorridor Design District\nCity of Gresham Development Code\n[7.01] - 1\n(11/20)\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "Corridor Design District\nIntroduction\nCity of Gresham Development Code\n[7.01] - 2\n(06/22)\nA. \t Applicability:\nNew developments, additions, and remodels in the Corridor Design District, as defined in \nSection 3.0100 Definitions, are subject to design review for the determination of consis­\ntency with the Guidelines and/or Standards contained in this Code. \nSections 7.0101 – 7.0103 shall apply to:\n•\t\nCommercial, industrial, and institutional uses;\n•\t\nMultifamily uses;\n•\t\nMixed-use developments;\n•\t\nResidential facilities and elderly housing;\n•\t\nPlexes: Duplexes, triplexes, and quadplexes in the Downtown Design District and \nRockwood Design District, only; and\n•\t\nThe multifamily residential component of mixed-use developments in Pleasant Valley \nand Springwater, unless superseded by the Plan District Standards.\nThese sections do not apply to: Townhouses (for these developments, see Section \n7.0430); residential home facilities; transit shelters; park-and-ride facilities; recycling \ndrop boxes; utilities and public facilities (as described in Appendix 5: Public Facilities); \nwireless communication facilities; public urban plazas and walking paths with associated \ntrail access points and trail heads; developments (such as parking lots) in public parks; \npark-related structures such as picnic shelters and public restrooms in public parks; \ncemeteries; sewerage or drainage system structures; water system structures; helicopter \nlanding facilities; and similar uses/structures as determined by the Manager.\nExisting Development: Guidelines and standards in Section 7.0103(A) shall apply as \ndetermined by the Manager or Design Commission when the standards can reason­\nably apply to existing development. For example, landscaping guidelines and standards \nmay apply when new landscaping is being added. Guidelines and standards in Section \n7.0103(B) apply to buildings that were constructed prior to November 16, 2010, as de­\ntermined by the Manager or Design Commission. For Sections 7.0103(A) and (B), site and \nbuilding modifications needed to comply with Section 8.0200 shall comply with applica­\nble guidelines and standards.\nB. \t Purpose:\nThe Corridor Design District Design Review Principles, Guidelines, and Standards help \nfacilitate attractive, innovative, high-quality, sustainable development; encourage \nmulti-modal transportation; and promote livability and public safety, thereby fostering \nquality environments and a sense of community throughout the City.\nC. \t Design Review Process:\nProjects subject to design review, as described in Article 7 Design Review, are either \nbrought before the Design Commission or administered by the Manager. For projects \nsubject to 7.0103 the Design Commission or the Manager shall make findings and \ndecisions concerning conformance with the Design Guidelines and/or Standards, based \non which review process is selected. Refer to Article 11 Procedures for review process \ndetails.\n7.0101 Introduction\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "Corridor Design District\nIntroduction\nCity of Gresham Development Code\n[7.01] - 3\n(06/22)\nD. \t How to Use this Code:\n1.\t Design Review: \nThe City has set up two alternative Design Review tracks. \n•\t\nThe Discretionary Track; and\n•\t\nThe Clear and Objective Track.\nApplicants have the choice of complying with either option. If the Clear and Objec­\ntive Track is chosen, the applicant must meet all applicable development standards. \nDeviation from any of the standards in Section 7.0103 (choosing to follow one or \nmore guidelines) means the application is using the Discretionary Track.\na.\t The Discretionary Track: \nThe Discretionary Track is intended for particularly creative proposals that might \nnot comply with all or some of the Standards in Section 7.0103. The aim is to \nencourage applicants to propose exciting, innovative designs, while still ensuring \nthe City’s design concerns and objectives for new development are met. In this \ncase, applicants shall meet the Design Guidelines. The Design Commission may \nwaive a Guideline or Guidelines to achieve the flexibility necessary to support a \nparticularly creative proposal. Approval requires that the applicant demonstrate \nto the Design Commission that the waiver from the Guideline(s) would result in \na development that better meets the applicable Design Principles and the intent \nstatement preceding the Guidelines.\nb.\t The Clear and Objective Track: \nThe Clear and Objective Track includes measurable Standards to meet the \ndesired urban form. The Standards ensure a degree of order, scale, and \nproportion within the built environment. That said, the Standards are written \nin a way to offer choices and allow for projects that are interesting and of \nsuperior design as individual buildings, while also contributing to a cohesive \nneighborhood. A decision on approval will come from the Manager or Design \nCommission. Deviation from any of the Standards will require the applicant to \nfollow the Discretionary Track.\n2.\t Layout: \nThe design Principles, Guidelines, and Standards are divided into two primary \ncategories:\na.\t Site Design: \nSite Design Guidelines and Standards address the organization and arrangement \nof a development’s components. They focus on the location and orientation \nof buildings, parking, service areas, landscaping, and site features such as \nopen space. Good site planning is of critical importance to the design of new \ndevelopment. Excellent site design can improve the aesthetics of a community, \nminimize a project’s impacts on its neighbors, improve the quality of the \nstreetscape, relate to or establish desirable development patterns, promote \nsustainability, and improve neighborhood connectivity.\nb.\t Building Design: \nBuilding Design Guidelines and Standards address the massing and exterior \narchitectural elements of buildings, including components that define the scale, \nquality, and character of a building, such as roofs, entries, windows, materials, \nand details. Excellent building design enhances the quality of life for residents \nby improving the appearance of the City, by establishing a sense of community, \nby minimizing negative environmental impacts, and by improving the long-term \neconomic value of the properties.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "Corridor Design District\nIntroduction\nCity of Gresham Development Code\n[7.01] - 4\n(06/22)\nFor each topic included in the Site Design and Building Design sections, there is \nan introductory statement describing the design intent and a list of all Design \nPrinciples that apply to that particular topic, followed by specific Guidelines and \nStandards. \nThe Intent Statement describes what the Guidelines and Standards are designed \nto achieve and sets expectations for high quality site and building design. \nThe Design Guidelines are the discretionary design parameters for development \nthat provide a statement of intent by which to evaluate the acceptability of a \nproject’s design. Design Guidelines provide the opportunity for creative design \nflexibility.\nThe Design Standards are the objective requirements for development in design \ndistricts that are based on Design Principles. Design Standards provide a clear \nand objective way of evaluating the acceptability of a project’s design.\nFor each item, either the Guideline or the Standard shall be followed. Guidelines \ncorrespond to the Standard of the same number and vice versa. For example, \nthe fifth Guideline corresponds with the fifth Standard (such that a Guideline \nnumbered ‘G5’ corresponds with the Standard ‘S5’). Sub-bullets under the Stan­\ndard do not always have a corresponding sub-bullet under the corresponding \nGuideline.\n3.\t Images: \nMost images, including photographs and illustrations, are not part of the \nDevelopment Code and do not act as Guidelines or Standards. These images are \nprovided to assist readers in envisioning the intent and potential outcomes of the \nGuidelines and Standards. Images that are not part of the Development Code are \nlabeled as figures. Images that are part of the Development Code are labeled with \nDevelopment Code section numbers.\n4.\t Code Compliance: \nDevelopments shall comply with other Code sections including, but not limited to: \n•\t\nArticle 4:  Land Use and Plan Districts; \n•\t\nArticle 5:  Overlay Districts; \n•\t\nArticle 6:  Land Divisions and Consolidations;\n•\t\nArticle 7:  Design Review; \n•\t\nArticle 8:  Special Uses;\n•\t\nArticle 9:  Common Requirements; and \n•\t\nArticle 11: Procedures.\n5.\t Exemptions: \nDevelopment within this Design District is exempted from the following sections:\na.\t 7.0310 Commercial (except those in a Design District), Institutional and Mixed \nUse Developments (Non-Residential Component); and\nb.\t 7.0210:  Transit and Pedestrian Design Criteria and Standards.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": "Corridor Design District\nDesign Principles\nCity of Gresham Development Code\n[7.01] - 5\n(11/20)\nSite Design Principles:\nA.\t Site Planning: Buildings shall be sited in a manner that fosters \ncommunity and stewardship, as well as provides a sense of \nseparation and transition between public and private spaces. \nDevelopments shall be designed to mitigate or minimize impacts \non surrounding properties, public spaces, and the environment.\nB.\t Sustainability: Development shall promote the efficient use of \nland and resources by conserving and protecting trees, water, \nand topography; reducing chemical use; increasing surface \nwater infiltration; promoting energy conservation; and other \nsustainability measures.\nC.\t Safe Design: Site and building design shall integrate Crime \nPrevention Through Environmental Design (CPTED) strategies \nas appropriate to enhance the safety, security, livability, and \ncomfort of site users and residents. \nD.\t Public Spaces: Site plans shall incorporate outdoor public spaces \nthat encourage activity, gathering, and enjoyment. These spaces \nshall foster desirability, place identity, and enhance the overall \naesthetic of the site. Multifamily development shall provide \nfunctional public, semi-public, and private open spaces for all \nresidents.\nE.\t Landscaping: Landscaping shall be utilized to create an attractive \nand sustainable built environment by enhancing building and \nsite appearance, defining pedestrian spaces, walkways, and \nstreets; breaking down the scale of parking areas; and screening \nservice and loading areas.\nF.\t Building and Site Orientation: Buildings shall be oriented \ntoward and be placed in close proximity to the street to create \na consistent street edge, to create eyes on the street, and to \nencourage interaction between pedestrians. \nG.\t Transportation Mode Provisions: Developments shall be \ncomfortable for pedestrians and shall be designed and sited to \nencourage transportation by modes such as walking, biking, and \nmass transit.\nH.\t Parking: Surface parking shall be configured in a manner that \nminimizes its visual and environmental impacts on the site and \non surrounding properties. Parking shall not dominate the site \nand the quantity of parking shall relate to actual usage and the \nneeds of site users and residents.\n7.0102 Corridor Design District Design Principles\nFig. B: Utilize sustainable design strategies\nFig. A: Design sites to foster community\nFig. D: Incorporate outdoor public spaces\nFig. E: Utilize landscaping to create attractive, \nsustainable site designs\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "Corridor Design District\nDesign Principles\nCity of Gresham Development Code\n[7.01] - 6\n(11/20)\nBuilding Design Principles:\nI.\t\nDesign Excellence and Architectural Expression: Developments \nshall create aesthetically pleasing architectural design that \nresponds to the unique physical conditions of the site and that \ncontributes to the sense of place, neighborhood, and pride in \nthe City.\nJ.\t\nProminence and Hierarchy: Buildings shall be designed in a \nmanner that enriches and gives design prominence to important \ncorners, streets, and locations in the City.\nK.\t Building Form and Articulation: Design strategies that break \ndown the scale of large buildings into smaller human-scale \nmasses shall be utilized, creating visual interest and eliminating \nblank facades.\nL.\t Building Activity and Glazing: Additional glazing shall be \nprovided at pedestrian levels to allow views into active interior \nspaces of commercial buildings, and to provide a visual \nconnection and natural surveillance for all development.\nM.\t Sustainable Architectural Design: Architectural design and best \npractices shall be incorporated that minimize energy use and life \ncycle costs, support residents’ health, and maximizes a building’s \npositive impact on the built and natural environments. \nN.\t High Quality Materials: Buildings shall utilize a combination \nof complimentary high-quality materials that are attractive, \ndurable, and context appropriate.\nFig. L: Utilize pedestrian level glazing\nFig. N. Utilize high-quality materials\nFig. K: Break down building massing\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 7\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\n7.0103 Corridor Design District Design Guidelines and Standards\nHeadings in Section 7.0103 apply to the following (except as exempted in Section 7.0101(A)):\n•\t\nAll Development: All developments, unless otherwise noted.\n•\t\nCommercial, Industrial, and Institutional: All developments that are commercial \n(including live-work units), institutional, or industrial uses; as well as commercial, \ninstitutional, or industrial uses included as components of mixed-use developments. \nHowever, parks, open spaces, and trails are not included.\n•\t\nMultifamily and Townhouse Style: Multifamily, residential components of mixed-use \nbuildings, Elderly Housing, Residential Facilities, and Townhouse Style Multifamily, \nunless otherwise specified. Duplexes, Triplexes, and Quadplexes in the Rockwood Design \nDistrict and in the DCC, DMU, and DTM sub-districts of the Downtown Plan District, \nunless noted otherwise.\n•\t\nMixed-Use Development: For mixed-use developments, guidelines and standards under \nthe Commercial, Industrial, and Institutional heading apply to those parts of the building \nand site designed for those uses, and the guidelines and standards under Multifamily \nand Townhouse Style headings apply to those parts of the building and site designed for \nthose uses. The “All Development” standards apply to the entire building and site.\n•\t\nPlexes: For duplexes, triplexes, and quadplexes in the Rockwood Design District and in \nthe DCC, DMU, and DTM subdistricts, guidelines and standards under the headings All \nDevelopment; Multifamily and Townhouse Style; and Additional Standards for Plexes and \nTownhouse Style shall apply, unless noted otherwise.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 8\n(06/22)\nDesign Guidelines\nAll Development\nG1.\t Development sites shall be integrated \ninto the surrounding neighborhoods \nand provide appropriate \ntransportation connections to these \nareas.\na.\t Connections shall be provided to \nadjacent properties to enhance \npedestrian accessibility and limit \nunnecessary auto traffic on public \nstreets.\nb.\t The 7.0103(A)(1)(S1)(b) standard \nshall be met.\nMultifamily and Townhouse Style\nG2.\t The 7.0103(A)(1)(S2) standard shall be \nmet.\nDesign Standards\nAll Development\nS1.\t Connections to surrounding properties and neighborhoods \nshall be established and include public streets, public \nbikeways, primary internal drives, and/or pedestrian paths. \na.\t Pedestrian paths shall connect to surrounding areas at \nspacing no greater than 400 feet.\nb.\t Cross access easements shall be required and shall take \neffect when adjacent properties are developed to this \nstandard. \nMultifamily and Townhouse Style\nS2.\t When, as a result of required public street dedications, \nnew parcels or blocks are created within a development \nsite, individual parcels or blocks need not meet minimum \nresidential density standards for the district, provided the \ndevelopment as a whole meets the standard.\n1.\t Integrated Site Design\nIntent:\t To design sites in a manner that creates connections to \nsurrounding properties and areas, reducing the distance \nrequired to access the site, while encouraging walking and \nalternative modes of transportation. Block structures shall \nbe used to break down the scale of the site, creating a \npedestrian-scaled environment that allows for improved infill \ndevelopment and redevelopment potential.\nKey Corridor District Design Principles:\n\t\n\t\nA.\t Site Planning\n\t\n\t\nG.\t Transportation Mode Provisions\nFig. A.1.S1:  Gresham Station utilizes public streets to break down the scale of the large parking area, adding pedestrian connections and street \ntrees and creating a more walkable environment.\nFig. A.1: A landscaped pedestrian path provides \nconnections through a development to the surrounding \nneighborhood.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 9\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards\nAll Development\nS1.\t Building frontage shall be measured by the length of the \nbuilding present between the minimum and maximum setback \n(the “setback zone”). Space attributed to public streets, \ndriveways (excluding driveways for townhouse style units and \nplexes), primary internal drives, bicycle and/or pedestrian \npaths, and clear vision areas, required as part of the \ndevelopment and within the setback area, shall be subtracted \nfrom the total length of the frontage calculations. Lots whose \nfrontage on a street includes only auto access, such as a flag \npole, are not required to meet the requirements for minimum \nbuilding on the frontage.  \na.\t At least 50 percent of the site’s frontage on any street shall \nbe occupied by buildings oriented to the abutting street. \nb.\t For multifamily buildings with a central courtyard space \nthat opens to the street, at least 60 percent of the site’s \nfrontage on any street shall be occupied by buildings and \ncentral courtyard.\n2.\t Building Frontage and Placement \nDesign Guidelines\nAll Development\nG1.\t Buildings shall be placed close to the \nstreet and shall occupy sufficient \nstreet frontage to define the street \nedge and create a pedestrian friendly \nenvironment. \na.\t Sufficient length of buildings shall \nbe present along a frontage to \nmaintain a continuous building \nstreet wall, and in general limit \nspatial gaps other than those \nnecessary to accommodate auto, \nbicycle, and pedestrian access in \norder to define the street edge. \nb.\t Buildings shall be located with the \nprimary facade or a street-facing \nopen space, such as a courtyard, \noriented to the street.\nFig. A.2:  Buildings at the street edge enhance \npedestrian spaces.\nIntent: \tTo ensure buildings are placed in locations that define \nthe street edge, creating a comfortable pedestrian scaled \nenvironment and minimizing the visual impact of parking \nfrom primary street frontages.\nKey Corridor District Design Principles:\n\t\n\t\nA.\t Site Planning\n\t\n\t\nD.\t Public Spaces\n\t\n\t\nF.\t Building and Site Orientation\n\t\n\t\nH.\t Parking\t\n50% min\nFig. A.2.S1.a Minimum street frontage for buildings without a \ncentral courtyard that opens to the street.\n60% min\nFig. A.2.S1.b: Minimum street frontage for buildings with a central \ncourtyard that opens to the street.\nMaximum Setback Line\nMaximum \nSetback \nLine\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 10\n(06/22)\nDesign Standards\nAll Development, Continued\nS2.\t Publicly accessible open spaces, meeting the requirements of \nSection 7.0103(A)(5)(S1) may be utilized to create an increased \nsetback and/or may count toward the required building \nfrontage for up to 20 percent of the required building frontage \nlength when:\na.\t Placed next to or in front of a building that is setback no \nmore than 40 feet from the right of way. When located \nbetween a building and a sidewalk, direct pedestrian \naccess shall be provided to the abutting building; and\nb.\t A building entry faces and abuts the space or is located no \nmore than 80 feet from the space, measured by walking \ndistance, in order to promote activity in the publicly \naccessible open spaces.\nS3.\t Internal public streets created as part of the development \ndo not have a building frontage requirement for the initial \ndevelopment. Subsequent building development, including \nredevelopment and intensification of the site shall comply with \nbuilding frontage requirements on the internal public streets.\nCommercial, Industrial, and Institutional\nS4.\t Auto-Dependent Uses may utilize alternative features in \nconjunction with the primary structure to count toward \nthe building frontage requirement. Canopies located within \nthe setback zone, that are associated with these uses, \nmay count toward the frontage requirement if used with a \ndecorative masonry wall a minimum of 36 inches in height. \nOther alternatives include pergolas or a landscape planter, a \nminimum of 8 feet in width with shrubs maintained at a height \nof 36 inches at maturity, to provide screening. \nMultifamily and Townhouse Style\nS5.\t Where more than one multifamily building (including plexes) \non a site faces one another, a minimum separation of 20 feet \nshall be required between front building facades, inclusive of \nsetbacks. The separation area shall include, at a minimum, a \nshared pedestrian walkway 5 to 10 feet wide and landscaping.\nFig. A.2.S4: For auto-dependent uses, alternative features such as a canopy with a \ndecorative masonry wall may count toward the frontage requirement.\nDesign Guidelines\nAll Development, Continued\nG2.\t Publicly accessible open spaces \nmay count toward building frontage \nrequirements and allow for greater \nbuilding setbacks when they are \ndeveloped for public use, located in \nhighly visible areas, and designed to \nencourage and concentrate activity.  \nThey shall be in close proximity \nto building entries and contain \npedestrian connections through the \nspace.  \nG3.\t Where a new development creates \ninternal public streets on a site, future \nbuildings on the site shall be oriented \nto the new streets.\nCommercial, Industrial, and Institutional\nG4.\t For Auto-Dependent uses, when the \nbuilding is outside the setback zone, \nthe pedestrian environment shall be \ndefined and enhanced through the \nuse of pedestrian scaled elements that \nestablish a physical edge adjacent to \nthe street.\nMultifamily and Townhouse Style\nG5.\t Provide adequate separation between \nmultifamily dwelling units, including \nplexes, to allow for pedestrian access, \nsunlight, air circulation, and semi-\npublic open spaces.\n2.\t Building Frontage and Placement, Continued\nFig. A.2.S2: Open spaces can be used to create an \nincreased building setback and may count toward the \nfrontage requirements. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 11\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\nIntent: To provide safe, comfortable, and convenient means of \npedestrian movement in developments by connecting \nbuilding entries, open spaces, streets, transit facilities, and \nparking areas.\nKey Corridor District  Design Principles:\n\t\n\t\nA.\t Site Planning\n\t\n\t\nC.\t Safe Design\t\n\t\n\t\nG.\t Transportation Mode Provisions\n\t\n\t\nH.\t Parking\t\nDesign Standards \nAll Development\nS1.\t All developments shall include a continuous on-site pedestrian \ncirculation system that provides connections between all \nadjacent streets; primary internal drives; building and dwelling \nunit entries (except service entries) including those of future \nbuildings; transit stops and facilities; auto and bicycle parking \nareas; open spaces; and other amenities on site. The system \nshall provide reasonably direct connections between all \ndestinations.\nS2.\t Walkway Construction. All walkways comprising the pedestrian \ncirculation system shall be hard surfaced, slip resistant, and \nconstructed of scored or saw-cut concrete or of decorative \npaving such as colored and stamped concrete, brick, stone, or \nconcrete pavers. Walkways shall be constructed at a consistent \nheight except where crossing auto routes and be at least 5 feet \nin width. When abutting parking stalls, walkways shall be at \nleast 7 feet wide or shall be separated from parking stalls by \nwheel stops with a minimum 2-foot overhang.  When adjacent \nto or crossing auto traffic routes, surface materials shall \ncontrast visually with adjoining surfaces.\nDesign Guidelines \nAll Development\nG1.\t Sites shall have an integrated \npedestrian circulation system that \nconnects important areas of the site \nand provides dedicated space for \nefficient pedestrian movement on site.\nG2.\t Walkway Construction. The 7.0103(A)\n(3)(S2) standard shall be met.\n3.\t Pedestrian Circulation\nFig. A.3: Pedestrian circulation route provides \nconnections on and through the site.\nFig. A.3.S2: A pedestrian circulation route which is separated from parking stalls and \nutilizes contrasting paving where crossing auto traffic routes.\nFig. A.3.S1: Pedestrian circulation route provides direct \nconnection between buildings.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 12\n(06/22)\nDesign Standards\nAll Development, Continued\nS3.\t When parking area walkways are perpendicular to drive aisles, \nthey shall be landscaped along their entire length in the form \nof planting bays or landscape strips, exclusive of areas where \nthe path crosses drive aisles. Planting bays that incorporate \nparking area walkways shall count toward the required \npercentage of parking area landscaping. With required \nwalkway widths, two minimum configurations are possible:\na.\t A 7-foot walkway and a single 6 foot landscaped area on \none side; or\nb.\t A 5-foot walkway with a 4 foot landscaped area on each \nside. \nS4.\t Addressing System. Addressing shall meet the requirements \nof the Oregon Fire Code (OFC), Gresham Revised Code (GRC), \nand the Gresham Fire and Emergency Services (GFES) Building \nIdentification and Addressing Guide. In addition, the following \nare required for all residential uses: \na.\t Individual multifamily building addresses shall be clearly \nvisible (as determined by the Fire Marshal) from the \nabutting public street right-of-way or from the abutting \ndriveway or private street; shall be at least 6 inches in \nheight; shall be of a contrasting color to the background; \nand shall be illuminated with a minimum of 1.0 foot-\ncandle so as to be visible during hours of darkness. \nBuilding addresses (including any building identification \nletters) shall be clearly visible on all sides of the buildings.\nb.\t For complexes of two or more buildings, an illuminated \nmap of the complex showing the location of the visitor \nand the unit designations within the complex shall be \npositioned at each driveway entry to the shared parking \narea. The illumination shall be a minimum of 1.0 foot-\ncandle. The directory sign(s) shall be free-standing, shall \nhave a 3-foot to 5.5-foot height, a 7 to 32 square-foot \narea, and shall be located at least 20 feet back from the \nproperty line at the street access point.\nc.\t The numbering of the parking spaces shall not directly \ncorrespond to the unit numbers, for safety purposes.\nDesign Guidelines \nAll Development, Continued\nG3.\t Parking area walkways shall provide \nadditional buffering when between \nadjacent parking stalls. When crossing \ndrive aisles, walkways shall utilize \nstrategies which minimize crossing \ndistances and slow traffic in order to \nprovide safe passage for pedestrians.\nG4.\t Addressing System. The 7.0103(A)(3)\n(S4) standard shall be met.\n3.\t Pedestrian Circulation, Continued\nFig. A.3.S4: Building address is illuminated and clearly \nvisible.\nFig. A.3.S3:  Landscaped parking area walkway perpendicular to drive aisles.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 13\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\n3.\t Pedestrian Circulation, Continued\nDesign Standards\nCommercial, Industrial, and Institutional\nS5.\t Parking area walkways shall be created perpendicular to the \ndrive aisles when the following conditions occur:\na.\t Parking areas contain more than 100 spaces; \nb.\t The parking area includes a depth of three or more parking \nmodules from the abutting building; and\nc.\t Commercial, industrial, or institutional tenant spaces or \nother uses on site exist in locations parallel to the parking \ndrive aisle.\nMultifamily and Townhouse Style\nS6.\t The on-site pedestrian circulation system shall be continuous \nand connect the following: streets abutting the site; ground \nlevel entrances to individual units; common building \nentrances; common buildings such as laundry and recreation \nfacilities; parking areas; shared open spaces; children’s play \nareas; abutting transit facility; bicycle parking; storage areas; \nand any pedestrian amenities such as plazas, resting areas, \nand viewpoints. A walkway connection shall be provided to an \nabutting street frontage an average of every 200 linear feet of \nstreet frontage.\nDesign Guidelines \nCommercial, Industrial, and Institutional\nG5.\t In large parking lots, walkways that \nare perpendicular to drive aisles shall \nbe present when necessary to access \nbuildings served by the parking area. \nMultifamily and Townhouse Style\nG6.\t Multifamily developments shall have \nan integrated pedestrian circulation \nsystem which connects building and \nunit entries to site amenities and \nabutting rights-of-way at spacing that \nallows for ease of pedestrian access \nthrough and around the site.\nFig. A.3.S6: Pedestrian circulation route provides connection between units, streets, \nand shared amenities.\nFig. A.3.S5: Site diagram illustrating a parking area \nwalkway perpendicular to the parking drive aisles. The \nwalkway is present when the parking area includes at \nleast three parking modules parallel to the building.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 14\n(06/22)\nIntent:\t Parking areas shall be designed to minimize and mitigate their \nnegative visual and environmental impacts.\nKey Corridor District Design Principles:\n\t\n\t\nA.\t Site Planning\t\n\t\n\t\nE.\t Landscaping\n\t\n\t\nG.\t Transportation Mode Provisions\n\t\n\t\nH.\t Parking\n\t\n\t\nN.\t High Quality Materials\t\n4.\t Parking, Loading, and Service Areas\nDesign Guidelines \nAll Development\nG1.\t Auto parking, loading, service, and \ncirculation areas shall be located and \nconfigured to minimize their visual \nimpact from abutting street frontages.\na.\t Auto parking shall be set back \nfrom the street and shall include \na landscaped buffer to minimize \nits visual impact and to create a \npedestrian-friendly street edge. \nAuto parking shall not be located \nat highly visible locations of a site, \nsuch as at a street corner.\nb.\t In order to minimize the size of \noff-street auto parking areas, \nprovide convenient short-\nterm, on-street parking (where \nallowed by street type) in front \nof commercial, industrial, and \ninstitutional developments.\nDesign Standards \nAll Development\nS1.\t Except for individual driveways for plexes and townhouse style \nunits, on-site auto surface parking areas, garages, and auto \ncirculation areas shall not be located between a building and \nan abutting street right-of-way. Auto parking and circulation \nareas shall be located to the side, interior, rear, on top of, or \nbeneath buildings.\na.\t Auto parking areas shall be behind the maximum setback \nor behind a line drawn parallel to the street at the point \nwhere the building is closest to the street, whichever \nis closest to the street. In no circumstances shall the \nparking area be closer than 8 feet to the right-of-way, to \naccommodate perimeter screening as required per Section \n9.0823(C). For sites with multiple frontages, auto parking \nareas shall be no closer than 8 feet to the right-of-way \non secondary or rear frontages, regardless of building \nlocation. \nb.\t For Commercial, Institutional, and Industrial uses, auto \nparking along new public streets (on-street parking), \ncreated as part of the development, may count toward the \nminimum parking requirement.\nArterial\nArterial\nFig. A.4.S1: Parking is located to the rear of street facing buildings. \nFig. A.4: Parking area is located behind multifamily \nbuildings and accessed from a secondary frontage.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 15\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards \nAll Development, Continued\nS2.\t Where more than 100 surface auto parking spaces are \nprovided on-site in a centralized parking area, auto parking \nshall be divided into areas of 100 or fewer spaces by one of \nthe following methods:\na.\t Pedestrian path(s) with landscaping connecting through \nthe parking area to surrounding uses and public rights-of-\nway; and/or\nb.\t A system of internal public streets or primary internal \ndrives; and/or\nc.\t Major landscape divisions consisting of a 24-foot wide \nlandscaped area planted with trees, shrubs and ground \ncover. This area may be designed to allow for stormwater \ninfiltration and pedestrian walking path(s).\nS3.\t When sites utilize primary internal drives, the following \nstandards shall apply: \nPrimary internal drives shall consist of a 24-foot two-way drive \naisle; a sidewalk no less than 6 feet in width and an amenity \nzone no less than 6 feet in width shall be provided on each \nside of the drive. \na.\t Drive aisles shall be a minimum width of 26 feet to \naccommodate emergency vehicles, or as determined by \nthe Fire Marshal.\nb.\t Where primary internal drives are not adjacent to \nbuildings, the amenity zone and sidewalk may each be \nreduced to 5 feet in width if space limitations prohibit \nwider dimensions.\nc.\t When a primary internal drive abuts a side or rear \nproperty line, and does not abut a public right of way, the \nrequirement for a sidewalk on the primary internal drive \nmay be eliminated.\nd.\t Shade (canopy) trees shall be planted on primary internal \ndrives in the amenity zone at an average tree spacing of 30 \nfeet. The amenity zone shall allow stormwater infiltration \nat a minimum of 6 feet from the base of a tree, extending \noutward, through techniques such as permeable paving, \ntree grates, or landscaped areas. Structural soil, Silva Cells \nor root channels shall be provided in the infiltration area \nof the amenity zone when paved. All trees planted on the \nprimary internal drives shall be selected from the City of \nGresham Approved Street Trees list.\ne.\t Lighting shall be provided along primary internal drives \nand shall not exceed 25 feet in height. Illumination levels \nare specified in Section 7.0103(A)(7).\n           Continued on following page\nDesign Guidelines \nAll Development, Continued\nG2.\t Where large surface parking areas \nare provided, they shall be divided \ninto smaller parking areas that allow \nfor safe and convenient movement \nthrough and around the parking lot. \nPedestrian paths, internal public \nstreets, primary internal drives, major \nlandscape divisions, or alternative \nstrategies as approved by the Manager \nor Design Commission may be used to \nbreak down the scale of the parking \nlot.\nG3.\t Primary Internal Drives shall replicate \nthe character of a public street, \ncreating a pedestrian-oriented \nenvironment and accommodating \npedestrians, auto traffic, and \nparking.  Primary internal drives shall \nincorporate amenities appropriate for \ncity streets, including sidewalks, street \ntrees, landscaping, pedestrian-level \nlighting, and other features.\n4.\t Parking, Loading, and Service Areas, Continued\nFig. A.4.S3: Cascade Station, Portland, OR, utilizes \nprimary internal drives on a regular grid to divide the \nparking area and provide opportunities for landscaping.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 16\n(06/22)\nDesign Standards\nAll Development, Continued\nS3. Continued\nf.\t\nWhen primary internal drives include auto parking:\ni.\t\nThe amenity zone shall allow frequent connections \nbetween parking stalls and the sidewalk. At least one \npaved connection shall be provided between street \ntrees. Paving shall match or accent the sidewalk by: \nusing concrete; using paving which allows stormwater \ninfiltration; or using pavers as approved by the \nManager or Design Commission.\nii.\t Bump outs that extend the depth of the parking stall \nshall be provided to lessen crossing distances where \npedestrian routes cross primary internal drives, \nsuch as at intersections and at mid-block crossings.  \nLandscaped areas that do not interfere with clear \nvision requirements and stormwater infiltration \nareas may be included in areas of the bump outs not \nrequired for pedestrian use.\ng.\t Crosswalks shall be provided on primary internal drives \nwhere pedestrian circulation routes cross drive aisles. \nCrosswalks shall receive enhanced paving that creates a \nvisual distinction between the crosswalk and the adjoining \nsurfaces, such as scored concrete, colored and stamped \nconcrete, brick, stone, or concrete pavers. Striping shall \nnot be an acceptable method of creating visual distinction.\nh.\t The site’s primary auto entry shall utilize a minimum of \none gateway feature to establish prominence. Gateway \nfeatures may include: \ni.\t\nA landscaped median; \nii.\t Decorative masonry piers; \niii.\t Public art pieces;\niv.\t Raised planters with seating walls;\nv.\t Pedestrian-oriented decorative way finding signage; \nand/or\nvi.\t Other features approved by the Manager or Design \nCommission.\nDesign Guidelines \nAll Development, Continued\n4.\t Parking, Loading, and Service Areas, Continued\nTrees at 30 \nfoot spacing\nEnhanced \nsoil \nconditions \nwithin 6 feet \nof trees\nBump outs \nat pedestrian \ncrossings\nLighting \nfixtures \nat regular \nspacing\nFig. A.4.S3.f:  Plan view of primary internal drive \nshowing optional angle parking.\nFig. A.4.S4.a-1: Loading area at the rear of the building, visually screened by a wall \nmatching the building architecture and by landscaping at the property line.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 17,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 17\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards \nAll Development, Continued\nS4.\t When dedicated loading facilities are required, loading areas \nshall be located at the rear of the building. If loading areas \ncannot be located on the rear of the building, they may be \nplaced along the side of the building and recessed from the \nfront facade a distance which prevents service vehicles from \nextending onto adjacent walkways. Required loading area \ndimensions can be found in Section 9.0840.\na.\t Dedicated loading facilities, such as loading docks, shall \nbe screened parallel to the building wall with liner spaces \nor walls integrated into the building and no less than 14 \nfeet in height. The liner spaces or walls shall fully conceal \nservice vehicles except at the entry in order to allow for \nsafe movement while exiting. Liner spaces and screening \nwalls shall be designed consistently with the remainder of \nthe building and design standards in Section 7.0103(B).\nS5.\t Solid Waste and Recycling Collection Area. In addition to \nrequirements stated in Section 7.0212 Solid Waste and \nRecycling Collection Area, the collection area shall be entirely \nscreened and enclosed by a fence or wall of at least 6 feet \nin height, designed using cladding materials and detailing, \nincluding colors and patterns, consistent with the primary \nbuilding(s).\nS6.\t In Mixed-Use developments, garage entries are prohibited on \na primary facade facing the street that includes ground floor \ncommercial use(s). This standard is not applicable when a site \nhas only one street frontage and no alley access. \nMultifamily and Townhouse Style\nS7.\t Parking areas located to the side of the building shall be \nlimited to 50 percent of the site’s street frontage.\nDesign Guidelines \nAll Development, Continued\nG4.\t Loading facilities and other service \nareas shall be located away from \npublic view and public areas of the site \nto the greatest degree possible and \nshall minimize visual, acoustic, and \nlighting impacts on surrounding areas.\na.\t Walls or liner spaces shall be \npresent at dedicated loading \nfacilities and shall be of sufficient \nscale to fully conceal and minimize \nnoise from service vehicles. \nScreening walls shall be visually \nconsistent with the building. \nG5.\t Solid waste collection areas shall \nbe designed and constructed as \npermanent elements of the site, \nutilizing high quality materials \nand a design that is consistent or \ncomplimentary to surrounding \nbuildings.\nG6.\t Garage Entries in Mixed-use \nDevelopments. The 7.0103(A)(4)(S6) \nstandard shall be met.\nMultifamily and Townhouse Style\nG7.\t Parking, loading service, and auto \ncirculation areas shall be integrated \ninto the site design in a manner that \ndoes not detract from the design of \nthe building, the street frontage, or \nthe site.\n4.\t Parking, Loading, and Service Areas, Continued\nFig. A.4.S4.a-2:  Service and loading area located \nat rear of building and screened by walls and conifer \ntrees.\nFig. A.4.S5: Collection areas enclosed with walls using high quality building \nmaterials.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 18,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 18\n(06/22)\n4.\t Parking, Loading, and Service Areas, Continued\nDesign Standards \nMultifamily and Townhouse Style, continued\nS8.\t Storage facilities shall be provided for articles used outdoors \nsuch as barbecues, outdoor furniture, etc. The storage \nfacility shall be a minimum 6 feet high and 24 square feet \nin area. The facility shall either be connected to each unit \nin a logical fashion as part of the building design or shall be \neasily accessible (such as in a central facility or garage) and \ncapable of being locked. (Except for retirement housing as \ndefined in Section 3.0100, elderly housing and assisted living \ndevelopments need not comply with this standard.)\nS9.\t Garage doors shall match the main building in terms of color, \nmaterials, and trim.\nS10.\tDetached garages or carports shall utilize the same \narchitectural style and/or building materials that are used for \nthe primary structure(s).\nAdditional Standards for Plexes and Townhouse Style\nS11.\tGarage Openings.\na.\t Attached garages on facades that also include a unit's \nprimary entry shall have a maximum opening width of 50 \npercent of the unit width.\nb.\t Attached garages shall be located at least 4 feet behind the \nfront facade (the facade with the primary entry).\nDesign Guidelines \nMultifamily and Townhouse Style, \ncontinued\nG8.\t Storage for articles used outdoors \nshall be provided in a manner \nappropriate for the size, quantity, and \ncharacteristics of the individual units \nas well as the design of the overall \ndevelopment.\nG9.\t Garage doors shall be integrated into \nthe design of the larger facade in \nterms of color, scale, materials, and \nbuilding style.\nG10.\tDetached garages and carport \nstructures shall complement, and not \ndetract from, the appearance of the \nprimary structure(s).\nAdditional Guidelines for Plexes and \nTownhouse Style\nG11.\tGarage Openings. The impact \nof garages on the pedestrian \nenvironment and visual composition \nof buildings shall be minimized.\nFig. A.4.S11: Garage opening widths are less than 50 \npercent of the facade width of the unit they serve.\nFig. A.4.S10: Detached garages utilize a similar architectural style and appearance \nto the primary structure.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 19,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 19\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\n5.\t Open Spaces\nIntent:  To create active public, semi-public, and private spaces that are \nfunctional, fully accessible, visually pleasing and comfortable, \nthereby enhancing the resident and visitor experience.\nKey Corridor District Design Principles:\n\t\n\t\nA.\t Site Planning\n\t\n\t\nB. \t Sustainability\n\t\n\t\nC.\t Safe Design\t\n\t\n\t\nD.\t Public Spaces\n\t\n\t\nE.\t Landscaping\n\t\nDesign Guidelines\nAll Development\nG1.\t Publicly accessible open space may \ninclude a variety of public space \ntypologies, both hardscaped and \nlandscaped, such as on-site plazas, \ninterior courtyards, patios, terraces, \nand gardens. Public spaces shall \nincorporate features that advance \nsustainable principles and shall include \nfocal points such as an art sculpture, \nwater feature, pavilion, seating area, \nspecimen plants, unique paving, or \nunusual lighting. When possible, \ntheses spaces shall take advantage \nof and preserve any natural features \non the site and shall be designed to \naccentuate view corridors.\nDesign Standards\nAll Development\nS1.\t Publicly accessible open space may be utilized to create \nan increased setback and/or may count toward the \nrequired building frontage, per Section 7.0103(A)(2). When \nincorporated into a development, publicly accessible open \nspaces shall incorporate the following:\na.\t At least 30 percent of the area shall be planted with trees, \nshrubs, groundcover, and perennial landscape plantings.\nb.\t At least 30 percent of the area shall be hardscaped with \ndecorative paving that meets accessibility standards.\nc.\t At least one bench or seating unit for each 200 square feet \nof area (seating may be grouped into benches or ledges).\nd.\t Pedestrian-scaled lighting fixtures no taller than 18 feet.\ne.\t At least one element with sustainability attributes, such \nas, but not limited to: rain gardens; a green wall; solar \npowered lights or equipment; pervious paving; or benches \nmade from recycled materials.\nf.\t\nArtistic design elements such as decorative paving \npatterns, ornamental art features, creative lighting \nelements, etc.\nFig. A.5.S1: Publicly accessible open space in front of the building includes \npedestrian friendly and sustainable elements.\nFig. A.5: A centrally located open space with children's \nplay area.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 20,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 20\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG2.\t The dimensions of outdoor spaces \nshall be sufficient to encourage and \nsupport usage and activity. They shall \nbe proportioned and designed to be \ncomfortable for human activity and \nsocial interaction – standing, sitting, \nand talking.\nMultifamily and Townhouse Style\nG3.\t Shared Open Space. Sufficient open \nspace shall be provided for the \npurpose of outdoor recreation, scenic \namenity, or shared exterior space for \npeople to gather.\nG4.\t Outdoor Private Space. Developments \nshall include functional open space for \nresidents that allows for passive and/\nor active recreation. Alternatively, all \nor a portion of the required square \nfootage of outdoor private space may \nbe added and incorporated into the \nrequired shared open space.\nDesign Standards\nAll Development, Continued\nS2.\t Publicly accessible open spaces shall have minimum \ndimensions of 30 feet by 20 feet.\nMultifamily and Townhouse Style\nS3.\t Shared Open Space.\na.\t Shared open space shall be provided for developments \ncontaining four or more units. \ni.\t\nFor sites 20,000 square feet and greater in gross site \narea a minimum of 4 percent of the gross site area, \nbut not less than 1,000 square feet, shall be shared \nopen space.\nii.\t For sites less than 20,000 square feet in gross site \narea, a minimum of 4 percent of the gross site area, \nbut not less than 500 square feet, shall be shared open \nspace.\nb.\t A shared open space may be any of the following: \nrecreational facilities such as tennis, racquetball and \nbasketball courts; recreation building (not including office \nspace); swimming pools and spas; gathering spaces such as \ncourtyards, gazebos, picnic, and barbecue areas; gardens; \npreserved natural areas; lawns; dual use areas (such \nas a basketball court that doubles as a loading space); \nchildren’s play areas; and other recreational facilities as \napproved by the Manager or Design Commission.\nc.\t The minimum dimensions for any shared open space shall \nbe 20 feet in length and width.\nd.\t The shared open space may not be within any buffer \nor yard setback area unless the open space includes \npreserved natural areas.\nS4.\t Outdoor Private Space. Attached and directly accessible \noutdoor private space of no less than 80 square feet in \narea shall be provided for all dwelling units. The minimum \ndimension(s) of the outdoor private space shall be 6 feet in \neach direction (balconies that do not meet the dimensional \nrequirements, such as Juliet balconies, are allowed but do not \ncount toward the minimum private space standard). The area \nshall be designed to provide privacy for unit residents with \nelements such as walls, railings, fences, or shrubs. (Elderly \nhousing developments that are assisted living developments \nneed not comply with this requirement. “Retirement housing” \nshall comply with this requirement.) All or a portion of the \nrequired square footage of outdoor private spaces may \nbe added and incorporated into the required shared open \nspace as long as the total outdoor areas provided meet the \ncombined minimum size requirements.\n Continued on following page\n5.\t Open Spaces, Continued\nFig. A.5.S3. A well-maintained courtyard shared open \nspace at the center of a multifamily development.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 21,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 21\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards\nMultifamily and Townhouse Style, Continued\nS4. Continued\na.\t Ground level dwelling units. Required outdoor private \nspace may be located at the primary entrance for ground \nlevel units. Where this is the case, the outdoor private \nspace shall not be screened.\nb.\t Dwelling units above ground level. The outdoor private \nspace shall be screened or otherwise designed to provide \nprivacy from adjacent units.\nS5.\t Common areas and streets shall be visible from 50 percent of \nthe units that face them. Common areas include, but are not \nlimited to, shared and publicly accessible open spaces; laundry \nand recreation buildings; pools and similar common facilities; \nchildren’s play areas; walkways; and parking areas. A unit \nmeets this criterion when at least one window of a frequently \nused room, such as a kitchen, living room, or dining room, but \nnot a bedroom or bathroom, faces the common area.\nS6.\t Children’s Play Area. A minimum of 50 percent of the \nminimum required shared open space (per Section 7.0103 (A)\n(5)(S3)) shall be a children’s play area. (Developments with less \nthan four units and Elderly Housing need not comply with the \nchildren’s play area requirement but shall provide the specified \nshared open space in Section 7.0103(A)(5)(S3) above). \na.\t For sites 20,000 square feet and greater in gross site area, \nthe minimum dimensions for any children’s play area shall \nbe 20 feet in length and width, and be a minimum of 500 \nsquare feet in size. \nb.\t For sites less than 20,000 square feet in gross site area, \nthe minimum dimensions for any children’s play area shall \nbe 12 feet in length and width, and be a minimum of 250 \nsquare feet in size.\nc.\t The children’s play area shall have a minimum of 3 types \nof play equipment such as slides, swings, towers, jungle \ngyms, and other natural play elements (such as boulders, \nlogs, and grass mounds), or other equipment as approved \nby the Manager or Design Commission. A Landscape \nArchitect or a playground recreation expert shall design \nthe children’s play area, including selection of the play \nequipment to ensure that the equipment is compatible, \nfun, and promotes some form of exercise or movement.\nd.\t The children’s play area shall be centrally located and shall \nbe outside of the required building setbacks and buffer \nareas.\ne.\t The children’s play area shall be enclosed by one or a \ncombination of any of the following: a 2.5 feet to 3 feet \nhigh wall, planter, decorative fence; or by 18 inch high \nbenches or seats. \nDesign Guidelines\nMultifamily and Townhouse Style, \nContinued\nG5.\t Communal gathering areas shall be \nin a central location that provides for \ncommunity surveillance and access \ncontrol.\nG6.\t Children’s Play Area. Children’s play \nareas shall be designed to promote \nsafety, creative play, and exercise and \nshall be adequate for the number of \nunits in the development.\n5.\t Open Spaces, Continued\nFig. A.5.S4: Outdoor private space is provided in the \nform of balconies attached to each unit.\nFig. A.5.S6.d and e: Children's play area is centrally \nlocated and enclosed with a wood fence.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 22,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 22\n(06/22)\n6.\t Landscaping\nIntent:\t To integrate landscaping into open spaces, auto parking \nareas, and general site design to contribute to an attractive \nand sustainable development that respects and enhances the \nnatural and urban environment.\nKey Corridor District Design Principles:\n\t\n\t\nA. \t Site Planning\n\t\n\t\nB.\t Sustainability\t\n\t\n\t\nE.\t Landscaping\n\t\n\t\nH.\t Parking\n\t\n\t\nDesign Guidelines\nAll Development\nG1.\t Licensed Design Professional. The \nlandscape plan shall be created by a \nlicensed design professional such as a \nLandscape Architect, Architect, or Civil \nEngineer. \nG2.\t Site Landscape Trees. The landscape \nplan shall provide sufficient \nvegetation, including trees on the \ninterior of the site, to create an \nattractive site.\na.\t Landscaping that offers variety \nin scale, color, and interest shall \nbe provided using canopy trees, \nshrubs, perennials, ornamental \ngrasses, groundcovers, and \nannuals. Ornamental trees and \nother similar species may be \npermitted where larger sized trees \nare not appropriate.\nb.\t Where feasible, existing, healthy \ntrees shall be retained and \nincorporated into landscape plans. \nLandscaping requirements may \nbe adjusted to accommodate the \nretention of existing trees.\nc.\t Trees shall be secured upon \ninstallation to avoid toppling and \ndamage from strong winds.\nDesign Standards\nAll Development\nS1.\t Licensed Design Professional. A professional licensed \nLandscape Architect shall complete and stamp the landscape \nplan for the development.\nS2.\t Site Landscape Trees. Site trees are required at a rate of 1 tree \nper 3,000 square feet of gross site area. Buffer, setback, drive, \nand parking lot tree requirements may count toward the site \ntree requirement. See also Section 9.1000.\na.\t Site trees must be capable of a height of 25 feet. \nb.\t Existing regulated major trees may be counted as two \nrequired site trees. Existing trees to be counted toward \nthis requirement must be confirmed to be healthy as \ndetermined by a consulting arborist, a qualified arborist, \nor a registered consulting arborist.\nc.\t New trees shall be supported by use of stakes, wire, or \nsimilar material for at least one year to prevent damage by \nstrong winds.\nFig. A.6: A mixture of canopy trees, shrubs, perennials, \nornamental grasses, and ground cover contribute to \ncreation of an attractive and sustainable development.\nFig. A.6.S2: Site trees are provided along the front yard setback, supported by \nstakes at time of planting.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 23,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 23\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards\nAll Development, Continued\nS3.\t Plant Sizes. All landscaping shall be planted at sizes no less \nthan the following (measurements shall be taken based on the \nAmerican Standard for Nursery Stock ANSI standards):\na.\t Deciduous canopy trees shall be a minimum of 2.5 inches \ncaliper size and shall be balled and burlapped or container \nstock;\nb.\t Deciduous ornamental trees shall be a minimum of 2.0 \ninches caliper size and shall be balled and burlapped or \ncontainer stock;\nc.\t Evergreen trees shall be a minimum of 6 feet in height and \nshall be balled and burlapped or container stock;\nd.\t Evergreen and deciduous shrubs, with the exception of \ndwarf shrubs such as boxwood, must be a minimum of 24 \ninches high from finished grade and a minimum of 1 gallon \nsize at planting;\ne.\t Ferns shall be a minimum of 16 inches high from finished \ngrade and 1 gallon in size;\nf.\t\nPerennials shall be a minimum of 1 gallon size; and\ng.\t Ground covers shall be well rooted in either flats or a \nminimum of 1 gallon pots.\nDesign Guidelines\nAll Development, Continued\nG3.\t Plant Sizes. The landscape plan shall \nbe designed to provide a mature \nappearance at installation.\n6.\t Landscaping, Continued\nFig. A.6.S3: Internal landscaping provides trees and other vegetation sized to create \nan attractive, mature site.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 24,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 24\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG4.\t Parking Area Landscaping. Auto \nparking areas shall include landscaping \nof sufficient quantity and size in order \nto minimize the visual impact of the \nparking area, provide opportunities for \nstormwater management, and provide \nshading of hardscape areas (reducing \nthe heat island effect of the area).\nG5.\t Parking Area Perimeter Screen \nLandscaping. Parking areas shall be \nbuffered from streets and primary \ninternal drives with landscaping that \nprovides definition to pedestrian areas \nand screens parking. The dimension of \nthe parking lot landscape buffer shall \nbe adequate to screen the parking \nand mitigate its visual impact from \nthe street. Perimeter screening shall \nbe layered to provide visual interest, \ndefinition of pedestrian areas, and \nscreening at various heights.\nDesign Standards\nAll Development, Continued\nS4.\t The minimum percentage of auto parking area landscaping \nshall be 15 percent.\na.\t Landscaped areas counting toward this requirement shall \ninclude parking area perimeter buffers, planting bays or \nlandscape strips, major landscape divisions, landscaping \non internal public streets or primary internal drives and all \nother landscaped areas that are located within 10 feet of \nparking modules or stalls. \nb.\t A minimum of 70 percent of all landscaped area shall be \ncovered with trees, shrubs, and continuous ground cover \n(lawn, low evergreen shrubs, or evergreen ground cover). \nLandscaped areas which include stormwater infiltration \nareas shall utilize appropriate plant materials.\nc.\t All parking area landscaping shall be designed to ensure \nautos do not make contact with plant materials, utilizing \noverhang distances no less than 2 feet when abutting \nshrubs or 3 feet when abutting trees. Wheel stops may be \nused in place of overhang distances.\nS5.\t Parking Area Perimeter Screen Landscaping. When located \nadjacent to a public street or primary internal drive, the auto \nparking area shall be buffered by a landscaped edge no less \nthan 8 feet in width consisting of trees, shrubs, decorative \nfencing or walls, and ground level plantings in a layered \nconfiguration (Fig. A.6.S5.a). This buffer screening shall \nbe located adjacent to the sidewalk of the public street or \nprimary internal drive. Decorative fencing or walls may be \nincluded in place of required shrubs in the landscape buffer. \nWhen adjacent to driveways and/or intersections, perimeter \nscreening shall be subject to the standards for clear vision \nareas.\n6.\t Landscaping, Continued\nFig. A.6.S5-2: Potential design of parking area perimeter screening landscaping, with \nground level plantings, trees, shrubs and a low wall.\nFig. A.6.S5-1: Parking lot perimeter screening using a \nmasonry wall with layered landscaping.\nMinimum 8 feet\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 25,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 25\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG6.\t Developments shall utilize strategies \nthat reduce water and energy usage \nattributed to site development \nand use, and the transportation \nof site users, while not detracting \nfrom good site and building design. \nHealthy and sustainable communities \nshall be created that incorporate \n“best practices” such as LEED™ for \nNeighborhood Development to \nconserve natural resources, reduce \ncarbon emissions, and promote \ninteraction between site users.\nG7.\t Drought resistant landscaping shall \nbe incorporated into the landscape \ndesign in a manner that contributes \nto a reduction in the irrigation water \nneeded.\nG8.\t Irrigation. Plants shall be properly \nwatered to ensure their viability.\nG9.\t Landscape and stormwater practices \nand strategies that reduce water use \nshall be included in all developments.\nDesign Standards\nAll Development, Continued\nS6.\t Energy conservation and sustainability in site development \nshall be promoted through a minimum of two of the following:\na.\t Preserve a minimum of 50 percent of existing regulated \n(greater than or equal to 8 inch diameter at breast height \n(DBH)) trees on site. Preserved trees must be healthy as \ndetermined by a consulting arborist.\nb.\t At least 20 percent of trees, 20 percent of shrubs, and 20 \npercent of groundcover plants shall be food-producing \nperennial species, such as named varietals of cherries, \napples, hazelnuts, blueberries, strawberries, etc. \nParking lot and street trees shall be selected from the \nRecommended Parking Lot and Street Tree lists.\nc.\t Site furnishings such as play structures, fences, gazebos, \ntrash receptacles, benches, and tables shall be constructed \nwith 20 percent sustainably harvested materials, such as \nForestry Stewardship Council (FSC)-certified wood and/or \nrecycled content materials, excluding plastics. The intent \nof this standard can also be achieved through the use of \nlocally sourced materials, originating within 500 miles of \nthe site. \nd.\t Provide a minimum of 20 percent recycled content \npavement or pavement base, such as concrete grindings \nfor base materials or blast furnace slag additives, or \nasphalt with glass for hardscape elements such as streets, \nsidewalks, paths, parking areas, and courtyards. \nS7.\t A minimum of 20 percent of landscape plantings shall be a \ndrought-resistance species.\nS8.\t All landscaped areas shall be irrigated by an underground \nsystem. \nS9.\t Water conservation and treatment shall be promoted through \na minimum of two of the following:\na.\t The irrigation system shall minimize water usage by \nincorporating a rain sensor to prevent watering during a \nrain event.\nb.\t The irrigation system shall minimize water usage by \nincorporating a drip irrigation system.\nc.\t On-site rain gardens and stormwater facilities shall \nbe incorporated and designed in accordance with \nGresham Green Development Practices for Stormwater \nManagement.\nd.\t Rainwater shall be used in public spaces to activate the \nspace via art elements, water features, etc. \n6.\t Landscaping, Continued\nFig. A.6.S6: Many species of creeping raspberries \ncreate dense groundcover and are drought resistant \nand shade tolerant.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 26,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 26\n(06/22)\nDesign Standards\nAll Development, Continued\nS10.\tAfter 5 years from occupancy, a minimum of 30 percent of \non-site hardscape area shall be shaded. Determination shall be \nbased upon expected growth of the selected trees and shall be \ncalculated at noon on the summer solstice. Hardscape shading \nfrom buildings and structures such as carports or pergolas may \nbe counted toward the total shading requirement.\nS11.\tLandscape Maintenance. Compliance with the following \ncriteria is required:\na.\t Inspections. A City representative will perform a final \nlandscape inspection to ensure that the landscape \ndemonstrates equivalent compliance with the approved \nlandscape plan upon completion of the project and before \nissuance of a Temporary or Final Certificate of Occupancy \nfollowing a request from the developer. \n\nThe inspection time period is from March 1 to November \n15. If an inspection is requested between November \n16 and the last day of February and the landscaping is \nnot complete, or if the applicant requests a Temporary \nCertificate of Occupancy to occupy one or more buildings \non site prior to the landscaping being completed, a \nfinancial guarantee is to be provided based on 110 percent \nof the estimated cost of plant materials and labor for \nthe total landscape plan as indicated in a landscape cost \nestimate. Beginning March 1, the Applicant has 180 days \nto complete the items or the City will cash in the amount \nbeing held and finish the landscape job.\nb.\t Establishment Period. The establishment period for the \nplant material guarantee will begin at the Final Certificate \nof Occupancy inspection approval to 2 years from that \ndate. All plantings shall be properly planted as to be in \na healthy, growing condition at commencement of the \nestablishment period. At the end of the establishment \nperiod, any plantings which are 20 percent dead or greater \nshall be replaced.\nc.\t Maintenance.\ni.\t\nMaintenance of required plantings by the owner shall \nbe carried out so as to present a healthy, neat, and \norderly appearance, free from refuse and debris.\n\t\n   Continued on following page\nDesign Guidelines\nAll Development, Continued\nG10.\tHardscapes shall be shaded as a \nmeans of reducing energy costs (heat \nisland effect), improving stormwater \nmanagement, and improving the \noverall aesthetic quality of the built \nenvironment.\nG11.\tLandscape Maintenance. The \n7.0103(A)(6)(S11) standard shall be \nmet.\n6.\t Landscaping, Continued\nFig. A.6.S10: Large canopy trees contribute to shading \nof hardscape areas on site.\nFig. A.6.S11.c.i-1: Well maintained landscape areas \npresent a healthy, orderly appearance, free from refuse  \nand debris.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 27,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 27\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nAll Development, Continued\nCommercial, Industrial, and Institutional\nG12.\tSite Landscaping. The 7.0103(A)(6)\n(S12) standard shall be met.\nDesign Standards\nAll Development, Continued\nS11. Continued\nii.\t To ensure proper maintenance and as a condition \nof Final Site Plan approval, the property owner shall \nenter into and record with the City a Landscape \nMaintenance Agreement, or include such provisions \nas part of a condominium master deed, each of \nwhich shall be approved by the City Attorney. \nSuch instrument shall identify the minimum plan \nof maintenance, the person or entity responsible \nfor maintenance, and shall provide the procedure, \nauthority, and finance for City cure of breaches by the \nresponsible entity. Such instrument shall also include: \nprovisions that all unhealthy and dead material shall \nbe replaced within 1 year, or the next appropriate \nplanting period, whichever occurs first; all landscaped \nareas shall be provided with an operable irrigation \nsystem; tree stakes, guy wires and tree wrap are to \nbe removed after 1 winter season; and plantings shall \nbe guaranteed for 2 years after the Final Certificate of \nOccupancy inspection approval.\nd.\t Responsibility and Certificates of Occupancy. The owner \nof the property subject to the requirements of this \nSection shall be responsible for installing and maintaining \nlandscaping per the approved final landscape plan as \nspecified in this Section. Where a person other than the \nowner occupies the property, the occupant shall also be \nresponsible for maintenance.\nCommercial, Industrial, and Institutional\nS12.\tSite Landscaping. All landscaped setback areas, buffers, \nlandscaped open spaces, eco-roofs, vegetated stormwater \nfacilities, preserved natural areas, and planter areas on site \nmay be credited toward the minimum landscape standard.\na.\t In all districts except Corridor Mixed Use, a minimum of 15 \npercent of the net site area shall be landscaped. \nb.\t In the Corridor Mixed Use district, a minimum of 20 \npercent of the net site area shall be landscaped.\n6.\t Landscaping, Continued\nFig. A.6.S12: Landscaped areas of roof-top open \nspaces may be credited towards the minimum \nlandscape standard.\nFig. A.6.S11.c.i-2: Well maintained landscaped areas \npresent a neat and orderly appearance.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 28,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 28\n(06/22)\nDesign Standards\nMultifamily and Townhouse Style\nS13.\tSite Landscaping. A minimum of 20 percent of the net site area \nshall be landscaped. A paved pedestrian walk, when integrated \nwithin the landscaped area, may satisfy up to 5 percent of this \nrequirement. All landscaped setback areas, buffers, landscaped \nopen spaces, eco-roofs, vegetated stormwater facilities, \npreserved natural areas, and planter areas may be credited \ntoward the minimum landscape standard.\nS14.\tAll setbacks shall be landscaped and shall have at least 5 \ndeciduous shade trees per 100 linear feet. \na.\t Such trees shall be capable of at least 25 feet in height and \nspread at maturity and be not less than 10 feet in height \nand 2.5 inches in caliper size at the time of planting. \nb.\t New evergreen trees may substitute for the required \ndeciduous shade trees on a one-for-one basis, provided \nthe trees are capable of at least 25 feet in height and are \nat least 8 feet in height at the time of planting.\nc.\t Each existing regulated major tree that is preserved may \nbe counted as two trees required in the setback. Existing \ntrees to be counted toward this requirement must be \nconfirmed to be healthy by a Consulting Arborist, qualified \narborist, or a registered consulting arborist.\nd.\t Where the setback overlaps a required buffer, the setback \ntrees may be credited towards any tree required for the \nbuffer, and vice versa.\ne.\t Where a setback is less than 8 feet in width, columnar tree \nspecies with a minimum mature height of 25 feet may be \nused.\nAdditional Standards for Plexes and Townhouse Style\nS15.\tLandscaping, including trees, shrubs, or ground cover, shall be \nutilized in the space between abutting driveways that have not \nbeen ganged together to reduce impervious surfaces. \nDesign Guidelines\nMultifamily and Townhouse Style\nG13.\tSufficient landscaping shall be \nprovided to contribute to an attractive, \ngreen and sustainable development.\nG14.\tThe landscape plan shall provide \nsufficient vegetation including trees \nin the setback areas to create an \nattractive site and to buffer uses.\nAdditional Standards for Plexes and \nTownhouse Style\nG15.\tLandscaping or other treatments \nbetween driveways shall be utilized \nto break up continuous pavement \nand provide separation and rainwater \ninfiltration opportunities.\n6.\t Landscaping, Continued\nFig. A.6.S14: Trees provided in the landscape setback \nprovide a buffer between auto traffic and residential \nuses.\nFig. A.6.S15: Where driveways are not ganged together (left), a landscape strip \nseparates driveways (right), allowing for rainwater infiltration opportunities and a \nsoftening of the street edge.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 29,
      "text": "Corridor Design District \nCity of Gresham Development Code\n[7.01] - 29\n7.0103 Design Guidelines and Standards\nA. Site Design\n(06/22)\n7.\t Site Lighting\nIntent: To utilize appropriate lighting fixtures and illumination levels \nto ensure safety during hours of darkness while providing an \nattractive visual element of the site design.\nKey Corridor District Design Principles:\n\t\n\t\nA.\t Site Planning\n\t\n\t\nC.\t Safe Design\t\n\t\n\t\nDesign Standards\nAll Development\nS1.\t The following areas shall be illuminated during the hours \nof darkness: primary internal drives, parking areas, loading \nand unloading areas, open spaces, pedestrian walkways, and \nbuilding entries.\na.\t The illumination levels listed in Table 7.0103(A)(7)(1) shall \nact as minimum standards for all exterior lighting.\nb.\t Maximum average lighting will be governed by the six-\nto-one ratio (6:1) of maximum average to minimum \nillumination (per Table 7.0103(A)(7)(1)) of the surface \nbeing lit.\nc.\t Maximum illumination at a property line adjacent to \na residential use shall not exceed 0.5 foot-candles. \nMaximum illumination at a property line adjacent to a \nnon-residential use shall not exceed 1.0 foot-candle.\nd.\t Average foot-candles shall be the average amount of light \nat 3-foot height above a surface as determined using \na photometric plan with 1-foot grid spot foot-candle \nreadings. The Manager or Design Commission may modify \nthese levels if such modifications are deemed necessary \nand appropriate for the use and surrounding area.\ne.\t No direct light source shall be visible at the property line.\nTable 7.0103(A)(7)(1): Site Illumination Values \nArea of Illumination\nIllumination Level (Foot-Candles)1\nPrimary Internal Drives\n1.0 minimum with an average of 3.5\nParking Areas\n0.5 minimum    \nLoading and Unloading Areas\n0.5 minimum    \nOpen Spaces\n0.5 minimum with an average of 1.5\nWalkways\n0.5 minimum with an average of 1.5\nBuilding Entrances -\nFrequent Use\n1.0 minimum with an average of 3.5\nBuilding Entrances - \nInfrequent Use\n1.0 minimum with an average of 2.0\nTable Notes:\n1See 7.0103(A)(7)(S1)(d)\n7.0103(A)(7)(S1)(d)\nFig. A.7: A primary internal drive illuminated with \npedestrian scaled lighting.\nFig. A.7.S1: Active walkways, open spaces, and \nbuilding entrances provide appropriate lighting to \nensure visibility and safety.\nDesign Guidelines:\nAll Development\nG1.\t The site shall be designed to achieve \nuniform illumination levels with a \nminimum glare to adjacent properties \nin order to create a comfortable and \nsafe environment.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 30,
      "text": "Corridor Design District \n7.0103 Design Guidelines and Standards\nA. Site Design\nCity of Gresham Development Code\n[7.01] - 30\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG2.\t Lighting fixtures shall not create \nunnecessary upward directed \nillumination that contributes to sky-\nglow, nor create negative impacts on \nsurrounding properties or unnecessary \nglare within the site. The standard \nmay be waived or altered when \nappropriate decorative fixtures are \nproposed (e.g. use of decorative up-\nlighting to illuminate the underside \nof a canopy or columns on a facade, \nwhere a canopy or roof projection \nrestricts the projection of the light into \nthe night sky, or bollards).\nG3.\t Lighting fixtures in pedestrian areas \nshall be appropriately scaled and \nplaced to contribute to a cohesive and \nvisually pleasing environment.\nDesign Standards\nAll Development, Continued\nS2.\t Developments shall use full cut-off lighting fixtures to avoid \noff-site lighting, night sky pollution, and shining lights into \nresidential units.\na.\t Fixtures shall have a cut-off angle of 90 degrees as \nmeasured perpendicular to the ground.\nS3.\t Light fixtures shall not exceed 25 feet in height.\na.\t Weather- and vandalism-resistant covers shall protect \nlighting devices.\n7.\t Site Lighting, Continued\nFig. A.7.S3.a: Pedestrian-scaled bollard lighting with weather resistant coverings are \nlocated to illuminate a pedestrian walkway.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 31,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 31\n(06/22)\nDesign Guidelines\nAll Development\nG1.\t Important facade sections, including \nthose adjacent to the intersection \nof two streets, should have forms \nwhich are distinct from adjacent wall \nsections, responding to highly visible \nareas of the site.\nG2.\t Arcades or colonnades shall be \nintegrated into the overall design \nof the building. Walkways beneath \narcades/colonnades shall be of \nsufficient width to accommodate \nanticipated pedestrian traffic. Arcades/\ncolonnades shall be designed to limit \nor prevent dark spaces on facades \nbeneath it.\nDesign Standards\nAll Development\nS1.\t For all development, excluding plexes and townhouse style \ndevelopment, building corners that front intersections of \npublic streets and/or facade sections that terminate the view \ndown a right-of-way or primary internal drive shall include \ndesign elements that establish prominence in the building, \nrespond to the unique site configuration, and the location of \nprimary building entries.\n\t\nDesign elements shall include one of the following profiles (in \nplan view), depicted in Figure B.1.S1:\na.\t Curved or hinged corner or wall section;\nb.\t A form which is projected or recessed from both abutting \nfacades; or\nc.\t Beveled or mitered corner.\nd.\t Alternatively, the design may include distinctive \narchitectural expressions, such as a tower form with an \nincrease in height no less than 10 percent of the adjacent \nwall height.\nS2.\t When used, arcades (or colonnades) shall have an \nunobstructed walking path a minimum of 10 feet in width. \nArcade ceilings shall be a minimum 15 feet tall to allow \nsufficient light into the space underneath. Buildings with \narcades may exceed the maximum building setback to achieve \nthe minimum colonnade depth. The square footage under \nthe arcade may count toward the building square footage in \ncalculating whether the project meets the minimum floor area \nratio standard.\n1.\t Building Massing and Articulation\nFig. B.1: Developments at street corners establish \nprominence in the building facade through a change in \nthe building form.\nIntent: \tTo enhance and enliven wall planes with design features \nwhich add depth, detail, and interest to facades; establishing \nprominence in sections of the facade which are highly visible \nfrom surrounding public spaces and streets, while also \nreducing the visual scale of building facades to the human \nscale.\nKey Corridor District  Design Principles:\n\t\n\t\nI.\t\nDesign Excellence and Architectural Expression\t\n\t\n\t\nJ.\t\nProminence and Hierarchy\n\t\n\t\nK.\t Building Form and Articulation\t\nFig. B.1.S1: (Above and left) Examples of profiles used at important facade sections, \nincluding the intersection of two streets or the terminus of an internal drive.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 32,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 32\n(06/22)\nDesign Standards\nCommercial, Industrial, and Institutional\nS3.\t In order to facilitate connections to surrounding areas, \ncommercial structures shall not have an overall horizontal \ndistance exceeding 400 linear feet in any dimension, measured \nfrom end wall to end wall.\na.\t A minimum separation of 20 feet shall be required \nbetween buildings when the sum of the length of two \nor more adjacent building equals or exceeds 400 feet. \nWhen the buildings are not separated by a public street, \nprimary internal drive, or a parking area, the separation \narea shall include landscaping. A pedestrian walkway shall \nbe required at the discretion of the Manager or Design \nCommission.\nMultifamily and Townhouse Style\nS4.\t Structures shall not have an overall horizontal distance \nexceeding 160 linear feet, measured from end wall to end wall.\na.\t Structures facing a street can increase to 200 linear feet \nprovided a courtyard, portal to a shared parking area, or \nother open space is provided that breaks up the building \nwall. Breaks in the facade shall be a minimum of 20 feet in \nwidth and depth.\nS5.\t On street-facing elevations, wall planes over 750 square feet \nshall be divided into distinct planes. This can be achieved by:\na.\t Incorporating elements such as porches or decks into the \nwall plane;\nb.\t Recessing the building facade a minimum of 2 feet over 6 \nfeet in width; or by\nc.\t Extending an architectural bay a minimum of 2 feet from \nthe facade. \nDesign Guidelines\nCommercial, Industrial, and Institutional\nG3.\t Buildings shall foster a walkable \ndevelopment and not exceed \ndimensions that limit connections to \nsurrounding areas. Spaces between \nbuildings shall be of sufficient \ndimension to allow for connectivity \nand the creation of an attractive and \nwalkable environment.\nMultifamily and Townhouse Style\nG4.\t Building shall be modulated to prevent \nlarge, uninterrupted, monotonous \nwalls.\nG5.\t Buildings shall utilize massing \nstrategies which create depth and \nadd interest to the facade. Changes in \ndepth shall relate to building design \nand be sufficient to provide surface \nrelief, depth, shadows, and visual \ndistinction between wall planes.\n1.\t Building Massing and Articulation, Continued\nMin. 15’\nMin. 15’\nMin. 10’\nMin. 10’\nFig. B.1.S2:  Minimum dimensions of an arcade to \nensure sufficient space for pedestrian movement and \nnatural lighting.\nFig. B.1.S4.a: Structures facing a street can increase horizontal length to 200 feet by \nproviding an internal courtyard with a minimum 20 foot width.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 33,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 33\n(06/22)\nDesign Standards\nMultifamily and Townhouse Style, continued\nS6.\t Structures shall not include long, monotonous, uninterrupted \nwalls. Walls shall incorporate structural exterior wall offsets, \nprojections, and/or recesses as a means of reducing the scale \nand improving the appearance of the building. A minimum of \n12 inches in horizontal variation shall be used at intervals of \n50 feet or less along the full height of the structure’s primary \nfacade.\nAdditional Standards for Plexes and Townhouse Style\nS7.\t Facades for duplex and townhouse style developments longer \nthan 30 feet, which include units' primary entries, shall be \nreduced into smaller volumes as individual units to achieve a \nresidential scale and a unified building appearance. This can \nbe achieved with variation in the building form by one of the \nfollowing:\na.\t Emphasize unit entries through a projecting or recessed \nform and/or change in materials;\nb.\t Provide a shift in massing between units of a minimum of \n12 inches; or\nc.\t Provide a change in roof shape or pitch, corresponding to \neach unit.\nDesign Guidelines\nMultifamily and Townhouse Style, \ncontinued\nG6.\t Buildings that front the public realm \nshall avoid long, monotonous, \nuninterrupted walls. Volumes shall \nreinforce a human scale within the \nbuilt environment, so pedestrians \ndo not feel dwarfed by the building \nstructure.\nAdditional Standards for Plexes and \nTownhouse Style\nG7.\t Changes in massing and building \ndesign shall be used to create a visual \ndistinction between adjacent units. \nVolumes shall reinforce a human \nscale within the built environment, so \npedestrians do not feel dwarfed by the \nbuilding structure.\n1.\t Building Massing and Articulation, Continued\nFig. B.1.S6 and S7: Building facades shall avoid monotonous, uninterrupted walls. \nIn addition, townhouse style development shall be reduced into smaller volumes as \nindividual units.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 34,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 34\n(06/22)\nDesign Guidelines\nAll Development\nG1.\t Heat Island Reduction. Roof surfaces \nshall utilize light-colored or natural \nmaterials to minimize localized heat \ngains.\nG2.\t Parapets shall not appear as flat \nor false extensions of building wall \nsections, but rather appear as distinct \nbuilding masses and extend into the \ndepth of the building.\n2.\t Roofs and Parapets\nIntent: To create a visually interesting condition at the top of the \nbuilding that enhances the quality and character of the \nbuilding and contributes to creating a sustainable building \ndesign.\nKey Corridor District Design Principles:\n\t\n\t\nI.\t\nDesign Excellence and Architectural Expression\n\t\n\t\nM.\t Sustainable\tArchitectural Design\n\t\nDesign Standards\nAll Development\nS1.\t Heat Island Reduction - Roof Surface. All low-sloped (pitches ≤ \n2:12) roof surfaces, exclusive of space dedicated to mechanical \nsystems, vegetated roof surfaces or solar panels, shall utilize \na “white roof” with a Solar Reflectance Index (SRI) of 78 or \ngreater. \nS2.\t In order to establish depth at the roof line, when parapets are \nused to increase the height of specific building wall sections, \nthe parapet shall extend into the depth of the building no less \nthan twice the distance of the increase in height, as measured \nfrom the point of intersection with the lower parapet or roof if \nno parapet is present.\nFig. B.2: Low-sloped roofs utilize landscaped roof \nsystems and white roofs with a high Solar Reflectance \nIndex to reduce the heat island effect.\nTwice increase \nin height\nIncrease \nIncrease \nin height\nin height\nPoint of \nIntersection\nFig. B.2.S2: Diagram illustrating parapet roof depth \nstandard.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 35,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 35\n(06/22)\n3.\t Entries\nIntent: To promote pedestrian comfort, safety, and orientation by \ncreating well-defined and welcoming building entries.\nKey Corridor District Design Principles:\n\t\n\t\nA. \t Site Planning\n\t\n\t\nF.\t Building and Site Orientation\n\t\n\t\nI.\t\nDesign Excellence and Architectural Expression\t\n\t\n\t\nL.\t Building Activity and Glazing\nFig. B.3: Recessed corner entry provides weather \nprotection and access from both street frontages.\nDesign Guidelines\nAll Development\nG1.\t All ground floor common entries or \nindividual unit primary entrances shall \nprovide protection from the weather.\nCommercial, Industrial, and Institutional\nG2.\t All building entries shall be visually \nprominent from the street and shall \ninclude a variety of design features \nand strategies that highlight these \nareas of the facade. Primary entries \nshall be more prominent than \nindividual or storefront entries.\nDesign Standards\nAll Development\nS1.\t All entries shall incorporate arcades, roofs, covered porches, \nporticoes, recessed entries, and/or structural awnings that \nprotect pedestrians from the rain and sun to a minimum depth \nof 4 feet. Sheltered entries shall not project more than 2 feet \ninto a required setback. Exterior doorways providing egress \nonly or access to non-habitable service areas are exempt.\nCommercial, Industrial, and Institutional\nS2.\t Each building shall provide at least one customer entry facing \nthe primary street on which the building is located. The \nprimary street shall be the street of highest classification or as \ndetermined by the Manager or Design Commission. \na.\t If a building is located at the intersection of 2 streets \nclassified as a major or standard arterial, boulevard, or \nDesign Street, a customer entry shall be located on the \nbuilding corner facing the intersection or an entry shall be \nlocated on each street facing facade. \nb.\t Buildings with multiple ground floor tenant spaces located \nabutting the street, shall provide a minimum of 1 customer \nentry per tenant space on the street facing facade. \nFig. B.3.S2.a and S3.a: A large commercial building \nutilizing a corner entry to provide access from both \nstreets and a visible change in form from adjacent \nfacade sections.\nFig. B.3.S2.b. Multi-tenant buildings provide separate street facing entries for each \nground floor tenant.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 36,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 36\n(06/22)\nDesign Guidelines\nCommercial, Industrial, and Institutional, \nContinued\nG3.\t Building entries shall be designed \nas a distinct, prominent element of \nthe building, that compliments the \nremainder of the design. Entries shall \ninclude a variety of design features \nand/or a change in form of sufficient \ndimension to visually distinguish \nthe entry from the remainder of the \nbuilding facade. Primary building \nentries shall be made more visually \nprominent than individual storefront \nentries. \nMultifamily and Townhouse Style\nG4.\t Buildings shall be located with the \nprimary facade and entries oriented \nto the street or a street-facing open \nspace such as a courtyard.\nDesign Standards\nCommercial, Industrial, and Institutional, Continued\nS3.\t Building entries shall feature a design that demonstrates \nvisual prominence and architectural emphasis. Building entry \nfeatures shall include a minimum of two of the following \nfeatures in the entry design to highlight the entry:\na.\t A visible change in building form from adjacent facade \nsections, which includes a change in depth of at least 16 \ninches;\nb.\t Oversized entry door(s) with a minimum height of 8 feet;\nc.\t Change in material, color, texture, pattern, or articulation;\nd.\t Change in roof or canopy form, such as but not limited to a \nprojecting, curved or sloped design;\ne.\t Distinct and decorative stone, masonry, or tile paving \npattern on the adjacent private sidewalk section; \nf.\t\nEntry courtyard with a minimum area of 100 square feet \nwith year-round site furnishings such as benches, tables, \nand sitting areas;\ng.\t Ornamental light fixtures, flanking both sides of the door;\nh.\t Planters with year-round landscaping framing the entry.\nMultifamily and Townhouse Style\nS4.\t Buildings abutting a street shall be accessed from and oriented \nto the street. \na.\t The primary entry or entries for all ground-floor units \nabutting the street shall open directly onto the street, not \nto the interior of the site or to a parking lot. Secondary \nentrances may face parking lots or other interior site \nareas. The primary entry for dwellings with frontage on \nboth a public street and an alley shall be oriented to the \nstreet, not to the alley. \nb.\t For buildings with a central courtyard space opening to \nthe street, the primary entry or entries for all ground-floor \nunits abutting the street or courtyard shall open directly to \nthe street or onto the courtyard. Secondary entrances may \nface parking lots or other interior site areas.\nc.\t Secondary entrances facing the street shall present the \nsame finished appearance as the primary entrances, and \nshall not include rear patios or sliding glass doors.\nd.\t Where a building is on a corner lot that fronts two abutting \nstreets, a dwelling unit at the corner of the building needs \nto have its primary entry oriented to a minimum of one of \nthe streets.\ne.\t The shared entry to a building or individual dwelling unit \nentry shall be oriented toward the street or a courtyard \nwhich the building or unit faces. When part of a mixed-\nuse building, residential and other non-retail commercial \nuses shall have a distinct entry that is not shared with a \ncommercial use. \n          Continued on following page\n3.\t Entries, Continued\nFig. B.3.S3: The entry for the commercial building is \nhighlighted with a visible change in the building form \nfrom adjacent facade sections, a change in the roof \nline, ornamental light fixtures, and oversize doors.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 37,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 37\n(06/22)\nDesign Standards\nMultifamily and Townhouse Style, Continued\nS4.   Continued\nf.\t\nResidential amenity buildings, such as recreation or \ncommunity centers, which abut a street shall provide an \nentry facing the street.\nS5.\t All shared and individual unit primary entries that face \nthe street shall be made visually prominent and receive \narchitectural emphasis.\n\t\nExterior individual unit entries shall be highlighted by \nincorporating a minimum of two of the following elements.\n\t\nShared entrances, such as those for apartment style buildings \nwith interior unit entries, shall be highlighted by incorporating \na minimum of three of the following elements.\na.\t Corner entries;\nb.\t Recessed entry (minimum of 12 inches from the \nsurrounding wall plane);\nc.\t Projecting entries (minimum of 12 inches from the \nsurrounding wall plane), including porches, canopies, and \narticulated lintels above the doorway;\nd.\t Pilasters or columns supporting and/or framing the \nentrance;\ne.\t Elevated entries (a minimum of 6 inches) with transparent \nrailing on stairways that are compatible with the \narchitecture; \nf.\t\nOrnamental glazing framing the entry;\ng.\t An entry courtyard a minimum of 40 square feet. The \ncourtyard shall provide year-round site furnishings such as \nseating, landscape features, and pedestrian scaled lighting \nfeatures;\nh.\t Prominent landscape treatment (ground cover, shrubs, \ntrees) that connects the public realm to the private realm, \nhighlight the entry, and emphasizes seasonal color and \ninterest;\ni.\t\nProminent landscape feature, such as a trellis, arbor, water \nfeature, or special walkway paving.\nj.\t\nYear-round site furnishings, including benches, tables, and \nsitting areas.\nDesign Guidelines\nMultifamily and Townhouse Style, \nContinued\nG5.\t Entries shall be highlighted and visible \nfrom the street.\n3.\t Entries, Continued\nFig. B.3.S5.b and d: Individual unit entry is framed by a \nwall recess and column.\nFig. B.3.S5.c: Shared entry is framed by a projecting \nawning, ornamental glazing, and year round landscape \nfurnishings.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 38,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 38\n(06/22)\nDesign Standards\nMultifamily and Townhouse Style, Continued\nS6.\t At least 70 percent of the street or courtyard frontage shall be \nvisible from at least one of the following: \na.\t The front door; \nb.\t A ground floor window in a frequently used room such as \na living room, dining room, kitchen, or bedroom (but, for \nexample, not a window to a garage, bathroom, or storage \narea); or \nc.\t A second story window in a frequently used room (which \nmay include a bathroom window placed no higher than 3 \nfeet, 6 inches from the floor to the bottom of the window \nsill).\nS7.\t Developments with multiple ground floor and street facing \nunits, such as multifamily and townhouse style units, shall \nprovide a direct connection from the sidewalk to the front \ndoor of each street-facing ground floor unit. The connection \nshall be a minimum of 5 feet wide. Abutting connections may \nbe ganged to maximize landscape area.\nS8.\t Transition Between Public and Private. Where a residential \nunit occupies the ground floor, fronts, and accesses the street, \nat least one of the following elements shall be incorporated \nbetween the ground floor of the unit and the right-of-way as a \nmeans of creating a sense of privacy:\na.\t Elevated entries (a minimum of 6 inches above sidewalk \ngrade) with transparent railing on stairways that are \ncompatible with the architecture;\nb.\t Landscape treatment 5 to 15 feet in width between the \nunit and the right-of-way for 60 percent of the setback \narea;\nc.\t A covered entry porch with a floor area of at least 40 \nsquare feet. \nd.\t Decorative, transparent fencing made of metal or wood, \nor a stone wall. Fencing or the stone wall shall not exceed \n30 inches in height when placed between the front of \nthe building and the right-of-way unless approved by \nthe Manager or Design Commission, and shall include a \nminimum of 1.5 feet of landscaping between the fence or \nwall and the street-facing sidewalk. There shall also be a \nminimum separation between the building and the fence \nor wall of 5 feet.\ne.\t Provide raised planter(s) between 18 inches and 30 \ninches in height and 4 feet in depth as measured from the \npoint of the planter nearest the front property line. The \nplanter(s) shall occupy at least 50 percent of the frontage \nof each unit and be planted with perennial landscaping.\nDesign Guidelines\nMultifamily and Townhouse Style, \nContinued\nG6.\t The front door and windows shall \nbe oriented to the street that the \ndwelling faces, or to a central \ncourtyard, and shall maximize visual \nsurveillance of the entry area and \nstreet frontage.\nG7.\t Walkways shall provide connections \nbetween entries, the on-site \npedestrian circulation system, and \nsidewalks on abutting public streets.\nG8.\t The development shall provide a sense \nof privacy for the residents.\n3.\t Entries, Continued\nFig. B.3.S8.a and e: A ground floor entry is separated \nfrom the public realm (the sidewalk) with an elevated \nentry and raised planters.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 39,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 39\n(06/22)\nDesign Guidelines\nMultifamily and Townhouse Style, \nContinued\nG9.\t The development shall provide a \nsense of privacy for the residents \nand a distinction between the public \nsidewalk realm and the private unit \nrealm.\nDesign Standards\nMultifamily and Townhouse Style, Continued\nS9.\t Transition between public and semi-public areas to private \nareas on site (including building and unit entry areas, porches, \npatios, etc.) shall be identified in a minimum of one of the \nfollowing ways:\na.\t Changes in paving material;\nb.\t Changes in paving color;\nc.\t Changes in paving pattern or texture;\nd.\t Changes in elevation; or\ne.\t Changes in landscaping (plant selection and/or design).\n3.\t Entries, Continued\nFig. B.3.S9.d: A transition between the public and private realm is achieved through \na change in elevation from the sidewalk to the unit entry and a small landscape \nplanter.\nFig. B.3.S9: The transition between the sidewalk and \nthe internal private areas of the site are demarcated \nthrough a change in paving material, color, and pattern. \nFig. B.3.S8.d: Decorative metal fencing at a ground \nfloor entry abutting the sidewalk creates a sense of \nprivacy. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 40,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 40\n(06/22)\n4.\t Facade Composition and Ground-Level Details\nFig. B.4: A repeating pattern of recesses and changes \nin wall planes create a pleasant rhythm in the facade \nwhich creates visual interest.\nDesign Guidelines\nAll Development\nG1.\t Mechanical equipment and individual \nthrough wall units shall not detract \nfrom building architecture and facade \ncomposition and shall be designed to \nminimize their visibility. Equipment \nshall not project beyond the adjacent \nfinished wall plane and shall be \nscreened and integrated into the \nbuilding’s overall architectural design, \nfacade composition, and detailing.\nG2.\t Exterior functional features shall be \nvisually minimized, screened, and/\nor integrated into the building’s \noverall architectural design, facade \ncomposition, and detailing.\nDesign Standards\nAll Development\nS1.\t Packaged Terminal Air Conditioners, Package Terminal Heat \nPumps and similar systems that are visible, including from \ninternal public or private areas, shall not be allowed. \nS2.\t Functional features such as vents and downspouts shall be \nvisually minimized and integrated into the facade design. \nFunctional features shall be painted to match the facade \nthey are attached to. Where feasible, these features shall \nbe entirely located on non-street facing facades or located \nin facade recesses or returns when placed on street facing \nfacades.\nIntent:\t To create a harmonious building facade that respects \nneighboring buildings through the use of architectural \nelements and timeless architectural principles.\nKey Corridor District Design Principles:\n\t\n\t\nI.\t\nDesign Excellence\t\n\t\n\t\nK.\t Building Form and Articulation\n\t\n\t\nM.\t Sustainable Architectural Design\t\nFig. B.4.S2. Venting on the facade is screened with covers, painted to match the \narea of the facade they are attached to.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 41,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 41\n(06/22)\nDesign Standards\nAll Development, Continued\nS3.\t Mechanical, electrical, and communication equipment and \ncomponents shall be screened so they are not visible at \nground level from streets and other street level public spaces, \nincluding alleys. \na.\t Equipment shall be screened in a manner that is consistent \nwith the architectural character (material, pattern, and \ncolor) of the building.\nb.\t Appropriate screening for rooftop equipment includes \nparapet walls or architecturally compatible fabricated \nenclosures such as metal louver panels and walls. The \nManager or Design Commission may require a review of \nscreening of rooftop equipment by requesting sight line \nstudies.\nc.\t Roof-top solar equipment that is installed parallel to a \npitched roof or no greater than 18 inches from parallel to a \nflat roof, that does not exceed the peak height of the roof, \nand that does not increase the footprint of the building, \nis exempt from the screening requirements above, unless \notherwise required as specified in Article 4 and Section \n10.0900.\nd.\t Ground level utilities such as transformers, heating and \ncooling, electric meters, and other utility equipment shall \nnot be located within 8 feet of primary entrances and \nshall be screened with evergreen landscape materials of a \nheight and spacing at time of planting that will screen the \nequipment, or with fencing that is opaque and screens the \nequipment.\nDesign Guidelines\nAll Development, Continued\nG3.\t Mechanical Screening. The 7.0103(B)\n(4)(S3) standard shall be met. Utilities \nshall be screened from the public \nrealm and the internal public or \nprivate areas. \n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S3.d-1: Ground level utilities are placed in \nlandscape islands screened by evergreen shrubs.\nFig. B.4.S3.a and d-2: Ground mounted equipment \nis screened with a fencing material, consistent with \nmaterial elements of the primary building.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 42,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 42\n(06/22)\nDesign Standards\nAll Development, Continued\nS4.\t Energy conservation and sustainability in building \ndevelopment shall be promoted through a minimum of two of \nthe following:\na.\t Orient the long axis of the building east and west, with \nunobstructed solar access to the south wall and roof;\nb.\t Locate the windows to take advantage of passive solar \ncollection and include architectural shading devices (such \nas window overhangs) that reduce summer heat gain \nwhile encouraging passive solar heating in the winter;\nc.\t Include solar energy panels on the roof of the building, \ngarage or car port that generate at a minimum 10 percent \nof the typical energy usage for the building in renewable \nenergy. The typical energy model for the building shall be \ndetermined by referencing the LEED™ standards. Solar \npanels shall be integrated into the building design or shall \nbe screened from view at street level with materials that \nare consistent with the building design and yet do not \ninterfere with the purpose of the solar panels;\nd.\t Plant a vegetated eco-roof on top of the building or \ncarport that covers 20 percent of the building footprint;\ne.\t A minimum of 20 percent of building materials contain, \nin aggregate, a minimum weighted average of 20 percent \npost consumer recycled content materials such as \naluminum, glass, or recycled paper;\nf.\t\nA minimum of 5 percent of the building materials consist \nof rapidly renewable materials which include materials \nthat can be planted and harvested within 10 years; or\ng.\t A minimum of 20 percent of wood based materials are \ncertified in accordance with the Forest Stewardship \nCouncil (FSC) and have been used in construction.\nDesign Guidelines\nAll Development, Continued\nG4.\t Developments shall utilize strategies \nthat reduce water and energy usage \nattributed to building development, \nbuilding use, and the transportation \nof building users while not detracting \nfrom good site and building design. \nHealthy and sustainable communities \nshall be created that incorporate \n“best practices” such as LEED™ for \nNeighborhood Development to \nconserve natural resources, reduce \ncarbon emissions, and promote \ninteraction between residents.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S4.c: Solar arrays on top of an industrial \nbuilding.\nFig. B.4.S4.b: A high level of transparency located on the south facing building \nfacade takes advantage of passive solar collection.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 43,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 43\n(06/22)\nDesign Standards\nAll Development, Continued\nS5.\t Building Base. Except for single story structures, building \nfacades shall include design elements that establish a base. \na.\t Building bases shall consist of a visible change in the \nbuilding facade and include a change in material, texture, \npattern, ornamentation, or a change in depth no less than \n4 inches. The required change in depth for bases may be \nreduced to 2 inches when they intersect other articulating \nfeatures, such as pilasters, in order to provide visual \ndistinction.\nb.\t The base shall be a minimum height no less than 5 percent \nof the facade height and shall not exceed 20 percent of \nthe facade height. Multi-story buildings of three levels or \ngreater, may have a building base equal to the wall area \nattributed to the first floor. \nc.\t The base treatment shall be located on a majority of the \nlength of each building facade and shall wrap all visible \nbuilding corners.\nCommercial, Industrial, and Institutional\nS6.\t Facade Depth. Facades visible from streets or those with \ncustomer entries shall incorporate design strategies and \nfeatures which create depth in wall planes. \na.\t Depth shall be established in facades by utilizing one of \nthe following strategies:\ni.\t\nA repeating pattern of wall recesses and/or projections \nthat has a relief of at least 16 inches (such as recessed \nstructural bays or recessed window openings between \ncolumns). Wall recessions and/or projections shall be \nat intervals not greater than every 30 feet.\nii.\t Changes in wall planes with an offset of at least \n24 inches at intervals that respond to the building \nmodule. These changes in wall plane shall occur at \nintervals of not less than 25 feet and not more than \n100 feet.\nb.\t Features used to establish depth in the facade shall be \nno less than 75 percent of the height of the wall area \nattributed to the ground floor use (including the parapet \non a single story building).\nDesign Guidelines\nAll Development, Continued\nG5.\t Buildings shall feature an \narchitecturally distinct base to address \nand enhance the meeting of the \nbuilding and ground.  Building bases \nshall be visually distinct and of a size \nwhich achieves visually pleasing and \nappropriate proportions.\nCommercial, Industrial, and Institutional\nG6.\t The building shall utilize design \nstrategies which effectively add depth \nto the building and wall planes.\na.\t Articulating elements shall provide \nsurface relief, depth, and shadows \nto the facade by being recessed or \nprojected.\nb.\t Changes in building depth shall \nreinforce and create a consistent \nstreet wall.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S6: A combination of projections/recesses and changes in wall plane are \nused to establish depth.\nFig. B.4.S5: A building base is established with a \nchange in materials and fenestration pattern on the \nground floor.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 44,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 44\n(06/22)\nDesign Standards\nCommercial, Industrial, and Institutional, Continued\nS7.\t All facades shall be articulated and a rhythm shall be \nestablished by repeating design elements at regular spacing \nwhich does not exceed 30 feet along the length and/or height \nof the facade. These design elements shall be present for a \nminimum of 80 percent of the facade length.\na.\t Buildings shall utilize a minimum of two of the following \noptions, each at the spacing specified above, to articulate \nthe facade and establish rhythm:\ni.\t\nColumns, pilasters or reveals at least 16 inches in \nwidth which follow the building module.\nii.\t Belt courses or other horizontal banding.\niii.\t Major vertical mullions of at least 6 inches in width on \nan all-glass facade which follow the building module.\niv.\t A repeating fenestration pattern including windows, \nwindow openings, and doors.\nv.\t Integrated planters or landscape beds with a minimum \nwidth of 10 feet featuring trees and ground-level \nplantings at the required spacing.\nvi.\t Pergolas, arcades, or colonnades.\nvii.\t Awnings, canopies, or solar shades/reflectors placed \nover windows, doors, or outdoor spaces with a \nminimum depth of 4 feet.\nviii.\tOther features approved by the Manager or Design \nCommission.\nb.\t The use of Option (S7)(a)(i) and Option (S7)(a)(ii) shall be \ncounted as only one articulating element on facades facing \na street and facades with customer entries. In this case, \nthe use of an additional feature is required.\nc.\t Design elements used to articulate the facade and \nestablish rhythm shall include a small change in depth \nno less than 4 inches from the adjacent wall plane. This \ndimension may be reduced to 2 inches on belt courses and \nhorizontal banding.\nDesign Guidelines\nCommercial, Industrial, and Institutional, \nContinued\nG7.\t Design elements shall occur at regular \nspacing which responds to the building \nmodule of the building, establishing a \nrhythm on the facade.\na.\t Building articulation shall establish \na vertical-orientation in the facade \nwith complimentary horizontal \ndetails, visually reducing the scale \nof the wall into several smaller \nlengths.\nb.\t Building articulation shall create \na human scale within the building \nand shall place emphasis on \nenhancing the pedestrian levels \nof facades adjacent to streets or \nparking areas.\nc.\t Articulating features shall use \na combination of changes of \nmaterials, plane, fenestration, \ndetailing and the establishment of \nvertical and horizontal datums.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S7.a.vii: Projecting facade elements, including solar shades and wall \nsconces are present along street facing facades.\nFig B.4.S7.a: An office building includes a repeating \nfenestration pattern, as well as integrated planters \nat the ground floor and solar shades for upper level \nfloors.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 45,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 45\n(06/22)\nDesign Standards\nCommercial, Industrial, and Institutional, Continued\nS8.\t Outdoor Sales areas shall be located adjacent to and shall \nshare at least 1 common wall with the building it is associated \nwith. Outdoor Commercial uses are exempt from this \nstandard.\na.\t The outdoor sales area shall be enclosed by a decorative \nfence or wall or a greenhouse-type glazed structure. The \nenclosure shall be no less than the height of the finished \nceiling of the first floor of the building it is associated with \nor 12 feet in height, whichever is less.\nS9.\t Outdoor storage areas visible from the street shall be entirely \nscreened by the employment of landscaping and/or fencing. \nExceptions to this requirement include: new or used cars, \ncycles, and truck sales (but not including car parts or damaged \nvehicles); new or used boat sales; recreational vehicle sales; \nmobile homes sales; new or used large equipment sales or \nrentals; and florists and plant nurseries.\nDesign Guidelines\nCommercial, Industrial, and Institutional, \nContinued\nG8.\t When present, outdoor sales areas \nshall be designed as a permanent and \nintegral component of the primary \nstructure. The outdoor sales enclosure \nstructure shall be of a sufficient \nheight to appear as an element of the \nadjacent building.\nG9.\t Outdoor storage areas shall be \nenclosed and screened from view \nof public spaces through the use of \nattractive, pedestrian scaled elements \nsuch as landscaping or fencing.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig B.4.S8: An outdoor sales area that uses masonry \npiers and decorative fencing.  The masonry base is \nalso lined with landscape to improve its appearance.\nFig. B.4.S9: Outdoor storage is screened from the street through employment of a \nfence and wall combined with landscaping.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 46,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 46\n(06/22)\nDesign Guidelines\nCommercial, Industrial, and Institutional, \nContinued\nG10.\tSustainable Architectural Elements. \nDevelopments shall utilize strategies \nthat reduce water and energy usage \nattributed to site and building \ndevelopment, building use, and the \ntransportation of building users \nwhile not detracting from good \nsite and building design. Healthy \nand sustainable communities \nshall be created that incorporate \n“best practices”, such as LEED™ for \nNeighborhood Development, to \nconserve natural resources and reduce \ncarbon emissions.\nDesign Standards\nCommercial, Industrial, and Institutional, Continued\nS10.\tFor buildings with greater than 30,000 square feet of non-\nresidential floor area, energy conservation and sustainability \nin building and site development shall be promoted through a \nminimum of one of the following:\na.\t A vegetated roof surface comprising a minimum of 30 \npercent of the roof area;\nb.\t Solar energy panels comprising an area equivalent to \na minimum 20 percent of the total roof area of all new \nbuildings. Solar panels shall be integrated into the building \ndesign or shall be screened from view at street level with \nmaterials that are consistent with the building design and \nyet do not interfere with the purpose of the solar panels;\nc.\t A system that collects rainwater from a minimum of 50 \npercent of the total roof area for reuse (e.g., site irrigation \nor gray water reuse);\nd.\t Skylights or other day lighting system which illuminates 75 \npercent of the building floor area, with skylights occupying \na minimum of 3 percent of the roof area with spacing \nbetween skylights not greater than 1.4 times the ceiling \nheight;\ne.\t Provide an on-site alternative fuel refueling station (such \nas an electric, bio-diesel, or natural gas refueling station, \netc). An electric fueling station must be within sight of a \nfunctional building entry;\nf.\t\nSource sustainable and local building materials from within \n500 miles of the development site for no less than 20 \npercent of the total construction materials;\ng.\t Preserve no less than 50 percent of existing regulated \ntrees on site (a minimum of 4 trees). Preserved trees \nmust be healthy as determined by a consulting arborist, a \nqualified arborist, or a registered consulting arborist;\nh.\t Preserve all Habitat Conservation Area (HCA) on-site, \nminimum one quarter (1/4) acre;\ni.\t\nProvide an increase in site landscaping. The minimum \nrequired percentage of landscaping for a site, per Section \n7.0103(A)(6)(S11)(a) and (b) shall be increased by 5 \npercent;\nj.\t\nProvide additional hardscape shading. After 5 years, a \nminimum of 35 percent shading on hardscape shall be \nprovided.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S10.a: A vegetated roof surface contributes \nto the reduction of energy usage and improves on-site \nstormwater treatment.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 47,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 47\n(06/22)\nDesign Standards\nMultifamily and Townhouse Style\nS11.\tBlank, windowless walls are prohibited when facing a public \nstreet unless required by the Building Code. If a blank wall \ngreater than 40 feet long is required by Building Code, a \nminimum of one of the following shall be incorporated \nthroughout the length of the wall:\na.\t A trellis or trellises that cover 40 percent of the blank wall \nwith vines planted that will grow vertically of sufficient \ndensity and height so that they provide significant \ncoverage of the blank wall. The plantings shall be at least \n4 feet tall or cover at least 50 percent of each trellis at the \ntime of planting.\nb.\t Decorative tile work that covers an area at least 40 percent \nof the blank wall, and located to be viewed from the \npedestrian level.\nc.\t Artwork reviewed and approved by the Manager or Design \nCommission that covers an area at least 40 percent of the \nblank wall, and located to be viewed from the pedestrian \nlevel.\nd.\t Landscape screening incorporating sub-canopy trees (trees \nthat will be 25 feet or shorter at maturity) every 15 feet \nalong the wall, with a hedge between trees of evergreen \nshrubs located every 3 feet on center and a minimum of 3 \nfeet in height at time of planting.\ne.\t Other strategies to create visual interest as approved by \nthe Manager or Design Commission.\nS12.\tRoll-up and garage doors shall match the main building in \nterms of color, pattern, appearance of materials, and trim.\nDesign Guidelines\nMultifamily and Townhouse Style\nG11.\tBlank, windowless walls are prohibited \nwhen facing a public street unless \nrequired by the Building Code. \nAlternative design strategies shall be \nutilized to create visual interest and \ndepth on the facade.\nG12.\tLarge access doors (for example, \nfor garages or trash rooms) shall be \nintegrated into the design of the \nlarger facade in terms of color, scale, \nmaterials, and building style.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig B.4.S12: Garage doors for multifamily developments and roll-up doors in \ncommercial developments are integrated into the design of the primary structure \nthrough use of similar materials, colors, and patterns.\nFig. B.4.S11.c:  A small art installation placed on a wall \nhelps to create visual interest on an otherwise blank \nfacade.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 48,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 48\n(06/22)\nFig. B.5: Clear glass on the building facade allows \nfor day lighting of interior space and creates a visual \nconnection to activity inside and outside the building.\nDesign Guidelines\nAll Development\nG1.\t Where transparency is required, \nwindows shall allow high levels of \nvisibility through window glazing into \nthe buildings.\nG2.\t Parking structure transparency. \nOpenings between interior and \nexterior spaces that do not contain \nglass may count toward the \ntransparency requirement when \nadequately screened to limit views \ninto parking structures.\nDesign Standards\nAll Development\nS1.\t To meet the transparent glass requirement, glass shall have a \nVisible Transmittance (VT) value of 60 percent or greater.\na.\t Where clear glass is required, the use of reflective, tinted, \nor spandrel glass shall not be permitted.\nb.\t For non-residential uses, required windows within the \npedestrian level transparency zone shall be maintained \nfree of shelving, signage (including painted window \nsignage), or other items that reduces visibility by more \nthan 50 percent between the interior and exterior spaces. \nS2.\t If structured parking is present, openings without glass but \nutilizing an artistic screening system or other decorative \nfeature in those areas may be used to meet the transparency \nrequirement for the portions of the facade occupied by the \nparking structure.\na.\t The design of parking structures and their artistic \nscreening systems shall be compatible with the \narchitectural character of the primary building. Design \nsimilarities include features such as color, material, \npattern, proportions, and articulations.\n5.\t Transparency\nIntent:\t To add interest to exterior facades, allow for day lighting of \ninterior space and create a visual connection between interior \nand exterior spaces.\nKey Corridor District Design Principles:\n\t\n\t\nI.\t\nDesign Excellence and Architectural Expression\n\t\n\t\nJ.\t\nProminence and Hierarchy\t\n\t\n\t\nL.\t Building Activity and Glazing\n\t\n\t\nM.\t Sustainable Architectural Design\t\nFig. B.5.S1: Windows in the pedestrian transparency \nzone are kept clear of shelving and signage that \nreduce visibility by more than 50 percent.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 49,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 49\n(06/22)\nDesign Guidelines\nCommercial, Industrial, and Institutional\nG3.\t Window recesses shall be sufficient \nto support facade articulation and \nprovide surface relief, depth, and \nshadow.\nG4.\t Buildings shall have high levels of \ntransparency at the pedestrian level \non facades which face the street.\nG5.\t Non-street facing facades that have \ncustomer entries shall have sufficient \nlevels of transparency to improve the \nappearance of the facade and allow \nfor natural surveillance of the parking \narea.\nG6.\t At the pedestrian level, transparent \nglazing shall allow visual interaction \nbetween active interior spaces and \npedestrian areas on the buildings \nexterior. When this is not possible, \nwindows which provide views of \ndisplays within the building may be \nacceptable.\nDesign Standards\nCommercial, Industrial, and Institutional\nS3.\t Exterior windows shall have a minimum of 4 inch reveal \n(depth), as measured from the exterior most window pane \nand the adjacent finish building plane, to create a shadow line \nthat highlights materials and the thickness of the wall. \nS4.\t Buildings shall have a pedestrian level transparency zone \nutilizing clear glass between the heights of zero and 12 feet for \nno less than 60 percent of facades facing public streets.\nS5.\t Non-street facing facades with customer entries shall have \na pedestrian level transparency zone utilizing clear glass \nbetween the heights of zero  and 12 feet for 40 percent of \nthe wall area within 30 feet of the entry (as measured from \nthe center of the doorway).  The length of this enhanced \ntransparency zone may be reduced to the end of the tenant \nspace that utilizes the entry if the transparency zone extends \nbeyond that tenant’s space.\na.\t Outside the enhanced transparency zone, building shall \nhave a pedestrian level transparency zone utilizing clear \nglass between the heights of zero and 12 feet for no less \nthan 20 percent of facades with customer entries.\nS6.\t Display windows that do not provide views into the \ncommercial space may count towards up to 25 percent of \nthe pedestrian level transparency requirement if the display \nextends a minimum of four 4 feet into the building and \ncontains three dimensional (3D) objects such as product \ndisplays. Window boxes added to the exterior of the building \nare not permitted.\n5.\t Transparency, Continued\nFig. B.5.S4.  High levels of transparency add interest by allowing views into active \nspaces within the building.\nFig. B.5.S2: Decorative perforated metal panels are \nused along the street facing facade of a ground level \nparking structure to screen the interior.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 50,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 50\n(06/22)\nDesign Standards\nMultifamily\nS7.\t For multifamily developments, not including townhouse style \nand plexes, windows and/or doors utilizing clear glass shall \noccupy a minimum of 25 percent of the total street-facing \nfacade.\nMultifamily and Townhouse Style\nS8.\t Exterior windows shall have a minimum 2 inch reveal (depth), \nas measured from the exterior most window pane and the \nadjacent finish building plane, to create a shadow line that \nhighlights materials and the thickness of the wall.\nS9.\t Energy Conservation.\na.\t Windows in residential units shall be operable by building \noccupants. \nb.\t Windows shall be high quality, durable, and energy \nefficient with insulating double or triple panes. \nc.\t Sunshades shall be provided for south and west facing \nwindows at a minimum depth of 18 inches, and be \ndesigned to effectively limit summer sun and to allow \nfor winter sun penetration, as calculated at noon during \nthe summer and winter solstice, respectively. Plexes are \nexempt from this standard.\nAdditional Standards for Plexes and Townhouse Style\nS10.\tWindows and/or doors utilizing clear glass shall occupy a \nminimum of 20 percent of the total street facing facade, and \n25 percent of the street facing ground floor living units.\nDesign Guidelines\nMultifamily\nG7.\t Windows shall be used to provide \narticulation, visual interest, and \nvisibility onto the street.\nMultifamily and Townhouse Style\nG8.\t Windows and doors shall be designed \nto create depth and shadows and to \nemphasize wall thickness and give \nexpression to residential buildings.\nG9.\t Buildings shall be designed to \nconserve energy by optimizing the \ncollection of passive solar radiation \nthrough building design.\nAdditional Standards for Plexes and \nTownhouse Style\nG10.\tThe street facing facade shall be \nanimated through the use of windows.\n5.\t Transparency, Continued\nFig. B.5.S7. A significant percentage of the facade for multifamily housing utilizes \nwindows to provide visual interest and visibility to the street. \nFig. B.5.S8: Windows on multifamily buildings are \nrecessed a minimum of 2 inches, emphasizing the \nappearance of depth of the wall.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 51,
      "text": "Corridor Design District\n7.0103  Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 51\n(06/22)\nDesign Guidelines\nSee Table 7.0103(B)(6)\nAll Development \nG1.\t Materials.\na.\t The predominant building \nmaterial(s) shall be high-quality, \ndurable, and attractive.\nb.\t The predominant building \nmaterial(s) may be complimented \nwith other secondary materials \nwhich may not be appropriate on \nlarge areas of the facade.\nc.\t Accent materials, which would \ngenerally not be acceptable on \nlarge areas of the facade, may be \nused in limited areas of the facade \nto highlight architectural features.\nG2.\t Prohibited Materials. The 7.0103(B)(6)\n(S2) standard shall be met.\n6.\t Materials\nIntent:\t To ensure buildings utilize high-quality, durable and attractive \nmaterials which contribute to the aesthetic quality of the \ndevelopment.\nKey Corridor District Design Principles:\n\t\n\t\nI.\t\nDesign Excellence and Architectural Expression\n\t\n\t\nM.\t Sustainable Architectural Design\n\t\n\t\nN.\t High Quality Materials\t\nDesign Standards\nSee Table 7.0103(B)(6)\nAll Development \nS1.\t Materials.\na.\t Primary building materials shall be utilized on a minimum \nof 65 percent of each individual building facade.\nb.\t Secondary building materials are prohibited as primary \ncladding on individual building facades and shall not \nbe allowed on more than 35 percent of each individual \nbuilding facade.\nc.\t Accent building materials are permitted as accent \nmaterials on no greater than 5 percent of each individual \nbuilding facade (e.g., flashing, projecting features, \nornamentation, etc.).\nS2.\t Buildings shall not utilize materials listed as prohibited.\nFig. B.6: Multiple finishes of brick and stone are used \ntogether to establish texture in the facade.\nFig. B.6.S1-1: A mixed-use building uses brick and glass as primary materials with \nfiber cement panels used as a secondary material.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 52,
      "text": "Corridor Design District\n7.0103 Design Guidelines and Standards\nB. Building Design\nCity of Gresham Development Code\n[7.01] - 52\n(06/22)\nTable 7.0103(B)(6): Primary, Secondary, Accent and Prohibited \nMaterials\nP:  Primary Material\nS:  Secondary Material\nA: Accent Material\nN: Prohibited Material or\n     Prohibited Fencing Type\nMaterial\nCommercial, Indus­\ntrial, Institutional\nAll Residential\nBrick (full dimensional)\nP\nP\nStone/masonry1\nP\nP\nStucco2\nP\nP\nFactory or naturally finished flat, profiled, \nfluted, or ribbed metal3 panels\nP\nP\nGlass (transparent and spandrel)\nP\nP\nFinished wood, wood veneers, and wood siding\nS\nP\nFiber reinforced cement siding and panels\nS\nP\nCeramic tile\nS\nP\nConcrete blocks with integral color (ground, \npolished, or glazed finishes)\nS\nS\nConcrete (poured in place or precast)\nS\nS\nStanding seam metal3\nS\nS\nOther material as approved by the Manager or \nDesign Commission\nP/S\nP/S\nGlass block\nA\nP\nConcrete blocks with integral color (split face \nfinish)\nA\nA\nSheet Pressboard\nA\nS\nGypsum reinforced concrete (for trim elements)\nA\nA\nCorrugated metal\nA\nS\nVegetated wall panels or trellises\nA\nA\nVinyl siding\nN\nN\nT-111 Plywood\nN\nN\nExterior Insulation Finishing System (EIFS)\nN\nN\nPlastic or vinyl fencing\nN\nN\nChain link fencing\nN\nN\n6.\t Materials, Continued\nFig. B.6.S1-2: The variety of materials, primarily brick \nwhich contrasted with concrete and metals, creates \ninterest and texture on the facade.\nTable 7.0103.B.6. Notes: \n 1 Stone shall not be manufactured and shall have a depth that is in \nproportion to the height of its application.\n2 See Section 3.0103 definition for more information on Stucco application \nrequirements.\n3 Metals shall be of a size, thickness, and detailing that will remain free of \nvisual defects and visual distortion such as oil canning, ski sloping, and \nshadowing.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.069110",
  "extractor_version": "1.0.0"
}