{
  "metadata": {
    "filename": "dc-section-9.0700.pdf_id7870",
    "extracted_at": "2025-05-22T06:15:22.946805",
    "num_pages": 6,
    "title": "DC Section 9.0700",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615194525-07'00'",
    "modification_date": "D:20220615194545-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n \n[9.07]-1 \nCity of Gresham Development Code \n \n(06/22) \nSECTION 9.0700 \nNEIGHBORHOOD CIRCULATION AND  \nFUTURE STREET PLANS \nGeneral \n9.0701  Purpose \n9.0702  Applicability  \nReview and Approvals \n9.0710  Approval Criteria  \n9.0711  Filing a Future Street Plan   \n9.0712  Compliance with or Revision to Future Street Plans   \nFuture Street Plans for Plan Districts \n9.0720  Downtown Future Street Plan \n9.0721  Civic Neighborhood Future Street Plan \nCentral Rockwood Future Street Plan \n9.0730  Purpose  \n9.0731  Future Street Designation on a Development Site   \n9.0732  Requirements of Traffic Analysis  \n9.0733  Dedication of a Future Street   \nCity Initiated Future Street Plans \n9.0740  City Initiated Future Street Plans   \nGeneral \n9.0701  Purpose \nNeighborhood Circulation and Future Street Plans (referred to as Circulation Plans) provide a guide for \ntransportation circulation to the developing site and in the immediate area.  Many areas of the city do not have a \nplan for how local streets will be extended in the future to provide access to undeveloped properties and provide \nfor traffic circulation.  In planning the future extension of local streets, a conceptual alignment is designated, \nshowing how streets will connect in the future and how access could be provided to other properties in the \nimmediate area. \nA. \nA neighborhood circulation plan is a plan that depicts the existing and proposed \nvehicular/bicycle/pedestrian transportation systems, including streets, bike lanes, sidewalks, \nbicycle/pedestrian paths, and destination points. \nB. \nA future street plan demonstrates how access can be provided to parcels within 600 feet of the \nboundaries of the site and is a conceptual plan in that its adoption does not establish a precise alignment.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n \n[9.07]-2 \nCity of Gresham Development Code \n \n(06/22) \n9.0702  Applicability   \nA. \nThe requirements of this section shall apply as follows:   \n1. \nTo all Type II and Type III tentative partition and subdivision plans.  \n2. \nTo all design reviews, level D and E.  \n3. \nTo design reviews, level C at the discretion of the Manager. \n4. \nTo uses subject to Special Use Review, except for basic utilities.   \n5. \nTo Townhouse projects in the MDR-24, THR-SW, and HDR-PV districts. \nB. \nAn applicant is required to submit a future street plan as part of an application for development except \nwhen the applicant demonstrates to the satisfaction of the Manager one of the following: \n1. \nAn existing street or a new proposed street need not continue beyond the land to be divided in \norder to complete or extend an appropriate street system or to provide access to adjacent parcels \nwithin 600 feet of the proposed development. \n2. \nThe proposed street layout is consistent with a street pattern adopted as part of the Community \nDevelopment Code, or with an existing approved Future Street Plan. \n3. \nThe proposed street layout is consistent with an adopted Pleasant Valley master plan. \nReview and Approvals \n9.0710  Approval Criteria   \nIn reviewing a proposed circulation plan, the approving authority shall find compliance with the relevant \nportions of the Community Development Code and the following: \nA. \nA future street plan shall: \n1. \nAdequately serve traffic with an origin in, and destination to, the area of the plan; \n2. \nProvide for the logical extension, continuation, and interconnection of streets, to serve circulation \nand access needs within a district, sub-area, or neighborhood; \n3. \nProvide multi-directional access and circulation to the street system and shall avoid maze-like and \ndiscontinuous street patterns; and, \n4. \nBalance traffic distribution within an area, rather than concentrating traffic on a few streets. \nB. \nAll streets, alleys, and paths must connect on both ends to other streets, within the development and to \nexisting and planned streets outside the development.  Paths may connect on one end to pedestrian and \nbicycle destinations.  Exceptions for cul-de-sacs and dead-end streets are provided in Section \nA5.402(E). \nC. \nA neighborhood circulation system shall be designed to allow planned streets outside the development \nto extend to the existing street system in conformance with Section A5.400. \nD. \nAll future street extensions shall be planned to provide adjoining lands subject to this code provision to \nhave access that will allow its development in accordance with this code. \nE. \nPedestrian accessways shall be provided as required under Section A5.508. \n9.0711  Filing a Future Street Plan   \nUpon approval by the review authority, a Future Street Plan shall be made a matter of record by being recorded \nby the Manager on a future street index to be maintained by the Manager.   \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n \n[9.07]-3 \nCity of Gresham Development Code \n \n(06/22) \n9.0712  Compliance with or Revision to Future Street Plans   \nNew developments shall be consistent with adopted Future Street Plans and/or any applicable master plan, \nincluding but not limited to the Pleasant Valley Master Plan and future street plans for plan districts.  Where \nproposed new development is not consistent with an existing plan, the applicant shall seek revision through a \nseparate application or in conjunction with a land division or site plan review application.  In the case where the \ndevelopment is within an adopted Master Plan, a revision shall only occur through an amendment to the Master \nPlan.  A new future street plan or revision to an approved future street plan may be approved by the Manager \nunder a Type II procedure when it is applied for concurrently with a land division or site plan review \napplication.  For the purposes of this section, concurrently means development permit applications are processed \neither in conjunction with another development permit application of the same review type at the same time or \nwhen two (2) development permits of different review types are processed at the same time. A revision to an \napproved future street plan may be reviewed by the Hearings Officer under a Type III procedure when it is \napplied for independent of any land development application.   \nWhen development is proposed for a site, and a future street, as shown on adopted plan, would abut or run \nthrough the site, but dedication of right-of-way for the future street is not required due to proportionality or other \nconstraints above, the Manager may require modification of the proposed site development plan as needed to \nreserve portions of the site for future street acquisition, as a condition of approval of a development permit. Such \nmodification may include limiting any future street right-of-way portions of the site to non-building purposes, \nsuch as landscaping, or surface parking. \nAn approved future street plan may be revised by the council in conjunction with a revision to the Community \nDevelopment Code, under the Type IV procedure.  All revisions to future street plans must comply with Section \n9.0710. \nFuture Street Plans for Plan Districts \n9.0720  Downtown Future Street Plan \nA. \nThe Downtown Plan District includes a future street plan, as shown on the Gresham Downtown Plan, \ncontained in Volume 1 - Findings, of the Community Development Plan.  This future street plan shall be \ndistinct from future street plans created in connection with land divisions, or at the initiative of the \nPlanning Commission.  The future street plan as shown on the Gresham Downtown Plan shall be \nconsidered a conceptual plan, in that it does not establish precise alignments or construction details for \nany street. \nB. \nWhen development is proposed for a site, and a future street, as shown on the Gresham Downtown Plan, \nwould abut or run through the site, the site plan submitted with the development permit application shall \nindicate the conceptual alignment of the future street as it would affect the site. \nC. \nWhen a traffic analysis is required in connection with a development permit application and a future \nstreet, as shown on the Gresham Downtown Plan, would abut or run through the site, the traffic analysis \nshall include, in addition to addressing all elements specified in Section A5.411, an analysis of the \nextent to which the future street may be needed in order to maintain acceptable levels of service on \nexisting streets following the proposed development, and to satisfy provisions of Section A5.401.   \nD. \nIf the Manager finds that dedication of all or a portion of a future street, as shown on the Gresham \nDowntown Plan, is needed in order to maintain acceptable levels of service on existing streets following \nthe proposed development, or to satisfy provisions of Section A5.401, the Manager may require \ndedication of all or a portion of the future street as a condition of development permit approval.  Any \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n \n[9.07]-4 \nCity of Gresham Development Code \n \n(06/22) \nsuch required dedication shall be roughly proportional in nature and extent to the anticipated impacts of \nthe proposed development. \n9.0721  Civic Neighborhood Future Street Plan   \nA. \nThe Civic Neighborhood Plan District includes a future street plan, as shown on the Gresham Civic \nNeighborhood Plan, contained in Volume 1 - Findings, of the Community Development Plan.  This \nfuture street plan shall be distinct from future street plans created in connection with land divisions, or at \nthe initiative of the Planning Commission.  Street rights-of-way shall be dedicated, and streets shall be \nconstructed, in locations and alignments as shown on the Civic Neighborhood Plan map, except where \nadjustments are authorized in this section or under Section 4.1200. The future street plan as shown on \nthe Gresham Civic Neighborhood Plan shall be considered a conceptual plan, in that it does not \nestablish precise alignments or construction details for any street. \nB. \nWhen development is proposed for a site, and a future street, as shown on the Gresham Civic \nNeighborhood Plan, would abut or run through the site, the site plan submitted with the development \npermit application shall indicate the alignment of the future street as it would affect the site.  Street \nrights-of-way within and abutting the site shall be dedicated, and streets shall be constructed, as \nnecessary to serve the proposed development and to conform with requirements of Section 4.1200 and \nthe Public Works Standards.  \nC. \nWhen a traffic analysis is required in connection with a development permit application and a future \nstreet, as shown on the Gresham Civic Neighborhood Plan, would abut or run through the site, the \ntraffic analysis shall include, in addition to addressing all elements specified in Section A5.411, an \nanalysis of the extent to which the future street may be needed in order to maintain acceptable levels of \nservice on existing streets following the proposed development, and to satisfy provisions of Section \nA5.401.  \nD. \nIf the Manager finds that dedication of all or a portion of a future street, as shown on the Gresham Civic \nNeighborhood Plan, is needed in order to maintain acceptable levels of service on existing streets \nfollowing the proposed development, or to satisfy provisions of Section A5.401, the Manager may \nrequire dedication of all or a portion of the future street as a condition of development permit approval. \nAny such required dedication shall be roughly proportional in nature and extent to the anticipated \nimpacts of the proposed development.  \nE. \nWhen development is proposed for a site, and a future street, as shown on the Gresham Civic \nNeighborhood Plan, would abut or run through the site, but dedication of right-of-way for the future \nstreet is not required under subsection (D) above, the Manager may require modification of the \nproposed site development plan as needed to reserve portions of the site for future street acquisition, as a \ncondition of approval of a development permit. Such modification may include limiting any future street \nright-of-way portions of the site to non-building purposes, such as landscaping or surface parking.  \nCentral Rockwood Future Street Plan \n9.0730  Purpose  \nThe Central Rockwood Plan includes a future street plan, as shown in Volume 1 - Findings of the Community \nDevelopment Plan (Appendix 39).  This future street plan shall be distinct from future street plans created in \nconnection with land divisions, or at the initiative of the Planning Commission.  The future street plan as shown \nin the Central Rockwood Plan shall be considered a conceptual plan, in that it does not establish precise \nalignments or construction details for any street. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n \n[9.07]-5 \nCity of Gresham Development Code \n \n(06/22) \n9.0731  Future Street Designation on a Development Site \nWhen development is proposed for a site, and a future street, as shown in the Central Rockwood Plan, would \nabut or run through the site, the site plan submitted with the development permit application shall indicate the \nconceptual alignment of the future street as it would affect the site. \n9.0732  Requirements of Traffic Analysis \nWhen a traffic analysis is required in connection with a development permit application and a future street, as \nshown in the Central Rockwood Plan, would abut or run through the site, the traffic analysis shall include, in \naddition to addressing all elements specified in Section A5.411, an analysis of the extent to which the future \nstreet may be needed in order to maintain acceptable levels of service on existing streets following the proposed \ndevelopment, and to satisfy provisions of Section A5.401.   \n9.0733  Dedication of a Future Street \nIf the manager finds that dedication of all or a portion of a future street, as shown in the Central Rockwood Plan, \nis needed in order to maintain acceptable levels of service on existing streets following the proposed \ndevelopment, or to satisfy provisions of Section A5.401, the manager may require dedication of all or a portion \nof the future street as a condition of development permit approval.  Any such required dedication shall be \nroughly proportional in nature and extent to the anticipated impacts of the proposed development. \nCity Initiated Future Street Plans \n9.0740  City Initiated Future Street Plans   \nThe Manager may initiate, and the Hearings Officer may adopt a future street plan for an area where there is no \nproposal for a land division under the Type III procedure.  A future street plan may be proposed, or an approved \nfuture street plan may be revised by the Council in conjunction with a revision to the Community Development \nCode, under the Type IV procedure.  City initiated future street plans shall comply with Section 9.0710. \n \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.947324",
  "extractor_version": "1.0.0"
}