{
  "metadata": {
    "filename": "dc-section-6.0500.pdf_id14098",
    "extracted_at": "2025-05-22T06:15:20.743489",
    "num_pages": 7,
    "title": "Development Code 6.0500 Middle Housing Land Division",
    "author": "Sarale Hickson",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.39",
    "creation_date": "D:20241008125622-07'00'",
    "modification_date": "D:20241016162552-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \nSection 6.0500 Middle Housing Land Division (6/2022) \nPage 6.05-1 \nSection 6.0500 Middle Housing Land Division  \nTABLE OF CONTENTS \n6.0501 Purpose \n6.0502 Applicability \n6.0503 Review Criteria and Standards \n6.0504 Procedures \n6.0505 Middle Housing Final Plat \n6.0501 PURPOSE  \nThe Middle Housing Land Division process supports homeownership by allowing lots with middle housing to \ndivide such that each middle housing dwelling is on its own lot. As used in this section, a “middle housing land \ndivision” is the division of a lot or parcel on which the development of middle housing is allowed under ORS \n197.758 (2) or (3). A Middle Housing Land Division includes both a preliminary approval and a final plat and is \nnot a land use decision or a limited land use decision under ORS 197.015. \n6.0502 APPLICABILITY  \nA. Lots in the following districts or portions of districts may be divided for middle housing development \nfollowing the Middle Housing Land Division process outlined in this section:  LDR-7, LDR-5, TR, TLDR, MDR-\n12 (lots of record only), OFR (lots of record only), LDR-GB, LDR-PV, MDR-PV, VLDR-SW, LDR-SW, DRL-1, \nDRL-2, and those portions of CMF along the NE Glisan and NE 162nd Avenue corridors.  \nB. This section applies only to Middle Housing Land Divisions permitted on or after July 1, 2022.  \nC. The Section 6.0500 Middle Housing Land Divisions process applies unless the applicant requests to use the \nprocedures in Section 6.0200. \n6.0503 REVIEW CRITERIA AND STANDARDS \nA. The Manager shall approve a Middle Housing Land Division upon finding: \n1. The parent lot or parcel is developed with Middle Housing, or the application for middle housing land \ndivision is concurrent with a building permit for construction of middle housing on the subject parcel. \nWhere the parent lot or parcel has an existing dwelling unit(s) not classified as middle housing, the \ndwelling(s) shall be converted to middle housing through the concurrent building permit. \n2. Each resulting middle housing lot shall contain exactly one dwelling unit, except for lots, parcels, or \ntracts used as common areas.  \n3. Each lot is served with utilities separately. \n4. All easements necessary for each dwelling unit shall be provided.  Easements shall ensure:  \na. Provision of and access for maintenance and replacement to all utilities; \nb. Pedestrian access from each dwelling unit to a private or public road; \nc. All dedicated driveways, parking, common use areas, shared building elements, and dedicated \ncommon area can be accessed and used. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0500 Middle Housing Land Division (7/2024) \nPage 6.05-2 \n5. Evidence submitted by the applicant demonstrates buildings or structures on a resulting middle \nhousing lot will comply with applicable building code provisions relating to new property lines and how \nbuildings or structures located on new lots/parcels will comply with Oregon Residential Specialty Code \nor Low-Rise Residential Dwelling Code, as applicable.   \nB. The Manager shall apply additional conditions to the approval of a tentative plan for a middle housing land \ndivision to: \n1. Prohibit the further division of the resulting middle housing lots or parcels. \n2. Require that a notation appear on the final plat indicating that approval was a Middle Housing Land \nDivisions under ORS 197.758 (2) or (3).  \nC. A Middle Housing Land Division does not alter the type of middle housing developed on the parent lot or \nparcel (for example a lot or parcel developed with a detached quadplex that is divided will result in four \nmiddle housing lots each developed with a quadplex unit not four single detached dwellings). \nD. Where the parent lot or parcel abuts the street and dedication or frontage improvements consistent with \nTable A5.501 were not provided when the lot or parcel was created, dedication and improvements shall \nbe provided that meet the standards of A5.500 and the Public Works Standards. \nE. The standards of Sections 6.0010-6.0412 do not apply to a Middle Housing Land Division. \n1. The Manager shall not enforce any provision in a recorded instrument affecting real property that is \nexecuted on or after August 8, 2019 if the provision would allow the development of a single detached \ndwelling on the real property but would prohibit the development of, or the partitioning or subdividing \nof lands according to the provisions of Section 6.0500 for, the following: \na. Middle housing, as defined in ORS 197.758 (Development of Middle Housing; Local Regulations); \nor \nb. An accessory dwelling unit allowed under ORS 197.312(5) (Limitation on City and County \nProhibitions – Needed Housing within UGBs). \nF. The Manager shall not require the final plat before it issues building permits, but is not responsible if \nutilities or buildings must be moved to meet code requirements relating to property line location. \nG. Planned Developments and Planned Communities. For development created through Section 6.0300 or \nORS 94.550-94.783 the following shall apply: \n1. Lots or parcels resulting from the division of land in a planned community are subject to the governing \ndocuments of the planned community and are allocated assessments and voting right on the same \nbasis as existing units.  \n2. Judicial partition by division of a lot in a planned community is not allowed unless: \na. The declaration expressly allows the division of lots in a planned community; or \nb. The lot may be divided under ORS 94.776 (Restrictions on Allowable Maximum Density \nProhibited). \n3. The lot may be partitioned by sale and divisions of the proceeds under ORS 105.245 (Sale or Partition \nOrdered by Court).  \n4. The restrictions noted in subsection (2) above do not apply if the homeowners association has \nremoved the property from the provisions of the declaration.  \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0500 Middle Housing Land Division (7/2024) \nPage 6.05-3 \n6.0504 PROCEDURES  \nA Middle Housing Land Division is not land use procedure. Unless the applicant requests to use the procedures \nin Section 6.0200 – Partitions and Subdivisions (a Type II land use procedure), the following procedure for \nMiddle Housing Land Division shall be followed. \nA. Pre-Application Conference.  A pre-application conference is not required. \nB. Neighborhood Meeting. A neighborhood meeting is not required. \nC. Application Requirements. Applications for development permits shall be submitted upon forms \nestablished by the Manager.  Applications will not be accepted in partial submittals.  All of the following \nitems must be submitted to initiate the completeness review: \n1. Application form, including required notarized signature(s) that demonstrate consent of all owners of \nthe affected property; \n2. Deed, title report, or other proof of ownership; \n3. Information addressing the criteria of Section 6.0502 in sufficient detail for review and action; \n4. Plans required for the particular type of application as noted by staff on the application checklist;  \n5. Application narrative to address applicable code approval criteria and standards as noted on the \napplication checklist; and  \n6. Payment of the required fee.  \nD. Completeness Review. The Manager shall review the application submittal and advise the applicant in \nwriting whether the application is complete or incomplete within 21 calendar days after the City receives \nthe application submittal.   \n1. Incompleteness shall be based solely on failure to pay required fees, failure of the applicant’s narrative \nto address the relevant criteria or development standards, or failure to supply the required \ninformation listed in the checklist and shall not be based on differences of opinion as to quality or \naccuracy.  Determination that an application is complete indicates only that the application contains \nthe information necessary for a qualitative review of compliance with the Development Code \nstandards.  \n2. If the application was complete when first submitted or the applicant submits the additional \ninformation within 180 days of the date the application was first submitted, approval or denial of the \napplication shall be based upon the standards and criteria that were in effect at the time the \napplication was first submitted.  \n3. If an application is incomplete, the completeness notice shall list what information is missing and allow \nthe applicant to submit the missing information. The completeness notice shall include a form, \ndesigned to be returned to the Manager by the applicant, indicating whether or not the applicant \nintends to amend or supplement the application.  \nE. Notification.  \n1. The Manager shall provide written notice of the receipt of the completed application for a Middle \nHousing Land Division to all of the following: \na. The applicant and/or authorized representative;  \nb. The owner(s) of record of the subject property;  \nc. Any City-recognized neighborhood association whose boundaries include or are within 100 feet of \nthe subject property;  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0500 Middle Housing Land Division (7/2024) \nPage 6.05-4 \nd. Owners of record within 100 feet of the perimeter of the subject property; and  \ne. Affected City departments, governmental agency, or special district responsible for providing \npublic facilities or services which is entitled to notice under an intergovernmental agreement with \nthe City which includes provision for such notice or is otherwise entitled to such notice.  \n2. The notice shall state: \na. The street address or other easily understood geographical reference to the subject property; \nb. A time and place where copies of all evidence submitted by the applicant will be available for \nreview; \nc. The applicable criteria for the decision; \nd. The name and telephone number of a local government contact person; \ne. A brief summary of the local decision-making process for the Middle Housing Land Division; \nf. That issues that may provide the basis for an appeal to the hearings officer must be raised in \nwriting prior to the expiration of the comment period;  \ng. That issues must be raised with sufficient specificity to enable the local government to respond to \nthe issue; and \nh. The place, date and time that comments are due.  \n3. For purposes of appeal to the hearings officer under ORS 197.375 (Appeal of Local Government to \nReferee; Court of Appeals), this requirement shall be deemed met when the Manager can provide an \naffidavit or other certification that such notice was given.  \n4. After notification according to the procedure set out above, the Manager shall provide a 14-day period \nfor submission of written comments prior to the decision. \nF. Decision: The Manager shall make a decision to approve or deny the application within 63 days of receiving \na completed application, based on whether it satisfies the applicable requirements of Section 6.0500. \n1. Approval may include conditions to ensure that the application meets the applicable regulations.  \n2. For applications subject to Section 6.0500, the Manager: \na. Shall not hold a hearing on the application; and \nb. Shall issue a written determination of compliance or noncompliance with applicable land use \nregulations that includes a summary statement explaining the determination.  \n3. The decision shall include a statement of the facts upon which the decision authority relied to \ndetermine whether the application satisfied or failed to satisfy each applicable approval. \n4. Notice of the decision shall be provided to the applicant and to those who received notice under \nsubsection (1) of this section within 63 days of the date of a completed application. The notice of \ndecision shall include: \na. The summary statement described in (2)(b) of this subsection; and  \nb. An explanation of appeal rights under ORS 197.375 (Appeal of decision on application for \nexpedited land division). \nG. Appeals: An appeal of a decision made under this section shall be made as follows: \n1. An appeal must be filed within fourteen (14) calendar days of mailing of the notice of the decision, or, \nin the case of weekends and holidays, the next business day, and be accompanied by the applicable \ndeposit for costs. \n2. A decision may be appealed by: \na. The applicant; or \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0500 Middle Housing Land Division (7/2024) \nPage 6.05-5 \nb. Any person or organization who filed written comments within the 14-day comment period.  \n3. An appeal shall be based solely on allegations: \na. Of violation of the substantive provisions of the applicable land use regulations; \nb. Of unconstitutionality of the decision; \nc. That the application is not eligible for review under Section 6.0500 or ORS 197.360 to 197.380 and \nshould be reviewed as a land use decision or limited land use decision; or \nd. That the parties’ substantive rights have been substantially prejudiced by an error in procedure. \n4. The Hearings Officer shall act as the referee for appeals of a decision made under this section and ORS \n197.360 and 197.365. \n5. Within seven days of receiving the appeal, the City, on behalf of the hearings officer, shall notify the \napplicant, the appellant if other than the applicant, any person or organization entitled to notice under \nSection 6.0504(E) that provided written comments to the local government, and all providers of public \nfacilities and services entitled to notice under Section 6.0504(E), and advise them of the manner in \nwhich they may participate in the appeal. A person or organization that provided written comments to \nthe local government but did not file an appeal under subsection (1) of this section may participate \nonly with respect to the issues raised in the written comments submitted by that person or \norganization. The hearings officer may use any procedure for decision-making consistent with the \ninterests of the parties to ensure a fair opportunity to present information and argument. The hearings \nofficer shall provide the local government an opportunity to explain its decision but is not limited to \nreviewing the local government decision and may consider information not presented to the local \ngovernment. \n6. The hearings officer shall apply the requirements of this section and ORS 197.360. If the hearings \nofficer determines that the application does not qualify as an expedited land division [as described in \nORS 197.360] or a middle housing land division, as defined in Section 6.0501, the hearings officer shall \nremand the application for consideration as a land use decision or limited land use decision. In all \nother cases, the hearings officer shall seek to identify means by which the application can satisfy the \napplicable requirements. \n7. The hearings officer shall not reduce the density of the land division application. \n8. The hearings officer shall make a written decision approving or denying the application, or approving it \nwith conditions designed to ensure that the application satisfies the land use regulations, within 42 \ndays of the filing of an appeal. The hearings officer shall not remand the application to the local \ngovernment for any reason other than as set forth in this subsection. \n9. Unless the City Council finds exigent circumstances, a hearings officer who fails to issue a written \ndecision within 42 days of the filing of an appeal shall receive no compensation for service as hearings \nofficer in the appeal. \n10. Notwithstanding any other provision of law, the hearings officer shall order the local government to \nrefund the deposit for costs to an appellant who materially improves his or her position from the \ndecision of the local government. The hearings officer shall assess the cost of the appeal in excess of \nthe deposit for costs, up to a maximum of $500, including the deposit paid under subsection (1) of this \nsection, against an appellant who does not materially improve his or her position from the decision of \nthe local government. The local government shall pay the portion of the costs of the appeal not \nassessed against the appellant. The costs of the appeal include the compensation paid the hearings \nofficer and costs incurred by the local government, but not the costs of other parties. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0500 Middle Housing Land Division (7/2024) \nPage 6.05-6 \n11. The Land Use Board of Appeals does not have jurisdiction to consider any decisions, aspects of \ndecisions or actions made under ORS 197.360 to 197.380 (Expedited and Middle Housing Land \nDivisions) or this section. \n12. Any party to a proceeding before a hearings officer under this section may seek judicial review of the \nhearings officer’s decision in the manner provided for review of final orders of the Land Use Board of \nAppeals under ORS 197.850 and 197.855. The Court of Appeals shall review decisions of the hearings \nofficer in the same manner as provided for review of final orders of the Land Use Board of Appeals in \nthose statutes. However, notwithstanding ORS 197.850 (9) or any other provision of law, the court \nshall reverse or remand the decision only if the court finds: \na. That the decision does not concern an expedited land division as described in ORS 197.360 or \nMiddle Housing Land Division as defined in Section 6.0501 and the appellant raised this issue in \nproceedings before the hearings officer; \nb. That there is a basis to vacate the decision as described in ORS 36.705 (1)(a) to (d), or a basis for \nmodification or correction of an award as described in ORS 36.710; or \nc. That the decision is unconstitutional. \nH. Expiration. The tentative approval of a Middle Housing Land Division is void if a final plat is not recorded \nwithin three years of the tentative approval. \n6.0505 MIDDLE HOUSING FINAL PLAT  \nA. The final plat shall comply with the Middle Housing Land Division conditions of approval.  \nB. The following data requirements, if applicable, shall also be shown on the final plat.  \n1. All tracts of land intended to be deeded or dedicated for public use;  \n2. Street names as approved by the Manager on the preliminary final plat copies in accordance with the \nCity of Gresham Street Naming and Property Addressing Guidelines;  \n3. Any non-access strips. \nC. Approval Criteria. The Manager shall approve or deny the final plat for the Middle Housing Land Division. \nApproval shall be based on the following criteria:  \n1. Lands to be deeded or dedicated for public use are provided for on the final plat or on separate \ndocuments. \n2. An approved guarantee of completion is provided for required public improvements that have not \nbeen completed and accepted by the City.  \n3. An approved grading and drainage plan is provided if grading is required.  \n4. Approved construction drawings for required public improvements are provided.  \n5. All conditions of Middle Housing Land Division approval have been met and the final plat substantially \nconforms to the provisions of the approved Middle Housing Land Division.  \nD. Recordation. Following review and Manager’s approval of a final partition plat, the applicant shall take the \nfollowing actions:  \n1. Obtain the approval signature on the final Middle Housing Land Division plat by the County Surveyor \ncertifying that the final partition plat complies with all applicable survey laws. Before certifying, the \nsurveyor may make field investigations to verify that the plat survey is sufficiently accurate. If the \nsurveyor determines that the plat does not comply, the applicant shall make corrections. When the \nsurveyor determines that the plat conforms, the surveyor shall sign and date the plat.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0500 Middle Housing Land Division (7/2024) \nPage 6.05-7 \n2. A Notice of Middle Housing Land Division for each middle housing lot shall be recorded with the \ncounty recorder that states:  \na. The middle housing lot may not be further divided. \nb. No more than one unit may be developed on each middle housing lot. \nc. The dwelling developed on the middle housing lot is a unit of middle housing and is not any other \nhousing type. \n3. File a statement of water right and, if a water right is appurtenant, a copy of the acknowledgment \nfrom the Water Resources Department.  \n4. Deliver the approved final partition plat and accompanying documents to the county recorder for \nrecording. \n5. Return a copy of the recorded Notices of Middle Housing Land Division to the City for filing.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.743847",
  "extractor_version": "1.0.0"
}