{
  "metadata": {
    "filename": "dc-section-5.0100.pdf_id7844",
    "extracted_at": "2025-05-22T06:15:22.470879",
    "num_pages": 8,
    "title": "DC Section 5.0100",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220615153828-07'00'",
    "modification_date": "D:20220615153852-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[5.01]-1 \nCity of Gresham Development Code \n \n(01/19) \nSECTION 5.0100 \nFLOODPLAIN OVERLAY DISTRICT \nGeneral \n5.0101  Introductory Provisions  \n5.0102  Warning and Disclaimer of Liability   \n5.0103  Interpretation of FIRM Boundaries   \n5.0104 Applicability  \nPermitted Uses \n5.0110  Permitted Land Uses   \nDevelopment Standards \n5.0120  Standards for Development in the Floodplain Overlay District  \n5.0121  Floodways   \n5.0122  Coordination With Other Regulatory Agencies   \n5.0123  Information to be Obtained and Maintained   \n5.0124  Alteration of Watercourses  \n5.0125  Flood Management Performance Standards \n5.0126  Standards for Shallow Flooding Areas (AO Zones) \n \nGeneral \n5.0101  Introductory Provisions   \nProvisions of this section apply to all areas within the Floodplain Overlay District as designated on the \nCommunity Development Special Purpose District Map. This designation shall apply to all areas of special \nflood hazard within the city. The areas of special flood hazard north of NE Halsey identified by the Federal \nInsurance Administration in scientific and engineering reports entitled, “Flood Insurance Study, Multnomah \nCounty, Oregon and Incorporated Areas”, December 18, 2009 with the accompanying maps entitled “Flood \nInsurance Rate Map, Multnomah County, Oregon and Incorporated Areas”, December 18, 2009 and the areas of \nspecial flood hazard south of NE Halsey identified by the Federal Insurance Administration in scientific and \nengineering reports entitled “Flood Insurance Study, Multnomah County, Oregon and Incorporated Areas”, \nFebruary 1, 2019 with the accompanying maps entitled “Flood Insurance Rate Map, Multnomah County, \nOregon and Incorporated Areas”, February 1, 2019 are hereby adopted by reference and declared to be a part of \nthis code. When base flood elevation data has not been provided in these flood insurance studies and maps, the \nManager may obtain, review, and reasonably utilize any base flood elevation and floodway data available from a \nfederal, state, or other source in order to administer provisions applying to the Floodplain Overlay District. \n5.0102  Warning and Disclaimer of Liability   \nThe degree of flood protection required by this ordinance is considered reasonable for regulatory purposes and is \nbased on scientific and engineering considerations. Larger floods can and will occur on rare occasions. Flood \nheights may be increased by man-made or natural causes. This code does not imply that land outside the areas of \nspecial flood hazards or uses permitted within such areas will be free from  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[5.01]-2 \nCity of Gresham Development Code \n \n(01/19) \nflooding or flood damages. This code shall not create liability on the part of the City, any officer or  \nemployee thereof, or the Federal Insurance Administration, for any flood damages that result from reliance on \nthis ordinance or any administrative decision lawfully made hereunder. \n5.0103  Interpretation of FIRM Boundaries   \nThe Manager shall determine the exact location of the boundaries of the areas of special flood hazards (for \nexample, where there appears to be a conflict between a mapped boundary and actual field conditions), based on \ndata referenced in Section 5.0101. Any person contesting the determination of the Manager may appeal such \ndetermination as provided in Section 11.0302. \n5.0104  Applicability  \nA. \nThe Manager is hereby appointed to administer, implement and enforce this Section (Floodplain \nOverlay District) by granting or denying development permits in accordance with its provisions. Permits \nshall be required as provided in Section 11.0101 and Section 11.0204. Exemption from building permit \ndoes not exempt a development from requiring a floodplain development permit. \n1. \nAn application for a floodplain development permit shall be reviewed by the Manager under the \nType II procedure unless otherwise specified. \n2. \nActivities listed in Section 11.0102(D), (E) and (F) shall be reviewed by the Manager under the \nType I procedure. \nB. \nWhere applicants are proposing development within the Floodplain Overlay District, they must comply \nwith the Development Standards found in Section 5.0120. \nC. \nWhere applicants are proposing development within the Floodway, they must comply with the \nDevelopment Standards found in Section 5.0121. \nD. \nIn flood prone areas where elevation data is not available either through the Flood Elevation Study or \nFIRM, applications for building permits shall be reviewed to assure that proposed construction will be \nreasonably safe from flooding. The test of reasonableness is a local judgement and includes use of \nhistorical data, high water marks, photographs of past flooding, where available. \nE. \nApplications for development in the Floodplain Overlay District shall include: \n1. \nPre- and post-development plans showing the grades, and all structures, utilities, paving, fencing, \nand use areas. \n2. \nElevation in relation to mean sea level, of the lowest floor (including basement) of all structures. \n3. \nElevation in relation to mean sea level of floodproofing in any structure. \n4. \nCertification by a registered professional engineer or architect that the floodproofing methods for \nany nonresidential structure meet the floodproofing criteria in Section 5.0120(E)(1), \n5.0120(F)(1) and 5.0120(G)(1). \n5. \nDescription of the extent to which a watercourse will be altered or relocated as a result of \nproposed development. \n6. \nFor repair or improvement of an existing structure, a cost estimate or itemized estimate including \nthe materials and labor for qualifying work. \n7. \nA copy of any documents submitted to the state and federal government regarding the \ndevelopment (including, but not limited to, CLOMR, LOMR, LOMA and Joint Removal/Fill \nPermit applications). \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[5.01]-3 \nCity of Gresham Development Code \n \n(01/19) \nPermitted Uses \n5.0110  Permitted Land Uses  \nUses permitted in the Floodplain Overlay District shall be those listed as permitted in the underlying district \ndesignated for the site. Within areas of special flood hazard which are also designated as Hillside and Geologic \nRisk Overlay, Natural Resources Overlay or Open Space (OS) Overlay Districts, development shall be permitted \nonly in accordance with provisions of those special purpose districts. In Floodplain Overlay Districts within the \nFairview Creek, Burlingame Creek, and Kelly Creek drainage basins, proposed developments shall demonstrate \nconsistency with guidelines and recommendations of the master storm drain plan for that stream. In addition, \nany proposal for development within the Floodplain Overlay District shall be accompanied by documentation \nprepared by a registered civil engineer demonstrating to the satisfaction of the Manager that the development: \nA. \nWill not result in an increase in floodplain area on other properties;  \nB. \nWill not reduce natural flood storage volumes; and \nC. \nWill not result in an increase in erosive velocity of the stream that may cause channel scouring or reduced \nslope stability downstream of the development. Stream velocity following development shall not exceed \nfindings and recommendations of the storm drainage master plan for the affected stream. \n \nDevelopment Standards \n5.0120  Standards for Development in the Floodplain Overlay District   \nIn addition to standards applying to development within the underlying Plan Map district, the following \nstandards shall apply to development proposed within the Floodplain Overlay District: \nA. \nAnchoring \n1. \nAll new construction and substantial improvements shall be anchored to prevent flotation, \ncollapse, or lateral movement of the structure. \n2. \nAll manufactured homes must likewise be anchored to prevent flotation, collapse, or lateral \nmovement, and shall be installed using methods and practices that minimize flood damage. \nAnchoring methods may include, but are not limited to, use of over-the-top or frame ties to \nground anchors. \nB. \nConstruction Materials and Methods \n1. \nAll new construction and substantial improvements shall be constructed with materials and utility \nequipment resistant to flood damage. \n2. \nAll new construction and substantial improvements shall be constructed using methods and \npractices that minimize flood damage. \n3. \nElectrical, heating, ventilation, plumbing, and air-conditioning equipment and other service \nfacilities shall be designed and/or otherwise elevated or located so as to prevent water from \nentering or accumulating within the components during conditions of flooding. \nC. \nUtilities \n1. \nAll new and replacement water supply systems shall be designed to minimize or eliminate \ninfiltration of flood waters into the system. \n2. \nNew and replacement sanitary sewage systems shall be designed to minimize or eliminate \ninfiltration of flood waters into the systems and discharge from the systems into flood waters. \n3. \nOn-site waste disposal systems shall be located to avoid impairment to them or contamination \nfrom them during flooding. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[5.01]-4 \nCity of Gresham Development Code \n \n(01/19) \nD. \nSubdivision Proposals \n1. \nAll subdivision proposals shall be consistent with the need to minimize flood damage. \n2. \nAll subdivision proposals shall have public utilities and facilities such as sewer, gas, electrical, \nand water systems located and constructed to minimize flood damage. \n3. \nAll subdivision proposals shall have adequate drainage provided to reduce exposure to flood \ndamage. \n4. \nWhere base flood elevation data has not been provided or is not available from another \nauthoritative source, it shall be generated for subdivision proposals and other proposed \ndevelopments which contain at least 50 lots or 5 acres, whichever is less. \nE. \nResidential Construction \n1. \nNew construction and substantial improvement of any residential structure shall have the lowest \nfloor, including basement, elevated to or above base flood elevation plus one foot. \n2. \nFully enclosed areas below the lowest floor that are subject to flooding are prohibited or shall be \ndesigned to automatically equalize hydrostatic flood forces on exterior walls by allowing for the \nentry and exit of floodwaters. Designs for meeting this requirement must either be certified by a \nregistered professional engineer or architect or must meet or exceed the following minimum \ncriteria: \na. \nA minimum of two openings having a total net area of not less than one square inch for \nevery square foot of enclosed area subject to flooding shall be provided. \nb. \nThe bottom of all openings shall be no higher than one foot above grade. \nc. \nOpenings may be equipped with screens, louvers, or other coverings or devices provided \nthat they permit the automatic entry and exit of floodwaters. \n3. \nBelow grade crawl spaces are allowed subject to the current Oregon Residential Specialty Code \nSection R324. \n4. \nDevelopment in the AH zone shall provide drainage paths around structures on slopes to guide \nfloodwaters around and away from proposed structures. \nF. \nNon-Residential Construction \n1. \nNew construction and substantial improvement of any commercial, industrial, institutional or \nother non-residential structure shall either have the lowest floor, including basement, elevated to \nthe level of the base flood elevation plus one foot; or together with attendant utility and sanitary \nfacilities, shall: \na. \nBe floodproofed so that below the base flood level the structure is watertight with walls \nsubstantially impermeable to the passage of water; \nb. \nHave structural components capable of resisting hydrostatic and hydrodynamic loads and \neffects of buoyancy; \nc. \nBe certified by a registered professional engineer or architect to have design and methods \nof construction which are in accordance with accepted standards of practice for meeting \nthe intent of provisions of this subsection. \n2. \nNon-residential structures that are elevated, not flood proofed, must meet the same standards for \nspace below the lowest floor as described in Section 5.0120(E)(2). \n3. \nApplicants floodproofing non-residential buildings shall be notified that flood insurance \npremiums will be based on rates that are one foot below the floodproofed level (e.g. a building \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[5.01]-5 \nCity of Gresham Development Code \n \n(01/19) \nconstructed to the base flood level will be rated as one foot below that level). \n4. \nDevelopment in the AH zone shall provide drainage paths around structures on slopes to guide \nfloodwaters around and away from proposed structures. \nG. \nPlacement of Manufactured Dwellings \n1. \nAll manufactured dwellings to be placed or substantially improved within the Floodplain Overlay \nDistrict shall be elevated on a permanent foundation such that the bottom of the longitudinal \nchassis frame beam is at or above BFE and be securely anchored to an adequately anchored \nfoundation system in accordance with the provisions of Section 5.0120(A)(2). \n2. \nManufactured dwellings supported on solid foundation walls shall be constructed with flood \nopenings that comply with Section 5.0120(E)(2). \n3. \nElectrical crossover connections shall be a minimum of 12 inches above base flood elevation. \nH. \nRecreational Vehicles \nRecreational vehicles placed on sites are required to either: \n1. \nBe on the site for fewer than 180 consecutive days; \n2. \nBe fully licensed and ready for highway use, on its wheels or jacking system, is attached to the \nsite only by quick disconnect type utilities and security devices, and has no permanently attached \nadditions; or \n3. \nMeet the elevation requirements of Section 5.0120(G) and the anchoring requirements of Section \n5.0120(A)(2). \n \n5.0121  Floodways   \nLocated within the Floodplain Overlay District (areas of special flood hazard) are areas designated as \nfloodways.  The floodway is an extremely hazardous area due to the velocity of flood waters which carry debris, \npotential projectiles, and erosion potential.  Due to this fact, encroachments, including fill, new construction, \nsubstantial improvements, retaining walls, and other development shall be prohibited.   \nA. \nNew installations of manufactured dwellings in the floodway are prohibited (2002 Oregon \nManufactured Dwelling and Park Specialty Code).  Manufactured dwellings may only be located in \nfloodways according to one of the following conditions: \n1. \nIf the manufactured dwelling already exists in the floodway, the placement was permitted at the \ntime of the original installation, and the continued use is not a threat to life, health, property, or \nthe general welfare of the public; or \n2. \nA new manufactured dwelling is replacing an existing manufactured dwelling whose original \nplacement was permitted at the time of installation and the replacement home will not be a threat \nto life, health, property, or the general welfare of the public and it meets the following criteria: \na. \nAs required by 44 CFR Chapter 1, Subpart 60.3(d)(3), it must be demonstrated through \nhydrologic and hydraulic analyses performed in accordance with standard engineering \npractices that the manufactured dwelling and any accessory buildings, accessory \nstructures, or any property improvements (encroachments) will not result in any increase \nin flood levels during the occurrence of the base flood discharge; \nb. \nThe replacement manufactured dwelling and any accessory buildings or accessory \nstructures (encroachments) shall have the finished floor elevated a minimum of 18 inches \n(46 cm) above the BFE as identified on the Flood Insurance Rate Map; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[5.01]-6 \nCity of Gresham Development Code \n \n(01/19) \nc. \nThe replacement manufactured dwelling is placed and secured to a foundation support \nsystem designed by an Oregon professional engineer or architect and approved by the \nauthority having jurisdiction; \nd. \nThe replacement manufactured dwelling, its foundation supports, and any accessory \nbuildings, accessory structures, or property improvements (encroachments) do not \ndisplace water to the degree that it causes a rise in the water level or diverts water in a \nmanner that causes erosion or damage to other properties; \ne. \nThe location of a replacement manufactured dwelling is allowed by the local planning \ndepartment’s ordinances; and \nf. \nAny other requirements deemed necessary by the authority having jurisdiction. \nB. \nExceptions to this prohibition are fences (except walls or footings for a fence that change the shape of \nthe floodway), public bridges, outfall structures, and fire hydrants which are allowed subject to \nstandards established in the City Public Works Standards. \n \nAs required by 44 CFR Chapter 1, Subpart 60.3(d)(3), it must be demonstrated through hydrologic and \nhydraulic analyses performed in accordance with standard engineering practices that the fences and \npublic bridges, and outfall structures will not result in any increase in flood levels during the occurrence \nof the base flood discharge. \n \n5.0122  Coordination With Other Regulatory Agencies   \nPrior to issuance of a development permit for development within the Floodplain Overlay District, an applicant \nshall provide evidence to the Manager that all necessary permits have been obtained from other federal, state, \nand local government agencies involved in regulating development activity within and adjacent to areas of \nspecial flood hazard. \n \n5.0123  Information to be Obtained and Maintained   \nA. \nWhere base flood elevation data is provided as required in Section 5.0101, the Manager shall obtain and \nrecord the actual elevation (in relation to mean sea level) of the lowest floor (including basement) of all \nnew or substantially improved structures, for which a development permit has been issued in the \nFloodplain Overlay District. \nB. \nFor all new or substantially improved floodproofed structures, the Manager shall: \n1. \nVerify and record the actual elevation (in relation to mean sea level), and \n2. \nMaintain the certifications of registered engineers and architects required in conformance with \nthese provisions. \nC. \nAll records pertaining to development permits issued within the Floodplain Overlay District will be \nmaintained for public inspection. \nD. \nThe applicant shall provide new technical data: \n1. \nWhen an applicant has obtained a Conditional Letter of Map Revision (CLOMR) from FEMA, or \nwhen development altered a watercourse, modified floodplain boundaries, or modified Base Flood \nElevations, applicant shall provide evidence that they have notified FEMA within six months of \nproject completion. This notification shall be provided as a Letter of Map Revision (LOMR). \n2. \nThe applicant shall be responsible for preparing technical data to support the LOMR application \nand paying any processing or application fees to FEMA. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[5.01]-7 \nCity of Gresham Development Code \n \n(01/19) \n3. \nThe Manager shall be under no obligation to sign the Community Acknowledgement Form, which \nis part of the CLOMR/LOMR application, until the applicant demonstrates that the project will or \nhas met the requirements of this code and all applicable State and Federal laws. \n4. \nNotify the Federal Insurance Administrator (in writing) of any acquisition by means of \nannexation, incorporation or otherwise, of additional areas of jurisdiction. \n \n5.0124  Alteration of Watercourses   \nA. \nWhen development activity is proposed which would result in relocation or alteration of a watercourse \nlying within a Floodplain Overlay District, the Manager shall cause notice of the proposed development \nto be mailed to those jurisdictions through which the watercourse passes, to the Division of State Lands, \nand to the State Department of Land Conservation and Development. \nB. \nThe Manager shall approve issuance of a development permit for proposed relocation or alteration of a \nwatercourse only when the following criteria are satisfied: \n1. \nSatisfactory documentation, prepared by a registered professional engineer, shall be submitted \ndemonstrating that such development will not diminish the flood carrying capacity of the \nwatercourse within the altered or relocated portion of said watercourse. \n2. \nA plan providing for on-going maintenance of the watercourse and adjacent land areas adequate to \nmaintain the flood carrying capacity of the watercourse shall be prepared and submitted. \n \n5.0125  Flood Management Performance Standards   \nA. \nAll development, excavation and fill in the Floodplain Overlay District shall conform to the following \nperformance standards. \n1. \nDevelopment, excavation and fill shall be performed in a manner to maintain or increase flood \nstorage and conveyance capacity and not increase design flood elevations. \n2. \nAll fill placed at or below the design flood elevation in the Floodplain Overlay District shall be \nbalanced with at least an equal amount of soil material removal. \n3. \nExcavation shall not be counted as compensating for fill if such areas will be filled with water in \nnon-storm winter conditions. \n4. \nTemporary fills permitted during construction shall be removed. \n5. \nUncontained areas of hazardous materials as defined by DEQ in the Floodplain Overlay District \nshall be prohibited. \n6. \nDevelopment, excavation and fill shall be performed in a manner to maintain or increase slope \nstability and maintain or decrease erosive velocities. \nB. \nThe following uses and activities are not subject to the requirements of Subsection (A) above: \n1. \nExcavation and fill necessary to plant new trees or vegetation. \n2. \nExcavation and fill required for the construction of public detention facilities or structures, and \nother facilities specifically designed to reduce or mitigate flood impacts.  Such facilities shall not \nbe used to create new buildable lands. \n3. \nNew culverts, stream crossings, and transportation projects may be permitted only if designed as \nbalanced cut and fill projects or designed to not raise the design flood elevation.  Such projects \nshall be designed to minimize the area of fill in the Floodplain Overlay District and to minimize \nerosive velocities.  Stream crossing shall be as close to perpendicular to the stream as practicable.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[5.01]-8 \nCity of Gresham Development Code \n \n(01/19) \nBridges shall be used instead of culverts wherever practicable. \n \n5.0126  Standards for Shallow Flooding Areas (AO Zones)   \nShallow flooding areas appear on the Flood Insurance Rate Maps (FIRM) as AO zones with depth designations.  \nThe base flood depths in these zones range from 1 to 3 feet above ground where a clearly defined channel does \nnot exist, or where the path of flooding is unpredictable and where velocity flow may be evident.  Such flooding \nis usually characterized as sheet flow.  In these areas, the following provisions apply: \nA. \nNew construction and substantial improvements of residential structures and manufactured homes \nwithin AO zones shall have the lowest floor (including basement) elevated above the highest grade \nadjacent to the building, a minimum of one foot above the depth number specified on the FIRM (at least \ntwo feet if no depth number is specified). \nB. \nNew construction and substantial improvements of nonresidential structures within AO zones shall \neither: \n1. \nHave the lowest floor (including basement) elevated above the highest adjacent grade of the \nbuilding site, one foot or more above the depth number specified on the FIRM (at least two feet if \nno depth number is specified); or \n2. \nTogether with attendant utility and sanitary facilities, be completely flood proofed to or above that \nlevel so that any space below that level is watertight with walls substantially impermeable to the \npassage of water and with structural components having the capability of resisting hydrostatic and \nhydrodynamic loads and effects of buoyancy.  If this method is used, compliance shall be certified \nby a registered professional engineer or architect as in Section 5.2-2(3). \nC. \nRequire adequate drainage paths around structures on slopes to guide floodwaters around and away \nfrom proposed structures. \nD. \nRecreational vehicles placed on sites within AO Zones on the community’s FIRM either: \n1. \nBe on the site for fewer than 180 consecutive days, be fully licensed and ready for highway use, \non its wheels or jacking system, is attached to the site only by quick disconnect type utilities and \nsecurity devices, and has no permanently attached additions; or \n2. \nMeet the requirements of above subsections A, B, and C and the elevation and anchoring \nrequirements for manufactured homes contained in Sections 5.0120(G) and 5.0120(A)(2). \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.471236",
  "extractor_version": "1.0.0"
}