{
  "metadata": {
    "filename": "dc-section-11.1000.pdf_id7896",
    "extracted_at": "2025-05-22T06:15:23.218412",
    "num_pages": 6,
    "title": "DC Section 11.1000",
    "author": "Katie",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615201705-07'00'",
    "modification_date": "D:20220615201729-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[11.10]-1 \nCity of Gresham Development Code \n \n(10/18) \nSECTION 11.1000 \nPUBLIC HEARINGS \n11.1000  Public Hearings  \n11.1001  Responsibility of Manager \n11.1002  General Public Notice Requirements \n11.1003  Rules of Procedure \n11.1004  Challenges to Impartiality \n11.1005  Disqualification \n11.1006  Participation by Interested Officers or Employees \n11.1007  Ex Parte Contacts \n11.1008  Abstention or Disqualification \n11.1009  Rights of Abstaining or Disqualified Member \n11.1010  Burden and Nature of Proof \n11.1011  Order of Proceedings \n11.1012  Continuance of Hearing \n11.1013  Decision \n11.1014  Findings and Order \n11.1015  Record of Proceedings \n \n11.1000 \nPublic Hearings  \n11.1001  Responsibility of Manager for Public Hearings \nThe Manager shall:  \nA. \nSchedule land use applications for review and public hearing before the appropriate review authority as \nrequired for the particular application procedure by Table 11.0204.  \nB. \nProvide public notice of the public hearing or appeal hearing.  \nC. \nPrepare minutes to include the decision on the matter heard at the public hearing, and the reasons for the \ndecision.  \nD. \nMail a copy of the decision to those required to receive such information as specified for the particular \napplication procedure.  \n11.1002  General Public Notice Requirements \nA. \nNotice of public hearings, either issued by mail, by site posting, and/or publication in a newspaper of \ngeneral circulation in the city, shall be provided for Type I – IV applications as described in the \nfollowing code sections: \n1. \nSection 11.1100 for notice requirements for a public hearing on an appeal of a Type I decision.  \n2. \nSection 11.1100 for notice requirements for a public hearing on an appeal of a Type II decision. \n3. \nSection 11.0500 for notice requirements for a public hearing on a Type III application and \nSection 11.1100 for notice requirements for a public hearing on an appeal of a Type III decision.  \n4. \nSection 11.0600 for notice requirements for a public hearing on a Type IV application.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[11.10]-2 \nCity of Gresham Development Code \n \n(10/18) \nB. \nAll public notices shall be deemed to have been provided or received upon the date the notice is \ndeposited in the mail or personally delivered, whichever occurs first.  \nC. \nCost of the initial public notice shall be included in the development permit application fee.  \n11.1003  Rules of Procedure \nPublic hearings shall be conducted in accordance with the rules of procedure adopted by the hearing body.  \nProvisions regarding challenges to impartiality, disqualification, abstention, participation by interested officers \nor employees, ex parte contacts, burden of proof, and the order of proceedings, as referenced in the Gresham \nRevised Code and below are applicable to all public hearings.  \n11.1004  Challenges to Impartiality  \nA. \nExcept for Type IV hearings, a party to a hearing or a member of a hearing body may challenge the \nqualifications of a member of the hearing body to participate in the hearing and decision.  The challenge \nshall state by affidavit the facts relied upon by the challenger relating to a person’s bias, prejudgment, \npersonal interest, or other facts from which the challenger has concluded that the member of the hearing \nbody cannot participate in an impartial manner.  Except for good cause shown, the challenge shall be \ndelivered by personal service to the Manager not less than 48 hours preceding the time set for the public \nhearing.  \nB. \nThe Manager shall attempt to notify the person whose qualifications are challenged prior to the meeting.  \nThe challenged person shall have an opportunity to respond orally and in writing to the challenge.  The \nchallenge shall be incorporated into the record of the hearing.  \n11.1005  Disqualification  \nExcept for Type IV hearings, no member of a hearing body may participate in a discussion of the proposal or \nvote on the proposal when any of the following conditions exist:  \nA. \nAny of the following have a direct or substantial financial interest in the proposal:  the member or the \nmember’s spouse, brother, sister, child, parent, father-in-law, mother-in-law, any business in which the \nmember is then serving or has served within the previous two years, or any business with which the \nmember is negotiating for or has an arrangement or understanding concerning prospective partnership or \nemployment.  \nB. \nThe member owns property within the area entitled to receive notice of the public hearing.  \nC. \nThe member has a direct private interest in the proposal.  \nD. \nFor any other valid reason, the member has determined that participation in the hearing and decision \ncannot be in an impartial manner.  \n11.1006  Participation by Interested Officers or Employees  \nNo officer or employee of the City who has a financial or other private interest in a proposal may participate in \ndiscussion with or give an official opinion to the hearing body on the proposal without first declaring for the \nrecord the nature and extent of such interest.  \n11.1007  Ex Parte Contacts  \nExcept for Type IV hearings, the general public has a right to have the hearing body members free from \nprehearing or ex parte contacts on matters heard by them.  It is recognized that a countervailing public right is \nfree access to public officials on any matter.  Therefore, hearing body members shall reveal any significant \nprehearing or ex parte contacts with regard to any matter at the commencement of the public hearing on the \nmatter.  If such contacts have impaired the member’s impartiality or ability to vote on the matter, the member \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[11.10]-3 \nCity of Gresham Development Code \n \n(10/18) \nshall so state and shall abstain from voting.  In addition, parties who had the communication with the member \nhave the right to rebut the substance of the communication, on the subject to which the communication relates, \nwith the member at the commencement of the public hearing on the matter.  \n11.1008  Abstention or Disqualification  \nExcept for Type IV hearings, disqualification for reasons other than the member’s own judgment may be \nordered by a majority of the members of a hearing body present and voting.  The member who is the subject of \nthe motion for disqualification may not vote on the motion.  \n11.1009  Rights of Abstaining or Disqualified Member of the Hearing Body  \nA. \nAn abstaining or disqualified member of the hearing body shall be counted for purposes of forming a \nquorum.  A member who represents a personal interest at a hearing may do so only by abstaining from \nvoting on the proposal, vacating the seat on the hearing body, physically joining the audience, making \nfull disclosure to the hearing body.  \nB. \nIf all members of a hearing body abstain or are disqualified, all members present after stating their \nreasons for abstention or disqualification shall be requalified and shall proceed to resolve the issues.  \nC. \nExcept for Type IV hearings, a member absent during the presentation of evidence in a hearing may not \nparticipate in the deliberations or decision unless the member has reviewed the evidence received.  \n11.1010  Burden and Nature of Proof  \nExcept for Type IV determinations, the applicant shall bear the burden of proof and persuasion that the proposal \nis in compliance with applicable provisions of the Gresham Community Development Plan and this Code.  \n11.1011  Order of Proceedings  \nThe order of proceeding for a hearing will depend in part on the nature of the hearing.  The following shall be \nsupplemented by rules of procedure of the hearing body as appropriate. \nA. \nBefore receiving information on the issue, the following shall be determined: \n1. \nAny objections on jurisdictional grounds shall be noted in the record and if there is objection, the \nhearing body has the discretion to proceed or terminate; and \n2. \nAny abstentions or disqualifications shall be determined. \nB. \nThe presiding officer may take official notice of known information related to the issue, such as: \n1. \nA provision of the charter, state law, ordinance, resolution, rule, or officially promulgated policy \nof the City. \n2. \nOther public records and facts judicially noticeable by law. \nC. \nMatters officially noticed need not be established by evidence and may be considered by the hearing \nbody in the determination of the matters.  Parties requesting notice shall do so on the record.  However, \nthe hearing body may take notice of matters listed in subsection B of this section if stated for the record.  \nAny matter given official notice may be rebutted. \nD. \nThe hearing body may view the area in dispute with or without notification to the parties, but shall place \nthe time, manner, and circumstances of such view in the record. \nE. \nInformation shall be received from the staff and from proponents and opponents.  The presiding officer \nmay approve or deny a request from a person attending the hearing to ask a question.  Unless the \npresiding officer specifies otherwise, if the request to ask a question is approved, the presiding officer \nwill direct the question to the person submitting testimony. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[11.10]-4 \nCity of Gresham Development Code \n \n(10/18) \nF. \nWhen the hearing has closed, the review authority shall openly deliberate and may further question a \nperson submitting information or the staff if opportunity for rebuttal is provided. \n11.1012  Continuance of Hearing   \nA. \nAll documents or evidence relied upon by the applicant shall be submitted to the City and be made \navailable to the public.  If additional documents or evidence are provided by any party at the hearing, \nthe hearing body may allow a continuance or leave the record open for at least seven (7) days to allow \nthe parties a reasonable opportunity to respond.  Any continuance or extension of the record requested \nby the applicant shall result in a corresponding extension of the time limitations of ORS 227. \nB. \nPrior to closing the initial evidentiary hearing, any participant may request an opportunity to present \nadditional evidence or testimony regarding the application.  The hearing body shall grant such request \nby continuing the public hearing or leaving the record open for additional written evidence or testimony \npursuant to subsection C below. \nC. \nIf the hearing body grants a continuance, the hearing shall be continued to a date, time and place certain \nat least seven (7) days from the date of the initial evidentiary hearing.  An opportunity shall be provided \nat the continued hearing for persons to present and rebut new evidence and testimony.  If new written \nevidence is submitted at the continued hearing, any person may request, prior to the conclusion of the \ncontinued hearing, that the record be left open for at least seven (7) days to submit additional written \nevidence or testimony for the purpose of responding to the new written evidence. \nD. \nIf the hearing body leaves the record open for additional written evidence or testimony, the record shall \nbe left open for at least seven (7) days.  Any participant may file a written request with the hearing body \nfor an opportunity to respond to new evidence submitted during the period the record was left open.  If \nsuch a request is filed, the hearing body shall reopen the record and any person may raise new issues \nwhich relate to the new evidence, testimony, or criteria for decision-making. \nE. \nA continuance or extension granted pursuant to Section 11.1012 shall be subject to the limitations of \nORS 227 unless the continuance or extension is requested or agreed to by the applicant. \nF. \nUnless waived by the applicant, the hearing body shall allow the applicant at least seven (7) days after \nthe record is closed to all other parties to submit final written arguments in support of the application.  \nThe applicant’s final submittal shall be considered part of the record, but shall not include any new \nevidence. For purposes of this section, “argument” means assertions and analysis regarding the \nsatisfaction or violation of legal standards or policy believed relevant by the proponent to a decision.  \n“Argument” does not include facts. “Evidence” means facts, documents, data or other information \noffered to demonstrate compliance or noncompliance with the standards believed by the proponent to be \nrelevant to the decision. \n11.1013  Decision \nA. \nFollowing the order of proceedings described in Section 11.1011, the hearing body shall approve, \nconditionally approve, or deny the application.  If the hearing is an appeal, the hearing body shall \naffirm, reverse or remand the decision that is on appeal.   \nB. \nA final local decision on an application for a development permit shall be made within 120 days from \nthe date the application was deemed to be complete, except that, with the agreement of the hearing body \nand an applicant or appellant, the processing of a matter under consideration may be extended for a \nreasonable period of time as determined by the hearing body, but not to exceed 6 months from the date \nof the first hearing on the matter.  \n \nFor Qualifying Applications as defined in Section 3.0103, unless waived by the applicant, the City will \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[11.10]-5 \nCity of Gresham Development Code \n \n(10/18) \nreach a final decision within 100 calendar days from the date that the application is deemed complete. \n11.1014  Findings and Order \nThe hearing body shall prepare findings of fact and an order, which shall include:  \nA. \nA statement of the applicable criteria against which the proposal was tested.  \nB. \nA statement of the facts that the hearing body found establishing compliance or noncompliance with \neach applicable criterion, and assurance of compliance with applicable standards.  \nC. \nThe reasons for, and decision to, approve, conditionally approve, or deny a proposal.  \n11.1015  Record of Proceedings  \nThe secretary to the hearing body shall be present at each hearing, and shall cause the proceedings to be \nrecorded stenographically or electronically.  \nA. \nTestimony shall be transcribed if required for judicial review.  \nB. \nThe hearing body shall, where practicable, retain as part of the hearing record each item of physical or \ndocumentary evidence presented, and shall have the items marked to show the identity of the person \noffering the item and whether presented on behalf of a proponent or opponent.  Exhibits received into \nevidence shall be retained in the hearing file until after the applicable appeal period has expired, at \nwhich time the exhibits may be released to the person identified on the exhibit, or otherwise disposed of.  \nC. \nIncluded in the record shall be a brief statement that explains the criteria and standards considered \nrelevant to the decision, states the facts relied upon in rendering the decision, and explains the \njustification for the decision based on the criteria, standards and facts set forth.  \nD. \nA person shall have access to the record of the proceedings at reasonable times, places, and \ncircumstances.  A person shall be entitled to make copies of the record at the person’s own expense.  \n \n \n \n \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.218857",
  "extractor_version": "1.0.0"
}