{
  "metadata": {
    "filename": "dc-section-11.0500.pdf_id7891",
    "extracted_at": "2025-05-22T06:15:21.396412",
    "num_pages": 4,
    "title": "DC Section 11.0500",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.39",
    "creation_date": "D:20241015162710-07'00'",
    "modification_date": "D:20241018132721-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[11.05]-1 \nCity of Gresham Development Code \n \n(07/24) \nSECTION 11.0500 \nTYPE III QUASI-JUDICIAL PROCEDURES \n11.0500  Type III Quasi-Judicial Procedures \n11.0501  General Description \n11.0502  Type III Procedures \n \n11.0500 \nType III Quasi-Judicial Procedures \n11.0501  General Description  \nType III applications are subject to criteria that require the exercise of discretion and judgment and about which \nthere may be broad public interest.  Impacts may be significant and development issues complex.  Extensive \nconditions of approval may be imposed to mitigate impacts or ensure compliance with this code or the \nCommunity Development Plan.  The Type III procedure provides for a quasi-judicial review of an application \nby the Hearings Officer, Planning Commission or the Design Commission.  The application process includes \nnotice to nearby property owners, and a public hearing before the appropriate decision authority. The following \nare Type III applications:  \n• \nThose identified in this code as Type III applications;  \n• \nThose identified in Table 11.0204 as Type III applications; or \n• \nThose identified by the Manager as Type III applications, based on the guidelines for classification of \napplications by procedure in Section 11.0203.  \n11.0502  Type III Procedures  \nA. \nPre-Application Conference, Optional Early Assistance Design Advice and Optional Design \nCommission Consult \n1. \nTable 11.0204 identifies all Type III applications that require a pre-application conference.   \n2. \nPre-application conference procedures are included in Section 11.0700. \n3. \nOptional Early Assistance Design Advice \na. \nAn applicant of a Type III proposal that is to be reviewed by the Design Commission \nmay choose to meet with the Design Commission before the Pre-Application \nConference and prior to the formal application submittal for advice on the proposal. \nb. \nOptional Early Assistance Design Advice procedures are included in Section 11.0700.  \n4. \nOptional Design Commission Consult \na. \nAn applicant of a Type III proposal that is to be reviewed by the Design Commission \nmay choose to meet with the Design Commission after the Pre-Application Conference \nand prior to the formal application submittal for advice on the proposal. \nb. \nOptional Design Commission Consult procedures are included in Section 11.0700.  \nB. \nNeighborhood Meeting \n1. \nA neighborhood meeting is required for those Type III applications which require a pre-\napplication conference, as indicated in Table 11.0204.  \n2. \nNeighborhood meeting procedures are included in Section 11.0800. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[11.05]-2 \nCity of Gresham Development Code \n \n(07/24) \nC. \nType III Application Requirements  \n1. \nType III applications shall be made on forms provided by the Manager and shall include all of the \ninformation required by Section 11.0900. \n2. \nType III applications shall:  \na. \nInclude the information requested on the application form; \nb. \nInclude the information requested in a submittal checklist, if any;  \nc. \nAddress the relevant criteria in sufficient detail for review and action; and  \nd. \nBe accompanied by the required fee.  \nD. \nType III Public Hearing Schedule.  Once the City determines that an application is complete, the City \nshall schedule a public hearing on a Type III application.  \nE. \nType III Public Notice  \n1. \nThe city shall mail notice of Type III plan map amendments to the Department of Land \nConservation and Development at least 35 days prior to the first public hearing on the \napplication.   \n2. \nAt least 20 days prior to the hearing, the city shall mail written notice of the public hearing for all \nType III applications to:  \na. \nThe applicant and/or authorized representative; \nb. \nThe owner(s) of record of the subject property;  \nc. \nAny City-recognized neighborhood association whose boundaries include or are within \n300 feet of the subject property; and the Presidents and Land Use Chairs of all City-\nrecognized neighborhood associations when the development is proposed in the GBSV \nDistrict; \nd. \nOwners of property located within three hundred (300) feet of the perimeter of the \nsubject property and owners or record within five hundred (500) feet of the perimeter of \nthe subject property when the development is proposed in the GBSV District; \ne. \nAffected city departments, and any governmental agency which is entitled to notice \nunder an intergovernmental agreement with the City which includes provision for such \nnotice or is otherwise entitled to such notice. Such departments and agencies may \nrequest up to a 15-day extension to their comment period if the application involves \nunusual circumstances. The department or agency is assumed to have no comments if \nno comments are received within the specified time period; and  \nf. \nTenants of a manufactured home park when a request for a Type III plan map \namendment would change the land use designation of the property which includes all or \npart of the manufactured home park.  \n3. \nThe mailed notice of public hearing shall include all of the following:  \na. \nThe name and address of the applicant or the applicant’s representative;  \nb. \nThe case file number and nature of the proposed use or development;  \nc. \nThe designation of the decision authority and the date, time, and place of the hearing; \nd. \nA description of the subject property reasonably sufficient to inform the public of the \nlocation; \ne. \nThe applicable criteria for the decision, listed by commonly used citation;  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[11.05]-3 \nCity of Gresham Development Code \n \n(07/24) \nf. \nA statement that all interested persons may appear and provide testimony and that only \nthose participating at the hearing, or in writing, shall be entitled to appeal;  \ng. \nA statement that failure to raise an issue at the hearing, in person or by letter, or failure \nto provide sufficient specificity to enable the decision authority to respond to the issue, \nprecludes an appeal based on that issue;  \nh. \nThe name and telephone number of a city representative to contact for information on \nthe application;  \ni. \nA statement that copies of the application and all evidence and documents submitted by \nor on behalf of the applicant are available for review, and copies can be obtained at \ncost; \nj. \nA statement that a copy of the staff report will be available for inspection at no cost at \nleast seven (7) days prior to the hearing, and copies will be provided at reasonable cost; \nand \nk. \nA general explanation of the requirements for submission of testimony and the \nprocedure for conduct of public hearings.  \n4. \nThe Manager shall cause an affidavit of mailing of notice to be prepared and made a part of the \nfile, which demonstrates the date that the required notice was mailed to the necessary parties.  \n5. \nNotice of the public hearing for a Type III application shall be published in a newspaper of \ngeneral circulation in the city at least 20 days prior to the scheduled hearing date. An affidavit of \npublication concerning such notice shall be made part of the administrative record.  \n6. \nAt least 20 days prior to the hearing, notice of the hearing shall be posted on the site by the \napplicant.  The Manager shall provide at least one (1) sign and the instructions for posting.  The \nsign shall be posted in a conspicuous place visible from the street.  For properties that abut more \nthan one improved street, separate signs shall be posted facing each improved street.  The sign \nshall include the case file number and the telephone number where city staff can be contacted for \nmore information about the application. An affidavit of posting shall be submitted by the \napplicant and made part of the administrative record.  \nF. \nType III Decision Authority.  Table 11.0204 identifies the decision authority for each Type III land use \napplication.  \nG. \nType III Notice of Decision \n1. \nA written decision in the form of a land use order shall be prepared regarding the Type III \napplication within approximately 60 days from the date the application is deemed complete \nunless the applicant chooses to extend the application.  For Design District applications to be \nreviewed and decided upon by the Design Commission, the applicant may choose to request a \ncontinuance of the hearing in order to make the requested modifications to the application.  In \nthis circumstance, the applicant shall return to the Design Commission at a later date for a final \ndecision.  The land use order shall include: \na. \nA listing of the applicable approval criteria by code section number; \nb. \nA statement or summary of the facts upon which the decision authority relied to find the \napplication does or does not comply with each applicable approval criterion and to \njustify any conditions of approval.  The decision authority may adopt or incorporate a \nstaff report or written findings prepared by any party to the proceeding into the land use \norder to satisfy this requirement; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[11.05]-4 \nCity of Gresham Development Code \n \n(07/24) \nc. \nA statement of conclusions based on the facts and findings; and \nd. \nA decision to deny or to approve the application and, if approved, any conditions of \napproval necessary to ensure compliance with applicable criteria.  \n2. \nWithin approximately seven (7) days from the date that the decision authority adopts a land use \norder, a notice of decision shall be sent by mail to:  \na. \nThe applicant and/or authorized representative;  \nb. \nThe owner(s) of record of the subject property; \nc. \nAny governmental agency which is entitled to notice under an intergovernmental \nagreement with the city which includes provision for such notice or is otherwise entitled \nto such notice; and \nd. \nAny group or participant who submitted oral or written public testimony for the hearing \nor requested notice of the decision.  \n3. \nThe notice shall contain:  \na. \nA brief summary of the decision, and conditions of approval, if any, and the case file \nnumber;  \nb. \nA description of the subject property reasonably sufficient to inform the public or its \nlocation; and \nc. \nA statement that the decision is final, unless appealed or called up for review by City \nCouncil as described in 11.1106(F) within twelve (12) calendar days of the notice of \ndecision, or, in the case of weekends and holidays, by the end of the next business day.  \nThe notice shall state in boldface type the date and time by which an appeal must be \nfiled.  The statement shall describe the requirements for filing an appeal of the decision. \nThe statement shall note that only those persons who made an appearance on the record \nare entitled to appeal the decision.  \nH. \nAppeal of a Type III Decision \n1. \nThe decision of the Hearings Officer, Planning Commission, or Design Commission in a Type III \naction may be appealed to the appeal authority identified in Table 11.0204.  Only the applicant or \npersons who submitted comments or made an appearance on the record at the public hearing \nbefore the Hearings Officer, Planning Commission, or Design Commission have standing to \nappeal a Type III decision. Additionally, the City Council may initiate review of a Type III \nDecision made by the designated “Decision Authority” as indicated in Table 11.0204, as \nprovided in Section 11.1106.F. \n2. \nAppeal requirements and procedures are outlined in Section 11.1100.  \n3. \nThe appeal authority decision shall be the final local decision on all appeals of Type III quasi-\njudicial decisions from the Planning Commission, Hearings Officer or Design Commission. Any \nfurther appeal shall be to the Land Use Board of Appeals (LUBA).   \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:21.396618",
  "extractor_version": "1.0.0"
}