{
  "metadata": {
    "filename": "dc-section-10.0700.pdf_id7900",
    "extracted_at": "2025-05-22T06:15:23.252621",
    "num_pages": 2,
    "title": "DC Section 10.0700",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615195630-07'00'",
    "modification_date": "D:20220615195653-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.07]-1 \nCity of Gresham Development Code \n \n(05/13) \n \nSECTION 10.0700 \nMINERAL AND AGGREGATE RESOURCE EXTRACTION \nGeneral \n10.0701  Resource Utilization Permits for Mineral and Aggregate Resource Extraction   \n10.0702  Required Information for Review Purposes   \nStandards \n10.0710  Standards for Mineral and Aggregate Resource Extraction  \n10.0711  Development Permit Requirements for Resource Utilization \n \nGeneral \n10.0701  Resource Utilization Permits for Mineral and Aggregate Resource \nExtraction   \nA. \nNo surface mining operation for mineral or aggregate resources requiring an operating permit, as \nprovided in ORS 517.790, or expansion of any such existing operation, may be undertaken prior to \nissuance of a development permit for resource utilization.  For purposes of this section, expansion shall \nmean lateral expansion consequential to surface mining into land surfaces previously not affected by \nsurface mining.  Land surfaces affected by surface mining shall be considered to be those areas \ndisturbed by excavation or other means during any stage of mineral or aggregate production, or the \ncovering of any land surface by surface mining refuse. \nB. \nAn application for a development permit for resource utilization shall be processed under a Type III \nprocedure. \n10.0702  Required Information for Review Purposes \nA development permit for resource utilization shall be required for establishment or expansion of a mineral or \naggregate resource extraction operation, as provided in Section 10.0711.  In preparing an application for a \npermit, the following materials shall be submitted: \nA. \nDesign Review data as specified in Article 7; \nB. \nA reclamation plan, prepared in conformance with requirements of the State Department of Geology \nand Mineral Industries. \nC. \nNarrative materials addressing the criteria of Section 10.0711 and containing, in addition, a description \nof conflicting uses identified in connection with the operation and an analysis of the economic, social, \nenvironmental, and energy consequences of carrying out resource extraction as proposed. \nD. \nAdditional data which may be required by the Manager for the purpose of evaluating the impacts of the \nproposed development on adjacent properties, public facilities, and existing natural features. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.07]-2 \nCity of Gresham Development Code \n \n(05/13) \n \nStandards \n10.0710  Standards for Mineral and Aggregate Resource Extraction   \nA. \nA strip of land at the existing topographical level, and not less than 15 feet in width, shall be retained \naround the perimeter of that portion of the site for which a reclamation plan has been prepared in \nconformance with requirements of the State Department of Geology and Mineral Industries. When any \nportion of the perimeter strip lies within 500 feet of a public street right-of-way or property which is not \nunder the ownership of the applicant, that portion of the perimeter strip shall be landscaped in \naccordance with Section 9.0110. \nB. \nPrincipal access to the site shall be from principal arterials, major arterials, and minor arterial streets \nwherever possible. Direct access to the site from neighborhood collectors, local streets, and cul-de-sacs \nshall not be permitted. \nC. \nFencing shall be placed on the site to prevent unauthorized access to open pit areas. Such fencing shall \nbe of chain-link type, no less than 6 feet in height. \nD. \nConformance with all applicable standards of the State Department of Geology and Mineral Industries \nfor Mined Land Reclamation Permits shall be demonstrated. \n10.0711  Development Permit Requirements for Resource Utilization  \nA development permit application for resource utilization shall be accompanied by a reclamation plan prepared \nin conformance with requirements of the State Department of Geology and Mineral Industries for surface \nmining operations.  In acting to approve issuance of the development permit, the hearing body may attach \nconditions as necessary to mitigate adverse impacts associated with operation of the surface mine.  A \ndevelopment permit for resource utilization shall be issued only upon finding compliance with the following \ncriteria: \nA. \nThe proposed development will be adequately screened from adjacent properties and rights-of-way, and \nwill not impose adverse impacts on public facilities or sites listed in the Inventory of Significant Natural \nResources and Open Spaces; or that adequate measures will be implemented to mitigate identified \nadverse impacts. \nB. \nMineral or aggregate resources to be extracted are shown to be present in sufficient quantities and are of \nsufficient importance to the development of the community so as to outweigh identified adverse \nimpacts. \nC. \nAppropriate provisions have been made for reclamation of the site, in conformance with requirements of \nthe State Department of Geology and Mineral Industries. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.252884",
  "extractor_version": "1.0.0"
}