{
  "metadata": {
    "filename": "dc-section-9.0400.pdf_id7867",
    "extracted_at": "2025-05-22T06:15:25.530005",
    "num_pages": 4,
    "title": "DC Section 9.0400",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615194358-07'00'",
    "modification_date": "D:20220615194415-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n \n[9.04]-1 \nCity of Gresham Development Code \n \n(06/22) \nSECTION 9.0400 \nFENCING \nGeneral \n9.0401  General Provisions   \nSpecific Fencing Requirements \n9.0410  Fencing of Residential Lots   \n9.0411  Residential Subdivision Fencing \n9.0412  Fencing of Hazardous Areas   \nGeneral \n9.0401  General Provisions   \nA. \nEvery fence shall be maintained in a condition of reasonable repair and shall not be allowed to become \nand remain in a condition of disrepair. Any fence which is, or has become dangerous to the public \nsafety, health, or welfare shall be considered a violation of this Ordinance.  \nB. \nLink fencing shall be constructed in such a manner that no barbed ends shall be at the top.  \nC. \nElectric fencing is prohibited except as noted in GRC 7.15.040(7)(d).   \nD. \nBarbed or razor wire fencing shall only be permitted when it is demonstrated to the satisfaction of the \nManager, that: \n1. \nThe barbed wire fencing is necessary for enclosing livestock in any land use district. \n2. \nThe barbed or razor wire fencing is proposed to provide added security for a non-residential use. \nWhen such wire fencing is proposed, it shall only be used above either a standard fence or wall \nwhich has a minimum height of 5 feet. \nE. Fencing shall not conflict with the requirements of the Clear Vision Area (refer to Section 9.0200). \nSpecific Fencing Requirements \n9.0410  Fencing of Residential Lots   \nA. \nFor fencing in LDR-5, LDR-7, TLDR, TR, MDR-12, MDR-24 and for fencing for single detached \ndwellings and middle housing in Pleasant Valley and Springwater Plan Districts the following standards \napply: \n1. \nThe maximum height of a fence forward (nearer the front lot line) of the minimum front yard \nsetback shall be 4 feet.  \n2. \nAll other fencing shall not exceed 6 feet in height when measured from grade unless:  \na. \nIt is provided for in the Buffering and Screening requirements of Section 9.0100; or \nb. \nThere is a grade difference between two sites which would make a 6 foot high fence \ninadequate to provide for privacy. Such fence shall be no higher than 6 feet above the \nhighest grade within 5 feet of the common boundary line (see Figure 9.0410); or \nc. \nTo provide added security for a non-residential use. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n \n[9.04]-2 \nCity of Gresham Development Code \n \n(06/22) \nFigure 9.0410 Fence heights with a grade difference \n \n \nB. \nIn the Pleasant Valley and Springwater Plan Districts for single detached dwellings and middle housing, \nthe maximum height of a fence along an alley lot line shall be 6 feet provided that the maximum height \nof sight-obscuring fencing shall be 4 feet and that above 4 feet, the fencing shall be at least 40% open. \n9.0411  Residential Subdivision Fencing \nThe following standards apply to fences in the LDR-5, LDR-7, TLDR and TR Districts: \n1. \nFor new residential subdivisions and partitions, fences a minimum of 6 feet in height shall be \ninstalled on rear or side yards facing streets of higher classification than a local street (such as \ncollector and arterial) and shall be of a consistent, uniform appearance for the entire length of the \nsubdivision or partition and built to the following standards: \na. Materials. The fence shall be constructed of: \ni.  Stone, brick, stone-look cast masonry, brick-look cast masonry or stucco with an \nanti-graffiti sealant. These may be integral or applied as a veneer over a concrete \nblock core. Synthetic stucco and exterior insulation finished systems are not \nallowed; or \nii.  Vinyl panels mounted on vertical columns and a base made of the materials in (i) \nabove. The base shall be at least 16 and not more than 20 inches tall; or \niii.  Other high-quality materials proposed by the applicant and approved by the \nManager. The materials shall be durable and long-lasting, such as tubular steel, \narchitectural concrete masonry units, or ornamental/wrought iron, or materials \nallowed in (i) and (ii) above. Link fencing such as chain link fencing; wood \nfencing; and plain and split-face concrete masonry units are prohibited. \nb. Columns. Vertical columns shall be integrated into the fence and shall: \ni.  Be at least14 inches wide; and \nii.  Set at regular intervals no more than 20 feet apart on center; and \niii.  Project at least 3 inches from the face of the wall; and \niv.  Include caps no greater than 6 inches in height; and; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n \n[9.04]-3 \nCity of Gresham Development Code \n \n(06/22) \nv.  Be constructed of a different material than the fence. \nc. Safety. Fences shall not contain jogs and angles exceeding 8 inches in depth that create \npotential hiding places. Jogs are allowed to avoid obstacles such as utility poles, \ncommunications service equipment, fire hydrants and existing trees. Fences also should \ncomply with the clear vision area provisions of Section 9.0200. Adjustments in fence \nlocations may be required to meet fire code standards, such as standards for clearance around \nfire hydrants. \nd.  Fence placement and landscaping: A landscape area shall be required between the sidewalk \nand the required fence, according to the following standards: \ni.  In locations where a landscape strip at least 36 inches from curb to sidewalk exists, \nthe fence shall be at least 4 feet from the sidewalk or at the property line, whichever \nis farther from the sidewalk, to allow for landscaping. The 4-foot area shall be \nplanted with ground cover, dwarf shrubs, perennials or non-invasive, vining plants \nand maintained by the property owner. Turf grass is prohibited in the landscaped \narea. \nii.  In locations where no landscape strip exists between the sidewalk and curb or the \nlandscape strip is less than 36 inches from curb to sidewalk, the fence shall be at \nleast 8 feet from the sidewalk or at the property line, whichever is farther from the \nsidewalk, to allow for landscaping and street trees. The 8-foot landscaped area shall \nbe planted with required street trees, shrubs, dwarf shrubs, perennials, ground \ncover, or non-invasive, vining plants and maintained by the property owner. With \nthe exception of dwarf shrubs such as boxwood, shrubs shall be a minimum of 24 \ninches high from finished grade and a minimum of 1-gallon size at planting. \niii. Fences and walls shall line up with and meet end-to-end with fences or walls on \nadjacent properties that meet these standards for fence location, although exceptions \nmay be approved by the Manager to address site conditions such as existing trees, \nutilities, fire hydrants and similar obstructions.  \niv.  If the required fence is not sight-obscuring, the construction of other fences on the \nsite within 15 feet of the fence on a rear lot line and 10 feet of the fence on a side \nlot line is prohibited. The intent is to prevent doubling-up of fences that is visible \nfrom the right of way. \ne.  Timing. Fences shall be completed by the applicant prior to the City’s acceptance of public \ninfrastructure or issuance of building permits for structures on the lots (other than any \nrequired permits for the fence). \nf.  Fences or walls shall be constructed such that the finished side of the fence faces the public \nright-of-way and any structural components (metal brackets, etc.) are positioned on the \nhouse side and away from the street side. \ng.  Slopes. Fences constructed on slopes shall be installed using a stair-step method, whereby \neach fence panel steps up or down the slope and remains level (zero-slope) rather than \nparallel to the grade of the underlying terrain, unless otherwise approved by the Manager. \nh.  Decorative or entrance features such as gates, arbors and trellises are allowed along fences \nsubject to the following standards: \ni.  Maximum height: 9 feet; and \nii.  Maximum width: 6 feet; and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n \n[9.04]-4 \nCity of Gresham Development Code \n \n(06/22) \niii.  Maximum depth: 3 feet; and \niv.  Each surface of the arbor or trellis shall be at least 50 percent open. \ni. \nStormwater drainage holes are allowed on the required fence as needed to facilitate \ndrainage. \n9.0412  Fencing of Hazardous Areas   \nAn applicant for a development permit shall be required to furnish and install fencing wherever the approval \nauthority determines that a hazardous condition may exist. The fencing shall be installed according to standards \nestablished by the Manager. No occupancy permit shall be issued until said fencing has been installed. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.530369",
  "extractor_version": "1.0.0"
}