{
  "metadata": {
    "filename": "dc-section-5.0500.pdf_id7848",
    "extracted_at": "2025-05-22T06:15:25.364758",
    "num_pages": 4,
    "title": "DC Section 5.0500",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.58",
    "creation_date": "D:20230105100331-08'00'",
    "modification_date": "D:20230105100352-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[5.05]-1 \nCity of Gresham Development Code \n \n(01/23) \n \nSECTION 5.0500 \nOPEN SPACE OVERLAY DISTRICT  \nGeneral \n5.0501  Introductory Provisions  \nOpen Space Dedication \n5.0510  Open Space Dedication  \n5.0511  Public Open Space Criteria  \n5.0512  Private Open Space Criteria  \nPermitted Uses \n5.0520  Permitted Land Uses   \n5.0521  Residential Density Transfer Credit  \nDevelopment Requirements \n5.0530  Site Development Requirements   \n5.0531  Design Standards and Supplementary Regulations   \n5.0532  Conservation of Open Space   \n \nGeneral \n5.0501  Introductory Provisions   \nProvisions of this section apply to all areas designated as Open Space Overlay District (OS) on the Community \nDevelopment Special Purpose District Map. Designation of OS sites is based on the Inventory of Significant \nNatural Resources and Open Spaces adopted as an appendix to the Community Development Plan. It is the \npurpose of the OS district is to conserve undeveloped and landscaped areas that reduce air pollution and enhance \nthe value of adjacent property, to enhance the value to the public of public parks, public urban plazas, public \ntrails and paths, public open spaces, natural areas and public school sites, to enhance recreation opportunities, \nand to promote orderly urban development. \nOpen Space Dedication \n5.0510  Open Space Dedication    \nThe Manager may accept the dedication of open space in connection with a development proposal for the \npurpose of off-setting the payment of parks system development charges, as provided in Article 6.15, System \nDevelopment Charges, Gresham Revised Code.  This acceptance of dedicated open space shall take place under \nthe Type I procedure when the property to be dedicated is identified as an Open Space or Natural Resource site \nin the Inventory of Significant Natural Resources and Open Spaces.  For all other areas, the acceptance of \ndedicated open space shall take place under the Type II procedure. \n5.0511  Public Open Space Criteria    \nAny proposal to accept an area not identified in the Inventory of Significant Natural Resources and Open Spaces \nas dedicated open space must meet criteria (A), (B), (C), and at least one of the remaining criteria below. \nA. \nThe potential costs associated with the maintenance of the area will not exceed the recreational value of \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[5.05]-2 \nCity of Gresham Development Code \n \n(01/23) \n \nthe open space to the public. \nB. \nThe area will meet a need identified in the Gresham Parks Development Plan. \nC. \nThe open space area will not exhibit features that represent an obvious hazard to users or create a \nsignificant liability for the City. \nD. \nThe open space area will link parks, neighborhoods, schools, or community activity centers or it will \nprovide continuity within an existing greenway or planned greenway corridor. \nE. \nThe open space area is in a usable location to serve passive or active recreational needs.  Active park \nareas shall be located in accordance with the Gresham Parks Development Plan Map. \nF. \nThe open space area has sufficient width and suitable topography to accommodate pedestrian or bicycle \ntrails. \nG. \nThe open space area will provide special opportunities for a nature trail, scenic walkway, exercise \ncircuit, or other special purpose trail. \nH. \nThe open space area will conserve any of the following natural resources or features: \n1. \nFish and wildlife habitat; \n2. \nWater resources, streams, drainageways, ponds, lakes, floodplains, or wetlands; \n3. \nNatural vegetation, stands of trees, or forest areas; \n4. \nScenic views and landscapes, such as forested hills and ravines; \n5. \nGeologic features; \n6. \nEcologically and scientifically significant areas, such as Hogan Cedars; or \n7. \nHazardous slopes greater than 35 percent. \nI. \nThe open space area represents an historical or culturally significant site. \n5.0512  Private Open Space Criteria    \nThe City shall permit a development proposal that includes private open space if it meets the following criteria: \nA. \nPortions of the land are sufficiently improved to offer active or passive recreational opportunities; \nB. \nThe proposal would not interfere with the continuity of an existing or planned public greenway corridor; \nC. \nAn Open Space easement in accordance with Section 9.0304 is recorded; and \nD. \nA Homeowner’s Association or other mechanism acceptable to the Manager shall be formed for the \nmaintenance and control of the private open space.  The by-laws or similar instrument shall also include \na financial mechanism that insures maintenance of the property. \n \nPermitted Uses \n5.0520  Permitted Land Uses    \nA. \nThe following uses are permitted in the Open Space Overlay District: \n1. \nUtility structures, including but not limited to substations, telephone switching stations, electrical \ngeneration facilities, and other facilities required for the transmission of power or communications \n2. \nSewerage or drainageway system structures, including but not limited to pump stations, or sewage \nor storm water treatment plants \n3. \nWater system structures, including but not limited to treatment plants, storage reservoirs, pump \nstations, or other major facilities associated with the supply or distribution of water \n4. \nEmergency service facility such as a fire station or ambulance service \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[5.05]-3 \nCity of Gresham Development Code \n \n(01/23) \n \n5. \nPublic urban plazas, public neighborhood parks, public community parks, public trails and paths \n6. \nPublic greenway \n7. \nCemeteries \n8. \nPortable classroom for public schools \n9. \nPublic or private elementary school  \n10. \nPublic or private high school or college  \n11. \nGolf course \n12. \nCommunity private recreational uses such as bicycle and pedestrian paths, play areas, athletic \nfields and private open space. \n13. \nTemporary, Intermittent and Interim Uses (Section 10.1400) and Food and Beverage Carts \n(Section 10.1600) \n14. \nAffordable housing development under Section 10.1700. \n5.0521  Residential Density Transfer Credit   \nA density transfer credit shall be permitted for those parcels with a plan map designation allowing residential \ndevelopment when one acre or more of the parcel lies within an OS district. For parcels with a low density \nresidential designation, the density transfer credit shall be calculated at the rate of two dwelling units per acre of \nthat portion of the parcel lying within the OS district. For parcels with a moderate density residential \ndesignation, the density transfer credit shall be calculated on the basis of the maximum number of dwelling units \npermitted per acre in that residential district for each acre of site area within the OS district. The number of units \ncalculated on this basis shall be added to the number of units permitted on that portion of the parcel lying \noutside the OS district to determine the total number of dwelling units which may be developed on the non-OS \nportion of the parcel. Where a density transfer credit is allowed in a low density residential district, minimum lot \nsizes and lot dimensions as specified for detached dwellings and duplexes may be reduced on the non-OS \nportion of the parcel. In both low density and moderate density residential districts, all other applicable \ndevelopment standards, including setback and building heights, shall continue to apply when a density transfer occurs. \nResidential density transfer credits do not apply to affordable housing development under Section 10.1700. \nDevelopment Requirements \n5.0530  Site Development Requirements   \nSite development standards including minimum lot size and dimensions, minimum yard setbacks, and maximum \nbuilding height shall be as specified for the underlying Plan Map District designation, except as may be \nmodified through a Special Use Review, under Section 8.0100. \n5.0531  Design Standards and Supplementary Regulations   \nAll uses permitted in the OS district shall be designed in conformance with applicable provisions and \nrequirements of the Community Development Code. \n5.0532  Conservation of Open Space   \nThe design and development of any use permitted in the OS district shall take place in such a manner as to limit \nto the maximum extent possible the intrusion of buildings, off-street parking areas, and driveways into natural \nareas and areas of the site which are landscaped or in recreational use. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[5.05]-4 \nCity of Gresham Development Code \n \n(01/23) \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.364976",
  "extractor_version": "1.0.0"
}