{
  "metadata": {
    "filename": "dc-section-5.0700.pdf_id11907",
    "extracted_at": "2025-05-22T06:15:25.274372",
    "num_pages": 34,
    "title": "DC Section 5.0700",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220615153656-07'00'",
    "modification_date": "D:20220615154251-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[5.07]-1 \nCity of Gresham Development Code \n \n(06/22) \n \nSECTION 5.0700 \nNATURAL RESOURCE OVERLAY \nGeneral \n5.0701  Purpose \n5.0702  Coordination with Other Regulations \n5.0703  Applicability \n5.0704  Prohibitions \n5.0705  Exempt Uses and Activities \n5.0706  Permit Required \n5.0707  Application Requirements  \nStandards \n5.0708  Tree Removal not Associated with Other Development \n5.0709  General Development Standards \n5.0710  Standards for Specific Development Types within a Resource Area \n5.0711  Mitigation Requirements \nProcess  \n5.0712  Alternative Review \n5.0713  Modification of NRO Standards \n5.0714  Mapping Protocols \n5.0715  Map Administration and Correction \n5.0716  Violations \n \n5.0701  Purpose   \nThe Natural Resource Overlay (NRO) regulations provides a framework for protection of Metro Titles \n3 and 13 lands, and Statewide Planning Goal 5 and 6 resources within the City of Gresham.  The NRO \ncontributes to the following community objectives:  \nA. \nProtect and restore streams and riparian areas for their ecological functions and as an amenity for the \ncommunity and to recognize the unique natural resources attributes within the new communities of \nPleasant Valley, Springwater and Kelley Creek. \nB. \nProtect floodplains and wetlands, and restore them for improved hydrology, flood protection, aquifer \nrecharge, and habitat functions. \nC. \nProtect upland habitats and enhance connections between upland and riparian areas. \nD. \nMaintain and enhance water quality and control erosion and sedimentation through the revegetation of \ndisturbed sites and by placing limits on construction, impervious surfaces, and pollutant discharge in \nResource Areas as defined in Section 5.0703(B)(1).   \nE. \nConserve scenic, recreational, and educational values of significant natural resources. \nF. \nProvide clear and objective standards and a discretionary review process, applicable to development in \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[5.07]-2 \nCity of Gresham Development Code \n \n(06/22) \n \nResource Areas, in accordance with Statewide Land Use Planning Goal 5. \nG. \nAllow and encourage habitat-friendly development, while minimizing the impact on fish and wildlife \nhabitat functions and mitigating the loss of ecological functions and values. \n \n5.0702  Coordination with Other Regulations   \nA. \nThe requirements of the NRO apply in addition to other applicable state, regional, and federal \ndevelopment requirements. Where the NRO imposes restrictions that are more stringent than other \napplicable state, regional and federal requirements, the provisions of the NRO shall govern. \nB. \nExcept as provided below, where the provisions of this overlay conflict with comparable provisions of \nthe Gresham Community Development Code,  the more restrictive shall govern, provided that within the \nboundaries of a Resource Area, the tree removal and mitigation requirements of this overlay shall \nsupersede those of Section 9.1000.   \nC. \nProposed development located near streams with regulated floodplains or identified flood prone areas \nshall also comply with the Floodplain Overlay District standards of Section 5.0100 of the Community \nDevelopment Code. Areas affected by this District are shown on the City’s Special Purpose Districts \nMap. \nD. \nProposed development located on or near sites with steeper slopes may also be affected by the Hillside \nand Geologic Risk Overlay (HGRO) provisions of Section 5.0200 of the Community Development \nCode. This Overlay may impose additional development requirements for sites with ravines and other \nsloped topographic features. Areas affected by this Overlay are shown on the City’s Special Purpose \nDistricts Map. \nE. \nDevelopment in or near wetlands and streams may require permits from the Oregon Department of State \nLands (DSL) and the U.S. Army Corps of Engineers. If a federal permit is required, a water quality \ncertification from the Oregon Department of Environmental Quality may also be required. The City \nManager shall notify the Department of State Lands and the Army Corps of Engineers when an \napplication for development within streams and wetlands is submitted. Because these agencies may \nhave more restrictive regulations than the City, Applicants are encouraged to contact them before they \nprepare their development plans. \nF. \nEnvironmental Technical Guidance Manual. Clarifications, commentary and examples are given in \nthe Gresham Environmental Technical Guidance Manual. Content of the guidance manual is to be used \nin tandem with development code and does not substitute for, amend, or supersede development code. \nG. \nFor the purposes of this section “land division” does not include middle housing land divisions pursuant \nto Section 6.0500 and “lot” does not include middle housing lots created by middle housing land \ndivisions. \n \n5.0703  Applicability   \nA. \nAll Areas \n1. Unless otherwise exempt, the Natural Resource Overlay and the regulations of this chapter apply to \nproperties containing mapped Resource Areas or Potential Resources Areas when any of the \nfollowing sues or activities are proposed: \na. Development or redevelopment. \nb. All land divisions or property line adjustments. \nc. Removing, cutting, mowing, clearing, burning, or applying herbicides to vegetation. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[5.07]-3 \nCity of Gresham Development Code \n \n(06/22) \n \nd. Changing topography, grading, excavating, stockpiling or filling. \ne. Resource enhancement. \nf. Construction or expansions of right-of-way improvements. \ng. Placement or stockpiling of wood debris. \n2. Mapped Resource Area (RA), High Value Resource Area (HVRA), and Potential Resource Area \n(PRA) boundaries are based on a GIS-supported application of the mapping protocols in Section \n5.0714.  The boundaries may be verified or amended in accordance with Section 5.0715.  In \ngeneral, these areas include the following: \na. Resource Areas (RA) include regulated wetlands and their buffers, regulated streams and their \nbuffers, other regulated waters including lakes and ponds and their buffers, and designated \nupland habitat. Within the RA are subareas of particularly high value.  These subareas are \ndesignated as High Value Resource Areas (HVRA).  All references in this chapter to Resource \nAreas shall be understood to include High Value Resource Areas. \nb. Potential Resource Areas (PRA) include areas that were identified as “potential wetlands” in a \nLocal Wetland Inventory Survey and areas that have been identified as having a high \nprobability of potential regulated wetlands, but have not been reviewed as part of a Local \nWetland Inventory Survey. \n3. Development within an RA in accordance with the provisions of the NRO shall not result in a \nchange of the RA status of such developed areas on a property. \n4. Properties containing Potential Resource Areas are subject to Section 5.0703(B). If no Resource \nAreas are identified in the PRA review, then the requirements of NRO do not apply. \n5. All development permit applications within the NRO which propose non-exempt activities within \n50 feet of, but not within, a Resource Area, shall comply with Section 5.0706(A).   \n6. Jurisdictional wetlands and waters are those subject to local, state, and/or federal authority.  A \njurisdictional wetland or stream identified during the course of a development permit review that \nmeets the mapping protocols in Section 5.0714 shall be subject to the NRO standards. Such \nwetlands or streams shall be added to the NRO map by the Manager, after DSL and City \nconcurrence. If a wetland or stream is identified that does not meet Title 3 criteria, it is not subject \nto the standards of this section but may still require a federal or state permit. \nB. \nPotential Resource Area (PRA) Determination \nThese regulations are required to protect water quality resources pursuant to Goal 6 and Metro \nFunctional Plan Title 3 \n1. Review. All applications for non-exempt uses and activities within areas designated as Potential \nResource Areas on the map are subject to a review to determine whether Resource Areas \n(specifically wetlands) are present.   \na. The review shall cover all proposed disturbance area(s) and all on-site land within 100 feet of \nthe disturbance area(s). \nb. The review may be processed separately as a Type I review or concurrently with another \ndevelopment permit. \nc. All wetland determinations must be conducted in accordance with the 1987 U.S. Army Corps of \nEngineers Wetlands Delineation Manual, including regional supplements and applicable \nguidance and any supporting technical guidance documents, rules, and regulations issued by the \nState of Oregon and the Oregon Department of State Lands. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[5.07]-4 \nCity of Gresham Development Code \n \n(06/22) \n \n2. Submittal Requirements. In order to determine if the standards of this chapter apply the applicant \nshall submit a site assessment for review that includes a map of the proposed review area and \nidentifies any proposed disturbance area(s) and on-site land within 100 feet of the disturbance \narea(s) as well as one of the following: \na. Documentation from Oregon Department of State Lands (DSL) that there is no wetland within \nthe review area. Such documentation may be: \ni. A determination that a wetland is not present provided by DSL. \nii. A determination that a wetland is not present conducted by a private wetland professional \nwith DSL concurrence. \nb. Documentation from the City’s Natural Resources Program that there is no wetland within the \nreview area.  Such documentation may be: \ni. A determination that a wetland is not present conducted by the City. \nii. Review and agreement with a determination that a wetland is not present that has been \nconducted by a private wetland professional. \nc. A wetland delineation with DSL concurrence or documentation from the City’s Natural \nResources Program that there is a wetland, and a determination regarding Title 3 Wetland status \nperformed by the City in accordance with the Department of Land Conservation and \nDevelopment’s OAR 660-023, including the application of the Oregon Freshwater Wetland \nAssessment Methodology (OFWAM) to the wetland. \n3. Determination of Resource Status. \na. If no wetland is found the Resource Area standards of this Overlay shall not apply and the PRA \nshall be corrected according to 5.0715(C). \nb. If a wetland is found but is determined not to meet the City and Metro’s criteria for a regulated \nTitle 3 wetland, it is not subject to the standards of this Overlay, but it may still require a federal \nor state permit. The PRA shall be corrected according to 5.0715(C). \nc. If a wetland is found and is determined to meet the City and Metro’s criteria for a regulated \nTitle 3 wetland, a buffer shall be applied, and the area shall be identified as Resource Area. \nSuch Resource Areas shall be added to the NRO map in accordance with Section 5.0715(B) and \nthe PRA shall be corrected according to 5.0715(C).   \n \n5.0704  Prohibitions   \nThe following prohibitions apply within Resource Areas and within Potential Resource Areas that have not had \na PRA review completed in accordance with Section 5.0703(B). These prohibitions do not apply to the \ncontinuation, in the same manner, of activities that were lawfully begun before January 15, 2021, were approved \npursuant to this Overlay, or are exempt in accordance with Section 5.0705. An activity continuing in the same \nmanner means that there is no expansion in the scope of that activity within the RA or PRA. \nA. \nOutside storage of materials and equipment. \nB. \nAny new gardens, lawns, structures, or development other than those allowed outright (exempted) or \nthat is part of a regulated use that is approved with an NRO permit. \nC. \nThe dumping of materials of any kind. \nD. \nGrading, placement of fill, or the removal of native vegetation other than those allowed outright \n(exempted) or that is part of a regulated use that is approved with an NRO permit. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[5.07]-5 \nCity of Gresham Development Code \n \n(06/22) \n \n \n5.0705  Exempt Uses and Activities   \nThe permit requirements of the NRO do not apply to the uses and activities listed in Subsection (A).  The \nadditional exemptions listed in Subsection (B) apply to all lands within the NRO except HVRAs.  Where an \nexemption specifies an allowance of area for disturbance area, impervious surface, or improvement, that area \nrepresents the total cumulative amount allowed on a site pursuant to that exemption. The amount of disturbance \narea, impervious surface, or improvement permitted by each exemption shall be calculated independently. \nNothing in this section shall allow activity prohibited in 5.0704. \nA. \nExempt Uses and Activities. The following uses and activities are exempt from the permit \nrequirements of the NRO: \n1. Change of ownership. \n2. The following activities within the PRA: \na. Activities that do not otherwise require a development permit (i.e. no development permit \nwould be required for the proposed activity outside of the NRO). \nb. Development within the boundaries of a current PRA review prepared in accordance with \nSection 5.0703(B), where the assessment shows that no RA is present on the site. \nc. Development within the boundaries of a current PRA review prepared in accordance with \nSection 5.0703(B), where the assessment shows that one or more RA are present on the site, but \nwhere the proposed development meets one or more of the exemptions for uses or activities \nwithin or near an RA.  An NRO exemption form is required in accordance with Section \n5.0705(C). \n3. New site improvements, disturbance or structures or other development that are more than 50 feet \nfrom an RA. An NRO exemption form is required in accordance with Section 5.0705(C). \n4. The removal of vegetation, including trees, in any of the following situations: \na. When not within a RA.  An NRO exemption form is required in accordance with Section \n5.0705(C) when trees 24” DBH or greater in size will be removed within 50 feet of an RA. \nb. When removed in accordance with a City-approved mitigation or restoration plan. An NRO \nexemption form is required in accordance with Section 5.0705(C).   \nc. When limited to the removal of invasive vegetation (as identified on the City of Gresham \nInvasive Species List), and the removal of refuse or fill, provided that: \ni. All work is done using hand-held equipment; \nii. No existing native vegetation is disturbed or removed \niii. All work occurs outside of wetlands and the tops of banks or streams; \niv. No more than 200 square feet of area of ground is disturbed and the disturbed area is \nstabilized with new native vegetative cover prior to October 1 in any given year; and \nv. Up to 6 Invasive trees may be removed; however, if trees with the DBH of 6 inches or \ngreater are proposed to be removed, an NRO exemption form is required in accordance with \nSection 5.0705(C). \n5. Previously approved development as follows: \na. A building permit for a phased development project for which the Applicant has previously met \nthe application requirements, so long as the area of new construction was identified on the \noriginal permit and no new portion of the RA will be disturbed. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[5.07]-6 \nCity of Gresham Development Code \n \n(06/22) \n \nb. On the individual lots where the location of the proposed improvements (disturbance area) was \nidentified in the land division decision and the City’s mitigation requirements were completed \nas part of the land division for the entirety of the proposed disturbance area. \n6. Operation, maintenance, and repair of existing improvements when no additional incursion into the \nRA is proposed, including: \na. Structures provided that the building footprint is not increased. \nb. Gardens, pastures, lawns and landscape perimeters, including the installation of new irrigation \nsystems within existing gardens, pastures, lawns, and landscape perimeters, with the exception \nof the planting of any invasive plants listed on the City of Gresham Invasive Plant List. \nc. Streets and roads, railroads, bridge footings, easements, and access roads and above-ground \nutilities.   \nd. Subsurface utilities provided there are no above ground impacts or impacts to trees (e.g., \ndamage to the root zone) within the RA. \ne. Manmade water control facilities such as outfalls, culverts, irrigation and drainage ditches, \nconstructed ponds or lakes, wastewater facilities, and water quality facilities. \n7. Alteration and replacement of existing improvements when no additional incursion into the RA is \nproposed (including the uses and activities listed in Subsection (6)) provided an NRO exemption \nform is completed in accordance with Section 5.0705(C). \n8. The trenchless subsurface installation of new utilities (e.g., via microtunneling), provided there are \nno above ground impacts or impacts to trees (e.g., damage to the root zone) within the RA.  An \nNRO exemption form is required in accordance with Section 5.0705(C). \n9. Existing farming practices as defined in ORS 215.203 and farm uses, excluding construction or \nexpansion of buildings and structures. \n10. The maintenance of existing water-dependent uses that can only be carried out on, in, or adjacent to \nwater because they require access to the water for waterborne transportation or recreation when no \nadditional incursion into the RA is proposed. \n11. Projects with the sole purpose of restoring or enhancing wetlands, streams, or fish and wildlife \nhabitat areas, provided that the project is part of an approved local, state, or federal restoration or \nenhancement plan. An NRO exemption form is required in accordance with Section 5.0705(C). \n12. Planting of native vegetation/ \n13. Work undertaken by Multnomah County Drainage District or its successor agency pursuant to ORS \nchapters 547 or 554 or Titles 33 or 44 of the Code of Federal Regulations. \n14. Boundary and topographic surveys leaving no cut scars greater than three inches in diameter on \ntrees. \n15. Development within an RA that is completely separated by an improved right-of-way from the \nwater feature(s) which was the basis for the RA. This exemption only applies to RAs that are \nassociated with a water feature (i.e., stream, wetland or other waters).  It does not apply to upland \nhabitat areas. See Section 5.0714, Mapping Protocols. An NRO exemption form is required in \naccordance with Section 5.0705(C). \n16. Installation of fencing that meets the wildlife passage design standards in the Gresham \nEnvironmental Technical Guidance Manual. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[5.07]-7 \nCity of Gresham Development Code \n \n(06/22) \n \nB. \nAdditional Exemptions for All Areas except HVRAs. Except within mapped High Value Resource \nAreas, the following uses and activities are exempt from the permit requirements of the NRO provided \nthat an NRO exemption form is completed in accordance with Section 5.0705(C): \n1. The alteration, expansion, or replacement of existing structures, provided that: \na. The alteration, expansion, or replacement of a structure will not intrude more than 500 square \nfeet into a mapped RA or PRA in addition to the area defined as the building footprint as of \nJanuary 1, 2006. \nb. Where the RA is mapped, the new intrusion into the RA is no closer to the HVRA than the pre-\nexisting structure or improvement. \n2. Minor encroachments into the RA or PRA not to exceed 120 sq. ft. of impervious surface such as \naccessory buildings, eave overhangs, exterior building improvements required to meet access and \nexiting requirements, or other similar features. \n3. Facilities that infiltrate stormwater onsite, including the associated piping, may be placed within the \nRA or PRA so long as the forest canopy and the areas within the Critical Root Zones of the trees are \nnot disturbed. Such facilities may include, but are not limited to, vegetated swales, rain gardens, \nvegetated filter strip, and vegetated infiltration basins. Only native vegetation may be planted in \nthese facilities. \n4. Temporary and minor clearing not to exceed 200 square feet for the purpose of site investigations \nand pits for preparing soil profiles, provided that such areas are restored to their original condition \nwhen the investigation is complete.   \n5. Low-impact outdoor recreation facilities for public use,  including, but not limited to, multi-use \npaths, access ways, trails, picnic areas, or interpretive and educational displays and overlooks that \nmay include benches and outdoor furniture, provided that the facility meets the following \nrequirements: \na. It contains less than 500 sq. ft. of new impervious surface. This area represents the total \ncumulative amount of new impervious surfaces that shall be allowed on a site under this \nexemption. \nb. Any trails shall be constructed using non-hazardous, pervious materials, with a maximum width \nof four feet. \nc. Trees 24-inch DBH or larger shall not be removed and their critical root zones shall be \nprotected. \n6. using a single utility pole or where no more than 100 sq. ft. of ground surface is disturbed above the \nordinary high water mark of water bodies and where the disturbed area is restored to the pre-\nconstruction conditions. This area represents the total amount of disturbance area that shall be \nallowed for a utility project under this exemption (regardless of the number of parcels).   \nC. \nNRO Exemption Form. When required by Subsection A or B, a written verification of exemption \nshall be obtained from the City prior to conducting exempt uses or activities.  A completed form with a \nsite plan showing location of work and location of RA(s) and/or PRA(s) on the site, a description of the \nwork to be done, methods of protection (if any), and anticipated schedule of the work shall be submitted \nto the City a minimum of seven business days prior to the proposed activity. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[5.07]-8 \nCity of Gresham Development Code \n \n(06/22) \n \n5.0706  Permit Required   \nUnless exempt pursuant to Section 5.0705, a permit is required for all regulated activities within the NRO as \nfollows: \nA. \nProposed Uses and Activities within 50 feet of an RA. Applications for uses and activities that are \nproposed within 50 feet of an RA, but are not within an RA, are required to submit a scale map, site \nplan, and construction management plan in accordance with Section 5.0707(A) – (C). The construction \nmanagement plan shall be processed under the Type I procedure and shall be approved by the Manager \nif the construction management plan provides measures to protect trees and other vegetation located \nwithin the RA as specified in Section 5.0707(C). \nB. \nProposed Uses and Activities within an RA. The permit shall be processed under the development \npermit procedure and subject to the applicable standards specified in Table 5.0706-1 and the general \nrequirements in Section 5.0709(A) and (B).  All permit applications shall comply with the application \nrequirements in Section 5.0707.   \nC. \nProposed Uses and Activities within a PRA. Applications for uses and activities that are proposed \nwithin a PRA are subject to the PRA review requirements in Section 5.0703(B). If Title 3 Wetlands are \nidentified within the PRA, the permit requirements of Subsections (A) and (B) shall apply to such \nwetlands and buffers established in accordance with Section 5.0715(B). \n \nTable 5.0706-1 Permit Procedure and Additional Applicable Standards for Development within \nan RA \nProposed Activity or Request \nPermit \nProcedure \nApplicable  \nStandards \nPRA review \nType I \n5.0703(B) \nStandards for development in a RA \nDevelopment of a single detached dwelling or \nmiddle housing on a lot of record \nType I \n5.0710(A) \nLinear utility facilities  \nType I \n5.0710(B) \nNon-linear utility facilities  \nType I \n5.0710(C) \nRights of ways and public access easements  \nType I \n5.0710(D) \nPublic trails and paths and park enhancements \nType I \n5.0710(E) \nDangerous Tree Removal \nType I \n5.0708(A) \nProgrammatic Tree Removal \nType II \n5.0708(B) \nMunicipal utility facilities  \nType II \n5.0710(F) \nLand divisions  \nType II \n5.0710(G)(1-8) \nProperty line adjustment \nType I \n5.0710(G)(9) \nOther development activities in a RA (other than \nthose activities listed above)  \nType I \n5.0710(H) \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n[5.07]-9 \nCity of Gresham Development Code \n \n(06/22) \n \n \nOther Reviews \nRequest for payment-in-lieu of mitigation \nType II \n5.0711(E) \nAlternative review  \nType II \n5.0712 \nMap Correction \nType I \n5.0715(C) \n \n \n \n \n5.0707  Application Requirements   \nExcept as specified in Section 5.0708, all applications shall include the items required for the applicable \nprocedure type in accordance with Article 11 and the items required by this section, and items specified in the \nGresham Environmental Technical Guidance Manual \nA. \nExisting Conditions Map.  For the entire subject property, Applicants shall submit a scaled map of the \nproperty that includes: \n1. Location of all Potential Resource Areas, Resource Areas and High Value Resource Areas on the \nproperty. \n2. Outline of any existing disturbance area, including the location of existing adjacent streets and \npaved areas, utilities, culverts, stormwater management facilities, or bridges. \n3. Location of any known wetlands, waterways, or other waters on the property. \n4. Location of Floodplain Overlay and floodway boundary as defined by the Federal Emergency \nManagement Agency (FEMA). \n5. Topography shown by contour lines. On properties that are two acres or larger, contours are only \nrequired for the portion of the property to be developed. \n6. If applicable, the boundaries of the Hillside and Geologic Risk Overlay. \nB. \nProposed Site Plan. Detailed site plan of proposed development outlining total permanent and \ntemporary disturbance area (including proposed building footprints, site property improvements, \nutilities, grading, and landscaping) and existing and proposed lot lines. \nC. \nConstruction Management Plan (CMP). In order to ensure that trees and vegetation remain \nundisturbed within RAs and are not damaged during construction, the application shall include a \nconstruction management plan demonstrating either that all work impacts will take place outside of the \nRA or that work impacts within the RA will be within a proposed disturbance area and the application is \nin compliance with Section 5.0709(A).  At a minimum, a construction management plan shall include \nthe following information: \n1. Location of site access and egress that construction equipment will use. \n2. Equipment and material staging and stockpile areas. \n3. Erosion and sediment control measures in accordance with the City of Gresham “Erosion \nPrevention and Sediment Control Manual” appendix of the Gresham Stormwater Management \nManual. \n4. Critical Root Zone of all trees to be preserved within 50 feet of the disturbance (per Gresham \nEnvironmental Technical Guidance Manual). \n5. Measures in accordance with the Gresham Environmental Technical Guidance Manual to protect \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": " \n[5.07]-10 \nCity of Gresham Development Code \n \n(06/22) \n \ntrees and other vegetation located within the RA, other than those within a proposed disturbance \narea. \n6. A construction schedule that includes the timing of in-stream work (if applicable). In addition, the \nCMP must include a copy of written notification of the ODFW and NFMS notification. \nD. \nAdditional Information Required. If any disturbance (permanent or temporary) is proposed within the \nRA, the following additional information shall be provided: \n1. Tree survey information: \na. Detailed tree survey information including the location, diameter at breast height (DBH) and \nspecies of: \ni. Any tree greater than six inches (DBH) located within the disturbance area. \nii. Any trees 24 inches or greater (DBH) located within 50 feet of the disturbance area. \nb. When all trees within 50 feet of the disturbance area are below 24 inches DBH, generalized tree \nsurvey Information including the approximate location and number of trees, their diameters and \nthe dominant species may be allowed. \nc. If the Applicant is requesting tree removal on the basis that the tree(s) is on the City of Gresham \nInvasive Plant List, the identity of the species including in-focus, high resolution photographs \nsupporting identification of species such as habitat, trunk, crown, flowers, fruits, branches, \ntwigs, and leaves is required. \nd. If the Applicant is requesting tree removal on the basis that the tree(s) meets the definition of \nDangerous Tree, an International Society of Arboriculture (ISA) basic tree risk assessment \nprepared by a qualified arborist is required.   \n2. A grading plan showing the proposed alteration of the ground. \n3. An outline of the disturbance area that identifies the vegetation to be removed. \n4. Narrative explanation and materials necessary to demonstrate compliance with the applicable \ndevelopment standards of Section 5.0709 and 5.0710. \n5. Mitigation plan showing plant location, spacing, species, and size at planting, maintenance plan and \nschedule, and monitoring plan prepared in accordance with Section 5.0711, unless payment-in-lieu \nof mitigation is proposed in accordance with Section 5.0711. \nE. \nIn addition to the requirements of this section, additional applications requirements may apply as \nspecified in the NRO (e.g., for Alternative Review). \n \n5.0708  Tree Removal not Associated with Other Development   \nThe following standards apply to the removal of Dangerous Trees or trees listed on the City of Gresham \nInvasive Plant List within the RA that are not associated with other development or to programmatic permits for \ntree removal. The general standards in Section 5.0709(A) do not apply to tree removal subject to this section. \nTree removal being proposed in conjunction with other development (e.g., a land division) shall be subject to the \nNRO standards applicable to that development rather than this section.   \nA. \nTree removal may be approved through the Type I process, when: \n1. One of the following criteria is met: \na.  The tree is identified as an invasive species and evidence regarding the species of the tree and \nthe credentials of who identified it are included as part of the application.  Applicants shall \nsubmit the information required by Section 5.0707(D)(1)(c). \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": " \n[5.07]-11 \nCity of Gresham Development Code \n \n(06/22) \n \nb. The tree meets the definition of Dangerous Tree and its removal is recommended by a qualified \ncertified arborist who has-completed basic tree risk assessment for the tree. Applicants shall \nsubmit the information required by Section 5.0707(D)(1)(d). \n2. Proposals to remove a total of six of fewer trees (invasive species, and/or Dangerous Trees) are \nexempt from the submittal requirements in Section 5.0707, except as specified in Subsection (a).  \nFor all other proposals to remove such trees, other vegetation on the site must be protected in \naccordance with an approved construction management plan prepared pursuant to Section \n5.0707(C) and a plan describing the methods of removal must be submitted. \nB. \nTree removal may be approved through a Type II Programmatic Permit.  Type II Programmatic Permits \nmay only be obtained by Public Agencies and Utilities with a Gresham franchise license to allow for \nroutine public facility or utility operation, repair and replacement, and/or on-going maintenance or \nenhancement programs. The purpose of a Programmatic Permit is to eliminate the need for individual \ntree removal permits for ongoing activities within the RA or HVRA.  Programmatic permits do not \ncover tree protection, removal, planting, or mitigation associated with a development permit. \n1. Time Limits. The Manager may approve a Programmatic Permit for a period of up to 2 years. An \nannual report from the applicant on activity conducted under the permit is required to be submitted \nto the Manager by June 30 each year.  Failure to submit the annual report will result in \ncancellation/suspension of the Programmatic Permit.   \n2. Work Standards.  All work conducted under a programmatic permit must be conducted in \naccordance with proper arboricultural practices as detailed in the most recent version of ANSI A300 \nstandards. \n3. Review Factors.  The Manager may approve a Programmatic Permit for work in the RA and HVRA \nupon finding that the following review factors are met or will be met with conditions: \na. Biodiversity:  The activities will result in the same or better native species diversity within each \nproject area treated under the programmatic permit. \nb. Erosion Control: Activities will be planned to prevent exposed soil areas of greater than 500 \nsquare feet during the wet weather window of October 1 to May 1. \nc. Mitigation of Impacts:  The activities will protect or improve project area conditions as they \nrelate to water quality, critical habitat protection, and forest health. \nd. Risk reduction: \n• \nIgnition fuel reduction at the private-public property interface shall occur before any \nadditional coarse woody debris (CWD) is placed as part of stand management activities. \n• \nCWD shall be placed in a manner not likely to increase wildfire, slope movement, or public \nsafety risks. \n• \nPlants not designated as fire accelerants on the Gresham Native Plant List will be preferred \nfor retention in defined firebreak areas. \n• \nPlants designated as fire accelerants on the Gresham Native Plant List will not be planted in \ndefined firebreak areas. \n• \nSuspended branch material is addressed as part of site activities. \n• \nAllowance for amount and location limitations for cut or chipped CWD are observed. \n• \nSnags or habitat tree retention is incorporated into project areas where retention of such \nfeatures pose no risk to structures or active use areas. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": " \n[5.07]-12 \nCity of Gresham Development Code \n \n(06/22) \n \n• \nWithin areas mapped as past landslides or associated scarp flanks according to DOGAMI \nIMS-57, a geotechnical review by a Certified Engineering Geologist or Geotechnical \nEngineer in advance of vegetation removal or deposition of CWD demonstrates the \ndevelopment will not cause negative impacts to on- and off-site geologic conditions, \nprocesses, or hazards.   \n4. Application Requirements. The application requirements in Section 5.0707 do not apply.  In \naddition to the requirements for a Type II application, an application for a programmatic permit \nshall include: \na. A narrative description of proposed activities and locations and how the activities comply with \nthe review factors above. \nb. A map of the areas work will occur, including generalized locations of each type of work. \n5. Permit Specifications. Approved permits issued by the City shall include the following \nspecifications. The Manager may modify these specifications during the permit period in order to \nrespond to public safety concerns, changes in regulations, or previously unforeseen issues, provided \nthe applicant is notified in writing and provided an opportunity to appeal the change: \na. Duration of permit. \nb. Geographic area covered by the permit. \nc. Permitted activities and any restrictions on the method, number, type, location or timing of \nactivities. \nd. Procedures and thresholds for informing neighboring residents, businesses, and the City of \nupcoming permitted activities.  \ne. Monitoring, performance tracking and reporting requirements. The Manager may prescribe \nrules or procedures that specify the manner in which such tracking and reporting occur. \n6. Revocation. The Manager may revoke a Programmatic Permit upon finding the applicant is not \nadhering to the limitations imposed or is acting beyond the activities permitted by the Programmatic \nPermit. Noncompliance with the Programmatic Permit may also be cause for any other enforcement \naction as stated in Section 5.0716. \n \n5.0709  General Development Standards   \nA. \nGeneral Standards. The following standards apply to all regulated development within an RA. \n1. Mitigation is required for the removal of trees and other vegetation in accordance with Section \n5.0711.  Trees listed on the City of Gresham Invasive Plant List are exempt from this mitigation \nstandard. Dangerous Trees are exempt from this mitigation standard but must be replaced at a ratio \nof one tree planted on site for each tree removed. \n2. All vegetation planted in an RA shall be native unless otherwise approved by the Manager based on \nthe Gresham Environmental Technical Guidance Manual.  \n3. Fences are allowed only within an approved disturbance area unless the fencing meets the wildlife \npassage design in the Gresham Environmental Technical Guidance Manual. \n4. Lighting within 50 feet of the RA shall be placed or shielded so it does not shine directly into the \nRA or must be motion activated. \n5. Temporary disturbance areas must be fully restored (see the Gresham Environmental Technical \nGuidance Manual). \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": " \n[5.07]-13 \nCity of Gresham Development Code \n \n(06/22) \n \n6. No fill or removal is allowed within a wetland, water body, or ordinary high water mark of a stream, \nunless all required permits are obtained from the US Army Corp of Engineers, and/or the Oregon \nDepartment of State Lands.  \n7. Stream crossings, bridges, new culverts, and culvert expansions shall be designed in accordance \nwith the Oregon Department of Fish and Wildlife (ODFW) fish passage criteria unless exempted or \nwaived by ODFW. \n8. Any state or federally approved work that will take place in a regulated waterway shall be \nconducted during the specified in-water work period as determined by Oregon Department of Fish \nand Wildlife for each specific water body. \n9. No parking beyond the minimum amount required in Sections 9.0850-9.0853 shall be allowed \nwithin the RA. This standard does not apply to single detached dwelling and middle housing \ndevelopment. \n10. During construction, the following standards apply: \na. Trees in the RA shall not be used as anchors for stabilizing construction equipment. \nb. Erosion control measures shall be in place prior to and maintained throughout the construction.  \nc. No stockpiling of soil or debris is allowed in the RA, except within an approved permanent or \ntemporary disturbance area. \nd. Prior to construction, the RA that is to remain undeveloped shall be flagged, fenced, or \notherwise marked and shall remain undisturbed. \ne. All construction activity on the property shall conform to the construction management plan \ndescribed in Section 5.0707(C). \nf. Tree protection shall either include all of the following protective measures or be designed by a \nCertified Arborist: \ni. No soil compaction or removal of vegetation or tree branches shall occur within the Critical \nRoot Zone.  \nii. Prior to any grubbing, clearing, grading, parking, preparation or storage of materials or \nmachinery, or other construction activity on the site, all trees to be protected on the project \nsite and adjacent to the site shall be clearly identified and temporary fencing shall be \ninstalled at the perimeter of the Critical Root Zone. Protective fencing shall be of a material \nthat cannot easily be moved, removed, or broken during construction activities.  \niii. No machinery repair, cleaning or fueling shall be performed within the Critical Root Zone \nof any trees identified for protection. \niv. Digging a trench for placement of public or private utilities or other structure within the \nCritical Root Zone of a tree to be protected is prohibited. \ng. For any construction or grading within the Critical Root Zone of a tree to be protected, a \nCertified Arborist shall inspect tree protection measures before and after work is completed or \nbe on site during any construction or grading activities. \nB. \nMethods for Avoiding Resource Areas. When development is proposed in the RA, an application may \ninclude the following habitat-friendly development practices to minimize the impact on the RA.    \n1. When building on a lot containing RA, the minimum building setback of the base district may be \nreduced to any distance between the base district minimum and three feet, unless this reduction \nconflicts with applicable fire or life safety requirements or the requirements to maintain a clear \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": " \n[5.07]-14 \nCity of Gresham Development Code \n \n(06/22) \n \nvision area in accordance with Section 9.0200. \n2. The minimum percentage landscaping requirements, apart from those required for parking lots, \nstreet trees, buffers (Section 9.0100) and required mitigation areas, may be met by preserving the \nRA. \n3. Density Transfer. For the purposes of this section, development sites may include non-contiguous \nproperties provided all of the properties that form the development site are within the same Natural \nResource Overlay Subarea (i.e., Pleasant Valley, Springwater, Kelley Creek Headwaters, or all \nother areas within the City of Gresham). See Map 5.0714-1. Development may be transferred to no \nmore than one non-contiguous property. On-site density transfer to avoid or minimize development \nshall be allowed within RA as follows: \na. Single Detached Dwellings and Middle Housing Development Lot Transfer \ni.  The number of lots in areas receiving lot transfers shall not exceed 125% of the lots that \ncould be created for single detached dwellings at maximum density for the underlying \nzoning district. \nii.  A number of lots equal to no more than 50% of the minimum lots for single detached \ndwellings permitted on the undisturbed RA portion of the site may be transferred onto the \nnon-RA portion of the development site. \niii.  The actual number of lots transferred shall be the lesser of the number of lots in i or ii \nabove.  \niv.  The transferred lots shall be in addition to the base number of dwelling units allowed in the \napplicable zoning district. \nb. Multifamily Development density transfer. \ni. \nThe density in areas receiving density transfers shall not exceed 125% of the density \nallowed by the underlying subdistrict of the receiving area.  \nii. A number of dwelling units equal to no more than 25% of the minimum density permitted \non the undisturbed RA portion of the site is permitted to be transferred onto the non-RA \nportion of the development site. \nc. Commercial, Industrial, and Institutional Development Floor Area Transfer \ni. \nThe floor area ratio in areas receiving FAR transfers shall not exceed 125% of the FAR for \nthe underlying sub-district of the receiving area. \nii. For density transfers in property developed as Commercial or Industrial, the transfer credit \nis 10,000 sq. ft floor area ratio (FAR) per acre of undisturbed land within the RA. For \ndevelopments that have no cap in FAR, the manager shall permit a reduction of the \nminimum parking requirement of up to 25 percent of the standard minimum parking \nrequirement. This allowance is in addition to any other minimum parking reduction \nallowance provided in Section 9.0800. \nd. Within mixed-use developments the development transfer credit is factored using a combination \nof Subsections (a), (b), and (c), above, which shall be pro-rated based on the percentages of \ngross floor area (GFA) devoted to residential and non-residential uses.  \ne. To accommodate the transferred density, lot dimensional standards, lot sizes, and minimum \nsetbacks on the non-RA portion of the site may be reduced by no more than 20%. Applicants \nmay use the landscaping reductions in Subsection (B)(2).  \nf. All RA counted toward density transfer shall be permanently restricted from development and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": " \n[5.07]-15 \nCity of Gresham Development Code \n \n(06/22) \n \nmaintained for habitat functions, such as by making a public dedication, creating a separate tract \nand/or executing a restrictive easement. \n \n5.0710  Standards for Specific Development Types within a Resource Area   \nA. \nSingle detached and middle housing. In addition to the general standards in Section 5.0709(A), the \nfollowing standards apply to the development of single detached dwellings and middle housing and \nrelated accessory structures and dwellings on existing legal lots of record.  Applicants who cannot or \nchoose not to comply with the standards of this section may apply for Alternative Review in accordance \nwith Section 5.0712. \n1. The maximum disturbance area (permanent and temporary) allowed within the RA on a lot is \ndetermined by subtracting all portions of the lot outside the RA from 6,000 square feet. If there is \n6,000 square feet of contiguous land outside of the RA with a minimum dimension (at any point) of \n40 feet in either width or depth, all permanent and temporary disturbance must occur outside the \nRA.  If there is not such a 6,000 square foot area outside the RA, encroachment into RA shall be \nlimited to the amount of area needed to make up for the deficit. \n2. The entire disturbance area shall be entirely outside the HVRA.   \n3. Of the 6,000 square feet maximum disturbance area permitted within the RA, no more than 4,000 \nsquare feet shall be permanent disturbance area. The balance may be temporary disturbance area.  \n4. Trees may be removed within the permanent disturbance area.  Within the temporary disturbance \narea, no trees 24 inches DBH or larger shall be removed. If any part of the Critical Root Zone of a \n24-inch DBH or larger tree is within a proposed permanent disturbance area, the entire Critical Root \nZone of the tree  shall be included for the purposes of calculating the maximum permanent \ndisturbance area.  Mitigation shall be in accordance with Section 5.0711(C). Dangerous Trees or \ntrees listed on the City of Gresham Invasive Plant List are exempt from this standard and may be \nremoved.   \n5. A stormwater facility serving only a single residential lot is allowed to be located outside of the \ndisturbance area (temporary and permanent) but within the RA provided it is outside the HVRA, \nthere is no disturbance to existing tree canopy, and it is located outside the Critical Root Zone of \nexisting trees over six inches DBH. \nB. \nStandards for Linear Utility Facilities. In addition to the general standards in Section 5.0709(A), the \nfollowing standards apply to new linear utility facilities (including private connections to existing or \nnew utility lines, and new utilities or upgrades of existing utility lines) that are proposed as a standalone \nproject. Linear utilities being proposed in conjunction with other development shall be subject to the \nNRO standards applicable to that development rather than this section. Applicants who cannot or choose \nnot to comply with the standards of this section may apply for Alternative Review in accordance with \nSection 5.0712. \n1. The maximum disturbance area in the RA shall be 1,200 square feet and the maximum width of the \ndisturbance area shall not exceed 12 feet at any point. \n2. The disturbance area shall be fully restored with the exception of permanent access points along the \nutility facility. Access points shall not exceed 144 square feet in size, shall be spaced no closer than \none every 200 feet of utility line, and shall not be located in an HVRA. \n3. Linear utilities shall not run parallel to a stream within an RA for a continuous distance of longer \nthan 600 feet. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": " \n[5.07]-16 \nCity of Gresham Development Code \n \n(06/22) \n \n4. Underground linear utilities that extend more than 50 feet into an RA or which cross a stream shall \nbe installed using bore, rather than trench, installation methods. \n5. Trees under 24 inches DBH may be removed within the disturbance area. No trees 24-inch DBH or \nlarger shall be removed. If any part of the Critical Root Zone of a 24-inch DBH or larger tree is \nwithin a proposed disturbance area, the entire tree shall be included for the purposes of calculating \nthe maximum disturbance area. Dangerous Trees or trees listed on the City of Gresham Invasive \nPlant List are exempt from this standard and may be removed.   \n6. For utility projects undertaken by utilities across property that is not owned by the utility, the utility \nshall not be required to map or provide any information about the property except for the area \nwithin 50 feet on either side of the proposed disturbance area of the utility’s project. \nC. \nStandards for Non-Linear Utility Facilities. These standards apply to non-linear minor basic utilities \nsuch as diversion structures, lift stations, pump stations, wellheads, small water treatment facilities and \nstormwater facilities that serve more than one lot or development. In addition to the general standards in \nSection 5.0709(A), the following standards apply to new facilities and upgrades of existing facilities \nthat are proposed as a standalone project. Non-linear utilities being proposed in conjunction with other \ndevelopment (e.g., a land division) shall be subject to the NRO standards applicable to that development \nrather than this section. Applicants who cannot or choose not to comply with the standards of this \nsection may apply using the Alternative Standards in Section 5.0712. \n1. The maximum permanent disturbance area in the RA shall be 1,000 square feet. An additional 200 \nsquare feet of temporary disturbance area in the RA is permitted. \n2. Disturbance areas shall not be allowed in the HVRA. \n3. Trees under 24 inches DBH may be removed within the disturbance area. No trees 24-inch DBH or \nlarger shall be removed. If any part of the Critical Root Zone of a 24-inch DBH or larger tree is \nwithin a proposed disturbance area, the entire tree shall be included for the purposes of calculating \nthe maximum disturbance area. Dangerous Trees or trees listed on the City of Gresham Invasive \nPlant List are exempt from this standard and may be removed.   \n4. All trees required for mitigation shall be planted on site and outside of proposed utility access \neasements.   \nD. \nStandards for Right-of-Ways and Public Access Easements. In addition to the general standards in \nSection 5.0709(A), the following standards apply to public right-of-ways (ROW) and Public Access \nEasements, including roads and bridges (stream crossings). ROW and public access easements being \nproposed in conjunction with other development (e.g. a land division) shall be subject to the standards \nof this section in addition to the NRO standards applicable to that development. Applicants who cannot \nor choose not to comply with the standards of this section may apply for Alternative Review in \naccordance with Section 5.0712. \n1. For proposed improvements with ROWs and public access easements that include a stream \ncrossing:  \na. New stream crossings for motorized vehicles subject to this section are allowed only for street \nclassifications of collector or above shown on the Transportation System Plan, all other \nproposed vehicle crossings require alternative review. \nb. New stream crossings for bicycle and pedestrian traffic required by the Transportation System \nPlan, Active Transportation Plan, and/or Appendix J of the Parks and Open Space Master Plan \nare subject to this section, all other proposed pedestrian crossings require alternative review. \nc. Within the RA, standard ROW cross section width dedication shall be required, although the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 17,
      "text": " \n[5.07]-17 \nCity of Gresham Development Code \n \n(06/22) \n \nwidth of the street section improvements shall be reduced by eliminating medians, planter \nstrips, and parking lanes.  \nd. Stream crossings shall be designed by an Engineer. Stream crossings where no regulated \nfloodplain has been identified will be designed to pass a 100-year flood without any increase in \nthe upstream flood height elevation. \n2. Trees under 24 inches DBH may be removed in the RA if the Critical Root Zone is within 10 feet of \nthe proposed improvements. No trees 24-inch DBH or larger shall be removed, except within the \napproved permanent disturbance area established pursuant to Subsection (G), below.  Dangerous \nTrees or trees listed on the City of Gresham Invasive Plant List are exempt from this standard and \nmay be removed.   \n3. Reduction of cross section for rights of way that lie entirely within the RA or HVRA may be \nallowed by removing median, parking lane, planter strip, or combination thereof. Alleys may be \nutilized, including: \na. Dead-end alleys not exceeding a length of 150 feet that may be designed for two way operation. \nb. Alleys entirely within RA or HVRA are exempt from the alley design restriction of Appendix \n5.501(H)(6) \nE. \nStandards for Public Trails and Paths and Park Enhancements. In addition to the general standards \nin Section 5.0709(A), the following standards apply to public trails, paths and related park \nenhancements, except for bridges/stream crossings allowed in accordance with Section 5.0710(D). \nApplicants who cannot or choose not to comply with the standards of this section may apply for \nAlternative Review in accordance with Section 5.0712. \n1. The maximum disturbance area within the RA shall be 500 square feet per acre of RA within the \nsite.   \n2. All trails shall be outside the HVRA except as designated in Appendix J of the 2009 Gresham Parks \nand Recreation, Trails and Natural Areas Master Plan (or its successor).  \n3. New trails or paths shall not result in disturbance of the Critical Root Zone of any tree 6-inch DBH \nor greater in size whose trunk is located inside the HVRA. \n4. Trees under 24 inches DBH may be removed within the disturbance area. No trees 24-inch DBH or \nlarger shall be removed. If any part of the Critical Root Zone of a 24-inch DBH or larger tree is \nwithin a proposed disturbance area, the entire tree shall be included for the purposes of calculating \nthe maximum disturbance area. Dangerous Trees or trees listed on the City of Gresham Invasive \nPlant List are exempt from this standard and may be removed.   \n5. All trees required for mitigation shall be planted outside of those areas that will be maintained to \nprovide trail access.   \n6. The proposed trail, path, or enhancement shall be associated with previously developed park \ninfrastructure, be connected to the existing park systems, implement master planned park facilities, \nor be identified in Appendix J of the 2009 Gresham Parks and Recreation, Trails and Natural Areas \nMaster Plan (or its successor).  \nF. \nStandards for Municipal Utility Facilities. In addition to the general standards in Section 5.0709(A), \nthe following standards apply to municipal utility facilities associated solely with Capital Improvement \nProjects. For the purposes of this section, municipal utility facilities include: municipal potable water, \nmunicipal stormwater and municipal wastewater utility facilities including but not limited to water \ntreatment plants, wastewater treatment plants, raw water intakes, pump stations, transmission mains, \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 18,
      "text": " \n[5.07]-18 \nCity of Gresham Development Code \n \n(06/22) \n \nconduits or service lines, reservoirs, and outfall devices. These facilities may be built, expanded, \nrepaired, maintained, reconfigured, rehabilitated, replaced or upsized within an RA provided that the \nstandards are met. Applicants shall comply with the application requirements in Section 5.0712(A), \nexcept that only one alternative (the preferred alternative) must be evaluated. The application shall \ndemonstrate that the following standards are met. \n1. The project does not encroach closer to an HVRA than practicable; and \n2. Best management practices will be employed that accomplish the following: \na. Account for watershed assessment information in project design. \nb. Minimize trenching and tree removal within the RA through methods such as boring. \nc. Obtain necessary local or state erosion control permit. Utilize and maintain erosion controls \nuntil site stabilization measures are established. \nd. Replant immediately after backfilling or as soon as weather conditions allow. \ne. Retain topsoil (stockpiled outside of RA if feasible) and use for final cover. \nf. Minimize the duration of the work within the RA. \ng. Complete in-water construction during appropriate seasons, or as approved within requisite \nFederal or State permits. \nG. \nStandards for Land Divisions and Property Line Adjustments. Applicants who cannot or choose not \nto comply with the standards of this section may apply for Alternative Review in accordance with \nSection 5.0712. \n1. Land divisions for uses other than single detached dwelling or middle housing development. \na. Applicants who are dividing, but not further developing, shall comply with the standards in \nSubsections (5) – (6) and shall: \ni. Complete the mitigation requirements in accordance with Section 5.0711 and thereby \nexempt all subsequent development on lots or parcels containing RA from further review \nunder this overlay.1  The City will verify that the mitigation requirements have been met \nwhen individual lot building permit applications are processed; or \nii. Not complete the mitigation requirements, thus requiring that all subsequent development \nwithin an RA be subject to further land use review for compliance with this overlay. \nb. Applicants who are dividing and further developing shall comply with the standards in \nSubsections (5) – (7), the general standards in Section 5.0709(A), and all of the requirements of \nthe NRO applicable to the development. Building permits may be issued once one or both of the \nfollowing has occurred: \ni. When the City will be implementing the mitigation requirements, the Applicant has \ntransferred to the City all mitigation and maintenance funding required by the Conditions of \nApproval; and/or \nii. When the Applicant is responsible for implementing the mitigation requirements, the \nmitigation plan has been approved and a Guarantee of Completion equal to 110% of the \nestimated cost of mitigation implementation and maintenance is filed with the City.  The \n \n1 This does not exempt any development from protecting jurisdictional resources present at the time of any future \ndevelopment application. All future development must ensure compliance with state and federal resource protection rules \nrelated to jurisdictional water resources. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 19,
      "text": " \n[5.07]-19 \nCity of Gresham Development Code \n \n(06/22) \n \nGuarantee of Completion shall ensure site preparation and initial planting within one year of \nfinal plat approval. \n2. Land divisions for single detached dwelling or middle housing development.  Applicants shall \ncomply with the standards in Subsections (3) – (8), the general standards in Section 5.0709(A), and \nall other requirements of the NRO applicable to the development.  Building permits may be issued \nonce one or both of the following has occurred: \na. When the City will be implementing the mitigation requirements, the Applicant has transferred \nto the City all mitigation and maintenance funding required by the Conditions of Approval; \nand/or \nb. When the Applicant is responsible for implementing the mitigation requirements, the mitigation \nplan has been approved and a Guarantee of Completion equal to 110% of the estimated cost of \nmitigation implementation and maintenance is filed with the City.  The Guarantee of \nCompletion shall ensure site preparation and initial planting within one year of final plat \napproval. \n3. Each lot or parcel created for single detached dwelling or middle housing development shall have a \ndevelopable area of no less than 2,000 square feet with a building envelope whose minimum width \nor depth is at least 16 feet. The developable area on each lot shall be drawn, dimensioned, and noted \non the subdivision plat to demonstrate compliance with this standard. \n4. The maximum amount of RA that may be disturbed within the subdivision or partition shall not \nexceed 10% of the total RA on the parent parcel.  Trees and vegetation may be removed within the \ndisturbance area provided mitigation is provided in accordance with Section 5.0711. If any part of \nthe Critical Root Zone of a 24-inch DBH or larger tree is within a proposed disturbance area, the \nentire tree shall be included for the purposes of calculating the maximum disturbance area. \n5. Except as allowed pursuant to Subsection (6) below, when a property containing any RA is divided, \nplats shall delineate and show the RA as a separate unbuildable tract according to the following \nprocess: \na. The applicant must place at least 90% of the RA in a separate tract. In addition, where \nmitigation is proposed at the time of land division, any RA that is proposed to be preserved, and \ntherefore is not mitigated, shall also be placed in a separate tract. The separate tract(s), which \nshall not be a part of any lot used for construction of a dwelling unit or any other development, \nshall be shown on the preliminary plat. \nb. Prior to final plat approval, ownership of the RA tract shall be identified to distinguish it from \nlots intended for sale. The tract may be identified as any one of the following: \ni. Private natural area held by the owner or homeowners’ association by a restrictive covenant \nconveying storm and surface water management rights to the City; or \nii. For residential subdivisions, private natural area subject to Natural Resource Easement \nestablished in accordance with Section 9.0300; or \niii. At the owner’s option and if accepted by the City, public natural area where the tract has \nbeen dedicated to the City or Metro along with conveying storm and surface water \nmanagement rights to the City; \nc. Any of the above documents in Subsection (b) shall be submitted to the City for review and \nafter it is approved as part of the final plat review process, be recorded with Multnomah County \nalong with the subdivision plat. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 20,
      "text": " \n[5.07]-20 \nCity of Gresham Development Code \n \n(06/22) \n \n6. If the parent parcel is less than 22,000 square feet, a separate tract is not required. However, the \nApplicant shall place at least 70% of the RA in a Natural Resource Easement established in \naccordance with Section 9.0300. \n7. The amount of impervious area shall be minimized within an RA as follows: \na. When driveways for multiple properties are proposed inside an RA, the driveways shall be \nshared by at least two properties. \nb. No access shall be granted through an RA if access can be achieved outside the RA.   \n8. Within the Pleasant Valley and Springwater subareas (shown on Map 5.0714-1), the rear property \nline of a single detached dwelling or middle housing lot shall not abut an RA. The City may allow \nexceptions to this standard due to topography, existing development, street layout, or other reasons \nthat make this requirement impractical.  Land divisions which do not include new streets or roads \nare exempt from this requirement.   \n9. Property Line Adjustments. The following standards apply to Type I Property Line Adjustments \n(PLAs). The site of a Property Line Adjustment is the two properties affected by the relocation of \nthe common property line. The standards in Subsections (a) and (b), below, shall be met. \na. A Property Line Adjustment shall not result in any property being entirely in the RA, unless that \nproperty is entirely in the RA before the PLA, or the property will be dedicated or limited by \ndeed restriction to open space use. \nb. The amount of developable area on each property that is outside of the RA may not be reduced \nbelow 2,000 square feet with a building envelope whose minimum dimension is at least 16-feet. \nThe Property Line Adjustment shall not cause a property that contains less than this amount of \ndevelopable area to move further out of conformance. \nH. \nOther Development Activities subject to Maximum Disturbance Area Standard. In addition to the \ngeneral standards in Section 5.0709(A), the following maximum disturbance area standards apply to all \nregulated development activities except for those uses and activities regulated by Subsections (C) \nthrough (E) or Subsections (G) through (J), above.  Applicants who cannot or choose not to comply \nwith the standards of this section may apply for Alternative Review in accordance with Section 5.0712. \n1. The maximum permanent disturbance area allowed is 25% of the RA on the site. In addition, a \ntemporary disturbance area is allowed within 10 feet of the proposed improvements up to a \nmaximum of 5% of the RA on the site. \n2. The disturbance area (temporary and permanent) shall be entirely outside the HVRA.   \n3. Trees may be removed within the permanent disturbance area.  Within the temporary disturbance \narea, no trees 24-inches DBH or larger shall be removed.  If any part of the Critical Root Zone of a \n24-inch DBH or larger tree is within a proposed disturbance area, the entire tree shall be included \nfor the purposes of calculating the maximum permanent disturbance area.  Dangerous Trees or trees \nlisted on the City of Gresham Invasive Plant List are exempt from this standard and may be \nremoved.   \n4. Non-residential applications that are otherwise subject to a discretionary review process shall \nprovide findings demonstrating that the proposal minimizes the number of trees 24-inch DBH or \nlarger proposed for removal. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 21,
      "text": " \n[5.07]-21 \nCity of Gresham Development Code \n \n(06/22) \n \n5.0711  Mitigation Requirements   \nIn order to achieve the goal of reestablishing the ecological values and functions provided by the Resource Area, \ntree replacement and vegetation planting are required when development extends into an RA.  The City of \nGresham mitigation requirements can be met by demonstrating compliance with the standards of this section. \nApplicants who cannot or choose not to comply with the standards of this section may apply for Alternative \nReview in accordance with Section 5.0712. \nA. \nExemptions. Removal of trees listed on the City of Gresham Invasive Plant List or Dangerous trees are \nexempt from the mitigation standards of this section. Dangerous Trees shall be replaced at a ratio of one \ntree planted on site for each tree removed. \nB. \nJurisdictional Wetlands.  Wetland mitigation shall be conducted per the functional and area \nreplacement standards established by the Army Corps of Engineers and the Oregon Department of State \nLands.  The NRO shall not impose additional mitigation requirements for wetlands that exceed the \nmitigation ratios or functions required by federal and state law.  Impacts to protected water features \nshall be mitigated within the sub-watershed (6th Field Hydrologic Unit Code) where the property is \nlocated, and all mitigation shall be done using native plants. Impacts to any RA that are not within the \nboundaries of the jurisdictional wetland shall be mitigated pursuant to Subsections C or D, as \napplicable. \nC. \nMitigation Standards for Single Detached Dwellings or Middle Housing on existing legal lots of \nrecord. Mitigation for single detached dwellings, middle housing, and related accessory structures and \naccessory dwellings on existing legal lots of record shall be conducted off-site by the City of Gresham. \nApplicants are required to pay for off-site mitigation -in-lieu of providing onsite mitigation otherwise \nrequired by the NRO. The payment shall be based on a rate set by Council resolution. Payment is not \nrequired in the following situations: \n1. Mitigation has been or will be completed for a jurisdictional wetland in accordance with Subsection \n(B) and no other mitigation is required. \n2. Mitigation was completed in conjunction with the land division that created the lot in accordance \nwith Section 5.0710(G). \nD. \nMitigation Standards for All Other Uses and Activities. \n1. Mitigation shall occur at a 2:1 ratio of mitigation area to proposed disturbance area. The target plant \ndensity within mitigation areas is specified below. \nPlant Type \nTarget Plant Density within Mitigation Areas \nTrees \n436 trees per acre \nShrubs \n2,178 shrubs per acre \nGround cover \n90 percent coverage within 3 years, 100 percent cover \nwithin 5 years \n \nThe total number of trees and shrubs required within a mitigation shall be calculated as follows: \nPlant Type \nFormula for Calculating Required Mitigation \nPlanting \nTotal number of trees \nMitigation Area (sf) x 0.01 trees/sf) \nTotal number of shrubs \nMitigation Area (sf) x 0.05 shrubs/sf). \nGround cover \nSeed or install native ground cover plants (grasses \nor forbs) to achieve target plant density \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 22,
      "text": " \n[5.07]-22 \nCity of Gresham Development Code \n \n(06/22) \n \n \nNOTE: The number of trees to be planted may be reduced based on the existing \ncanopy coverage of trees within the mitigation area (Adjusted total number of \ntrees = (Mitigation Area (sf) – Existing Canopy Coverage (sf)) x 0.01 trees/sf)). \nCanopy coverage must be determined by an arborist. \n \nThe number of shrubs to be planted may be reduced based on the total area of \ncontinuous shrub coverage within the mitigation area (Adjusted total number of \nshrubs = (Mitigation Area (sf) – Continuous Shrub Coverage (sf)) x 0.05 \nshrubs/sf)). Continuous shrub coverage must be identified by a qualified natural \nresource specialist and surveyed by a professional land surveyor, with dominant \nspecies identified. \n \n2. All vegetation shall be planted on the Applicant’s site within the RA or in an area contiguous to the \nRA; provided, however, that if the vegetation is planted outside the RA, then the Applicant shall \npreserve the contiguous area by executing a deed restriction, such as a restrictive covenant. Location \nof mitigation areas shall be prioritized as specified below. \nPriority \nLocation \nRiparian Priority 1 \nWithin the HVRA, outside of Fire Defensible \nSpaces Zones 1 and 2 \nRiparian Priority 2 \nWithin the RA, outside of Fire Defensible Spaces \nZones 1 and 2 \nRiparian Priority 3 \nWithin the HVRA or RA, within Fire Defensible \nSpaces Zone 2 \nNOTE:  \nFire Defensible Spaces Zone 1 – within 10 feet of a habitable structure \nFire Defensible Spaces Zone 2 – within 30 feet of a habitable structure \n \nNo mitigation credit will be given for plantings proposed within a Fire \nDefensible Spaces Zone 1 (within 10 feet of a habitable structure \n \n3. All mitigation plantings shall be native species appropriate for site soil types, hydrologic conditions, \naspect and existing vegetation coverage, topography, geologic hazard status, and fire safety. \na. Plantings shall consist of no more than 1 in 10 mitigation trees and no more than 1 in 10 \nmitigation shrubs designated as belonging to one of the following groups. Numeric limitations \napply per group, rather than across all groups.   \ni. ‘Suspected Climate Stressed’ on the Gresham Native Plant List. \nii. ‘Very High Forest Pest Risk’ on the Gresham Native Plant List. \nb. If 20 or more mitigation trees are planted, no more than 1/3 shall be of the same species. \nc. If fewer than 100 shrubs are planted at least 3 shrub species are required to be used. For more \nthan 100 shrubs at least 6 shrub species are required to be used. \n4. All plants that are on the Gresham Invasive Plant List must be removed from the mitigation area \nprior to mitigation plant installation.  Invasive control methods prior to planting and after planting \nshall be noted in the mitigation plan.   \n5. A mitigation maintenance plan shall be included and shall be sufficient to ensure the success of the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 23,
      "text": " \n[5.07]-23 \nCity of Gresham Development Code \n \n(06/22) \n \nplanting. Compliance with the plan shall be a condition of development approval. \n6. The Applicant is responsible for monitoring the mitigation site for five years and submitting an \nannual monitoring report to the City during that monitoring period demonstrating that the following \nminimum success thresholds for mitigation plant survival and invasive species eradication on the \nsite are being met.  If survival of trees or shrubs drops below 80% of the initial required planting \nquantities within the first five years, replacement plants must be added to maintain 80% or greater \nsurvival of plantings. Prior to re-planting, the cause of plant mortality must be determined and \ndocumented with a description of how the problem will be corrected. \nPlant Type \nSuccess Thresholds \nMitigation Trees \n350 trees per acre (0.008 trees per square foot) \nMitigation Shrubs \n1,750 shrubs per acre (0.04 shrubs per square foot) \nMitigation Ground Cover \n90% cover after 3 years; 100% cover after 5 years \nInvasive plants \nInvasive plant coverage may not exceed 20 percent \nor 25 square feet of contiguous area within the \nmitigation area. \n \n \na. Plant survival shall be demonstrated as follows: \ni. For mitigation sites that are less than or equal to 0.25 acres in size: \n• \nComplete census of installed tree and shrub plantings \n• \nVisual estimate to provide cover and species diversity of herbaceous plants \n• \nVisual estimate of invasive plant coverage \nii. For mitigation sites that are greater than 0.25 acres in size: \n• \nVegetation sampling to provide annual estimates of cover, species diversity, and density \nof woody vegetation. Depending on the Mitigation Plan, sampling may need to be \nconducted within distinct planting zones (i.e. within Fire Defensible Spaces, within \nriparian forest, within utility corridor, etc.). Annual monitoring shall include the \nfollowing: \no Use of permanent plots and visual estimates to sample tree, shrub, herbaceous, and \ninvasive species coverage \no Sampling shall be conducted during the same stage of the growing season each \nyear, which shall be a period when plants are easily identifiable \no A minimum of five sample plots for mitigation areas two acres or less. An \nadditional two sample plots for each acre of mitigation area thereafter. \no Sample plots should cover at least 700 sf  \no  \n• \nAdditional vegetation monitoring details can be found in DSL’s Routine Monitoring \nGuidance for Vegetation. \nb. At a minimum, the annual monitoring report must contain the following: \n• \nPhotos from fixed locations \n• \nSampling data sheets \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 24,
      "text": " \n[5.07]-24 \nCity of Gresham Development Code \n \n(06/22) \n \n• \nSummarized sampling results \n• \nMonitoring plan showing the location of sample plots and photo points. \n7. Financial guarantee, in the form of an instrument approved by the City, shall be submitted to the \nCity before building permits are issued, or when no building permit is required before development \nwithin the RA commences. It shall be in an amount adequate to cover 110% of the cost of \nperforming the mitigation. The City will release the guarantee at the end of the five-year monitoring \nperiod, or before, if it determines that the trees and shrubs have been successfully established. \n8. No Certificate of Occupancy will be issued until mitigation has been installed. \nE. \nRequests to provide Payment-in-Lieu of Mitigation. An Applicant may request approval to provide \npayment-in-lieu of mitigation for all or a portion of the required mitigation. The payment-in-lieu amount \nis set by Council resolution and shall be used for natural resource projects within the city at large. \n1. Type II review of a request to provide payment-in-lieu of mitigation is required for projects \ninvolving Design Review (Types B, C, D, and E only), land division, or vegetation removal or \ndisturbance areas within the RA in excess of 10,000 square feet. \na. Application requirements.  In addition to the application requirements in Section 5.0707, \napplicants shall submit an Impact Evaluation and Alternatives Analysis prepared in accordance \nwith Section 5.0712(A)(1). \nb. Approval criteria. The Applicant has demonstrated that it is not practicable to complete all or a \nportion of the mitigation on-site due to insufficient land area suitable for mitigation.  Land area \nmay be considered unsuitable for mitigation if it is developed or contaminated or has similar \nconstraints, or if it has existing high quality resources that would not benefit from mitigation. \n2. For projects which do not meet the thresholds in Subsection (1), applicants may request that the \nCity accept payment-in-lieu of mitigation through a Type I review provided there are no impacts to \nthe HVRA. \n3. If the Applicant chooses, the Applicant may offer to convey land to the City, for natural resource \npurposes, to meet some or all of the payment-in-lieu. Determination of the land’s ecological value \nand whether or not to accept the offer of conveyance is at the city’s sole discretion. \n5.0712  Alternative Review   \nApplicants who cannot or choose not to comply with the standards of Section 5.0709, 5.0710, or 5.0711, may \napply for Alternative Review in accordance with this Section.   \nA. \nApplication Requirements. In addition to the items described in Section 5.07087 the Applicant shall \nalso provide information described in Subsections (1) through (3) and any additional information \nneeded to demonstrate compliance with the approval criteria in Subsection B. For utility projects \nundertaken by public utilities across property that is not owned by the utility, the utility is not required \nto map or provide any information about the property except for the area within 100 feet of the location \nof the proposed disturbance area of the utility’s project. \n1. Alternatives Analysis and Impact Evaluation. An alternatives analysis and impact evaluation are \nrequired to determine compliance with the approval criteria and to evaluate development \nalternatives for a particular property.   \nThe alternatives analysis and impact evaluation shall include all the following items: \na. Identification and assessment of the ecological functions provided by the Resource Areas on the \nproject site, and if it is reasonably certain that there will be off-site impacts, the functions of the \nRA and HVRA within the same sub-watershed (6th Field Hydrologic Unit Code), including: \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 25,
      "text": " \n[5.07]-25 \nCity of Gresham Development Code \n \n(06/22) \n \n• \nHydrologic Function (water storage and delay) \n• \nWater Quality Function (sediment stabilization and retention, phosphorous retention, nitrate \nremoval and retention) \n• \nAquatic Habitat Support Function (for anadromous and/or resident species) \n• \nTerrestrial Habitat (for invertebrates, native plant diversity, pollinators, birds, reptiles, \namphibians, and mammals) \n• \nStream Temperature Moderation \nb. Evaluation of alternative locations, design modifications, or alternative methods of development \nto determine which option best reduces the impacts.  At a minimum, the analysis should \nevaluate three alternatives: 1) no project, 2) the preferred alternative, and 3) a second \npracticable alternative that proposes less development within RAs.  \nThe alternatives shall be evaluated on the basis of their unavoidable impacts on the RA, the \necological functions provided by the RA on the property and off-site impacts within the sub-\nwatershed (6th Field Hydrologic Unit Code).  The applicant must provide adequate detail for \nthe evaluated alternatives so that the distinct locations, designs, and construction methods and \ntheir unavoidable impacts can be compared.  The applicant must clearly demonstrate that the \npreferred alternative’s location, design, and construction methods represents the alternative with \nthe least unavoidable impact overall to the ecological functions provided by the project site.   \nc. For the selected alternative, an explanation of unavoidable impacts must be provided.  The full \nrange of impacts must be detailed, including the precise impact areas (both temporary and \npermanent) as well as impacts to ecological functions provided at the site and, if applicable, \nwithin the same sub-watershed.   \nd. With the exception of the standard(s) subject to the alternative review, the applicant shall \ndocument that all other applicable NRO standards are met. \n2. Mitigation Plan for Alternative Review. The purpose of a mitigation plan is to compensate for \nunavoidable impacts that result from the chosen development alternative as identified in the impact \nevaluation. \na. An Applicant may choose to develop a mitigation plan consistent with the requirements of \nSection 5.0711. If an Applicant so chooses, then the Applicant shall submit a mitigation plan \ndemonstrating such compliance. \nb. If an Applicant chooses to develop a mitigation plan that would not comply with the \nrequirements of Section 5.0711, then the Applicant shall submit a mitigation plan that includes \nall the following: \ni. An explanation of how the proposed mitigation will adequately compensate for unavoidable \nimpacts described in the impact evaluation required by Subsection 5.0712(A)(1). The \nApplicant may use the mitigation that would be required under Section 5.0711 as the \nbaseline mitigation required to compensate for unavoidable impacts to an RA that provides \nan average level of ecological functions. \nii. Documentation of permits from Army Corps, DSL, MCDD and DEQ (if applicable). \niii. A list of all parties responsible for implementing and monitoring the mitigation plan and, if \nmitigation will occur off-site, the names of the owners of property where mitigation \nplantings will occur and documentation of a deed restriction. \niv. The Applicant’s mitigation site monitoring, success criteria, and reporting plan.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 26,
      "text": " \n[5.07]-26 \nCity of Gresham Development Code \n \n(06/22) \n \nv. A complete list of proposed mitigation plantings. \nvi. If offsite mitigation is proposed, a narrative description of why mitigation cannot be \ncompleted on site. The following could be considered: \n• \nInadequate RA available \n• \nRemaining RA already includes a documented mitigation area \n• \nRemaining RA already provides a high level of functions \nvii. If mitigation is proposed which is not within the same sub-watershed (6th Field Hydrologic \nUnit Code) as the proposed impact, documentation that provides evidence that there are no \nproperties within the sub-watershed that are available for purchase and/or could provide the \nopportunity to off-set the project’s unavoidable impacts. This could include documentation \nof the following: \n• \nCommunication records with property owners that potential mitigation areas are not \navailable \n• \nRecords of a documented mitigation area for properties that would otherwise be \nappropriate for RA mitigation \n• \nDocumentation or analysis results that indicate there are inadequate mitigation \nopportunities on properties within the sub-watershed \nviii. For a proposal that includes mitigation on a site within the same 5th Field Hydrologic Unit \nCode, the applicant’s mitigation plan should include a narrative description of how the \nproposal will adequately offset unavoidable impacts of the project to the functions of the \nRA. \nix. Mitigation shall not be allowed on sites that are outside of the same 5th Field Hydrologic \nUnit Code excepting that wetland mitigation of 0.2 acres and less can be mitigated through \nstate-approved PIL or bank opportunities if the applicant can demonstrate no feasible \noptions exist for mitigation within the 5th field HUC \n3. The Impact Evaluation and Alternatives Analysis shall be prepared and signed by a knowledgeable \nand qualified natural resource professional, such as a wildlife biologist, wetland scientist, botanist, \nor other appropriate and knowledgeable discipline. The application shall include a description of the \nqualifications and experience of all persons that contributed to the  Alternatives Analysis and \nImpact Evaluation and to the Mitigation Plan, and, for each person that contributed, a description of \nthe elements of such reports to which the person contributed. \nB. \nApproved Criteria. \n1. Avoid intrusion. An Applicant shall first avoid the intrusion of development into the HVRA and RA \nto the extent practicable. The development that is proposed shall have less overall unavoidable \nimpact to the HVRA or RA or ecological functions of the HVRA or RAs than other practicable \nalternative(s), including a different practicable alternative(s) that proposes less development within \nRAs. If there is HVRA on a property then the Applicant shall first avoid the intrusion of \ndevelopment into the HVRA, to the extent practicable. Specifically, the alternatives analysis must \ndemonstrate that there are no practicable alternatives for the proposed use or activity to be located \noutside the RA or to be located inside the RA and to be designed and constructed in a way that will \nmeet all of the applicable NRO development standards. Where the RA will be avoided, the \nconstruction management plan must designate the RA to be left undisturbed and demonstrate that \nthere will be no impacts to the RA or the functions of the RA in the designated area(s). To avoid \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 27,
      "text": " \n[5.07]-27 \nCity of Gresham Development Code \n \n(06/22) \n \ndevelopment in RAs and HVRAs, to the extent practicable, Applicants should consider the best \nmanagement practices outlined in the Gresham Environmental Technical Guidance Manual. \n2. Minimize impacts. If the Applicant demonstrates that there is no practicable alternative that will \navoid disturbance of the RA or HVRA, then the development proposed by the Applicant within the \nRA or HVRA shall minimize unavoidable impacts to the extent practicable. If there is HVRA on a \nproperty, then the development within HVRA shall be considered more detrimental than \ndevelopment within other parts of the RA. \na. The applicant’s Alternatives Analysis and Impact Evaluation must demonstrate that the \nproposed development will minimize unavoidable impacts to ecological functions and loss of \nhabitat consistent with uses allowed by right under the base zone, to the extent practicable. \nb. To the extent practicable within the RA, the proposed development shall be designed, located, \nand constructed to minimize grading, removal of native vegetation, disturbance and removal of \nnative soils, adverse hydrological impacts on water resources , and impacts on wildlife corridors \nand fish passage through the use of the best management practices and habitat-friendly \ndevelopment practices.  Examples of these are outlined in the City of Gresham Environmental \nTechnical Guidance Manual. \n3. Mitigate impacts. If the Applicant demonstrates that there is no practicable alternative that will \navoid disturbance of the RA, then development shall mitigate for unavoidable impacts. The \nmitigation plan must demonstrate how the functions listed in 5.0713A(1)a are maintained or \nenhanced.  All proposed mitigation plans shall meet the following standards: \na. The mitigation plan shall demonstrate that it compensates for unavoidable impacts after taking \ninto consideration the Applicant’s efforts to minimize such impacts through the use of the best \nmanagement practices outlined in the City of Gresham Environmental Technical Guidance \nManual and through any additional or innovative techniques. \nb. Mitigation shall occur on the site of the disturbance, to the extent practicable. If onsite \nmitigation is not practicable, the location of the proposed offsite mitigation must comply with \n5.0712(A)(2)(vii)-(A)(2)(x). \nc. All re-vegetation plantings shall be with native plants. listed in the City of Gresham \nEnvironmental Technical Guidance Manual. \nd. All in-stream work in fish-bearing streams shall be done in accordance with the Oregon \nDepartment of Fish and Wildlife (ODFW) in-stream work timing schedule or approved in-water \nwork timing variance (approved by National Marine Fisheries Service (NMFS). \ne. A mitigation maintenance plan shall be included and shall be sufficient to ensure the success of \nthe planting. Compliance with the plan shall be a condition of development approval. \nf. Financial guarantee, in the form of an instrument approved by the City, shall be submitted to the \nCity before building permits are issued, or when no building permit is required, before \ndevelopment within the RA commences. It shall be in an amount adequate to cover 110% of the \ncost of performing the mitigation. The City will release the guarantee at the end of the five-year \nmonitoring period, or before, if it determines that the trees and shrubs have been successfully \nestablished. \ng. A mitigation plan that entails the amount of planting that would be required under Section \n5.0711 based on the amount of proposed disturbance area within the RA, and that otherwise \ncomplies with all of the mitigation requirements in Section  5.0711, shall be considered to have \nsatisfied this approval criterion. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 28,
      "text": " \n[5.07]-28 \nCity of Gresham Development Code \n \n(06/22) \n \n5.0713  Modification of NRO Standards   \nWhere the compliance with the NRO would cause unreasonable hardship, applicants may seek a Type II Minor \nVariance or a Type III Major Variance pursuant to Section 10.1500. \n \n5.0714  Mapping Protocols   \nMapped Resource Area (RA), High Value Resource Area (HVRA), and Potential Resource Area (PRA) \nboundaries are based on a GIS-supported application of the following mapping protocols. RAs and HVRAs \ninclude water features and buffers and upland habitat. All areas within the boundaries of the water features itself \nare designated as HVRA.  Areas within the boundaries of the buffer are designated as either RA or HVRA.  All \nbuffer measurements are based on horizontal distance rather than a slope distance.  The buffers recognize the \nunique natural resource opportunities within the new communities of Pleasant Valley, Springwater and Kelley \nCreek. The boundaries of these subareas are identified on Map 5.0714-1. \nA. \nResource Areas (RA) and High Value Resource Areas (HVRA). Resource Areas and High Value \nResource Areas include areas with the following attributes: \n1. Regulated wetlands and associated RA and HVRA. \na. Water feature. Regulated wetlands are designated as HVRAs. Regulated wetlands include \nwetlands shown on National Wetland Inventory (NWI) mapping, Local Wetland Inventory \n(LWI) mapping, and protected wetlands identified in DSL concurred site-specific studies as \nwell as other wetlands associated with streams and other non-wetland waterways. See also \nSection 5.0715(B). \nb. Buffer. The RA and HVRA associated with the regulated wetlands includes a buffer measured \n50 feet from the edge of the wetland or from the delineated edge of the wetland, where the edge \nof the wetland is delineated in accordance with methods required by the Department of State \nLands and the Corps of Engineers. The inner 35 feet of the buffer closest to the edge of the \nwetland is designated as HVRA.    \n2. Regulated streams and associated RA and HVRA. \na. Water feature. Regulated streams are designated as HVRAs. Regulated streams include all \nstreams shown on the City’s GIS stream layer. The GIS stream layer was developed by \nmodeling LiDAR topography and ground-truthing streams identified in headwater situations.  \nStreams are continued through other waters and wetlands where applicable. \nb. Buffer. The RA and HVRA associated with a regulated stream include a buffer on either side \nmeasured from the centerline of the stream. The width of the RA and HVRA varies depending \non stream order as described in Table 5.0714-1. For the purposes of this chapter, “stream order” \nis based on the \"top down\" Strahler system where rivers of the first order are the outermost \ntributaries. If two streams of the same order merge, the resulting stream is given a number that \nis one higher. If two streams with different stream orders merge, the resulting stream is given \nthe higher of the two numbers. \n3. Other regulated waters and associated RA and HVRA. \na. Water feature. Other regulated (non-wetland) waters are designated as HVRAs. These include \nponds and lakes created in-line with a stream channel.   \nb. Buffer. The RA and HVRA associated with other regulated non-wetland waterbodies include a \nbuffer measured landward from the b Ordinary High Water Mark of the waterbody. The width \nof the RA and HVRA associated with the waterbody corresponds to the RA and HVRA width \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 29,
      "text": " \n[5.07]-29 \nCity of Gresham Development Code \n \n(06/22) \n \nassociated with the stream order of the stream that flows out of the waterbody, as described in \nTable 5.0714-1. \n4. Upland Habitat Areas.    \na. Significant Upland Habitat Areas which were identified as discrete upland habitat of importance \nin either the Pleasant Valley Master Plan or the Springwater Master Plan are designated as RA. \nb. Publicly owned land acquired predominantly for protection of natural resources or open space \nuses are designated as RA. \nTable 5.0714-1: Resource Area Buffer Width \nRegulated Water \nFeature \nResource Areas \nType \nPleasant Valley Plan \nDistrict, Springwater \nPlan District, Kelley \nCreek Headwaters \nAll other locations \nwithin the City of \nGresham \nStreams  \n \nStream \nOrders 1 - 5 \n(Measured \nfrom \ncenterline of \nstream) \n1 \nRA \n50 feet \n50 feet \nHVRA \n35 feet \n35 feet \n2 \nRA \n200 feet \n100 feet \nHVRA \n50 feet \n50 feet \n3 \nRA \n200 feet \n100 feet \nHVRA \n50 feet \n50 feet \n4 \nRA \n200 feet \n100 feet \nHVRA \n50 feet \n50 feet \n5 \nRA \n200 feet \n125 feet \nHVRA \n50 feet  \n50 feet \nWetlands \n(Measured from \ndelineated edge) \nRA \n50 feet  \n50 feet \nHVRA \n35 feet \n35 feet \nOther Waters \n(Measured from \nOrdinary High Water \nMark) \nRA \n50 feet \n50 feet \nHVRA \n35 feet \n35 feet \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 30,
      "text": " \n[5.07]-30 \nCity of Gresham Development Code \n \n(06/22) \n \nMap 5.0714-1: Natural Resource Overlay Subarea Boundaries \n \n \nB. \nPotential Resource Area include the following lands that were not designated as RA, but which have a \nhigh probability of including significant wetlands: \n1. Those portions of the East Buttes toe of slope (as represented by the breakline contour) that have \nhydric or partially hydric soils and have not been reviewed as part of a Local Wetland Inventory \nsurvey or are not subject to a wetland determination, submitted to the City for review within the last \n5 years. These areas are indicated on Figure 5.0714-2. \n2. Lots shown on a Local Wetland Inventory survey as “potential wetland.” \n3. General areas identified by Natural Resources staff and City Consultants as potential wetlands based \non existing knowledge and remote sensing data.   \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 31,
      "text": " \n[5.07]-31 \nCity of Gresham Development Code \n \n(06/22) \n \nFigure 5.0714-2: East Buttes Potential Resources Area \n \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 32,
      "text": " \n[5.07]-32 \nCity of Gresham Development Code \n \n(06/22) \n \n5.0715  Map Administration and Correction   \nA. \nMap Administration. The City shall incorporate all map updates associated with development permit \ncorrections to the location of the RA boundary after the land use decision is final. This shall not be \nconsidered a comprehensive plan map amendment.  In the case of purchase of upland acquired by a \npublic entity for parks or open space purposes, the map will be updated when change of ownership is \nprovided to the City unless the acquiring agency clearly identifies acquisition was to develop a parcel \nfor active recreational uses. In the case of newly updated information regarding “Potential Wetlands” \nunder 5.0714.B.3, the map will be updated periodically. \nB. \nAddition of regulated wetlands.  As required by Metro Urban Growth Management Plan Section \n3.07.340, the City will amend the NRO map to add a wetland when the City or County receives \nsignificant evidence that the wetland meets any one of the following criteria: \n1. The wetland is fed by surface flows, sheet flows or precipitation, and has evidence of flooding \nduring the growing season, and has 60 percent or greater vegetated cover, and is over one-half acre \nin size; or  \nThe wetland qualifies as having \"intact water quality function\" under the 1996 Oregon Freshwater \nWetland Assessment Methodology; or \n2. The wetland is in the Flood Management Area, and has evidence of flooding during the growing \nseason, and is five acres or more in size, and has a restricted outlet or no outlet; or \nThe wetland qualifies as having \"intact hydrologic control function\" under the 1996 Oregon \nFreshwater Wetland Assessment Methodology; or \n3. The wetland or a portion of the wetland is within a horizontal distance of less than one-fourth mile \nfrom a water body which meets the Department of Environmental Quality definition of \"water \nquality limited” water body in OAR Chapter 340, Division 41. \nExamples of significant evidence that a wetland exists that may meet the criteria above are a wetland \nassessment conducted using the 1996 Oregon Freshwater Wetland Assessment Methodology, or \ncorrespondence from the Department of State Lands that a wetland determination or delineation has \nbeen submitted or completed for property in the City or County. \nWetland data must be submitted according to the most recent version of the Oregon Wetland Mapping \nStandard and OAR 141-090-0035 including a minimum required horizontal accuracy of 3 feet. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 33,
      "text": " \n[5.07]-33 \nCity of Gresham Development Code \n \n(06/22) \n \nC. \nMap Corrections. All Applicants who believe that the NRO map is inaccurate may file a correction \nrequest consistent with this subsection. Correction requests will be processed under the Type I \ndevelopment permit procedure.  The reasons for map corrections and correction criteria are specified in \nTable 5.0715-1. \nTable 5.0715-1 Map Correction Criteria. \nDisputed Issue \nCorrection Criteria  \nWetland location incorrectly \nidentified \nAn accurate wetland boundary has been delineated using \nmethods currently accepted by the Oregon Department of \nState Lands and the U.S. Army Corps of Engineers, and \nconcurrence has been received by Department of State Lands. \nWetland data must be submitted according to the most recent \nversion of the Oregon Wetland Mapping Standard and OAR \n141-090-0035 including a minimum required horizontal \naccuracy of 3 feet. \nStream location incorrectly \nidentified \nAn accurate location of the stream centerline based on the \nmidpoint between Ordinary High Water Marks has been \nidentified and surveyed as specified in the Gresham \nEnvironmental Technical Guidance Manual. Removal/Fill of \nstreams after January 15, 2021 will not alter established \nstream orders. \nOther regulated waterbody \nlocation incorrectly \nidentified \nAn accurate location of the feature’s Ordinary High Water \nMark as defined in Section 5.0714(A)(3) has been identified \nand surveyed as specified in the Gresham Environmental \nTechnical Guidance Manual. \nTitle 3 Wetland \n \nCompleted OFWAM forms documenting the change in \nprotected status and qualifications of the person(s) \ncompleting the forms. \nPublic Purpose for Upland \nRA \nDocumentation clearly showing the property was acquired for \ndevelopment with active recreational uses \nPRA requirements satisfied \nAreas evaluated pursuant to 5.0703(B) may be removed from \nthe PRA in concert with any associated RA and HVRA \nupdates. Where the perimeter of such site evaluations do not \ncoincide with a property line they will be internally buffered \nby 50 feet and only the resulting areas will be removed from \nthe PRA. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 34,
      "text": " \n[5.07]-34 \nCity of Gresham Development Code \n \n(06/22) \n \n5.0716  Violations   \nActions that violate the RA regulations, such as removing protected vegetation or impacting protected water \nresources without having a required permit, are subject to the abatement and penalty provisions of Section \n2.0008 of the Gresham Community Development Code. \nA. \nFor correcting violations regarding unauthorized removal of an RA, the property owner shall submit an \napplication that meets all applicable standards of the NRO including mitigation for all impacts, \nincluding tree removal. \nB. \nIf one or more of the applicable standards of the NRO cannot be met, then the property owner shall \nsubmit a remediation plan for Type II review that demonstrates that there will be: \n1. No permanent loss of any type of resource of functional value; \n2. A significant improvement of at least one functional value; and \n3. There will be minimal loss of resources and functional values during the remediation action until it \nis fully established. \nC. \nThe remediation plan shall be developed by a Professional Wetland Scientist or other knowledgeable \nand qualified natural resource professional, such as a wildlife biologist, wetland, scientist, or botanist. \nD. \nBest practices to accomplish the requirements of the remediation plan are outlined in the Gresham \nEnvironmental Technical Guidance Manual. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.276369",
  "extractor_version": "1.0.0"
}