{
  "metadata": {
    "filename": "dc-section-10.1500.pdf_id7885",
    "extracted_at": "2025-05-22T06:15:23.234888",
    "num_pages": 6,
    "title": "DC Section 10.1500",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615200032-07'00'",
    "modification_date": "D:20220615200049-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.15]-1 \nCity of Gresham Development Code \n \n(01/19) \nSECTION 10.1500 \nVARIANCE AND ADJUSTMENT PROCEDURES \nGeneral \n10.1501  Purpose   \n10.1502  Exceptions   \nType II Variances \n10.1510  Type II Minor Variance Provisions   \n10.1511  Type II Variance Provisions  to the Floodplain Overlay District Standards  \nType II Adjustments \n10.1520  Reduction in Minimum Street Frontage   \n10.1521  Modification of Regulations  \n10.1522  Modification of Dedications and Other Requirements   \nType III Variances \n10.1530  Type III Major Variance Provisions  \n10.1531  Private Residential Access for Dwellings under Unit Ownership   \n10.1532  Type III Major Variance Provisions to Maximum Height in the GBSV District   \nGeneral \n10.1501  Purpose  \nVariance and adjustment procedures are intended to allow modification of specific standards contained in the \nCommunity Development Code.  A variance or adjustment may be permitted if the approval authority finds the \napplicant has satisfactorily addressed all the approval criteria.  If a variance or adjustment request is approved, \nthe approval authority may attach conditions to the final order to mitigate adverse impacts which might result \nfrom the approval.  \n10.1502  Exceptions  \nThe following regulations of the Community Development Code may not be varied: \nA. \nThe uses permitted in the land use district. \nB. \nDefinitions. \nC. \nThe minimum and maximum residential development density allowed in a land use district. \nD. \nRestrictions on uses or development that contain the word \"prohibited.\" \nE. \nThe floodway provisions of Section 5.0121. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.15]-2 \nCity of Gresham Development Code \n \n(01/19) \nType II Variances \n10.1510  Type II Minor Variance Provisions   \nThe Type II procedure shall be used to process a minor variance request involving a 20 percent reduction or 20 \npercent increase from a quantitative provision of the Community Development Code, with the exception that all \nvariances to maximum height in the GBSV District shall be reviewed under the Type III process described in \nSection 10.1530, and all variances from the Floodplain Overlay District shall be reviewed under the Floodplain \nVariance process described in Section 10.1511. The Manager shall grant a variance if all of the following \ncriteria are satisfied: \nA. \nThe need for the variance does not result from prior actions of the applicant or owner, or from personal \ncircumstances of the applicant or owner, such as financial circumstances. \nB. \nTo meet the need, the request is the minimum necessary variation from the Community Development \nCode requirement. \nC. \nThere are development constraints associated with the property, or the present use or permitted use of \nthe property, which make development of a permitted use impractical; or the variance is needed to allow \nthe applicant to enjoy a substantial property right possessed by a majority of property owners in the \nsame vicinity. \nD. \nThe purposes of the Community Development Code and the applicable policies of the Community \nDevelopment Plan would be equally met or advanced by a variation from the development requirement. \n10.1511  Type II Variance Provisions to the Floodplain Overlay District \nStandards \nThe Manager shall grant a variance is all of the criteria identified in Section 10.1510 and a determination can be \nmade that the granting of a variance shall only be issued by a community upon a showing of good and sufficient \ncause, that failure to grant the variance would result in exceptional hardship to the applicant, and that the \ngranting of a variance will not result in increased flood heights, additional threats to public safety, extraordinary \npublic expense, create nuisances, cause fraud on or victimization of the public, or conflict with existing local \nlaws or ordinances. \nA community shall notify the applicant in writing that the issuance of a variance to construct a structure below \nthe base flood level will result in increased premium rates for flood insurance and increases risks to life and \nproperty. Such notification shall be maintained with a record of all variance actions. \nType II Adjustments \n10.1520  Reduction in Minimum Street Frontage  \nIntent.  The City’s transportation policies assure public street connectivity in general, and specifically require \npublic street frontage and access for residential parcels. \nAdjustment.  However, the Manager under a Type II procedure may reduce the minimum street frontage \nrequired if 1) such reduction is necessary to satisfy neighborhood circulation and/or future street plan provisions \n(Section 9.0700), and 2) Associated findings show either condition (A) or condition (B) exists, and condition \n(C) exists: \nA. \nTopographical constraints preclude the application of the minimum standard; or \nB. \nThe land division is part of an infill process where the application of the minimum street frontage \nstandard would prohibit the division of the parcel. Infill development within LDR-5, LDR-7, TLDR and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[10.15]-3 \nCity of Gresham Development Code \n \n(01/19) \nTR shall also be subject to the standards of Section 4.0136; and \nC. \nIt is not feasible to extend the public street system to provide local circulation and the minimum street \nfrontage.  For purposes of the section “not feasible” shall mean that there is no reasonable connection to \nanother public street; or that the property configuration or physical constraints preclude connection; or \nlotting patterns surrounding the site or development patterns preclude street extensions, and/or an \nadopted Future Street Plan affects the site. \n10.1521  Modification of Regulations   \nA. \nUnder the Type II procedure, the Manager may modify standards in the Community Development Code \nregarding public facilities, parking requirements, building lot coverage, yard setbacks, building height, \nand landscaping if any one of the following criteria is satisfied: \n1. \nThe site design reduces the need for major alterations of the site, such as excavations, retaining \nwalls, steep road cuts and fill, and extensive grading; \n2. \nThe site design has provisions for major recreational facilities such as playgrounds, swimming \npools, tennis courts, and similar facilities; \n3. \nThere is a maximum retention of natural topographic features, such as drainage swales, slopes, \nridge lines, rock outcroppings, vistas, natural plant formations, and trees; \n4. \nThe street system is designed in an east/west alignment to maximize solar orientation. Multifamily \ninclude solar space heating or water heating devices, or insulation beyond the minimum standards \nof the Building Code. \nB. \nUpon a finding that the applicant's plan substantially achieves any of the preceding criteria, the Manager \nmay modify the identified standards within the following prescribed limits: \n1. \nFront, side, and rear yards may be reduced to zero when in compliance with the Oregon State \nStructural Specialty Code. \n2. \nThe requirements for the installation of sidewalks may be modified if provisions are made to \nprovide off-street parking in addition to that required in the off-street parking section of this code, \nas follows: \na. \nDetached dwellings - two additional off-street parking spaces. \nb. \nAttached dwellings - for each unit, one-half additional off-street parking space for each \nbedroom in addition to the first bedroom.  In cases where a one-half space occurs in a \ntotal figure, the standards shall be increased to the next whole figure. \n3. \nHeight limitations may be increased, provided the additional height does not exceed 45 feet in a \nresidential district. Additional height cannot be approved under Section 10.1521 in the GBSV \nDistrict. \n4. \nBuilding lot coverage may be increased provided the additional coverage does not exceed 50 \npercent. \n5. \nParking requirements may be reduced by 10 percent. \n10.1522  Modification of Dedications and Other Requirements   \nUnder the Type II procedure, the Manager may reduce or eliminate a dedication of land or other requirement if \nthe requirement, as determined by the Manager, does not meet the requirements of the Fifth Amendment to the \nUnited States Constitution. \nType III Variances \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[10.15]-4 \nCity of Gresham Development Code \n \n(01/19) \n10.1530  Type III Major Variance Provisions   \nThe Type III procedure shall be used to process a major variance request involving more than a 20 percent \nreduction or 20 percent increase from a quantitative development standard or a request to deviate from a \nqualitative standard or a request to deviate from the maximum height requirements in the GBSV District as \noutlined in Section 10.1532. Except for applications for a variance to maximum height in the GBSV District, \nwhere additional criteria apply, the hearing body shall grant the variance if all of the criteria identified in \nSection 10.1510 and one of the following criteria is met: \nA. \nThe circumstances that apply to the site or to the present or permitted use of the site do not typically \napply to other properties in the same vicinity or land use district and are unique or unusual; or, \nB. \nIt would be more detrimental to the public safety or more injurious to the public welfare to apply the \ndevelopment standard than to grant the proposed variance. \n10.1531  Private Residential Access for New Dwellings under Unit Ownership  \nPrivate residential access to a public street for new dwellings under unit ownership may be authorized under the \nType III procedure, if the proposal is consistent with the following criteria: \nA. \nThe proposed access shall not eliminate or make impractical the establishment of a planned public street \nor continuation of an existing public street.  The public circulation needs of the area within one-quarter \nmile shall be accommodated without a public street through the site. \nB. \nAdditional off-street parking shall be provided to dwellings served by an access in order to replace the \nlost on-street parking. \n10.1532  Type III Major Variance Provisions to Maximum Height in the GBSV \nDistrict  \nA. \nThe Planning Commission is the decision authority. \nB. \nApplicants must address the criteria located in Section 10.1510 and one of the criteria outlined in \nSection 10.1530 and comply with Section 10.1532.C.1 or Section 10.1532.C.2 as described below. \nC. \nThe structure shall not be visible from any parcels outside of the GBSV District. Demonstration of \ncompliance with this standard must be provided as noted in Section 10.1532.C.1 or Section \n10.1532.C.2. \n1. \nA site plan and elevations documenting that: \na. \nThe structure is no taller than the existing evergreen canopy as measured from the \ndownslope side, or \nb. \nThe structure is topographically screened by its placement behind a hill, is located in a \nravine or is screened by other natural features. \n2. \nSubmittal of a photo simulation from parcels outside of the GBSV District using 3D Analyst or \nanother program as approved by the Manager accompanied by an analysis of the contrast rating of \nthe proposed structure using the Bureau of Land Management’s Manual 8431-Visual Contrast \nRating or other tool approved by the Manager. \n \nThe structure must meet the Class I or Class II Objectives found in Appendix 2 of the Bureau of \nLand Management’s Manual 8431-Visual Resource Contrast Rating when the structure is \nobserved from viewpoints outside of the GBSV District. \n \nIf other approved tools are used, the analysis of the siting of the structure shall determine that, \nwhen the structure is observed from viewpoints outside of the GBSV District: \na. \nThe existing character of the landscape is preserved. The level of change to the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[10.15]-5 \nCity of Gresham Development Code \n \n(01/19) \ncharacter of Gresham Butte is very low and does not attract attention away from the \nforested landscape of Gresham Butte, or \nb. \nThe existing character of the landscape is retained. The level of change is low and \nchanges must blend into the predominant natural features of the landscape. \n3. \nIf vegetation used for screening is removed through natural circumstances such as disease or fire, \nreplacement vegetation must be planted within 6 months of the event and be of a species that will \ngrow to an equal or greater size, height, and canopy spread as the vegetation that was removed. \nReplacement plantings must be a minimum of 2.5 caliper inches for deciduous trees and a \nminimum of 8 feet in height for evergreen trees. \n \n \n \n \n \n \n \n \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.235301",
  "extractor_version": "1.0.0"
}