{
  "metadata": {
    "filename": "dc-section-10.1600.pdf",
    "extracted_at": "2025-05-22T06:15:23.771381",
    "num_pages": 6,
    "title": "DC Section 10.1600",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.58",
    "creation_date": "D:20230111122631-08'00'",
    "modification_date": "D:20230111122708-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.16]-1 \nCity of Gresham Development Code \n \n(01/23) \nSection 10.1600  Food Carts  \nTABLE OF CONTENTS \nGeneral \n10.1601 Purpose  \n10.1602 Applicability \n10.1603 Coordination \nStandards \n10.1611 Standards for All Carts  \n10.1612 Additional Standards for Structures and Covered Outdoor Seating  \n10.1613 Additional Standards for Drive-Through Carts  \n10.1614  Standards for Food Cart Pods \nProcess \n10.1621 Permit Type \n10.1622 Duration \n10.1623 Removal \n \nGENERAL \n10.1601 PURPOSE \nFood Carts can provide opportunities to invigorate under-utilized non-residential sites, allow low-barrier, \nsmall-scale entrepreneurship, and provide unique eating establishments for the public. The purpose of this \nsection is to provide development standards for food carts that are in the interest of public health and safety. \nThe standards minimize barriers to Food Cart development and minimize costly site improvements, in \nrecognition that substantial investment in underutilized sites could excessively postpone site redevelopment. \n10.1602 APPLICABILITY \nA. This section shall apply when food carts are proposed in districts designated OFR, GI, RTC, SC, SC-RJ, CMU, \nCC, MC, DCC, DMU, DTM, DEM, DRL-2, DCL, CNTH, CNTM, TC-PV, MUE-PV, NC-PV, EC-PV, VC-SW, RTI-SW, \nIND-SW, NC-SW, and  \nIN ALL OTHER DISTRICTS, THESE STANDARDS SHALL APPLY ON THE SITES OF \nAPPROVED CIVIC, MEDICAL, AND SCHOOL USES WHICH ARE AT LEAST 10 ACRES \nIN SIZE.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.16]-2 \nCity of Gresham Development Code \n \n(01/23) \n10.1603 COORDINATION WITH OTHER REGULATIONS \nA. All Food Carts shall meet the requirements of the Fire Code (as described in GRC 10.25). \nB. All structures erected on Food Cart sites shall comply with the City of Gresham Building Code (as described \nin GRC 10.05) and the Fire Code.  \nC. Food Carts, Food Cart Pods, and structures approved in conjunction with them are exempt from: \n1. District requirements regarding density and floor area ratio; \n2. Design District guidelines and standards; \n3. Other design standards in Article 7; \n4. Section 9.0100 Buffering and Screening Requirements; and  \n5.  Section 9.0800 Parking Standards. \nD. Except as provided in Sections 10.1613 and 10.1614, Food Carts are exempt from the requirements of \nAppendix 5.  \nE. Covered outdoor seating, accessory structures and new impervious paving associated with Food Carts shall \nmeet the grading, drainage and stormwater management standards of 9.0500.  \nF. Signage for Food Carts and Food Cart Pods is regulated by Appendix 6.120. \nG. Food Carts and Pods shall meet all Multnomah County Health Department regulations (including those \nregarding utilities, sanitation, restroom access) and maintain a valid Mobile Food Unit Operating License \n(and Mobile Food Pod License where appropriate). \nH. Food Carts and Pods are subject to the standards of GRC 7.25.400(4) and (7) regarding business recycling \nand food scrap collection. \nI. \nApplicants who choose not to comply with these standards may apply for Design Review in accordance \nwith Section 7.0000. \nSTANDARDS \n10.1611 STANDARDS FOR ALL CARTS \nA. Carts and uncovered seating areas shall only be located on existing hard surfaces or newly constructed \npervious temporary hard surfaces such as pavers, cellular confinement systems (CCS)/geocells, or \ngrasscrete. Additional paving required for vehicular travel may be impervious. \nB. Except as provided in Sections 10.1613 and 10.1614 for drive-through carts and carts in pods, no new \nvehicle access shall be granted for food cart development and all vehicular traffic shall be restricted to \nexisting paving. New ADA accessible pedestrian and bicycle access may be permitted provided that the \npathways are permeable or no more than 8 feet wide.  \nC. Any on-site utility work for utility service shall terminate in temporary connection assemblies, such as \nthose used in recreational vehicles parks. No new permanent water and sewer connections shall be \nallowed. Any connection to underground water, wastewater, gas, or electricity shall be temporary in \nnature.  \nD. Food Carts shall be located: \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[10.16]-3 \nCity of Gresham Development Code \n \n(01/23) \n1. Outside district setbacks, pedestrian walkways, clear vision areas, required landscaping areas, required \nparking and access to required parking spaces, required bicycle parking, and fire lanes. \n2. A minimum of 3 feet from the right-of-way or the back of sidewalk, whichever is further from the \nstreet centerline. \n3. A minimum of 25 feet from any driveway approach. \n4. A minimum of 15 feet from the property line of an abutting residential use. No minimum separation is \nrequired where carts are adjacent to sites in the Downtown Plan District, Civic Plan District, or \nRockwood Design District. \nE. Except in the case of drive-through carts and carts in a pod, if any part of a cart is within 25 feet of a right-\nof-way, an active service window oriented toward the street shall be provided. If it is within 25 feet of \nmore than one right-of-way, an active service window facing the street with the higher classification shall \nbe provided. If the streets have equal classifications, the window may be oriented to either street. \nF. Food Carts are limited to no more than 26 feet in length and 8.5 feet in width. \n10.1612 ADDITIONAL STANDARDS FOR ACCESSORY STRUCTURES AND COVERED \nOUTDOOR SEATING \nA. Each cart is allowed no more than one accessory structure (such as a storage shed).  The structure shall be \nno more than 80 square feet in footprint and 10 feet in height. Structures cannot be used by the public. \nB. Each cart shall be allowed a covered outdoor seating of up to 200 square feet in footprint except as limited \nby Section 10.1614(C). Covers may be combined on a site. All covered seating areas shall require building \npermits. \nC. Food carts (including awnings) shall be separated from covered outdoor seating per the Fire Code. \nD. Outdoor seating covers for carts: \n1. Shall not have more than 2 walls unless they are part of a Food Cart Pod. \n2. May have more than 2 walls if the cart is part of a Food Cart Pod.  When more than 2 walls are \nprovided, walls shall be limited to 4 feet in height. \nE. Temporary membrane structures or walls may be used only pursuant to the Fire Code limitations. \n10.1613 ADDITIONAL STANDARDS FOR DRIVE-THROUGH CARTS \nA.  Drive-through Food Carts are permitted only where drive-through business and retail service and trade \nuses are allowed. \nB. Drive-through stacking lanes and service areas shall not be located between the street and the Food Cart \nalong Design Streets, in Design Districts, and other locations where those elements are not allowed \nbetween a building and the street. \nC. To ensure adequate distance for at least 3 vehicles to line up behind the vehicle ordering at the drive-\nthrough, drive-through Food Carts shall have at least 85 feet in queuing distance behind each drive-\nthrough window where sales occur. Queuing distance shall be measured from the center of the service \nwindow or point of service, along the queuing path, to the sidewalk, or if no sidewalk to the driveway \napproach in the right-of-way. The distance is measured along the centerline of the queuing lane.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[10.16]-4 \nCity of Gresham Development Code \n \n(01/23) \nD. A separate window shall be provided for walk-up customers. A waiting area a minimum of 8 feet by 5 feet \nshall be provided directly adjacent to the window. Such areas shall be outside driveways, queuing aisles, \nand other vehicular paths.  The area shall be: \n1. Oriented to the street along Design Streets, in Design Districts and other locations where those \nelements are not allowed between a building and the street unless there is a building between the \nFood Cart and the street; and \n2. Connected to the sidewalk by a paved pedestrian path at least 5 feet in width. \nE. Food Carts and Pods requiring vehicle access on a site without existing approved access: \n1. Are subject to a finding of adequate public facilities regarding streets and access, and \n2. Shall provide safe and adequate ingress and egress when combined with the other uses of the \nproperty as required by Appendix 5. \n10.1614 STANDARDS FOR FOOD CART PODS \nA. A paved pedestrian path at least 5 feet in width is required between the cart and the public sidewalk of at \nleast one adjacent street. A grouping of carts may share one path.  Pathways shall comply with the \nstandards of Section 10.1611(A) and (B). \nB. Solid Waste and Recycling receptacles shall be provided for customer and business waste. Solid waste, \nrecycling and food scraps shall be collected for disposal at regular intervals, not to exceed seven calendar \ndays. \nC. Covered outdoor seating shall be limited to a total area of 150 square feet per cart up to a combined total \nof 2,500 square feet per site and meet the standards of Section 10.1612(C)-(E). Covered outdoor seating \nmay be combined on a site. All covered seating areas shall require building permits. \nD. Sites in the Downtown, Civic, or Rockwood design districts which provide covered outdoor seating over \n1,000 square feet in size shall provide at least one site amenity. Amenities shall support vibrant active sites \nand/or active transportation.  Amenities are structural seating (such as seating incorporated into \nlandscaping planters), children’s play areas, stages, screen walls for projection of movies, bicycle parking \nfacilities, and seating adjacent to the right-of-way that is oriented to the street. \nE. A business license must be maintained for the site and designate a responsible party. \nF. Applicants who choose not to comply with these standards may apply for Design Review in accordance \nwith Section 7.0000. \nPROCESS \n10.1621 PERMIT TYPE \nFood Carts shall be required to acquire a development permit if they remain on one site more than four hours \nin any one day. \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[10.16]-5 \nCity of Gresham Development Code \n \n(01/23) \nTable 10.1621-1 Permit Procedure for Food Cart and Pods \nProposed Activity or Request \nPermit Procedure \nNew Food Cart Pod (including one created by the addition of a cart or carts to a site \nwith an existing cart) \nType II \nFood Carts and Food Cart Pods requiring vehicle access on a site without existing \napproved access \nType II \nNew stand-alone Food Cart or adding a Food Cart to an existing pod \nType I \nAdding a Food Cart to a site with a single existing cart \nType I \nAdding a structure or drive-through to a Food Cart or expanding covered outdoor \nseating by more than 400 square feet \nType I \nExpansion of covered outdoor seating by no more than 400 square feet \nType I \nReplacing an approved Food Cart in a pod \nType I1 \nAdding a new Food Cart to a previously approved Food Cart Pod spot \nType I1 \nReplacing an approved Food Cart on a site within 12 months of a previous cart being \nremoved. \nType I1 \nTable Notes: \n1 Processed as part of the Business License application. \nDURATION \nA.  A development permit for a Food Cart and/or Pod expires one year from the date of issuance of the \npermit.  \nB.  Food Cart permits shall renew automatically with the business license except when the use has been \nsubject to a City Code Compliance enforcement action to address an uncorrected violation as provided for \nin Gresham Revised Code Article 7.50 or when a Multnomah County license has been revoked. \nEnforcement actions include but are not limited to civil penalties, citations, and abatement. If an \nenforcement action has occurred, the use shall be reviewed at the time of renewal following the same \nprocess and in the same manner as an application for a new permit. In such a case, the enforcement action \nshall be considered during the renewal application review, such as when determining conditions of \napproval. \n10.1623 REMOVAL \nFood Carts, covered outdoor seating, temporary utility connections, and additional related site improvements \n(such as hard surfaces and amenities) must be removed from the site when the Food Cart or Pod ceases \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[10.16]-6 \nCity of Gresham Development Code \n \n(01/23) \noperation unless an application for design review showing the site meets the applicable standards and \nguidelines of Article 7 are met is submitted. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.771664",
  "extractor_version": "1.0.0"
}