{
  "metadata": {
    "filename": "dc-section-7.0200.pdf_id7857",
    "extracted_at": "2025-05-22T06:15:20.877365",
    "num_pages": 9,
    "title": "DC Section 7.0200",
    "subject": "Development Code Section 7.0200 General Design Standards\r\n",
    "creator": "Acrobat PDFMaker 25 for Word",
    "producer": "Adobe PDF Library 25.1.211",
    "creation_date": "D:20250416150412-07'00'",
    "modification_date": "D:20250416170331-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "Section 7.0200 General Design Standards (6/2022) \nPage 7.02-1 \nSECTION 7.0200  \nGENERAL DESIGN STANDARDS \nTABLE OF CONTENTS \n7.0210 Transit and Pedestrian Design Criteria and Standards \n7.0212 Standards for New Solid Waste and Recycling Collection Areas for Multifamily, Commercial, \nIndustrial, and Institutional Development \n7.0220 Optional Improvements with Design Review   \n7.0221 Landscaping Installation  \n7.0222 Irrigation Provisions  \n7.0223 Maintenance Responsibility  \n7.0224 Site Lighting   \n7.0210 TRANSIT AND PEDESTRIAN DESIGN CRITERIA AND STANDARDS  \nA. Purpose and Applicability and Design Criteria and Standards \n1. Transit and Pedestrian Design Criteria and Standards are intended to provide for convenient, direct, \nand accessible pedestrian routes to and from public sidewalks and transit facilities and other \npedestrian destinations; to provide for safe, pleasant, and convenient pedestrian circulation by \nconnecting activities within a structure to the adjacent sidewalk and to nearby transit stops; and to \npromote the use of pedestrian and transit modes to retail and commercial facilities.   Standards for \nwindows and walls are designed to encourage surveillance opportunities, to avoid a monotonous \npedestrian environment, and to prevent fortress-like facades along public streets. \n2. Transit and Pedestrian Design Criteria and Standards shall apply to development along designated \nDesign Streets as shown on Figure 7.0210 and in those Station Center lands that are not within the \nRockwood Design District.  Section 7.0210(B)(8) and Section 7.0210(B)(10)(b) do apply to \ndevelopments within the Rockwood Design District. \n3. Exceptions to Transit and Pedestrian Design Criteria and Standards on Design Streets \na. Certain motor vehicle service uses permitted in the underlying district are exempt from Transit \nand Pedestrian Design Criteria and Standards:  These uses include gas pump islands, service \nstations, car washes, and vehicle service bays.  However, walk-in retail uses such as a mini-mart \nor convenience store connected with a motor vehicle service use, are not exempt. \nb. Industrial uses within the General and Heavy Industrial Districts. \nc. When a site has frontage on both a Design Street and on other streets, the Transit and \nPedestrian Design Criteria and Standards shall apply only to site development along the Design \nStreet frontage, unless otherwise specified. \n4. Orientation/Design of Building and Entrance for Non-Residential Buildings on Design Streets and in \nthose Station Center lands that are not within the Rockwood Design District. \na. Primary building and entry orientation shall be to the street rather than to a parking lot.  All \nbuildings shall have at least one (1) of their primary entrances oriented toward a Design Street, \nor (if no Design Street in the Station Center lands that are not within the Rockwood Design \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (6/2022) \nPage 7.02-2 \nDistrict) toward an adjacent street.  A building may have more than one primary entry as \ndefined in the Building Code.  When a primary entrance is located on more than one street, the \nfull address (including street name) shall also be clearly posted on or near the entrance not \nbearing the assigned street address. \nb. If a lot has frontage on more than one Design Street, the building shall provide one primary \nentrance oriented to a Design Street or shall provide a single entrance at the corner where two \nstreets intersect.  \nc. Buildings shall have a primary entrance connecting directly between the Design Street (or other \nabutting street when there is no Design Street) and the building interior.  Primary entrances for \nnon-residential development shall be open to the public during all business hours. \nd. Primary building entrances shall be architecturally emphasized and visible from the street. \ne. All building entrances and exits shall be well lighted.  All unit entrances shall be posted with the \nassigned address as determined by the Manager.  Failure to post an address as assigned by the \nManager shall constitute a violation of the Code.  Exterior lighting should be an integral part of \nthe architectural and landscape design.  The minimum lighting level for non-residential building \nentries is an average of 3.5 foot-candles.  Lighting shall be a pedestrian scale (3 feet to 12 feet) \nand the source light shall be shielded to reduce glare.  \nf. For building facades over 300 feet in length on a Design Street, two or more primary entrances \nfacing the street must be provided.  \ng. Building entrances shall incorporate arcades, roofs, porches, alcoves, porticoes, and awnings \nthat protect pedestrians from the rain and sun. \nh. Building entries must comply with the accessibility standards as outlined in the Building Code. \n5. Ground Floor Windows, Window Walls, Blank Walls, and Design for Non-Residential Buildings on \nDesign Streets and in those Station Center lands that are not within the Rockwood Design District. \na. All development shall provide ground floor windows along street facades.  Required window \nareas must be either windows that allow views into working areas or lobbies, or pedestrian \nentrances, or display windows.  Required windows shall have a sill no higher than 4 feet above \ngrade, except as follows:  Where interior floor levels prohibit such placement, the sill height may \nbe raised to allow it to be no more than 2 feet above the finished floor level, up to a maximum \nsill height of  6 feet above grade. \nb. For any wall within 30 feet of a street, at least 20% of the ground floor wall area facing the \nstreet shall be display areas, windows, or doorways.  Blank walls are prohibited. \nc. Darkly tinted windows and mirrored windows that block two way visibility are prohibited as \nground floor windows along street facades. \nd. Buildings must include changes in relief on 15% of their street facades such as cornices, bases, \nwindow treatments, fluted masonry, or other designs for pedestrian interest and scale. \ne. Building facades greater than 100 feet in length shall have offset jogs, using elements such as \nbay windows and recessed entrances for pedestrian scale. \n6. Except for uses exempted under Section 7.0210(A)(3), Section 9.0821 (Parking Lot Location on \nDesign Streets) shall apply to parking lots on sites that are subject to the Transit and Pedestrian \nDesign Criteria and Standards.   \n7. Service and Loading areas shall be located in accordance with the restrictions of  \nSection 9.0822(A)(12). \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (6/2022) \nPage 7.02-3 \n \nB. Additional Design Criteria and Standards for Station Center lands that are not within the Rockwood \nDesign District: \n1. All development within the Station Center lands that are not within the Rockwood Design District \nshall follow standards for Orientation/Design of Building and Entrance of Section 7.0210(A)(4) and \nparking lot location standards of Section 9.0821.  However, townhouses and duplexes which are not \nlocated on a Design Street are exempt from the parking location standards of Section 9.0821(A) and \n(B).  Development within the Station Center lands that are not within the Rockwood Design District \nshall also meet the following additional criteria of subsections (B)(3) through (B)(10) below. \n2. Exceptions:   As specified in subsections (B)(3) through (10) below, some Additional Transit and \nPedestrian Design Criteria apply only to sites that abut or face a transit station (across the street) or \nthat abut a street containing a transitway (e.g. Burnside).  Some criteria may not apply to sites with \nunique physical characteristics. \n3. Pedestrian Environment and Access to Transit Facilities – All Sites \na. Development shall provide convenient, direct, and barrier-free pedestrian circulation between \nbuildings and adjacent light rail stations, park and ride facilities, public sidewalks, and pedestrian \nroutes.  All buildings and sites shall orient their interior and on-site pedestrian circulation to the \nclosest adjacent light rail station.  Pedestrian activity centers within one-quarter mile walking \ndistance should also be considered in the layout of pedestrian circulation. \nb. On-site vehicular and pedestrian circulation shall be designed to minimize vehicular/pedestrian \nconflicts (e.g. driveway crossings). \nc. Enhanced pedestrian spaces and amenities accessible to the public are encouraged, such as \nplazas, arcades, gallerias, courtyards, outdoor cafes, widened public sidewalks (more than 6 feet \nwide outside the public right of way), benches, shelters, street furniture, public art, kiosks, and \nstreet vending.  Arcades (covered walks) are encouraged between public art, kiosks, and street \nvending.  Covered walks are also encouraged between primary building entries and adjacent \npublic sidewalks and on other on-site walkways. \n4. Building Facades Adjacent to Transit Facilities \na. Site abutting or facing a light rail station:   Building should maintain a continuity in design \nelements with the stations, such as roof lines and materials, and should connect to existing or \nproposed transit pedestrian spaces and amenities and to transit station landscape treatments. \nb. All Sites:  Buildings should avoid blank walls and provide a series of openings (windows, entries, \ndisplay areas) on facades which are at street level and/or which face a light rail station. \nc. All Sites:  Enhanced pedestrian spaces as described in subsection (3)(c) above. \n5. Building Orientation to Light Rail Transit \na. Site abutting or facing a light rail station, or abutting a street containing a transitway:  At least \none primary building entry and facade shall face the station or the transitway street. \nb. Site abutting or facing a light rail station:  All building(s) and site design arrangements shall be \nlinked as directly as possible to the light rail station by a continuous on-site landscaped \ncourtyard plaza or square that leads directly to the station and public walkways accessing the \nstation.  Areas for the courtyards, plazas, or squares must contain seating and 20% landscape \nareas including trees within the enhanced areas. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (6/2022) \nPage 7.02-4 \n6. Required Parking and Parking Location  - All Sites:   Parking and maneuvering areas, except spaces \ndesignated for park and ride or kiss and ride use, should be located on portions of a site that are \nfurthest in walking distance from an adjacent light rail station. \n7. Building Setback Variation – All Sites:  The required minimum building yard setback standards of the \nunderlying land use district may be reduced to zero.  Minimum yard setbacks shall apply to off street \nparking spaces. \n8. Incidental Drive-Through Uses – All Sites: \nDrive through uses as defined in Section 3.0103 are not permitted, except when such use is \nincidental to a primary site use and when designed in conformance with the following standards: \na. The incidental drive-through use is limited to one service window which is part of a primary use \nstructure and to no more than two queuing lanes.  Vehicular service bays or islands are not \npermitted. \nb. On a street containing a transitway, no curb cuts are permitted for the exclusive use of drive-\nthrough queuing or exit lanes. \nc. The drive-through service window and queuing lane(s) are located as far as practical from the \nclosest light rail transit station or a street containing a transitway, and not adjacent to such \ntransit facilities. \n9. Service and Loading Areas -- All Sites. \nService and loading areas shall be visually screened from a light rail station or transitway.  See also \nthe restrictions of Section 9.0822(A)(12). \n10. Special Criteria for sites abutting or facing a light rail station or park and ride facility contiguous to a \nlight rail station (e.g., Cleveland, or City Hall).  The Manager shall approve a development when the \napplicant can demonstrate compliance with relevant portions of the Community Development Plan \nand the following criteria are satisfied: \na. The development satisfies applicable design review criteria and standards, especially those \nrelated to transit development (Sections 7.0210 (A) and (B)).  Also see the applicable parking \nstandards in Section 9.0800 and the applicable transit standards found in Section A5.504. \nb. The development satisfies the applicable Public Transit Services and Central Area Development \nPolicy Implementation strategies in Volume II, Policies, Gresham Community Development Plan. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (6/2022) \nPage 7.02-5 \nFigure 7.0210: Design Streets \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (6/2022) \nPage 7.02-6 \n7.0212 STANDARDS FOR NEW SOLID WASTE AND RECYCLING COLLECTION \nAREAS FOR MULTIFAMILY, COMMERCIAL, INDUSTRIAL, AND INSTITUTIONAL \nDEVELOPMENT \nA. Multifamily development, commercial development, industrial development, and institutional \ndevelopment shall provide for solid waste and recycling collection areas (collection areas) according to \nthe following standards: \n1. There shall be unobstructed and safe access for the local licensed hauler’s equipment and \npersonnel, including unobstructed overhead and vertical clearance for collection. \n2. Collection areas shall be adequately sized for the necessary number and size of recycling and solid \nwaste containers to serve the development at maximum occupancy, as outlined in the City of \nGresham Solid Waste and Recycling Collection Service Planning Matrix guidelines. \n3. An adequate number of collection areas shall be provided in locations that are conveniently \naccessible by the development’s users, tenants and/or residents. \n4. When solid waste and recycling collection areas are not within the same enclosure, they shall be \nlocated no more than 20 feet from each other. \n5. No collection area shall be located within any required buffer, screening or setback areas.  \n6. Collection areas shall comply with the Gresham Revised Code, 7.25, related to placement of \ncontainers for collection. \n7. Exterior collection areas shall be entirely screened by the employment of a vegetative screening \nand/or minimum six-foot high sight-obscuring enclosure (fence) or wall. Alternatively, they may be \nscreened by a 6-foot high brick or concrete block (or similar material) wall.  This applies to \ntownhouses only if a shared common collection area is provided for the site. \na. Enclosures constructed of wood or chain link fencing material shall contain a bumper curb at \nground level inside the enclosure or fencing, at least 8 inches thick and four inches high, and 12 \ninches from enclosure walls to prevent damage from container impacts. \nb. Enclosures constructed of concrete, brick, masonry block, or similar type of materials shall \ncontain a bumper curb to prevent damage from container impacts, or a bumper rail. The rail \nshall be secured by anchor bolts recessed in the rail within the perimeter walls of the enclosure \nat a height compatible with service container. \n8. Enclosure gates shall swing free of obstructions and have restrainers in the open and closed \npositions. The gate swing should open to a minimum of 120 degrees. \n9. “No Parking” signs shall be placed in a prominent location on, or near, the enclosure or painted on \nthe pavement in front of the collection area to provide unobstructed and safe access for servicing \ncontainers. \n10. The location for collection areas and method of storage shall conform to local fire and structural \nspecialty code provisions and be accepted by the approval authority. \n11. Within enclosures, containers shall be located on a level cement concrete pad, a minimum four (4) \ninches thick, at ground elevation or other location compatible with the local licensed hauler’s \nequipment at the time of construction. A permanent cover must be added over the entire waste \nenclosure for multifamily residential developments, businesses generating food waste, and \nenclosures where oil and grease waste will be stored. The area under the cover shall be hydraulically \nisolated and drain to the sanitary sewer system. Waste storage areas for all other businesses must \nprovide water quality treatment for any stormwater coming into contact with waste containers. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (6/2022) \nPage 7.02-7 \n12. Collection areas designed for containers smaller than three yards shall have a staging area in front of \nthe enclosure with a minimum length and width to allow for a three-foot perimeter around all sides \nof the container when being serviced outside of the enclosure. \n13. The vehicular approach area and staging area shall not have a percent of grade exceeding three (3) \npercent, sloped in any direction. \n14. Adequate room shall be provided within enclosures for length and width of the service containers \nand for maneuverability in depositing solid waste or recyclable materials. \na. A minimum of two feet, including pad area, shall be provided around the sides and rear of each \ncontainer. \nb. A minimum of three feet, including pad area, shall be provided in front of each container for \nmaneuverability in depositing solid waste or recyclable materials. \nc. In cases where the containers face each other, a minimum of four feet shall be provided in \nbetween containers. \n15. Adequate area shall be provided around the outside or enclosures to allow for maintenance to \nprevent accumulation of waste. \n16. Containers 3 yards and larger must be placed facing the opening of the enclosure. \n17. For containers of three yards and larger, including drop boxes and compactors, the minimum safe \naccess to the front of a service container pad or enclosure shall be a length of 65 feet and width of \n12 feet. \nB. Design and construction of collection areas that accommodate drop boxes and compactors shall comply \nwith the standards listed in subsection (A) above as well as the following standards: \n1. The size of the pad for drop boxes and compactors shall be at least 14 feet wide and at least 5 feet \nlonger than the length of the drop box or compactor. \n2. The pad shall be located a minimum of two feet from any perimeter wall or structure. \n3. Loading dock areas that accommodate drop boxes or compactors shall have a guide rail and bumper \nstop placed at ground level or at dock level, where the rear of the drop box or compactor is to rest \nto protect any enclosure, wall, or structure from damage due to loading or unloading. \n4. Compactors shall be compatible with collection equipment and weight limits prescribed by State \nand local law. The local franchised collection firm shall be consulted for equipment compatibility. \nC. The on-site storage of special wastes/recyclable materials shall conform to the following standards: \n1. Environmentally hazardous wastes defined in ORS 466.005 shall be located, prepared, stored, \nmaintained, collected, transported, and disposed of in a manner acceptable to the Oregon \nDepartment of Environmental Quality. \n2. Containers used to store food waste, cooking oils, grease or animal renderings shall not be located \nin the principal recyclable materials or solid waste storage areas. These materials should be stored \nin separate storage areas designed for this purpose, including a permanent cover and hydraulic \nisolation to prevent contact of waste containers with rainwater. \nD. Exceptions.  As part of a Type II development permit procedure, modification to these provisions may be \npermitted when the changes are consistent with the purpose of these provisions and the City receives \nwritten evidence from the local licensed solid waste and recycling firm that the proposed changes: \n1. Are compatible with firm’s methods of operations. \n2. Will not result in an unreasonable increase in the cost of service. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (6/2022) \nPage 7.02-8 \n7.0220 OPTIONAL IMPROVEMENTS WITH DESIGN REVIEW   \nTo the extent necessary to meet the criteria for design review contained in this ordinance, the \napproval authority may impose the following additional requirements on a development subject to \nadvising the applicant of the reason in writing. \nA. Establish the suitability of the landscape plan by having it prepared by a licensed landscape architect. \nB. Obtain City Engineer's approval of a grading and drainage plan for the collection, treatment, \nretention/detention and conveyance of storm or ground water. \nC. Establish vehicle and pedestrian access facilities with due consideration to size, location and grade. \nD. Dedicate and improve public street right-of-way, a pedestrian way, or an easement for utilities, a \nwaterway or slope protection. \nE. In the case of commercial, institutional or industrial development, provide access by a frontage road \nhaving limited and controlled access onto a major or standard arterial street by means of traffic signals, \ntraffic control islands, or other means that will preserve the traffic carrying capacity and safety of the \nmajor or standard arterial street and will avoid the cumulative effect of individual access points directly \nonto the major or standard arterial street. \nF. Provide access to a street that intersects a major or standard arterial street instead of taking access \ndirectly from the major or standard arterial street in order to preserve the traffic carrying capacity and \nsafety of the major or standard arterial street and avoid the cumulative effect of individual access points \ndirectly onto the major or standard arterial street. \n7.0221 LANDSCAPING INSTALLATION  \nA. Occupancy permits may be issued prior to the complete installation of all required landscaping if a \nGuarantee of Completion equal to 110% of the estimated cost of plant materials and labor as \ndetermined by the Manager is filed with the City ensuring such installation within a time specified by the \nManager but not exceeding six months after occupancy.   \nB. The final landscape inspection shall be made prior to any security being returned. Any portions of the \nplan not installed, not properly installed, or not properly maintained shall cause the inspection to be \npostponed until the project is completed or cause the security to be used by the City. \n7.0222 IRRIGATION PROVISIONS   \nExcept as required in Section 7.0103, underground irrigation may be eliminated without the signature of a \nlicensed landscape architect if the existing vegetation which is employed in the landscape plan has been \npreviously established. \n7.0223 MAINTENANCE RESPONSIBILITY  \nThe property owner is responsible for the maintenance of the site improvements including plant material, \nrestriping parking stalls, posting of the correct address as determined by the Manager, and ensuring the \npreservation of the Clear Vision area and the visibility of addresses and street signage. \nFor the purpose of this subsection, maintenance also includes the replacement of landscaping and street \ntrees that are dead or damaged for various reasons. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (6/2022) \nPage 7.02-9 \nFor complexes, homeowner associations, site management offices, or such other system (including financial \nassurances) for maintenance management shall be established for purposes of maintenance responsibilities.  \nWhere private easements are established (such as with townhouse complexes) to meet open space \nrequirements, property owners will be held responsible for maintenance responsibilities via easement \nlanguage and deed covenants and restrictions.  Maintenance systems shall be established prior to \noccupancy and appropriate documentation provided to the City for verification.  Two or more units, elderly \nhousing and mixed-use developments have additional maintenance requirements in Section 7.0103. \nFailure to maintain site improvements and landscaping may be determined to be a violation of this section. \n7.0224 SITE LIGHTING   \nOn-site lighting for all developments subject to design review shall be hooded or directional so as to reduce \nthe lighting of adjacent properties.  The Manager may require reduced lighting intensities or special fixtures \nto accomplish this provision. Lighting plans addressing this requirement are required to be submitted as part \nof the design review application package. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.877800",
  "extractor_version": "1.0.0"
}