{
  "metadata": {
    "filename": "dc-section-6.0300.pdf_id7853",
    "extracted_at": "2025-05-22T06:15:22.434647",
    "num_pages": 7,
    "title": "DC Section 6.0300",
    "author": "Sarale Hickson",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220615154633-07'00'",
    "modification_date": "D:20220615154649-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \nSection 6.0300 Planned Developments (6/2022) \nPage 6.03-1 \nSection 6.0300 Planned Developments \nTABLE OF CONTENTS \nGeneral \n6.0301 Purpose \n6.0302 Applicability \n6.0303 Types of Planned Developments (PDs) \n6.0311 PD Tentative Plan Approval Criteria \n6.0312 Modification of Tentative PD Plan Approval \nDevelopment Standards \n6.0320 Site Development Requirements \n6.0321 Exception to Site Development and Zoning Standards \n6.0322 PD Density Transfer for sites with Hillside Overlay District    \n6.0323 PD Density Credit for Natural Resources Overlay District Property \n6.0324 Open Space Areas \n6.0325 Streets and Access, Public or Private Status \n6.0326 Street Trees \n6.0327 Required Buffers and Transitioning \n6.0328 Final PD Plat \n6.0329 Additional Standards for Large Lot PDs \nGENERAL \n6.0301 PURPOSE \nThe purpose and intent of this section is to allow an alternative to the traditional subdivision that encourages \nconservation of natural features by relating design to the existing landscape, efficient use of land and public \nservices (particularly but not limited to situations where the existence of slopes, drainageways, or other \nnatural features may preclude traditional subdivision design), and the creation of public and private common \nopen space.  A Planned Development (PD) is such a method of applying alternative development standards for \nresidential developments. \n6.0302 APPLICABILITY \nPD's shall be permitted for residential-only partition and subdivision developments in any of the following \nresidential zones that permit residential development:  VLDR-SW, LDR-5, LDR-7, LDR-PV, LDR-SW, TLDR and TR. \nOnly those housing types permitted as allowed uses in each district shall be allowed in PDs. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0300 Planned Developments (6/2022) \nPage 6.03-2 \n6.0303 TYPES OF PDS \nPDs may include a mix of the housing types permitted within the primary plan district. Subdivision lot sizes are \nalso variable and may consist of large, mixed size, or small lots provided the maximum density of the district is \nnot exceeded.  A “Large Lot” PD, for example, is a PD that creates larger than standard lot sizes for purposes of \nsingle detached and middle housing.  No maximum lot size is stipulated. \n6.0311 PD TENTATIVE PLAN APPROVAL CRITERIA  \nAn application for a tentative PD plan approval shall be made in conjunction with an application for Land \nDivision under Section 6.0200 of the Community Development Code, except that it shall be processed under \nthe Type III procedures.  In addition, PDs that include elements that require Design Review under Article 7 shall \nsubmit for Design Review concurrent with the PD application.  In approving a tentative PD plan, the approving \nauthority shall find compliance with the applicable sections of the Community Development Code. \nIn addition to the above, the application shall clearly provide satisfaction to all of the following: \nA. That the proposal needs to be processed as a PD instead of a standard subdivision or partition,  \nB. That the proposal implements the Purpose of this section (see Section 6.0301),  \nC. That all private open space areas have an approved conservation/maintenance plan, \nD. That the Development Standards in this section are met, and \nE. That the project design, building heights, bulk and scale is appropriate for this location, considering such \nelements as surrounding development and housing types, street system network and capacity, utility \navailability, and the physical and/or natural features of the site.  Such project design shall include \ntransitioning measures (lower to higher height, bulk, scale and density) or buffers, so that perimeter \nstructures of the PD are both comparable and compatible with adjacent residential development.  Note:  \nIn the case of Large Lot PDs, since the building bulks proposed for each lot may be larger and not \ncomparable to adjacent residential development, buffering measures (such as increased vegetation and \nsetbacks) may be required by the review body to ensure neighborhood compatibility and bulk separation. \n6.0312 MODIFICATION OF TENTATIVE PD PLAN APPROVAL  \nModification of the tentative PD plan approval shall be made under the Type II procedures unless it involves \nany of the following, in which case it shall be processed under the Type III procedures used for the tentative PD \nplan approval: \nA. An increase in the number of dwelling units approved as part of the tentative plan. \nB. A change in the mix of dwelling types. \nC. A reduction in the amount of approved open space area by 5% or more.  In no case, except by Type III \nvariance, shall the amount of land designated as open space fall below 25% of the gross land area within \nthe PD if there is no specified Special Purpose overlay district designation; 30% of the gross land area \nwithin the PD if there is a Floodplain, Hillside and Geologic Risk Overlay, Open Space, or Natural Resource \nOverlay designation. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0300 Planned Developments (6/2022) \nPage 6.03-3 \nDEVELOPMENT STANDARDS \n6.0320 SITE DEVELOPMENT REQUIREMENTS \nA. Site development standards of the underlying land use district, including maximum and minimum density \nstandards, shall apply unless superseded by the standards of the PD Section or applicable Overlay District.  \nThe regulations of the PD Section shall prevail if there is a conflict. Maximum density does not apply to \nduplexes, triplexes, quadplexes, or cottage clusters. \nB. The regulations of the PD Section shall apply unless superseded by the standards of the Overlay Districts in \nArticle 5.  The regulations of the Overlay District(s) shall prevail if there is a conflict. \nC. Uses subject to a Special Use Review developed in conjunction with a residential PD shall be subject to the \nprovisions of Sections 8.0100 and 7.0000.  Such reviews would occur concurrently with the PD. \nD. Planned Developments may not prohibit Middle Housing Land Divisions (see Section 6.0503(G)). \n6.0321 EXCEPTION TO SITE DEVELOPMENT AND ZONING STANDARDS  \nExceptions to the following site development standards of the underlying land use district or applicable special \npurpose district provisions may be approved in accordance with this Article: \nA. Design performance Standards Exemption: The Safe Neighborhood Design Performance Standards do not \napply. \nB. Table 6.0321 indicates overall limits for adjusting the underlying district dimensional standards dependent \nupon housing type.   \nTable 6.0321 Standards Allowed for PD  \nResidential Units Permitted in VLDR-SW, LDR-SW, LDR-PV, LDR-7, LDR-5, TR, and TLDR \n \nSingle Detached \nDwelling \nDuplex, Triplex, \nQuadplex \nTownhouse \nCottage Cluster \nStandards \nMinimum site size \nNone \nNone \nNone \nNone \nMinimum lot size \n3,500 sq. ft. (use \nunderlying district \nstandards for \nperimeter lots) \n3,500 sq. ft. (use \nunderlying district \nstandards for \nperimeter lots) \nNone \n3,500 sq. ft. (use \nunderlying district \nstandards for \nperimeter lots) \nDensity range1 \nSee underlying \ndistrict \nSee underlying \ndistrict \nSee underlying \ndistrict \nSee underlying \ndistrict \nMinimum lot \ndimensions2 \nNone \nNone \nNone \nNone \nMinimum lot \nwidth/depth ratio \nNone \nNone \nNone \nNone \nMinimum street \nfrontage \nNone \nNone \nNone \nNone \nMinimum yard \nsetbacks: Interior lots \n3 feet \n0 feet3 \n0 feet3 \n3 feet \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0300 Planned Developments (6/2022) \nPage 6.03-4 \nMinimum yard \nsetbacks: Perimeter \nlots \nSee underlying \ndistrict \nSee underlying \ndistrict \nSee underlying \ndistrict \nSee underlying \ndistrict \nMaximum lot \ncoverage \n70% \n70% \n70% \n70% \nMinimum building \nheight \nSee underlying \ndistrict \nSee underlying \ndistrict \nSee underlying \ndistrict \nSee underlying \ndistrict \nMaximum building \nheight  \n40 feet (See \nunderlying district for \nperimeter lots) \n45 feet or underlying \ndistrict4 \n45 feet or underlying \ndistrict4 \n40 feet (See \nunderlying district for \nperimeter lots) \nMaximum number of \nattached units per \nstructure \nNA \nSee underlying \ndistrict and 10.0100 \nSee underlying \ndistrict \nNA \nBuilding separation \nPer Building Code \nPer Building Code \nPer Building Code \n8 ft. \nGeneral lot utility \neasements5 \nNone \nNone \nNone \nNone \nTable Notes \n1. Developments subject to Overlay Districts may also be restricted in density as per those Overlay Districts.  \n2. It shall be demonstrated for each lot that there is a building area of adequate space to accommodate the \nproposed dwelling type. \n3. Structures with zero lot lines and/or common wall construction are subject to appropriate building and fire \ncode standards at the time of building permit application. \n4. Whichever is greater. \n5. It shall be demonstrated that general utility facilities can be accommodated and, if necessary, general \nutility easements shall be provided. \n6.0322 PD LOT TRANSFER FOR SITES WITH HILLSIDE AND GEOLOGIC RISK \nOVERLAY  \nTo encourage the development of PDs in the Hillside and Geologic Risk Overlay, a lot transfer shall be \nprovided. \nTable 6.0322 PD Density for Hillside and Geologic Risk Overlay Property \nIn areas of the lot(s) or \nparcel(s) that are: \nPercentage of maximum lots \nfrom underlying zone: \nHGRO \n100% \nHSS \n 1 lot per acre* \nThere is no average lot size requirement. However, the total number of lots proposed for the entire PD shall be \nno less than 80% of the minimum allowed at single detached dwelling density on those portions of the \nproperty that are outside the Hillside and Geologic Risk Overlay with the exception of large lot PDs as provided \nin Section 6.0329.  Refer to the Hillsides and Geologic Risk Overlay (Section 5.0200) for other applicable \ndevelopment standards. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0300 Planned Developments (6/2022) \nPage 6.03-5 \n*This lot must be transferred to another portion of the ownership outside the HSS.  No dwelling units shall be \nconstructed on slopes in the HSS, except as provided under Section 5.0212. \n6.0324 OPEN SPACE AREAS \nThe approval authority shall evaluate proposed open space areas based on the following criteria: \nA. For sites with no specified Special Purpose Overlay District designation as per subsection (B), a minimum of \n25% of the gross land area within the PD shall be allocated as an open space area and shall be in public or \nprivate common ownership. Improved open spaces shall be subject to the applicable provisions of Section \n7.0400.  \nB. For sites with a Hillside and Geologic Risk Overlay, Open Space Overlay District, or Natural Resource \nOverlay designation, a minimum of 30% of the gross land area within the PD shall be allocated as an open \nspace area and shall be in public or private common ownership.  Open space that conserves steep slopes \nand/or natural areas shall allow limited access to preserve its natural features.   \nC. Proposed natural open space areas shall be located to maximize the preservation of the features identified \nin subsection (G). \nD. The open space areas may be either public open space or private common open space. \n1. Public open space must comply with requirements of Section 5.0500 of the Community Development \nCode. \n2. Private open space shall comply with the following criteria: \na. Open space easements transferring development rights are dedicated to the public;  \nb. A conservation/maintenance plan is provided that maintains all natural open space areas in a \nnatural condition with only minimal maintenance activity provided.  The plan shall be approved by \nthe City, maintained and implemented by the property owner, and kept as part of the City’s site \ndevelopment file for the duration of the existence of the private open space area.  This plan shall \ninclude: \ni. Identification and contact information of the party responsible for maintenance and oversight \nof the open space area; \nii. Whether the open space area is to be actively or passively maintained and/or conserved; \niii. Specific maintenance anticipated (as applicable) and timing thereof; \niv. Anticipated conservation measures; \nv. Vegetation renewal or replacement plans, nuisance and/or dangerous vegetation removal \nplans; and \nc. There is a financial mechanism that ensures maintenance of any private open space area. \nE. The approval authority may approve the dedication of open space areas or of open space easements in \nconcurrence with an approved phased land division. \nF. Open space areas that are not located in a Special Purpose Overlay District may be improved with active \nrecreation uses or landscaping/passive recreation uses.  Active recreation areas shall include, but are not \nlimited to: swimming pools; tennis, basketball, volleyball and badminton courts; children's play areas; \nbaseball and soccer fields, etc.  Landscaping or passive recreation uses shall include, but are not limited to: \npicnic and barbecue facilities; reflection parks; vegetated stormwater facilities; lawn and other landscaped \nareas; and community gardens, etc.  Active open space areas shall be of a sufficient size for the proposed \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0300 Planned Developments (6/2022) \nPage 6.03-6 \nactive use.  Active and passive open space areas shall be made accessible to all residents of the \ndevelopment. \nG. Proposed open space areas shall be located so as to encourage the conservation of natural features and \nthe protection of steep slopes.  The following topographic features, natural resources and other features \nshall be mapped and identified as part of the application: \n1. Significant natural and cultural features: \na. Water resources, streams, drainageways, ponds, lakes, fish habitat or wetlands; \nb. Historically or culturally significant sites; \nc. Ecological or scientifically significant areas, such as Hogan Cedar trees; \nd. Significant trees and significant tree groves; \ne. Land areas within the Natural Resource Overlay; \nf. Land areas designated High Slope Subarea of the HGRO map. \n2. Other natural features: \na. Trees with a circumference of 25 inches or greater measured at a point 4.5 feet above the ground \non the upslope side of the tree; \nb. Geologic features; \nc. Scenic views and landscapes; \nd. Significant wildlife habitat.  \n6.0325 STREETS AND ACCESS, PUBLIC OR PRIVATE STATUS \nAll PD proposals shall include a future street/neighborhood circulation plan as per Section 9.0700.  Streets \nprovided within a PD shall be public streets, unless it is determined by the City that neighborhood connectivity \nis not necessary for the provision of access through the PD to other properties, either for purposes of public \nsafety and/or efficiency of traffic circulation and access.  Public paths and trails identified as transportation \nfacilities in the Transportation System Plan shall be located within public rights-of-way or public access \neasements, unless otherwise approved by the City. Private streets may be allowed within a PD if the future \nstreet/neighborhood circulation plan demonstrates that connectivity is not necessary through the PD to other \nproperties (as described above), and, the applicant can demonstrate how on-going maintenance of the private \nstreets will be provided for.  All streets and public paths and trails shall be designed and constructed according \nto applicable standards of Appendix 5.000, Section A.5.400-Streets and the Public Works Standards document. \n6.0326 STREET TREES   \nStreet trees shall be provided for all streets within a PD following the standards of Section 9.1044 of the \nCommunity Development Code. \n6.0327 REQUIRED BUFFERS AND TRANSITIONING \nPDs are not exempt from applicable buffer provisions of Section 9.0100.  However, natural and landscaped \nopen space areas may substitute for required buffers via the alternative buffer plan provision of Section \n9.0110(F)(3).  The transitioning of housing types (lower to higher bulk, scale and density) is required at the \nperimeter of PD's regardless of whether or not a buffer is required by Section 9.0100.  Buffer or transition \nvariations may be considered as part of alternative buffer plan proposals. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0300 Planned Developments (6/2022) \nPage 6.03-7 \n6.0328 FINAL PD PLAT \nFinal plats for a PD shall follow the standards, process, and timelines of Section 6.0400, Land Division Final Plat \nRequirements. \n6.0329 ADDITIONAL STANDARDS FOR LARGE LOT PDS \nA. Large Lot PDs are not limited to just areas covered by Overlays.  In case of conflicts in standards, the more \nrestrictive standards shall apply, with the exception of subsection (D) below, which applies in any case. \nB. When clustering and/or attached housing are not proposed and site grading will not exceed the 55% of site \nlimit (if Hillside and Geologic Risk Overlay) as per Section 5.0210(B), the open space designation \nrequirement is not required for Large Lot PDs.  However, buffering or transition measures for compatibility \npurposes may be required by the review body for portions of Large Lot PDs, whether in Hillside and \nGeologic Risk Overlay or not, adjoining other developed areas. \nC. A minimum site size of 2 acres is required for establishment of a Large Lot PD. \nD. Large Lot PDs are not required to comply with minimum density or maximum lot size standards.  Large Lot \nPDs shall, however, have a minimum average lot size that is the same or greater than at least twice the \nminimum density standard of the primary land use district where proposed.  For example, the minimum \naverage lot size in LDR-5 for a Large Lot PD would be 14,000 square feet per lot and in TLDR it would be \n8,712 square feet per lot. \nE. All PD requirements (except as authorized above) are still in effect for Large Lot PDs.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.434999",
  "extractor_version": "1.0.0"
}