{
  "metadata": {
    "filename": "dc-section-4.0400.pdf",
    "extracted_at": "2025-05-22T06:15:23.880485",
    "num_pages": 17,
    "title": "DC Section 4.0400",
    "author": "City Staff",
    "creator": "Acrobat PDFMaker 23 for Word",
    "producer": "Adobe PDF Library 23.6.156",
    "creation_date": "D:20240102104938-08'00'",
    "modification_date": "D:20240102105015-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[4.04]-1 \nCity of Gresham Development Code \n \n(01/2023) \nSECTION 4.0400 \nCORRIDOR DISTRICTS \nGeneral \n4.0401  Purpose   \nCorridor District Characteristics \n4.0410  Rockwood Town Center (RTC)  \n4.0411  Station Centers (SC)  \n4.0412  Corridor Multifamily (CMF)  \n4.0413  Corridor Mixed Use (CMU)  \n4.0414  Community Commercial (CC)  \n4.0415  Moderate Commercial (MC)  \nPermitted Land Uses \n4.0420  Permitted Land Uses   \nCorridor District Standards \n4.0430  Development Standards   \n4.0431  Lot Size and Dimensions   \n4.0432  Floor Area Ratio   \n4.0433  Setbacks   \n4.0434  Building Height   \n4.0435  Transit Design Criteria and Standards in Central Rockwood and Corridor Districts   \n4.0436  Commercial Uses   \n4.0437  Outdoor Commercial Uses     \n4.0439  Clear Vision Area Requirements   \n4.0440  Off-Street Parking for Townhouses in the Rockwood Town Center, Station Center, and Station \nCenter (Ruby Junction Overlay) Districts \n4.0441  Public Facilities and Supplementary Requirements  \n4.0442  Solar Energy Standards for Corridor Districts  \n4.0443  Wind Energy Standards for Corridor Districts  \n4.0444  Biomass Energy Standards for Corridor Districts  \n4.0445  Geothermal Energy Standards for Corridor Districts  \n4.0446  Micro-Hydro Energy Standards for Corridor Districts  \nGeneral \n4.0401  Purpose  \nThis section of the Community Development Code implements the Central Rockwood Plan and creates \ndistricts for the city’s transit corridors.  The Central Rockwood Plan originated in the Gresham 2020 \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[4.04]-2 \nCity of Gresham Development Code \n \n(01/2023) \nAction Plan, which called for this area to accommodate intensive commercial, residential, and mixed-use \ndevelopment.  Central Rockwood is envisioned as a Town Center, growing into a lively pedestrian-\noriented, transit-supportive district.  Transit Corridors are made up of lands adjacent to streets with transit \nservice, identified in Map 21, Volume IV – Transportation System Plan, of the Gresham Community \nDevelopment Plan.  The land use districts of both the Central Rockwood Plan and the transit corridors are \ndesigned to take advantage of the substantial public investments which have been made in transit service, \nand to create attractive places to live, work, shop, and recreate with less reliance on the automobile than \nmight be found elsewhere in the community. \nCorridor District Characteristics \n4.0410  Rockwood Town Center (RTC)  \nThis district encompasses the heart of Central Rockwood. It is centered on the triangle formed by E. \nBurnside, NE 181st Ave., and SE Stark St., but also takes in adjacent properties around the triangle.  \nPrimary uses permitted in RTC are retail commercial, services, office uses and housing. Mixed-use \ndevelopments and various institutional uses (e.g. library, public meeting halls, government facilities) are \nalso permitted. The scale and character of new development is intended to support and reinforce the \nimage of a town center, with buildings of at least two stories, oriented to streets and pedestrians, and with \nparking lots behind or to the sides of buildings. \n \nA portion of the Rockwood Town Center will be the focus of more concentrated high-density residential, \noffice, commercial, service and institutional mixed-use development in a village type urban form. Within \nthis area, proposals to develop multifamily structures and townhouses that front on streets are required to \nhave a mixed-use component along the street frontage. Mixed-use consists of commercial, office, or \ninstitutional uses or combinations thereof in combination with residential uses. This “Mixed-Use” \nRockwood Town Center area consists of the “triangle” described above, and other properties which front \non its abutting streets (see Appendix 9.000). \n4.0411  Station Centers (SC)  \nThis district takes in properties which are adjacent to, or within easy walking distance, of light rail \nstations at 162nd Avenue, 172nd Avenue, Ruby Junction (197th Ave.), and Gresham City Hall. The Station \nCenters district is intended to accommodate uses which are directly supportive of light rail transit. \nDevelopment types permitted include retail and service businesses, offices, mixed-use projects, higher-\ndensity housing, and townhouses. Acknowledging the different character of existing land uses adjacent to \nthe Ruby Jct. light rail station, an overlay designation here will also permit auto-dependent uses, and \nsmall-scale light industrial uses. \n4.0412  Corridor Multifamily (CMF)  \nThis district designation is applied to properties along segments of Transit Streets. The CMF district \nprimarily provides opportunities for moderate-density residential development, including multifamily and \nmiddle housing. It also allows single detached dwellings along the NE Glisan and NE 162nd Avenue \ncorridors. To help create a pleasant pedestrian environment, most new residential buildings will be \noriented to public sidewalks, with parking lots behind or beside buildings. Standards will require that the \nscale of new housing diminish as buildings approach abutting lower density residential districts. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[4.04]-3 \nCity of Gresham Development Code \n \n(01/2023) \n4.0413  Corridor Mixed Use (CMU)  \nThis district designation is applied to certain clusters of properties along Transit Streets. In addition to \nmoderate-density residential uses, the CMU district permits small-scale commercial uses and mixed-use \ndevelopments. Commercial businesses operating in this district will serve primarily the day-to-day needs \nof residents in nearby housing developments and neighborhoods. Design standards in Section 7.0400 for \nduplexes, triplexes, quadplexes, and townhouses, and in Section 7.0100 for new construction and \nremodels which meet the thresholds described in Section 7.0003 will help to ensure that new buildings \nbecome attractive additions to existing and developing neighborhoods. \n4.0414  Community Commercial (CC)  \nThis district designation is applied to larger nodes of primarily commercial development clustered around \nthe intersections of major and/or standard arterial streets. This district services the surrounding \ncommunity with a larger trade area than the Moderate Commercial district but still has building size \nlimitations for compatibility with the adjacent residential properties. The CC district will accommodate a \nwide range of community-scale commercial uses, including retail, services, and offices. This district also \npermits housing as a secondary use, with multifamily being developed in conjunction with commercial \nconstruction.  New buildings will be pedestrian-oriented, with parking placed behind or beside buildings. \nDesign Standards in Section 7.0100 for new construction and remodels which meet the thresholds \ndescribed in Section 7.0003 will help to ensure that new buildings become attractive additions to existing \nand developing neighborhoods.  \n4.0415  Moderate Commercial (MC)  \nThe MC district is applied to smaller nodes of commercial activity than the Community Commercial and \nis clustered around key intersections. This district is intended to function primarily as locally-oriented \ncenters serving smaller trade areas than the Community Commercial district.  Building size limitations \nensure compatibility with the surrounding neighborhoods. Permitted development types include \ncommercial retail, service, and office uses. This district also permits housing as a secondary use, with \nmultifamily being developed in conjunction with commercial construction. Design Standards in Section \n7.0100 for new construction and remodels which meet the thresholds described in Section 7.0003 will \nensure a strong pedestrian orientation for new development. \nPermitted Uses \n4.0420  Permitted Uses   \nTable 4.0420 lists those uses that are permitted in each Corridor Land Use District.   \n• \nP = Permitted use \n• \nL = Use is permitted, but is limited in the extent to which it may be permitted \n• \nNP = Use not permitted \n• \nSUR = Use permitted subject to a Special Use Review \nIn addition to the permitted commercial land use types listed in Table 4.0420, the manager, under the \nType II procedure, may permit other commercial uses which the manager finds to be supportive of, and \nconsistent with, the purposes of the Central Rockwood Plan (Appendix 39 of Volume 1) and Corridor \nDistricts (Section 4.0400), and with applicable land use policies and implementation strategies of the \nCommunity Development Plan. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[4.04]-4 \nCity of Gresham Development Code \n \n(01/2023) \nTable 4.0420:  Permitted Uses in the Corridor Land Use Districts \nUSES \nRTC \nSC \nSC-RJ \nCMF \nCMU \nCC \nMC \nRESIDENTIAL1 \nSingle Detached Dwelling \nNP \nNP \nNP \nL2 \nNP \nNP \nNP \nDuplex \nNP \nP \nP \nP \nP \nNP \nNP \nTriplex \nNP \nP \nP \nP \nP \nNP \nNP \nQuadplex \nNP \nP \nP \nP \nP \nNP \nNP \nTownhouse \nL3 \nP \nP \nP \nP \nNP \nNP \nCottage Cluster \nNP \nNP \nNP \nL2 \nNP \nNP \nNP \nMultifamily28 \nL3, 4 \nL4, 5  \nP4 \nP \nP4 \nL4, 6, 7a \nL4, 6, 8a \nElderly Housing \nSUR3 \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \nManufactured Dwelling Park \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nResidential Facility \nP3 \nP \nP \nP \nP \nL6, 7a \nL6, 8a \nResidential Home \nNP \nNP \nNP \nL2 \nNP \nNP \nNP \nAffordable Housing \nP9 \nP9 \nP9 \nP9 \nP9 \nP9 \nP9 \nCOMMERCIAL \nAuto-Dependent Use \nL10 \nNP \nP \nNP \nL11 \nL7a, 7b \nL8a, 8b \nBusiness and Retail Service and Trade \nP \nL12 \nP \nNP \nL11 \nL7a, 7b \nL8a, 8b \nClinics \nP \nL12 \nP \nNP \nL11 \nL7a, 7b \nL8a, 8b \nCommercial Parking \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \nDaycare Facilities \nP \nL12 \nSUR \nSUR \nP \nP \nP \nLive-Work \nP \nP \nP \nNP \nP \nP \nP \nMajor Event Entertainment \nSUR \nSUR \nSUR \nNP \nSUR \nSUR \nSUR \nMini-Storage Facilities \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nOutdoor Commercial \nNP \nNP \nL13 \nNP \nL13 \nL7a, 7b \nL8a, 8b \nINDUSTRIAL \nConstruction \nNP \nNP \nL14 \nNP \nNP \nNP \nNP \nExclusive Heavy Industrial Uses \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nIndustrial Office \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nInformation Services \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nManufacturing \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nMiscellaneous Industrial \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nTrade Schools \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nTransportation/Distribution \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nWarehousing/Storage \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nWaste Management \nNP \nNP \nNP \nNP \nL/SUR15 \nL/SUR 15 \nL/SUR 15 \nWholesale Trade \nNP \nNP \nNP \nNP \nNP \nNP \nNP \nINSTITUTIONAL USES \nCivic Use \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \nCommunity Services \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[4.04]-5 \nCity of Gresham Development Code \n \n(01/2023) \nUSES \nRTC \nSC \nSC-RJ \nCMF \nCMU \nCC \nMC \nMedical \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \nParks, Open Spaces and Trails \nL/SUR16 \nL/SUR16 \nSUR \nSUR \nSUR \nSUR \nSUR \nReligious Institutions \nP \nP \nP \nSUR \nP \nL7a, 7b \nL8a, 8b \nSchools \nP/SUR20 P/SUR17, 19 \nP/SUR20 SUR20 \nP/SUR20 P/SUR20 \nP/SUR20 \nRENEWABLE ENERGY19 \nSolar Energy Systems \nL/SUR22 \nL/SUR22 \nL/SUR22 \nL/SUR22 \nL/SUR22 \nL/SUR22 \nL/SUR22 \nWind Energy Systems \nL/SUR23 \nL/SUR23 \nL/SUR23 \nL/SUR23 \nL/SUR23 \nL/SUR23 \nL/SUR23 \nBiomass Energy Systems \nL24 \nL24 \nL24 \nL24 \nL24 \nL24 \nL24 \nGeothermal Energy Systems \nL/SUR25 \nL/SUR25 \nL/SUR25 \nL/SUR25 \nL/SUR25 \nL/SUR25 \nL/SUR25 \nMicro-Hydro Energy Systems \nL26 \nL26 \nL26 \nL26 \nL26 \nL26 \nL26 \nOTHER \nBasic Utilities \n  Minor basic utilities \n  Major basic utilities \n \nP \nSUR \n \nP \nSUR \n \nP \nSUR \n \nP \nL/SUR18 \n \nP \nSUR \n \nP \nSUR \n \nP \nSUR \nHeliports17 \nSUR \nNP \nNP \nNP \nNP \nSUR \nNP \nWireless Communication Facilities \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \nSUR \nTemporary, Intermittent & Interim Uses \nP \nP \nP \nP \nP \nP \nP \nMarijuana Businesses \nNP \nNP \nNP \nNP \nNP \nL27 \nL27 \nTable 4.0420 Notes \n1 Temporary health hardship dwellings may be permitted per Section 10.1300. \n2 Permitted only along the NE Glisan and NE 162nd Avenue corridors.  \n3 Within the area identified on the Appendix 9.000 map (Rockwood Town Center Mixed Use Area), all buildings on Stark shall \nhave non-residential uses at the ground floor frontages with primary entries on Stark. In a mixed use building, residential uses \nare allowed above and behind the non-residential uses on Stark. \nGround floor residential uses on Burnside within the area identified on the Appendix 9.000 map (Rockwood Town Center \nMixed Used Area) shall have individual entries oriented to Burnside and located above grade a minimum of 4 feet and a \nmaximum of 9 feet.  Windows into living areas for ground floor residential uses shall be sited for privacy. Except for Section \n7.0210(A)(4) and (5), Transit and Pedestrian Design Criteria and Standards of Section 7.0210 shall apply to all residential \ndevelopment with frontage on Burnside within the RTC district. All other applicable design and development criteria in this code \nshall apply. \n4 Conversion of a hotel or motel to an emergency shelter or to affordable housing is permitted. See Section 10.0420. \n5 New Multifamily shall be developed as a mixed use project when the subject parcel fronts East Burnside and is within 500 feet \nof the center lines of the intersections of East Burnside and 162nd, 172nd or 197th Avenues. A development proposal may be \nexempted from this standard upon an affirmative finding that the street frontage has insufficient dimensions, such as in the case \nof flag lots or irregular shaped parcels, whereby it is physically impracticable to develop commercial or institutional uses.  \nHousing developed for persons with special needs is exempted from the mixed use requirement. This is housing for persons \nwith “special needs” consistent with the definition of the most recent “Consolidated Action Plan” as approved by the US. \nDepartment of Housing and Urban Development. \n6 May be permitted in conjunction with mixed use developments.  Such developments are permitted provided they remain \nprimarily non-residential. This is achieved by having: 1) at least 51% of the site’s ground floor uses be commercial or \ninstitutional uses; and 2) at least 75% of the linear street footage be fronted by a ground floor commercial or institutional use. \nThe street frontage requirement only applies to a street classified as principal arterial, major arterial, standard arterial or \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[4.04]-6 \nCity of Gresham Development Code \n \n(01/2023) \nboulevard. The 75% standard does not apply to those parts of street not fronted by a building due to a driveway or other site \nelement required by the Development Code, such as a required buffer or height transition area. \n7 Community Commercial.  a) The maximum building footprint size permitted for any building, regardless of the type of uses \nwithin it, shall be 100,000 square feet; and b) The maximum total building size (floor area) for commercial uses shall be 100,000 \nsq. ft. \n8 Moderate Commercial.  a) The maximum building footprint size permitted for any building, regardless of the type of uses within \nit, shall be 40,000 square feet with an exception for a maximum building footprint size of 60,000 square feet for a grocery store \nuse; b) The maximum total building size (floor area) for commercial uses shall be 80,000 sq. ft. \n9 Affordable housing development is permitted. See Section 10.1700. \n10 In the Town Center district, Auto-Dependent Uses are limited to sites fronting on standard, major or principal arterial streets. \n11 The maximum building footprint size permitted for any building occupied entirely by a commercial use or uses shall be 20,000 \nsquare feet. For mixed use buildings, the residential and commercial components shall comply with the standards of Section \n7.0103(B)(1)(S4). \n12 A commercial use permitted in the Station Center district (except for the Ruby Junction Overlay) must be located on a parcel of \nwhich some portion is within 500 feet of the intersection of the centerlines of East Burnside / 162nd, or East Burnside / 172nd, or \nEast Burnside / 197th Ave, or East Burnside / 181st, or within ¼ mile of the intersection of the centerlines of Division Street / \nEastman Parkway or Division Street / Kelly Avenue. \n13 The maximum site size for a new Outdoor Commercial use is 2 acres. Certain types of Outdoor Commercial Uses may be \nprohibited.  See Section 4.0437. \n14 Any industrial use shall be limited to a maximum of 45,000 square feet of gross floor area. In addition, any new industrial use \nshall employ at least one person per 500 square feet of gross floor area. An applicant for design review for a new industrial use \nshall submit documentation as part of the application demonstrating conformance with this employee density requirement.  \nIndustrial developments are subject to standards pertaining to GI in Sections 4.0330 and 4.0331. \n15 Solid waste transfer stations, composting facilities, and landfills may pursue approval through the Special Use Review process.  \nWhen located in the Corridor Districts, waste management uses adjacent to residentially designated land shall be located at \nleast 100 feet from the residential property. \n16 Golf courses are not permitted through a Special Use Review. \n17 Schools are permitted in the SC district if they are located on a parcel of which some portion is within 500 feet of the \nintersection of the centerlines of East Burnside / 162nd, or East Burnside / 172nd, or East Burnside / 197th Ave, or East Burnside \n/ 181st, or within ¼ mile of the intersection of the centerlines of Division Street / Eastman Parkway or Division Street / Kelly \nAvenue.  If they are not within this area, they are subject to a Special Use Review. \n18 Electrical generating facilities are not permitted through the Special Use Review process. \n19 Permitted as an accessory use to Medical and Civic Uses through the Special Use Review process. \n20 Schools are permitted without a Special Use Review if they are occupying an existing commercial space.  Schools must \npursue a Special Use Review if they are proposing new construction. \n21 See Section 10.0900 for additional standards that apply. \n22 For limitations, see Section 4.0442 Solar Energy Standards for Corridor Districts. \n23 For limitations, see Section 4.0443 Wind Energy Standards for Corridor Districts.  \n24 For limitations, see Section 4.0444 Biomass Energy Standards for Corridor Districts.  \n25 For limitations, see Section 4.0445 Geothermal Energy Standards for Corridor Districts.  \n26 For limitations, see Section 4.0446 Micro-Hydro Energy Standards for Corridor Districts. \n27 For limitations, see GRC 9.63.090. \n28 Transitional housing for individuals transitioning from incarceration facilities are subject to a Special Use Review. \nCorridor District Standards \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[4.04]-7 \nCity of Gresham Development Code \n \n(01/2023) \n4.0430  Development Standards   \nTable 4.0430, below, summarizes development standards which apply in the Corridors Districts.  The \nstandards contained in this table are supplemented by referenced subsections which provide additional \nclarification or guidance.  Furthermore, the regulations of Section 7.0100 Corridor Design District Design \nGuidelines and Standards, Section 7.0400 Residential Design Standards, and Section 7.0500 Rockwood \nDesign District Design Guidelines and Standards may also apply. \nTable 4.0430  Development Requirements For Corridor Districts \n \nRockwood \nTown \nCenter \nStation \nCenters \nStation \nCenter \n(Ruby Jct. \nOverlay) \nCorridor \nMulti-\nfamily16 \nCorridor \nMixed-Use \nCommunit\ny \nCommerci\nal \n \nModerat\ne \nCommer\n-cial \nA. \nMinimum \nLot Size \n(Section \n4.0431) \n10,000 \nsquare feet \nfor \nresidential; \nnone for \ncommercial, \ninstitutional \nand mixed-\nuse8 \n10,000 \nsquare feet \nfor \nresidential; \nnone for \ncommercial, \ninstitutional \nand mixed-\nuse8, 9 \n10,000 \nsquare feet \nfor \nresidential; \nnone for \ncommercial, \ninstitutional, \nmixed-use, & \nindustrial8, 9 \n10,000 \nsquare \nfeet 8, 9 \n10,000 \nsquare feet \nfor \nresidential; \nnone for \ncommercial, \ninstitutional \nand mixed-\nuse8, 9 \nNone \nNone \nB. \nMinimum \nStreet \nFrontage \n(Section \n4.0431) \n100 feet for \nresidential;  \nnone for \ncommercial, \ninstitutional \nand mixed \nuse14 \n100 feet for \nresidential;  \nnone for \ncommercial, \ninstitutional \nand mixed \nuse11, 14 \n100 feet for \nresidential;  \nnone for \ncommercial, \ninstitutional, \nmixed use, & \nindustrial11, 14 \n100 feet \nfor   \nresidential\n; 11, 14 \n100 feet for \nresidential;  \nnone for \ncommercial, \ninstitutional \nand mixed \nuse11, 14 \nNone \nNone \nC. \nMinimum \nLot Width/ \nDepth \nRatio \n(Section \n4.0431) \n.5 : 1 for \nresidential;  \nnone for \ncommercial, \ninstitutional \nand mixed \nuse8 \n.5 : 1 for \nresidential;  \nnone for \ncommercial, \ninstitutional \nand mixed \nuse8 \n.5 : 1 for \nresidential;  \nnone for \ncommercial, \ninstitutional, \nmixed use, & \nindustrial8 \n.5 : 1 for \nresidential\n; 8 \n.5 : 1 for \nresidential;  \nnone for \ncommercial, \ninstitutional \nand mixed \nuse8 \nNone \nNone \nD. \nMinimum \nFloor Area \nRatio \n(FAR) \n(Section \n4.0432) \n.5 : 1 \n.6 : 1 \n.6 : 1 for \ncommercial, \ninstitutional \nand mixed-\nuses;  none \nfor industrial \nNone \nNone, \nexcept  \n.4 : 1 in \nCentral \nRockwood \nPlan Area13 \nNone, except  \n.4 : 1 in \nCentral \nRockwood \nPlan Area13 \nNone, \nexcept  \n.4 : 1 in \nCentral \nRockwood \nPlan \nArea13 \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[4.04]-8 \nCity of Gresham Development Code \n \n(01/2023) \nTable 4.0430  Development Requirements For Corridor Districts \n \nRockwood \nTown \nCenter \nStation \nCenters \nStation \nCenter \n(Ruby Jct. \nOverlay) \nCorridor \nMulti-\nfamily16 \nCorridor \nMixed-Use \nCommunit\ny \nCommerci\nal \n \nModerat\ne \nCommer\n-cial \nE. \nMinimum \nResidentia\nl Net \nDensity19 \n(See \ndefinition of \nNet Density \nin Article 3) \n18 units per \nacre for \nTownhouses\n; \n20 units per \nacre for \nMultifamily \n18 units per \nacre for \nTownhouses\n; \n24 units per \nacre for \nMultifamily \n18 units per \nacre for \nTownhouses; \n24 units per \nacre for \nMultifamily \n \n12 units \nper  acre \n \n12 units per \nacre \n \n12 units per \nacre \n \n12 units \nper acre \n \nF. \nMaximum \nResidentia\nl Net \nDensity20 \n(See \ndefinition of \nNet Density \nin Article 3) \nUnlimited \ninside Stark/ \nBurnside/ \n181st \nAvenue \nTriangle; \n40 units per \nnet acre \nelsewhere \n60 units per \nacre \n60 units per \nacre \n24 units \nper acre \n24 units per \nacre \n40 units per \nacre \n40 units \nper acre \nG. \nMinimum \nBuilding \nSetbacks \n(Section \n4.0433 and \nSection \n7.0500) \n \n \n0 feet front, \nside and \nrear for \ncommercial, \nmixed-use, \nand \ninstitutional \nuses;  \n5 feet front \nand street-\nside, 0 feet \ninterior side, \n15 feet rear  \nfor \nresidential1, \n16 \n0 feet front, \nside and \nrear for \ncommercial, \nmixed-use, \nand \ninstitutional \nuses;  \n5 feet front \nand street-\nside, 0 feet \ninterior side, \n15 feet rear  \nfor \nresidential1, \n16 \n0 feet front, \nside and rear \nfor \ncommercial, \nmixed-use, \nand  \nInstitutional \nuses;  \n5 feet front \nand street-\nside, 0 feet \ninterior side, \n15 feet rear \nfor \nresidential1, \n16.  For \nindustrial \nuses, see \nTable 4.0330 \n1 \n5 feet \nfront; 15 \nfeet rear; \n0 feet \ninterior \nside; 5 \nfeet \nstreetside\n1 \n5 feet front; \n15 feet rear; \n0 feet \ninterior side; \n5 feet \nstreetside1 \n0 feet front, \nside and \nrear, \nincluding \nstreetside \n0 feet \nfront, side \nand rear, \nincluding \nstreetside \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n[4.04]-9 \nCity of Gresham Development Code \n \n(01/2023) \nTable 4.0430  Development Requirements For Corridor Districts \n \nRockwood \nTown \nCenter \nStation \nCenters \nStation \nCenter \n(Ruby Jct. \nOverlay) \nCorridor \nMulti-\nfamily16 \nCorridor \nMixed-Use \nCommunit\ny \nCommerci\nal \n \nModerat\ne \nCommer\n-cial \nH. \nMaximum \nBuilding \nSetbacks \n(Section \n4.0433) \n \nCommercial, \nInstitutional \n& Mixed-\nUse: 10 feet \nfront and \nstreetside2 \nNone for \ninterior side \nand rear.  \nResidential: \n20 feet front; \nNone for \ninterior side \nand rear; 20 \nfeet street-\nside3a \n20 feet front; \nNone for \nrear and \ninterior side; \n20 feet for \nstreet-side3a \nFor \nresidential, \ncommercial, \ninstitutional \nand mixed-\nuse: 20 feet \nfront; none for \nrear and \ninterior side; \n20 feet for \nstreet-side.3a \nNo maximum \nfor industrial \nuses. \n \n20 feet \nfront; \nNone for \nrear and \ninterior \nside; 20 \nfeet for \nstreet-\nside3a \n20 feet \nfront; None \nfor rear and \ninterior side; \n20 feet for \nstreet-side3a \n10 feet front; \nNone for rear \nand interior \nside; 10 feet \nfor street-\nside3b, 3c \n10 feet \nfront; \nNone for \nrear and \ninterior \nside; 10 \nfeet for \nstreet-\nside3b, 3c \nI. \nMaximum \nBuilding \nHeight21 \n(Section \n4.0434) \nInside the \nTriangle \nArea: \ncommercial \nand \ninstitutional: \n6 stories; \nBuildings \nthat include \nother uses: \n4 stories; \nOutside the \nTriangle \nArea: 10 \nstories for all \nuses.15, 22 \n10 stories in \nOutside \nTriangle \nArea and 80 \nfeet \nelsewhere15, \n22 \n10 stories in \nOutside \nTriangle Area \nand 80 feet \nelsewhere15, \n22 \n45 feet22 \n45 feet22 \n45 feet \n45 feet \nJ. Transit \nDesign \nCriteria \nand \nStandards \nApply  \n(Section \n4.0435) \nYes7 \nYes7 \nYes7 \nYes7 \nYes7 \nYes \nYes \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": " \n[4.04]-10 \nCity of Gresham Development Code \n \n(01/2023) \nTable 4.0430  Development Requirements For Corridor Districts \n \nRockwood \nTown \nCenter \nStation \nCenters \nStation \nCenter \n(Ruby Jct. \nOverlay) \nCorridor \nMulti-\nfamily16 \nCorridor \nMixed-Use \nCommunit\ny \nCommerci\nal \n \nModerat\ne \nCommer\n-cial \nK. \nMinimum \nOff-Street \nParking \nRequired  \n \nNone \nNone \nNone \nAs \nprovided \nin Section \n9.0851 \nAs provided \nin Section \n9.0851 \nAs provided \nin Section \n9.0851 \nAs \nprovided \nin Section \n9.0851 \nL. \nMaximum \nOff-Street \nParking \nPermitted   \n2 spaces/ \nunit for \nresidential4, \n5; all other \nuses see \nSection \n9.0851.  \n1.5 spaces/ \nunit for \nresidential4, \n5; all other \nuses see \nSection \n9.0851. \n1.5 spaces/ \nunit for \nresidential4, 5; \nall other uses \nsee Section \n9.0851. \nAs \nprovided \nin Section \n9.08514 \nAs provided \nin Section \n9.08514,5 \nAs provided \nin Section \n9.08515 \nAs \nprovided \nin Section \n9.08515 \nM. \nScreening \nand \nBuffering \nRequired  \nNo, except \nwhere \nabutting \nLDR-5, \nLDR-7, TR, \nTLDR,  \nCMF, or \nCMU12 \nNo, except \nwhere \nabutting \nLDR-5, \nLDR-7, TR, \nTLDR, CMF, \nor CMU12 \nNo, except \nwhere \nabutting \nCMF, and for \nauto-\ndependent \ncommercial, \noutdoor \ncommercial \nand industrial \nuses12 \nYes12 \nYes12 \nYes \nYes \nN. Clear \nVision \nArea \nRequired \n(Section \n4.0439) \nYes 6 \nYes 6 \nYes 6 \nYes \nYes \nYes \nYes \nTable 4.0430 Notes: \n1 \nMinimum setbacks for Townhouses (except in those areas of CMF along the NE Glisan and NE \n162nd Avenue corridors see table note 18) are: \n(a) Front Yard: \n(i) Front façade = 5 feet \n(ii) Front Porch = 3 feet \n(iii) Garage = 20 feet \n(b) Side Yard: \n(i) Interior = 5 feet for any side of a dwelling structure that is not a common wall with another \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": " \n[4.04]-11 \nCity of Gresham Development Code \n \n(01/2023) \ndwelling structure; \n(ii) Interior - Common: 0 ft. \n(iii) Street side (corner lot): Façade = 5 feet; Porch = 5 feet; Garage with access from street \nside = 20 feet. \n(c) Rear Yard = 10 feet if there is no alley; 5 feet if there is an alley. \n2 \nA maximum front or streetside setback of up to twenty (20) feet may be permitted when enhanced \npedestrian spaces and amenities are provided that comply with Section 7.0103(A)(5)(S1) and \n(S2).  \n3 \nThe following setback standards apply: \n \na. When abutting a Principal Arterial, a Major Arterial, a Minor Arterial or Boulevard street, the \nmaximum front or streetside setback for a building containing dwelling units is thirty (30) feet.  \nThe maximum front or streetside setback may be exceeded when enhanced pedestrian spaces \nand amenities are provided that comply with Section 7.0103(A)(5)(S1) and (S2). \n \nb. When abutting a Principal Arterial, a Major Arterial, a Minor Arterial or Boulevard street, the \nmaximum front or streetside setback for a building containing commercial uses is ten (10) feet.  \nThe maximum front or streetside setback may be exceeded when enhanced pedestrian spaces \nand amenities are provided per Section 7.0103(A)(5)(S1) and (S2). \n \nc. When abutting a Collector, Community or Local streets, the maximum front or streetside \nsetback is five (5) feet.  The maximum front or streetside setback may be exceeded when \nenhanced pedestrian spaces and amenities are provided that comply with Section \n7.0103(A)(5)(S1) and (S2). \n4 \nThere is no maximum parking limitation for Townhouses. \n5 \nFor commercial uses, when included in a mixed-use development, the maximum amount of off-\nstreet parking shall be as provided in Section 9.0850 for each commercial use. \n6 \nConformance with clear vision standards of Section 9.0200 shall be required only for \ndevelopments with direct access to an arterial street. \n7 \nGround floor window standards for commercial buildings on Design Streets (Section 7.0210) do \nnot apply to residential developments. \n8 \nMinimum lot size and lot width/depth ratio standards do not apply to lots or parcels created for \nTownhouses. Minimum lot dimensions for Townhouse lots (except in those areas of CMF along \nthe NE Glisan and NE 162nd Avenue corridors see table note 18) are as follows:  \n \nWidth at building line \nInterior Lot \n16 feet (lots of less than 22 feet in width shall take access from an alley or from a \nshared access) \nCorner Lot \n16 feet where it abuts an alley 25 feet where there is no alley or shared access \nDepth 0 feet - all developments that include townhouses shall receive both land division approval \nto create lots for the townhouses as required in Section 6.0001, and design review approval \nas required in Section 7.0001. \n9 \nThere is no minimum lot size requirement for duplexes in the SC, CMF and CMU districts. \n10 \nMinimum street frontage for duplex in the SC, CMF (except in those areas along the NE Glisan \nand NE 162nd Avenue corridors see table note 18) and CMU districts is 35 feet, except corner \nlots shall be 40 feet as measured from the corner radius end point to the property corner. \n11 \nScreening and buffering are not required for townhouses abutting the LDR-5, LDR-7, TLDR, or \nTR District. \n12 \nThe Central Rockwood Plan Area is the area shown as Central Rockwood Plan Land Use \nDistricts on Figure 1 of Appendix 39, Volume 1 of the Gresham Community Development Plan. \n13 \nMinimum street frontage for townhouses shall be 16 feet, except corner lots shall be 25 feet as \nmeasured from the corner radius end point to the property corner if there is an alley or shared \naccess, and 32 feet from the corner radius end point to the property corner if there is no alley or \nshared access.  A reduction in the minimum street frontage may be approved when the applicant \ncan document compliance with Section 10.1520 of the Community Development Code. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": " \n[4.04]-12 \nCity of Gresham Development Code \n \n(01/2023) \n14 \nWithin the Rockwood Design District: \n \na.  Triangle Area. For lands in the Triangle Area as described in Section 7.0501 buildings shall \nnot exceed six stories for buildings with exclusively commercial and/or institutional uses and four \nstories in height for buildings that include other uses. \n \nb.  Outside Triangle Area. For lands in the Outside Triangle Area as described in Section 7.0501 \nbuildings shall not exceed ten (10) stories in height. \n \nSee Section 7.0503(B)(6) Gateways for additional building height requirements for properties at \nthe three gateway street intersections of: \n \na.  181st and Burnside \n \nb.  181st and Stark \n \nc.  Burnside and Stark \n15 \nWithin the Rockwood Design District: \n \na.  Triangle Area. See Section 7.0503(A)(2) Building Frontage and Placement for minimum and \nmaximum front building setbacks. \n \nb.  Outside Triangle Area. See Section 7.0503(A)(2) Building Frontage and Placement for \nminimum and maximum front building setbacks. \n16 \nSingle detached dwellings and middle housing in the areas of CMF along the NE Glisan and NE \n162nd Avenue corridors shall conform with development standards of Tables 4.0130 and 4.0131 \nfor the TLDR district, except minimum net density for middle housing shall be 12 units per acre \nand maximum density shall be 25 units per acre for townhouses and 24 units per acre for all other \nmiddle housing uses. \n20 \nMinimum residential net density does not apply to affordable housing development. See Section \n10.1700.  \n21 \nA density bonus applies to affordable housing development. See Section 10.1700. \n22 \nA heigh bonus applies to affordable housing development. See Section 10.1700. \n23  \nHeight limitations for Townhouses (except in the areas of CMF along the NE Glisan and NE \n162nd Avenue corridors, see table note 18) shall be as follows: \n(i)  Minimum Building Height:  \n \n \nCMU and CMF districts: 1 Story \n \n \nAll other districts: 2 Stories \n(ii) Maximum Building Height: 45 ft. \n4.0431  Lot Size and Dimensions   \nA. \nMinimum lot size, minimum street frontage, and minimum lot width/depth ratio shall be as \nspecified in Table 4.0430 for new development.  The lot width/depth ratio shall be determined by \ndividing the lot width dimension by the lot depth dimension. \nB. \nMinimum lot size, street frontage, and lot width/depth ratio standards of Table 4.0430 shall be \nsatisfied prior to issuance of a development permit for attached dwellings. \nC. \nExisting lots of record which do not meet the minimum lot size or street frontage standard, or the \nminimum lot width/depth ratio standard, may be developed with permitted uses as listed in Table \n4.0420.  Development permitted under this subsection is exempt from the minimum residential \ndensity standard of Table 4.0430. \n4.0432  Floor Area Ratio   \nA. \nThe minimum floor area ratios contained in Table 4.0430 apply to non-residential and mixed-use \ndevelopment.  Alterations to existing development are exempt from the minimum FAR standard.  \nFor mixed-use developments in areas with a minimum commercial FAR and a minimum \nresidential density requirement, minimum FAR and residential density requirements are satisfied \nwhen consistent with the following formula: \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": " \n[4.04]-13 \nCity of Gresham Development Code \n \n(01/2023) \n \nNumber  Of Proposed  Dwelling Units \n+ \nProposed Commercial Floor Area \n≥ 1 \nMinimum Number Of Units Required \nMinimum Required Commercial Floor Area) \n \nB. \nSites that have all the following characteristics shall calculate their minimum required floor area \nusing a site area equal to 100 feet times the site width: \n1. \nThe site width is less than 150 feet; and \n2. \nThe site depth is more than three times the site width; and \n3. \nThe site has street frontage on only one street, and that street is on the site’s shorter \ndimension, which is its width. \n4.0433  Setbacks   \nRequired minimum and maximum setback standards are specified in Table 4.0430 and Section 7.0500. \nA. \nMinimum setback distances shall be determined in conformance with the definition for \"Setback\" \nas specified in Section 3.0103.   \nB. \n1.  For Rockwood Town Center (RTC), Station Centers (SC) and Station Center-Ruby Junction \n(SC-RJ) within the Rockwood Design District see Section 7.0500.  For Station Center elsewhere \nin the city, the following shall apply: Conformance with maximum setback distance is achieved \nfor a commercial or mixed-use building when at least one (1) primary entrance located on the \nfaçade facing the street is placed no farther from the property line than the distance specified for \nMaximum Building Setback in Table 4.0430.  Maximum building setbacks may be exceeded \nwhen a development incorporates enhanced pedestrian spaces and amenities in the setback area.  \nEnhanced pedestrian spaces and amenities consist of features such as plazas, arcades, courtyards, \noutdoor cafes, widened sidewalks, benches, shelters, street furniture, public art, or kiosks.  In \naddition, on sites with more than one building, the maximum setback may be exceeded for \ncommercial, mixed-use, and residential buildings containing three (3) or more dwelling units, \nprovided conformance is achieved with the maximum setback distance for at least one (1) \nbuilding.  For townhouse buildings, conformance also must be achieved with building orientation \nstandards of Section 7.0432. \n \n2.  For commercial developments in Corridor Mixed-Use (CMU), Community Commercial (CC), \nand Moderate Commercial (MC), see Section 7.0100. \n3.  For mixed-use developments and multifamily in all districts, see Section 7.0100. \nC. \nSetback standards for townhouses are in Table 4.0430, Footnote 1. \n4.0434  Building Height   \nMaximum building heights are specified in Table 4.0430.  Any required building story must contain a \nhabitable floor. \nA. \nIn addition to conforming with the Ground Floor Windows requirement of Section 7.0210, for \nany new commercial or mixed-use building of more than one story, at least twenty percent of the \nupper facade area shall be made up of display areas or windows for all facades facing a street, \nexcept those developments subject to the Corridor Design District Design Standards of Section \n7.0100 and those subject to the Rockwood Design Standards of Section 7.0500, and those subject \nto Plan District requirements such as the Downtown Plan District. \nB. \nThe maximum building height for any building containing dwelling units shall be reduced when \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": " \n[4.04]-14 \nCity of Gresham Development Code \n \n(01/2023) \nlocated adjacent to an LDR-5, LDR-7, TLDR, or TR District, as provided in Section 7.0432(P). \nC. \nHeights of townhouses are identified in Table 4.0430, Footnote 19, except for those areas of \nCMF along the NE Glisan and NE 162nd Avenue corridors see Table 4.0430 Footnote 18. \n4.0435  Transit Design Criteria and Standards in Central Rockwood and \nCorridor Districts  \nThe Central Rockwood Plan and Corridor districts are pedestrian districts.  As such, new development \nmust have a strong orientation to the pedestrian and be transit-supportive, as well as enhance the \nappearance and functioning of these districts.  In order to achieve these purposes, the provisions of \nSection 7.0500 apply to development within the Rockwood Design District. Additionally, the provisions \nof Section 7.0210(B)(8) and 7.0210(B)(10)(b) apply to new development requiring design review \napproval in the Rockwood Design District.  Sections 7.0103 and 7.0432 apply to new residential and \nmixed-use (residential) development.  Section 7.0103 applies to commercial development in the Corridor \nDesign District. Except those developments in and reviewed under a Design District, Section 7.0310 \napplies to Commercial, Institutional, and the non-residential portions of Mixed Use developments that are \nnot in the Downtown Plan District, Civic Neighborhood Plan District, or the Corridor Design District. \nSection 7.0320 applies to new industrial development requiring design review approval.  Section \n7.0210(A) applies in addition to other applicable standards and criteria to all developments except to \nthose commercial developments in the Corridor Design District.  Additionally, the provisions of Section \n7.0210(B) apply to new development requiring design review approval in the Station Center outside the \nRockwood Design District. \n4.0436  Commercial Uses   \nA. \nAt least 85% of business activities in connection with commercial uses permitted in Table 4.0420 \nshall be conducted within a completely enclosed structure, except for outdoor commercial uses.  \nNo more than 15% of the area devoted to buildings may be used for outdoor business activities, \nproduct display, or storage.  However, in the Rockwood Town Center, the Station Center district, \nand the Corridor Mixed-Use district, the amount of site area used for outdoor business activities, \nproduct display, or storage may be up to 50% of the amount of floor area on the site. \nB. \nNo outdoor business activities, product display or storage shall be located within yard setback or \nbuffering and screening areas.  Areas devoted to on-site outdoor business activities, product \ndisplay or storage shall be located so that they do not interfere with pedestrian circulation. \n4.0437  Outdoor Commercial Uses   \nA. \nOutdoor commercial uses may be permitted in the Station Center (Ruby Junction Overlay) \nDistrict or the Corridor Mixed-Use District as indicated in Table 4.0420, subject to the following \nlimitations: \n1. \nTotal site size for any new outdoor commercial use shall not exceed two acres. \n2. \nThe amount of total site area covered by buildings shall amount to no less than 25% of the \namount of site area used for outdoor storage or display. \n3. \nExcept for buildings used entirely for storage associated with the business, the maximum \nfront or streetside setback for any building shall be 20 feet. \n4. \nScreening shall be provided along any portion of the site’s street frontage which is not \noccupied by a building, in a manner which satisfies provisions of Section 9.0823(C)(3). \nB. \nThe following types of outdoor commercial uses shall be prohibited within the Station Center \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": " \n[4.04]-15 \nCity of Gresham Development Code \n \n(01/2023) \n(Ruby Junction Overlay) District and the Corridor Mixed-Use District: \n1. \nVehicle sales lots; \n2. \nMobile home or manufactured home sales, service, or storage; \n3. \nRecreational vehicles sales service, or storage. \n4.0440  Off-street Parking for Townhouses in the Rockwood Town Center, \nStation Center, and Station Center (Ruby Junction Overlay) Districts \nA. \nEach parking space shall be at least 8.5 feet wide by 18 feet deep. \nB. \nTandem (end-to-end) parking is allowed. \nC. \nA maximum of one parking space per unit may be located in a driveway in the front or street side \nyard setback or in the rear yard setback when there is an alley. \nD. \nDriveways shall have minimum width of 10 feet.   \nE. \nCurb cuts shall meet all of the requirements contained in Section A5.400. \n4.0441  Public Facilities and Supplementary Requirements   \nAll developments shall also be subject to the applicable requirements of Section 4.0430 - Site \nDevelopment Standards; Article 9 - Common Requirements; and Appendix 5.000 - Public Facilities \nStandards. \n4.0442  Solar Energy Standards for Corridor Districts  \nSolar energy systems are limited in all Corridor districts as follows: \nA. \nScale. Small and medium scale solar energy systems are permitted in these districts. Large scale \nsystems are permitted with a Special Use Review. \nB. \nType.  Roof-top, flat-roof, integrated and ground-mounted solar energy systems are permitted. \nC. \nHeight. The following limitations on maximum height apply to all solar energy systems: \n1. \nRoof-top, Flat-roof and Integrated. \na. \nFor roofs that are flat or the horizontal portion of mansard roofs, the solar energy \nsystems on frames shall not exceed 10 feet above the roof height on which the \nsystem is installed. \nb. \nFor pitched, hipped or gambrel roofs, the solar energy system panels shall not \nexceed 18 inches in height from the surface of the roof on which the system is \ninstalled.  \n2. \nGround-mounted. Ground-mounted solar energy systems shall not exceed 20 feet in height. \nD. \nSetbacks and Yards. Solar energy systems are not allowed in the required front or street-side \nsetbacks. \n4.0443  Wind Energy Standards for Corridor Districts \nWind energy systems are limited in all Corridor districts as follows: \nA. \nScale. Small and medium scale wind energy systems are permitted in these districts.  Large scale \nsystems are permitted with a Special Use Review. \nB. \nType.  Roof-top and ground-mounted wind energy systems are permitted. \nC. \nHeight.  The following limitations on maximum height apply to all wind energy systems: \n1. \nRoof-top.  Wind energy system height shall not exceed a value equal to the building height \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": " \n[4.04]-16 \nCity of Gresham Development Code \n \n(01/2023) \nwhen the building height is 45 feet or less. For example, a 20 foot tall building could have a \n20 foot tall wind energy system installed on its roof for a total height of 40 feet from the \nground to top of the wind energy system.  \n \nFor buildings which exceed 45 feet in height, the wind energy system shall not exceed 45 \nfeet maximum. For example, a 60-foot tall building could have a 45-foot tall wind energy \nsystem installed on its roof for a total height of 105 feet from the ground to the top of the \nwind energy system. \n2. \nGround-mounted.  Ground-mounted wind energy systems shall not exceed 45 feet in \nheight. The height limit of 45 feet can be exceeded up to 110 feet with a Special Use \nReview.  \nD. \nSetbacks and Yards.  Wind energy systems are not allowed in required front, street-side, side or \nrear setbacks, and are not allowed in the front or street-side yards between the building and the \nstreet. \n4.0444  Biomass Energy Standards for Corridor Districts \nBiomass energy systems are limited in all Corridor districts as follows: \nA. \nScale.  Small scale biomass energy systems are permitted. \nB. \nType.  Non-hazardous biomass systems are permitted. \nC. \nHeight.  Biomass energy systems shall not exceed the maximum district height limits. \nD. \nSetbacks and Yards.  Biomass energy systems are not allowed in the required front, street-side, \nside or rear setbacks, and are not allowed in the front or street-side yards between the building \nand the street. \n4.0445  Geothermal Energy Standards for Corridor Districts \nGeothermal energy systems are limited in all Corridor districts as follows: \nA. \nScale.  Small scale geothermal energy systems are permitted. Large scale systems are permitted \nwith a Special Use Review. \nB. \nType.  Closed-loop geothermal energy systems that are not in any well field protection areas are \npermitted. \nC. \nHeight.  Geothermal energy systems shall not exceed the maximum district height limits. \nD. \nSetbacks and Yards.  Geothermal energy systems are not allowed in the required front, street-\nside, side or rear setbacks, except that small geothermal heating and cooling units like heat pumps \ncan project into the setbacks per Section 9.0900 Projections. \n4.0446  Micro-Hydro Energy Standards for Corridor Districts \nMicro-hydro energy systems are limited in all Corridor districts as follows: \nA. \nScale.  Small scale micro-hydro energy systems are permitted. \nB. \nType.  In-pipe micro-hydro energy systems such as systems within water, stormwater or \nwastewater pipe are permitted. \nC. \nHeight.  Generally the district height limits apply. However, in-pipe systems may exceed the \ndistrict height limit as allowed for mechanical equipment. If supplemental equipment structures \naccompany the in-pipe systems, then the district height limit would apply.  \nD. \nSetbacks and Yards.  Micro-hydro energy systems contained within piping are allowed and pipe \ncan run within the required setbacks. However, if supplemental equipment structures accompany \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 17,
      "text": " \n[4.04]-17 \nCity of Gresham Development Code \n \n(01/2023) \nthe in-pipe systems, then the district setback limits apply.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.881488",
  "extractor_version": "1.0.0"
}