{
  "metadata": {
    "filename": "dc-section-11.0700.pdf_id7893",
    "extracted_at": "2025-05-22T06:15:23.745050",
    "num_pages": 4,
    "title": "DC Section 11.0700",
    "author": "Katie",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615201544-07'00'",
    "modification_date": "D:20220615201600-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[11.07]-1 \nCity of Gresham Development Code \n \n(08/14) \nSECTION 11.0700 \nOPTIONAL CONFERENCES AND PRE-APPLICATION \nCONFERENCE \n11.0700  Optional Conferences and Pre-Application Conference \n11.0701  Purpose \n11.0702  Applicability \n11.0703  Optional Conferences and Pre-Application Conference Procedures \n \n11.0700 \nOptional Conferences and Pre-Application Conference \n11.0701  Purpose \nA. \nOptional Early Assistance Design Advice.  The purpose of the Optional Early Assistance Design Advice \nmeeting is to permit a conversation with the Design Commission prior to the applicant beginning the \nDevelopment Permit process by submitting for a Pre-Application meeting. The Design Commission is \nnot rendering a decision at this meeting on whether the proposal meets the Design Principles, Guidelines \nand Standards of the Design District nor is this meeting an exhaustive review of all potential issues. The \nconference does not bind or preclude the City from enforcing all applicable regulations or from applying \nregulations in a manner differently than may have been indicated in the Optional Early Assistance \nDesign Advice. \nB. \nPre-Application Conference.  The purpose of the pre-application conference is to acquaint the applicant \nor representative with the requirements of this code, including relevant approval criteria, standards and \nprocedures.  It is designed to assist the applicant.  The pre-application conference is not an exhaustive \nreview of all potential issues, and the conference does not bind or preclude the city from enforcing all \napplicable regulations or from applying regulations in a manner differently than may have been \nindicated in the pre-application conference. \nC. \nOptional Design Commission Consult.  The purpose of the Design Commission consult is to provide an \nopportunity for the applicant to gain initial insight into the Design Commission’s preliminary evaluation \nof whether the proposal appears to meet the Design Principles, Guidelines and Standards of the Design \nDistrict.  The Design Commission is not rendering a decision at this meeting nor is this meeting an \nexhaustive review of all potential issues.  The conference does not bind or preclude the City from \nenforcing all applicable regulations or from applying regulations in a manner differently than may have \nbeen indicated in the Design Commission consult. \n11.0702  Applicability  \nTable 11.0204 identifies all applications that require a pre-application conference.  The Optional Early \nAssistance Design Advice and the Optional Design Commission Consult meetings are optional for the applicant \nand not a requirement. \n11.0703  Optional Conferences and Pre-Application Conference Procedures \nA. \nInitiation and scheduling of Optional Early Assistance Design Advice, Pre-Application Conference and \nOptional Design Commission Consult \n1. \nThe applicant shall submit a completed form provided by the Manager for that purpose, the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[11.07]-2 \nCity of Gresham Development Code \n \n(08/14) \nrelevant fee, and copies of information required on the form.  \n2. \nThe City will schedule and conduct the Optional Early Assistance Design Advice, the Pre-\napplication Conference and the Optional Design Commission Consult within approximately \ntwenty (20) calendar days of receipt of a request for the meeting. For industrial reviews as \ndescribed in Section 7.0003, a pre-application conference shall be scheduled and conducted \nwithin 10 calendar days of receipt of a request for the meeting. \n3. \nThe Manager shall coordinate the involvement of City staff responsible for planning, \ndevelopment review, roads, drainage, and other subjects, as appropriate, in the meetings.  The \nOptional Early Assistance Design Advice and the Optional Design Commission Consult \nmeetings with the Design Commission are open to the public. The Pre-application conference is \nnot open to the general public. \n \nThe Manager shall coordinate the involvement of City staff and the Design Commission \nmembers responsible for providing consult meeting input. \nB. \nOptional Early Assistance Design Advice, Pre-Application Conference and Optional Design \nCommission Consult Summary  \n1. \nWithin approximately fourteen (14) calendar days after an Optional Early Assistance Design \nAdvice, Pre-application Conference or Optional Design Commission consult, the Manager may \nprovide to the applicant, or the applicant’s agent, a written summary of the conference.  The \npurpose of the written summary is to provide a preliminary assessment of a proposal and is not to \nbe construed as a final recommendation by the City, by the Design Commission or by any other \noutside agency or service provider on the merits of the proposal.   \n2. \nThe written Optional Early Assistance Design Advice summary should:  \na. \nSummarize the proposed use and relevant characteristics of the proposal; \nb. \nIdentify Design Commission comments on the proposal; and  \nc. \nIdentify the applicant’s response to the Design Commission comments. \n3. \nThe written Pre-application Conference summary should:  \na. \nSummarize the proposed use and relevant characteristics of the proposal; \nb. \nIdentify necessary application submittal requirements;  \nc. \nIdentify the relevant approval criteria and development standards, with a disclaimer that \nthe approval criteria and development standards in effect at the time an application is \nreceived will control; \nd. \nIdentify specific additional information that is needed to respond to the relevant criteria \nand development standards or is recommended to respond to other issues; and  \ne. \nIdentify applicable application fees, with a disclaimer that fees are subject to change \nand that the fees in effect at the time a complete application is received will control.  \n4. \nThe written Optional Design Commission Consult summary should:  \na. \nSummarize the proposed use and relevant characteristics of the proposal; \nb. \nIdentify Design Commission comments on the proposal with regard to the relevant \nDesign Principles, Guidelines and Standards; and  \nc. \nIdentify the applicant’s response to the Design Commission comments. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[11.07]-3 \nCity of Gresham Development Code \n \n(08/14) \nC. \nPre-Application Conference Validity Period, Optional Design Commission Consult Validity Period and \nFollow-Up \n1. \nIf a complete application relating to a proposed development action that was the subject of a pre-\napplication conference has not been submitted within eighteen (18) months of the conference, the \napplicant shall schedule a follow-up pre-application conference.  \n2. \nAn applicant may request a follow-up pre-application conference, if desired.  \n3. \nA new or follow-up pre-application conference is required in the following instances: \na. \nThe number of residential units increases by twenty percent (20%) or more; \nb. \nThe proposed use changes between residential, mixed-use, commercial, industrial, or \ninstitutional; \nc. \nThere is a significant change in circulation; or \nd. \nAdditional application reviews that require a pre-application conference as per Table \n11.0204 are needed to accommodate the proposal.  \nA new or follow-up pre-application conference is not needed if these instances were discussed in the \npre-application conference and incorporated in the City’s meeting notes.   \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.745413",
  "extractor_version": "1.0.0"
}