{
  "metadata": {
    "filename": "dc-section-11.0600.pdf_id7892",
    "extracted_at": "2025-05-22T06:15:20.246386",
    "num_pages": 4,
    "title": "DC Section 11.0600",
    "author": "Katie",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615201518-07'00'",
    "modification_date": "D:20220615201536-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[11.06]-1 \nCity of Gresham Development Code \n \n(09/17) \nSECTION 11.0600 \nTYPE IV LEGISLATIVE PROCEDURES \n11.0600  Type IV Legislative Procedures \n11.0601  General Description \n11.0602  Type IV Procedures \n \n11.0600 \nType IV Legislative Procedures \n11.0601  General Description  \nType IV applications are legislative and typically involve the adoption, implementation or amendment of policy \nby ordinance.  These include amendments to the text of the Gresham Community Development Plan.  Large \nscale changes in planning and development maps also may be characterized as legislative where a larger number \nof property owners are directly affected. The Type IV process includes public hearing before a recommendation \nauthority like the Planning Commission or Design Commission, which forwards a recommendation to the City \nCouncil.  The City Council holds a public hearing before making a final decision.  The following are Type IV \napplications:  \n• \nThose identified in this Code as Type IV applications;  \n• \nThose identified in Table 11.0204 as Type IV applications; or \n• \nThose identified by the Manager as Type IV applications, based on the guidelines for classification of \napplications by procedure in Section 11.0203.   \n11.0602  Type IV Procedures  \nA. \nPre-Application Conference.  A pre-application conference is not required for Type IV legislative \napplications.  \nB. \nNeighborhood Meeting.  A neighborhood meeting is not required for Type IV legislative applications.  \nHowever, the city may schedule general neighborhood or public meetings to provide information on the \nType IV legislative application in advance of the formal notice and public hearing process. \nC. \nApplication Initiation \n1. \nThe City Council may initiate a Type IV legislative application to amend the text of the Gresham \nCommunity Development Plan or Code by motion. \n2. \nA property owner or their authorized representative may initiate a Type IV legislative application \nthat does not involve a text amendment.   \nD. \nType IV Public Notice  \n1. \nFor Comprehensive Plan Amendments, the public notice is as follows: \na. \nA Type IV proposal to amend the Community Development Plan or Code or to adopt a \nnew land use regulation shall be submitted to the Manager of the Department of Land \nConservation and Development (DLCD) along with appropriate forms at least 35 days \nprior to the initial evidentiary hearing on adoption.  Notice to DLCD is not required \nwhen the city determines that the goals do not apply to a particular proposed \namendment or new regulation. Notice shall be given to affected City departments, and \nany governmental agency which is entitled to notice under an intergovernmental \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[11.06]-2 \nCity of Gresham Development Code \n \n(09/17) \nagreement with the City which includes provision for such notice or is otherwise \nentitled to such notice. Such departments and agencies may request up to a 15-day \nextension to their comment period if the application involves unusual circumstances. \nThe department or agency is assumed to have no comments if no comments are \nreceived within the specified time period. \nb. \nNot more than forty (40) nor less than twenty (20) days before the initial evidentiary \nhearing on the Type IV proposal, the Manager shall mail notice to owners of property \nwithin the city for which the proposed ordinance, if adopted, may in the Manager’s \nopinion affect the permissible uses of land.  The notice of the initial evidentiary hearing \nfor a Type IV procedure shall include at least the following information:  \n1. \nIf required by ORS 227.186, a statement in bold type across the top of the first \npage of the notice that reads as follows: “This is to notify you that the City shall \nconsider a proposed land use regulation that may affect the permissible uses of \nyour land”; \n2. \nThe date, time, and location of the hearing; \n3. \nThe nature and purpose of the hearing; \n4. \nThe casefile number or title of the proposed ordinance to be considered at the \nhearing; \n5. \nA listing of the applicable approval criteria by Community Development Plan \nand/or Code section numbers;  \n6. \nA statement that a copy of the staff report will be available for inspection at no \ncost at least seven (7) days before the hearing, and a copy will be provided at \nreasonable cost, and the name and telephone number of a city representative to \ncontact about the ordinance;  \n7. \nA statement that failure to raise an issue in a hearing, in person or by letter, or \nfailure to provide statements or evidence sufficient to afford the decision making \nauthority an opportunity to respond to the issue precludes appeal to the Land Use \nBoard of Appeals on that issue;  \n8. \nInclude a general explanation of the requirements for submission of testimony \nand the procedure for conduct of hearings; and \n9. \nIf applicable, a statement that the ordinance is a result of an order of the Land \nConservation and Development Commission or Metro. \nc. \nAt least ten (10) days before the initial hearing in a Type IV procedure, the Manager \nshall: \n1. \nPublish in a newspaper of general circulation in the City of Gresham a summary \nof the hearing notice, including the date, time, and location of the hearing and the \nnumber and nature of the ordinance to be considered; and \n2. \nMake copies of the hearing notice available in City Hall.  \n2. \nFor all other Type IV applications, such as vacations and historic resource designations, the public \nnotice is as follows: \na. \nAt least 20 days prior to the hearing, the city shall mail written notice of the public \nhearing to:  \n1. \nThe applicant and/or authorized representative; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[11.06]-3 \nCity of Gresham Development Code \n \n(09/17) \n2. \nThe owner(s) of record of the subject property;  \n3. \nAny City-recognized neighborhood association whose boundaries include or are \nwithin 300 feet of the subject property;  \n4. \nOwners of property located within three hundred (300) feet of the perimeter of \nthe subject property; \n5. \nAffected city departments, and any governmental agency which is entitled to \nnotice under an intergovernmental agreement with the City which includes \nprovision for such notice or is otherwise entitled to such notice. Such \ndepartments and agencies may request up to a 15-day extension to their comment \nperiod if the application involves unusual circumstances. The department or \nagency is assumed to have no comments if no comments are received within the \nspecified time period.  \nb. \nThe mailed notice of public hearing shall include all of the following:  \n1. \nThe name and address of the applicant or the applicant’s representative;  \n2. \nThe case file number and nature of the proposed use or development;  \n3. \nThe designation of the review authority and the date, time, and place of the \nhearing; \n4. \nA description of the subject property reasonably sufficient to inform the public of \nthe location; \n5. \nThe applicable criteria for the decision, listed by commonly used citation;  \n6. \nA statement that all interested persons may appear and provide testimony and \nthat only those participating at the hearing, or in writing, shall be entitled to \nappeal;  \n7. \nA statement that failure to raise an issue at the hearing, in person or by letter, or \nfailure to provide sufficient specificity to enable the review authority to respond \nto the issue, precludes an appeal based on that issue;  \n8. \nThe name and telephone number of a city representative to contact for additional \ninformation;  \n9. \nA statement that copies of the application and all evidence and documents \nsubmitted by or on behalf of the applicant are available for review, and copies \ncan be obtained at cost; \n10. \nA statement that a copy of the staff report will be available for inspection at no \ncost at least seven (7) days prior to the hearing, and copies will be provided at \nreasonable cost; and \n11. \nA general explanation of the requirements for submission of testimony and the \nprocedure for conduct of public hearings.  \nc. \nThe Manager shall cause an affidavit of mailing of notice to be prepared and made a \npart of the file, which demonstrates the date that the required notice was mailed to the \nnecessary parties.  \nd. \nNotice of the public hearing shall be published in a newspaper of general circulation in \nthe city at least 20 days prior to the scheduled hearing date. An affidavit of publication \nconcerning such notice shall be made part of the administrative record.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[11.06]-4 \nCity of Gresham Development Code \n \n(09/17) \ne. \nAt least 20 days prior to the hearing, notice of the hearing shall be posted on the site by \nthe applicant.  The Manager shall provide at least one (1) sign and the instructions for \nposting.  The sign shall be posted in a conspicuous place visible from the street.  For \nproperties that abut more than one improved street, separate signs shall be posted facing \neach improved street.  The sign shall include the case file number and the telephone \nnumber of the city representative to contact about the application. An affidavit of \nposting shall be submitted by the applicant and made part of the administrative record.  \nE. \nType IV Decision Authority  \n1. \nThe recommendation authority shall conduct the initial evidentiary hearing and provide a \nrecommendation to the City Council for all Type IV proposals.  The recommendation authority \nmay recommend that the City Council reject or adopt the ordinance with or without certain \nchanges, conditions or both, together with a written justification for the recommendation.   \n2. \nAt least ten (10) days before the City Council consideration of the Type IV proposal, the \nManager shall publish in a newspaper of general circulation in the City of Gresham a summary of \nthe hearing notice, including the date, time, and location of the hearing and the number and \nnature of the ordinance to be considered.  \n3. \nAt the conclusion of the City Council consideration of the Type IV proposal, the Council shall \ntake one of the following actions:  \na. \nContinue the matter to a date, time, and location certain;  \nb. \nRemand the matter back to the recommendation authority for additional deliberation;  \nc. \nApprove the proposal, with or without certain changes.  The City Attorney shall prepare \nthe ordinance with written findings which demonstrate that adoption will comply with \napplicable approval criteria; or \nd. \nReject the proposed ordinance. \n4. \nThe City Council shall adopt or approve written findings which demonstrate that adoption of the \nproposed ordinance will or will not comply with applicable approval criteria.  \nF. \nType IV Notice of Decision \n1. \nNot more than twenty (20) days after the date of the adoption or rejection of an ordinance subject \nto Type IV procedures, the Manager shall mail or otherwise submit notice to the Department of \nLand Conservation and Development (DLCD) on forms provided for such notice.   \n2. \nNot more than seven (7) days after the date of the adoption or rejection of an ordinance, the \nManager shall mail or otherwise submit notice to persons who testified orally or in writing to the \nrecommendation authority or City Council while the public record was open regarding the \nproposed ordinance.  The notice shall include at least the following information:  \na. \nA brief summary of the ordinance; \nb. \nThe date of the decision on the ordinance;  \nc. \nThe place where and the time when the ordinance and related findings may be \nreviewed; and \nd. \nA summary of the requirements for appealing the City Council decision to LUBA.   \nG. \nAppeal of a Type IV Decision.  The final decision of the City Council on a Type IV ordinance may be \nappealed to the Land Use Board of Appeals (LUBA). \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.246752",
  "extractor_version": "1.0.0"
}