{
  "metadata": {
    "filename": "dc-section-4.1300.pdf_id7840",
    "extracted_at": "2025-05-22T06:15:25.235212",
    "num_pages": 3,
    "title": "DC Section 4.1300",
    "author": "City Staff",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220615143220-07'00'",
    "modification_date": "D:20220615143819-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[4.13]-1 \nCity of Gresham Development Code \n \n(01/19) \nSECTION 4.1300 \nGRESHAM BUTTE PLAN DISTRICT \nGeneral \n4.1301  Purpose  \nDevelopment Standards \n4.1310  Types of Development Allowed and Setback Minimum  \n4.1311  Density and Average Lot Sizes  \n4.1312  Site Development Requirements  \nGeneral \n4.1301  Purpose   \nThe Gresham Butte Plan District is an overlay district providing special regulations covering the Gresham \nButte area of the city.  The boundaries of the Gresham Butte Plan District are shown on the Gresham \nButte Overlay Map in Appendix 41 of Volume 1, Gresham Community Development Plan.  Contained in \nthis section are special requirements for development within this area. \n \nSpecial requirements for this area are provided to preserve the natural beauty of Gresham Butte.  In \naddition, the requirements are needed to provide for the unique development conditions experienced on \nGresham Butte including special needs in the areas of storm water management, fire protection and access \nmanagement. \n \nThe uses permitted and standards applied match those of the Low-Density Residential-5 District and the \nHillside and Geologic Risk Overlay unless modified by this section. \nDevelopment Standards \n4.1310  Allowed Uses \nThe permitted uses of Table 4.0120 under LDR-5 apply. \nThe LDR-5 development types are allowed except the Gresham Butte Plan District specifically prohibits: \n1. \nTriplexes; \n2. \nQuadplexes; \n3. \nTownhouse; \n4. \nCottage Cluster; and \n5. \nZero Lot Line Dwellings. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[4.13]-2 \nCity of Gresham Development Code \n \n(01/19) \n4.1311  Density and Average Lot Sizes \nTable 4.1311(A) summarizes the density and lot size requirements which apply to the Gresham Butte \nPlan District. \nTable 4.1311(A) \nStandard \nRequirement \nCalculation Method \nMaximum Density \n1 D.U./Acre \nProperty Area = Gross Property Area as \ndescribed by recorded legal description or \nexisting boundary survey \nRounding of D.U. = 1/2 Acre or more will round \nup to the next D.U. (i.e. 1.50 Acres = 2 D.U., \n1.499... = 1 D.U.)* \nAverage Lot Size \nMinimum Average = 1 Acre \nIf separate open space area(s)** is(are) \ncreated, the area of the open space tract(s) \nis(are) added into the area calculation but is not \ncounted towards the total dwelling unit count \n(i.e. Lot A = .5 Acres, Lot B = .3 Acres, Lot C = \n.5 Acres and Open Space Tract D = 1.7 Acres \nwould result in an average lot size of 1 acre) \n*   Existing vacant properties under .5 acre, with adequate space get credit for one dwelling unit. \n** Separate open space must be put in a tract or tracts owned and maintained by all of the property owners of the lots created \nwith the land division.  Tract deeds and maintenance agreement(s) must be approved by the City of Gresham prior to the \nrecordation of the final plat or final subdivision. \n4.1312  Site Development Requirements \nThe Site Development Requirements of LDR-5 shall apply unless modified by this section. \nA. \nDevelopment on a Lot of Record \nA lot of record may be developed with a permitted use as per the Gresham Community \nDevelopment Code.  Development on a lot of record must be developed with dwellings protected \nwith a fire sprinkler system consistent with Subsection (B) below. \nB. \nSetbacks  \nThe LDR-5 setback requirements are required except that the side yard setback shall be a \nminimum of 10 feet to encourage side yard planting. \nC. \nFire Suppression Systems Required \nAll new dwelling units constructed within the Gresham Butte District shall be built with fire \nsuppression systems installed consistent with the Building Code and shall be inspected and \napproved by the Gresham Fire Marshal. \nNew construction within the Gresham Butte Plan District involving the addition to or remodeling \n(requiring building permits under the Building Code) that either adds to or modifies over 50% of \nthe original structure floor area shall be built with a fire suppression system installed as above. \nD. \nAccess Requirements \nAccess to Gresham Butte shall be enhanced through upgrades to the existing SW Walters Road as \ndescribed in the City of Gresham Capital Facilities Plan. \nAll development shall be designed to the greatest extent possible to create connectivity between \nstreets and sidewalks and the public trail and path system as described in the current Gresham \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[4.13]-3 \nCity of Gresham Development Code \n \n(01/19) \nParks and Recreation, Trails and Natural Areas Master Plan.  \nE. \nArea-wide and Basin Specific Utility Facilities  \nIn order to effectively manage stormwater runoff from development on Gresham Butte, new \ndevelopment shall participate in area-wide or basin specific stormwater management solutions \nwhere the City of Gresham best design approaches indicates an area-wide solution based on \nefficiency for long term maintenance and safety considerations. \nThis participation may also be required for other utilities given the unique topographic and open \nspace features of Gresham Butte.  Other facilities preliminarily identified, include but are not \nlimited to sanitary sewer systems and water systems. \nF. \nModifications to Public Facility Standards \nFor SW Walters Road and in the Gresham Butte Plan District, standards of Appendix 5.000 - \nPublic Facilities, Gresham Community Development Code, may be modified including right of \nway, width, pavement, sidewalk, and other standards with approval by the Manager. \n4.1313  Design Standards \nThe design standards of Section 7.0420 shall apply to single detached dwellings and duplexes in the \nGresham Butte Plan District. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.235411",
  "extractor_version": "1.0.0"
}