{
  "metadata": {
    "filename": "dc-section-10.0600.pdf_id7879",
    "extracted_at": "2025-05-22T06:15:25.428278",
    "num_pages": 2,
    "title": "DC Section 10.0600",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615195607-07'00'",
    "modification_date": "D:20220615195624-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.06]-1 \nCity of Gresham Development Code \n \n(04/15) \n \nSECTION 10.0600 - WIRELESS COMMUNICATION \nFACILITIES CO-LOCATION STANDARDS \n \nWireless Communication Facilities Co-Location Standards \n10.0601  Co-Location Standards \n10.0602  Request to Modify an Existing and Eligible Wireless Communication Facility \nCo-Location Standards \n10.0601  Co-Location Standards  \nThe purpose of this section is to provide standards for the co-location of wireless communication facilities. Co-\nlocated facilities that cannot meet the standards of this section shall be reviewed through a Type II Special Use \nReview procedure. \nA. \nCo-located wireless communication facility antennas shall meet the following standards: \n1. \nThe co-located antennas are proposed for an approved wireless communication facility or other \nlocation; \n2. \nAdditional equipment facilities may be contained within the confines of the existing approved \nsite; \n3. \nAntennas do not extend more than two feet from the pole, co-location facility or existing antenna \narray upon which it will be attached; or do not extend beyond the easement where the co-location \nfacility is located, whichever distance is less. \nB. \nCo-located antennas shall obtain a building permit. \nC.      1.   \nAll wireless communication facility co-location proposals for personal wireless services shall be \nsubject to the requirements and limitations of 47 U.S.C. 332(c)(7) and the rules adopted by the \nFederal Communications Commission to implement said section.   \n2.   \nAll wireless communication facility co-location proposals shall be subject to the requirements and \nlimitations of 47 U.S.C. 1455(a) and the rules adopted by the Federal Communications \nCommission to implement said section.   \n3.   \nIn the event the applicable federal laws or rules conflict with Section 10.0601, the provisions of \nthe applicable federal laws and rules shall apply. \n10.0602  Request to Modify an Existing and Eligible Wireless Communication \nFacility  \nNotwithstanding Section 8.0103, Section 8.0122 or Section 10.0601, the modification of a wireless \ncommunication facility that is an “eligible facility” shall be subject to the following: \nA. \nTerms as used in Section 10.0602 shall have the meanings provided by 47 U.S.C. 1455(a) and the rules \nadopted by the Federal Communications Commission to implement said section (Mandatory Approval \nProvisions). \nB. \nThe Manager shall comply with the completeness process, review process and timelines as provided by \nthe Mandatory Approval Provisions. 47 U.S.C. 1455(a). \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.06]-2 \nCity of Gresham Development Code \n \n(04/15) \n \nC. \nAs required by 47 U.S.C. 1455(a), the Manager may not deny and shall approve an eligible facility \nrequest for a modification of an existing wireless tower or base station that meets the requirements of \nthe Mandatory Approval Provisions. Notwithstanding the foregoing, the Manager may place conditions \non the grant of an eligible facility request, provided that those conditions are consistent with the \nrequirements of the Mandatory Approval Provisions. \nD. \nAny 47 U.S.C. 1455(a) application that the City grants, whether by City action or by operation of FCC \nrule or federal law, shall be subject to the condition that the applicant comply with: \n1. \nThe camouflage requirements in the City of Gresham Community Development Code or in the \noriginal approval of the existing tower or base station;  \n2. \nThe applicable provisions of the codes adopted and enforced pursuant to GRC Article 10.05.   \n3. \nAny other generally applicable City laws reasonably related to health and safety. \nE. \nAny application that is deemed granted by reason of the City’s failure to act within the applicable time \nperiods provided in federal law: \n1. \nShall not be deemed granted until the Applicant provides notice to the City, in writing, that the \napplication has been deemed granted after the applicable time period has expired; and \n2. \nShall be subject to all requirements in Section 10.0602(D).   \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.428569",
  "extractor_version": "1.0.0"
}