{
  "metadata": {
    "filename": "dc-section-10.0900.pdf_id7880",
    "extracted_at": "2025-05-22T06:15:23.839265",
    "num_pages": 8,
    "title": "DC Section 10.0900",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615195736-07'00'",
    "modification_date": "D:20220615195758-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.09]-1 \nCity of Gresham Development Code \n \n(06/22) \n \nSection 10.0900 \nRENEWABLE ENERGY \nRenewable Energy \n10.0901  Purpose \n10.0902  Applicability \n10.0903  Development Permit Requirements for Renewable Energy Systems \n10.0904  General Standards   \nSolar Energy Systems \n10.0910  Solar Energy Systems   \n10.0911  Solar Energy Systems Scale \n10.0912  Solar Energy Systems Type \n10.0913  Solar Energy Systems Height \n10.0914  Solar Energy Systems Setbacks and Yards \nWind Energy Systems \n10.0920  Wind Energy Systems   \n10.0921  Wind Energy Systems Scale \n10.0922  Wind Energy Systems Type \n10.0923  Wind Energy Systems Height \n10.0924  Wind Energy Systems Setbacks and Yards \n10.0925  Wind Energy Systems Environmental Standards \n10.0926  Wind Energy Systems Safety \n10.0927  Wind Energy Systems Noise Impact \nBiomass Energy Systems \n10.0930  Biomass Energy Systems   \n10.0931  Biomass Energy Systems Scale \n10.0932  Biomass Energy Systems Type \n10.0933  Biomass Energy Systems Height \n10.0934  Biomass Energy Systems Setbacks and Yards \nGeothermal Energy Systems \n10.0940  Geothermal Energy Systems   \n10.0941  Geothermal Energy Systems Scale \n10.0942  Geothermal Energy Systems Type \n10.0943  Geothermal Energy Systems Height \n10.0944  Geothermal Energy Systems Setbacks and Yards \nMicro-Hydro Energy Systems \n10.0950  Micro-Hydro Energy Systems   \n10.0951  Micro-Hydro Energy Systems Scale \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.09]-2 \nCity of Gresham Development Code \n \n(06/22) \n \n10.0952  Micro-Hydro Energy Systems Type \n10.0953  Micro-Hydro Energy Systems Height \nRenewable Energy \n10.0901  Purpose  \nThe purpose of this section is to allow renewable energy systems where appropriate in order to diversify energy \nsources, reduce greenhouse gas emissions, stimulate the economy with new jobs, and contribute to high-quality, \nenergy efficient developments that create a great place to live, work, shop and play. \n10.0902  Applicability  \nThis section shall apply to all renewable energy systems throughout the city, unless superseded by the Plan \nDistrict Standards. This section is not applicable to electric generating facilities or to renewable energy systems \nlocated within the publically owned or administered right of way. \n10.0903  Development Permit Requirements for Renewable Energy Systems  \nThe development permit requirements for renewable energy systems are discussed in Article 11 with review \nauthorities listed in Table 11.0204 unless stated otherwise in the Code. \n10.0904  General Standards  \nThese standards apply to all renewable energy systems, unless otherwise noted. Additional standards are found \nin Article 4. \nA. \nMechanical Equipment Screening \n1. \nAll mechanical, electrical, service equipment and outdoor storage associated with renewable \nenergy systems shall be screened so that the equipment is not visible from the streets and other \nstreet level public spaces, including alleys. Appropriate screening includes architecturally \ncompatible, sight obscuring parapet walls, building walls, fabricated enclosures such as panels, \nfences or dense evergreen landscaping of sufficient height and density to conceal the equipment \nwithin five years of planting. \n2. \nExemptions to the renewable energy system equipment screening include: \na. \nRoof-top solar panels parallel to pitched roof or no greater than 18” from parallel to the \nroof; \nb. \nFlat-roof solar energy systems; \nc. \nIntegrated solar energy systems; \nd. \nSolar panels that in total are less than two feet x two feet total area; \ne. \nGround-mounted solar trees or other art features at the discretion of the Manager; \nf. \nWind turbines. However, any associated equipment shelter shall be screened; \ng. \nHeat pumps; and \nh. \nElectric vehicle charging stations and units. \nB. \nExternal Effects \nThe following standards apply to all renewable energy systems.  Additional standards may be found in \nthe Article 4 table notes. \n1. \nNoise.  All renewable energy systems shall comply with the noise standards in the Gresham \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[10.09]-3 \nCity of Gresham Development Code \n \n(06/22) \n \nRevised Code Sections 7.20.030 to 7.20.050. \n2. \nLighting and Glare.  Lighting shall be consistent with local, state and federal law. Lighting of any \nassociated equipment shelters shall be limited to that required for safety, security and operational \npurposes, and shall be full cut-off, shielded fixtures. Materials shall be designated as non-\nreflective or no more than 11% reflective to minimize glare.  \n3. \nEmissions.  The emission of air pollutants, odorous gases and changes in temperature detectable \nby human senses without the aid of instruments at any point beyond the property  line is \nprohibited.  \nC. \nSignage.  Signage on any renewable energy system equipment shall comply with Appendix 6.000 Sign \nRegulations. Signage does not include reasonable identification of the manufacturer or operator of the \nsystem and necessary safety and operations information. \n10.0910 Solar Energy Systems Standards \n10.0911  Solar Energy Systems Scale \nThere are three scales of solar energy systems with characteristics as noted below: \nA. \nSmall Solar Energy System.  A small solar energy system has the following characteristics: \nRoof-top or Flat-roof \n1. \nDoes not exceed the peak height of the roof on which it is installed; and \n2. \nDoes not increase the footprint of the structure; and \n3. \nIs installed generally parallel to the slope of the roof or is no more than 18” from the roof; or \nintegrated. \nIntegrated \n4. \nIs integrated into the building materials and design such as the walls, windows or roofing \nmaterials; or \nGround Mounted \n5. \nCovers a total ground area no greater than 25 square feet; and \n6. \nHas a height no greater than 6 feet in height. \nA small solar energy system also has all of the following characteristics: \n7. \nIs not located on a building or on a site that is a historic, cultural or archeological resource; and \n8. \nIs accessory to the primary use of the site; and \n9. \nIs used to generate energy for use primarily on the site and/or for selling back to the grid with a \nsystem size no greater than 10 kW. \nB. \nMedium Solar Energy System.  A medium solar energy system has the following characteristics: \nRoof-top or Flat-roof \n1. \nExceeds the peak height of the roof on which it is installed by no more than 10 feet; or \n2. \nIncreases the footprint of the structure; or \n3. \nIs not installed generally parallel to the slope of the roof if it is roof-top equipment and is more \nthan 18” from the roof; or \nGround Mounted \n4. \nCovers a total ground area greater than 25 square feet but no more than 225 square feet; or \n5. \nExceeds six (6) feet in height but no greater than ten (10) feet in height. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[10.09]-4 \nCity of Gresham Development Code \n \n(06/22) \n \nA medium solar energy system also has all of the following characteristics: \n6. \nIs not located on a building or on a site that is a historic, cultural or archeological resource; and \n7. \nIs accessory to the primary use of the site; and \n8. \nIs used to generate energy for use primarily on the site and/or for selling back to the grid with a \nsystem size over 10 kW and no greater than 100 kW. \nC. \nLarge Solar Energy System.  A large solar energy system has the following characteristics: \nRoof-top or Flat-roof \n1. \nIs located on the roof of a building that is a historic, cultural or archeological resource; or \nIntegrated \n2. \nIs located on the roof of a building that is a historic, cultural or archeological resource; or \nGround Mounted \n3. \nCovers a total ground area greater than 225 square feet; or \n4. \nExceeds 10 feet in height but no greater than 20 feet in height; or \n5. \nIs located on a site that is a historic, cultural or archeological resource. \nA large solar energy system also has all of the following characteristics: \n6. \nIs accessory to the primary use of the site; and \n7. \nIs used to generate energy for use primarily on the site and/or for selling back to the grid with a \nsystem size over 100 kW but no greater than 500 kW. \n10.0912  Solar Energy Systems Type \nThere are four types of solar energy systems as follows: \nA. \nRoof-top Solar.  The solar energy systems, such as the solar panels, are installed or attached to the roof \nas independent panels on the roof of a building or on a structure such as a carport. \nB. \nFlat-roof Solar.  Thin film solar cells are integrated into the rolled roofing material and installed as part \nof the roof of the building. \nC. \nIntegrated Solar.  The solar energy system materials are part of the building fabric or structure by \ndesign, materials and/or structure such as solar window glazing, solar walls, solar awnings or solar \nshingles. \nD. \nGround-mounted Solar.  The solar energy system is independent of the building and is mounted on \narmatures to the ground either on a ground racking system or on a pole such as a stand-alone solar tree. \n10.0913  Solar Energy Systems Height \nHeight shall be measured from the base of the solar energy system equipment to the system’s highest point. \n10.0914  Solar Energy Systems Setbacks and Yards \nThe solar energy system shall be allowed as noted in Article 4 in the site’s underlying land use district. For \nthose systems which are not allowed in the yards, yard is as defined in Article 3 General Terms. \n \n10.0920 Wind Energy Systems Standards \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[10.09]-5 \nCity of Gresham Development Code \n \n(06/22) \n \n10.0921  Wind Energy Systems Scale \nA. \nSmall Wind Energy System.  A small wind energy system has the following characteristics: \n1. \nHas a total extended wind energy system height of no greater than ten (10) feet; and \n2. \nHas no more than two (2) units. \nA small wind energy system also has all of the following characteristics: \n3. \nIs not located on a building or on a site that is a historic, cultural or archeological resource; and \n4. \nIs accessory to the primary use of the site; and \n5. \nIs used to generate energy for use primarily on the site and/or for selling back to the grid. \nB. \n Medium Wind Energy System.  A medium wind energy system has the following characteristics: \n1. \nHas a total extended wind energy system height over ten (10) feet but no greater than forty-five \n(45) feet; or \n2. \nHas three (3) but no greater than five (5) units. \nA medium wind energy system also has all of the following characteristics: \n3. \nIs not located on a building or on a site that is a historic, cultural or archeological resource; and \n4. \nIs accessory to the primary use of the site; and \n5. \nIs used to generate energy for use primarily on site and/or for selling back to the grid. \nC. \nLarge Wind Energy System.  A large wind energy system has the following characteristics: \n1. \nIs not located on a building or on a site that is a historic, cultural or archeological resource; or \n2. \nHas a total extended wind energy system height of greater than forty-five (45) but no greater than \none-hundred ten (110) feet; or \n3. \nHas six (6) units but no greater than ten (10) units. \nA large wind energy system also has all of the following characteristics: \n4. \nIs accessory to the primary use purpose of the site; and \n5. \nIs used to generate energy for use primarily on the site and/or for selling back to the grid. \n10.0922  Wind Energy Systems Type \nThere are two types of wind energy systems as follows: \nA. \nRoof-top Wind.  The wind energy systems, such as the blade or vertical turbines, that are attached to the \nroof of a building or structure. \nB. \nGround-mounted Wind.  The wind energy systems that are independent of the building and are mounted \neither into the ground typically on a pole or on a tower structure. \n10.0923  Wind Energy Systems Height \nHeight shall be measured from the natural grade base of the wind energy system equipment to the system’s \nhighest point. \n10.0924  Wind Energy Systems Setbacks and Yards \nA. \nThe wind energy systems shall be allowed as noted in Article 4 in the site’s underlying land use district. \nB. \nIn addition to conforming with the required setback areas of the underlying land use district, all wind \nenergy systems that are adjacent to residential lands shall be set back from the property line a distance \nequal to 1.1 times the total extended wind energy system height. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[10.09]-6 \nCity of Gresham Development Code \n \n(06/22) \n \n10.0925  Wind Energy Systems Environmental Standards \nA. \nWind energy systems shall not be allowed in the city’s environmental overlays or districts, such as \nNatural Resource Overlay (NRO) except that a single detached dwelling unit or middle housing unit \nlocated entirely within a NRO may have a helical vertical axis turbine roof-top wind energy system. \nB. \nHorizontal axis wind energy systems (with blades) shall be set back 100 feet from identified wetlands \nand bird habitat areas plus the 1.1 times the system height setback of Section 10.0924(B). \nC. \nThe natural grade shall not be changed to increase the elevation of the wind energy system. \n10.0926  Wind Energy Systems Safety \nA. \nAll ground-mounted wind energy system equipment shall be secured to prevent unauthorized access. \nB. \nWind energy systems shall have an automatic braking, governing or feathering system to prevent \nuncontrolled rotation, over-speeding, and excessive pressure on the tower structure, rotor blades, and \nturbine components. \nC. \nMechanical brakes shall be operated in a fail-safe mode. Stall regulation shall not be considered a \nsufficient braking system for over-speed protection. \n10.0927  Wind Energy Systems Noise Impact \nFor wind energy systems only, the applicant shall submit a report issued by a licensed acoustical engineer \nstating that the wind energy system will meet the provisions of the Gresham Revised Code Section 7.020.030-\n7.020.050.  Additionally, a second report shall be submitted to indicate that the installed wind energy system has \nmet the provisions of the Gresham Revised Code Section 7.020.030-7.020.050 prior to final approval of the \nbuilding permit. \n10.0930 Biomass Energy Systems Standards \n10.0931  Biomass Energy Systems Scale \nA. \nSmall Biomass Energy System.  A small biomass energy system, such as a sawdust burning furnace or a \ncommercial size fuel cell system, has the following characteristics: \n1. \nIs internal to the primary use building; or \n2. \nContains one (1) to five (5) mechanical equipment units no larger than 4’ deep x 4’ wide x 6’ high \neach outside the building; and \n3. \nIs accessory to the primary use of the site; and \n4. \nIs used to generate energy for use primarily on the site and/or for selling back to the grid.  \nB. \nLarge Biomass Energy System.  A large biomass energy system, such as a commercial forest waste \nbiomass furnace, has the following characteristics: \n1. \nIs internal or external to the primary use building or buildings and exceeds the thresholds of a \nsmall biomass energy system; and/or \n2. \nHas outdoor biomass storage; and \n3. \nIs accessory to the primary use of the site; and \n4. \nIs used to generate energy for use primarily on the site and/or for selling back to the grid. \n10.0932  Biomass Energy Systems Type \nThere is one type of biomass energy system as follows: \nA. \nNon-Hazardous Biomass.  Non-hazardous biomass energy systems which generate energy from \ncontrolled combustion or some other conversion of plant materials such as wood, lawn, tree or garden \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[10.09]-7 \nCity of Gresham Development Code \n \n(06/22) \n \nresidue or agricultural crops, or waste or land fill gases are permitted. \n10.0933  Biomass Energy Systems Height \nHeight shall be measured from the base of the biomass energy system equipment to the system’s highest point. \n10.0934  Biomass Energy Systems Setbacks and Yards \nThe biomass energy systems shall be allowed as noted in Article 4 in the site’s underlying land use district. \n10.0940 Geothermal Energy Systems Standards \n10.0941  Geothermal Energy Systems Scale \nA. \nSmall Geothermal Energy System.  A small geothermal energy system such as a heat pump has the \nfollowing characteristics: \n1. \nIs internal to the primary use building except for up to three exterior mechanical heat exchange \nunits no larger than 4’ deep x 4’ wide x 6’ high; \n2. \nIs accessory to the primary use of the site; and \n3. \nIs used to generate energy, heat or cooling for use primarily on the site or for selling back to the \ngrid.  \nB. \nLarge Geothermal Energy System.  A large geothermal energy system such as an industrial geothermal \neco-district has the following characteristics: \n1. \nIs internal to the primary use building except for four to ten exterior mechanical heat exchange \nunits; \n2. \nIs accessory to the primary use of the site; and \n3. \nIs used to generate energy, heat or cooling for use primarily on the site or for selling back to the \ngrid. \n10.0942  Geothermal Energy Systems Type \nThere is one allowed type of geothermal energy system as follows: \nA. \nClosed-loop Geothermal.  Closed-loop geothermal energy systems which exchange heat and cooling \nthrough contained fluid systems are permitted. \n10.0943  Geothermal Energy Systems Height \nHeight shall be measured from the base of the geothermal energy system equipment to the system’s highest \npoint. \n10.0944  Geothermal Energy Systems Setbacks and Yards \nIn addition to the district setback standards, small scale geothermal energy systems such as heat pumps may \nproject 4.5 feet into the side and rear setbacks per Section 9.0900 Projections. \n \n10.0950 Micro-Hydro Energy Systems Standards \n10.0951  Micro-Hydro Energy Systems Scale \nA. \nSmall Micro-Hydro Energy System.  A small micro-hydro energy system such as a turbine contained \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[10.09]-8 \nCity of Gresham Development Code \n \n(06/22) \n \nwithin a water pipe has the following characteristics: \n1. \nIs contained entirely within a structure or pipe; \n2. \nIs accessory to the primary use of the site; and \n3. \nIs used to generate energy such as electricity for use primarily on the site.  \n10.0952  Micro-Hydro Energy Systems Type \nThere is one allowed type of micro-hydro energy system as follows: \nA. \nIn-Pipe Micro-Hydro.  In-pipe micro-hydro energy systems which generate energy through water fluid \nmovement within a pipe structure are permitted. \n10.0953  Micro-Hydro Energy Systems Height \nHeight shall be measured from the base of the micro-hydro energy system equipment to the system’s highest \npoint. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.839761",
  "extractor_version": "1.0.0"
}