{
  "metadata": {
    "filename": "dc-section-9.0100.pdf_id7864",
    "extracted_at": "2025-05-22T06:15:22.910291",
    "num_pages": 10,
    "title": "DC Section 9.0100",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.58",
    "creation_date": "D:20230105100928-08'00'",
    "modification_date": "D:20230105100947-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n \n[9.01]-1 \nCity of Gresham Development Code \n \n(01/23) \nARTICLE 9 \nCOMMON REQUIREMENTS \nSECTION 9.0100 \nBUFFERING AND SCREENING REQUIREMENTS \nGeneral \n9.0101  Responsibilities  \nBuffering and Screening Requirements \n9.0110  Buffering and Screening Requirements \n9.0111  Buffer Matrix \nGeneral \n9.0101  Responsibilities \nTo reduce the impacts on adjacent conforming uses that are of a different type, buffering and screening will be \nrequired. The property owner is responsible for the establishment and maintenance of buffering vegetation and \nscreening in accordance with the requirements of this section unless the abutting use has already provided \nbuffering in compliance with the standards in this Article. \nBuffering and Screening Requirements \n9.0110  Buffering and Screening Requirements   \nA. \nA buffer consists of a horizontal distance adjacent to the property line.  The following standards apply to \nmaterials in the buffer: \n1. \nThe following elements are allowed in the buffer: vertical elements such as plants, berms, \nfences or walls; screening; landscaping materials (including gardens); vegetated stormwater \nfacilities; and garden elements such as arbors, trellises, fountains, ponds, yard accessories and \nseating.  Seating must be at least 5 feet from the abutting property line. Underground, in-ground \nand overhead utilities are allowed in the buffer.  Above-ground installation of mechanical \nequipment such as for heating, ventilation, renewable energy systems and air conditioning is not \nallowed in the buffer width. \n2. \nUnless listed in Section 9.0110(A)(1), projections listed in Section 9.0901(A) shall not be \nallowed in the buffer. \n3. \nChildren’s play areas are not allowed in the buffer area. \nB. \nBuffer tree requirements can count toward yard and site tree requirements. They shall not count toward \nother requirements such as drive, parking lot and street tree requirements. \nC. \nFor purposes of this section, a vacant lot is a lot that is undeveloped or developed with a non-\nconforming use. The abutting use of a vacant lot shall be the primarily intended use of the district. \nWhere the adjacent property allows mixed uses, the buffer and screening shall be based on the most \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n \n[9.01]-2 \nCity of Gresham Development Code \n \n(01/23) \nintense conforming use. Least to more intensive uses are as shown in the sequencing in Table \n9.0111(A). \n1. \nWhen the proposed development occurs adjacent to a vacant lot one-half of the buffer and \nscreening shall be provided at the time of the proposed development. The one-half provided by \nthe proposed development shall at least include one-half of the required buffer width and one-half \nof required buffer shrubs and trees and groundcover. A required fence or wall shall be provided \nby the more intensive use at the time of its development. The balance of the buffer shall be \nprovided at the time the vacant lot is developed. \n2. \nIf the proposed development abuts a property in the LDR-5, LDR-7, TLDR or TR District, the \nentire buffer shall be provided by the proposed development. \n3. \nIf the proposed development is an LDR-5, LDR-7, TLDR or TR District dwelling and abuts \nvacant land that is primarily intended for a more intensive use, the entire buffer shall be provided \nby the more intensive use at the time of its development. \n4. \nWhen a proposed development occurs adjacent to an existing use that has not provided a buffer \nand screening in accordance to this section, the proposed use shall provide the buffer and \nscreening to the conforming use of the adjacent property. \nD. \nBuffers are required across streets only when: \n1. \nIndustrial uses are adjacent to single detached dwelling, duplex, triplex, quadplex, townhouse, or \ncottage cluster uses across streets that have a designated right of way in the Public Works \nStandards of less than 100 feet. Screening required as part of E or F landscape requirements (as \ndefined in Table 9.0111(B)) shall be incorporated. On portions of the site facing the street, the \nrequired landscaping shall be oriented toward the right of way. \n2. \nCommercial or Type B (see Section 9.0111(A)(2) ) uses greater than 10,000 square feet (either in \none building or an entire site, including both indoor and outdoor uses) adjacent to single detached \ndwelling, duplex, triplex, quadplex, townhouse, or cottage cluster uses that are across streets with \na designated right of way in the Public Works Standards of 60 feet or less. In this case, screening \nelements would not be required. \nE. \nRequired materials within the buffer, as provided in this Article shall consist of the following: \n1. \nTrees (see Article 3 for definitions): \na. \nShade trees capable of at least 25 feet in height and spread at maturity. These trees shall \nbe not less than 10 feet high and 2.5 inches caliper in size at the time of planting and \nshall be balled and burlapped or container stock. In buffer widths that are less than 15 \nfeet, shade trees shall be capable of reaching a height of at least 25 feet and at least 15 \nfeet of spread at maturity. \nb. \nEvergreen trees that are capable of at least 25 feet in height. These must be 8 feet in \nheight at the time of planting and balled and burlapped or container stock. \nc. \nAt least one tree shall be required to be planted within the area specified in the “Trees” \ncolumn in Table 9.0111(B). For example, if the standard requires 1 tree per 30 linear \nfeet, at least 1 tree shall be planted in each 30 linear feet.  They are not required to be \nplanted in a straight line. See Figure 9.0110(E). \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n \n[9.01]-3 \nCity of Gresham Development Code \n \n(01/23) \nFigure 9.0110(E) Tree Placement in Buffer \n \n2. \nEvergreen and deciduous shrubs: With the exception of dwarf shrubs such as boxwood, shrubs \nshall be a minimum of 24 inches high from finished grade and a minimum of 1 gallon size at \nplanting. Shrub selection shall consider which plants will thrive under selected trees and in shade \nor sun conditions. The shrubs should be planted to obscure the lower portion of any required fence \nor wall. Hedges required for screening must be a minimum of 6 feet tall at the time of planting. \n3. \nGround cover:  shall be well rooted in either flats or a minimum of 1 gallon pots. Ground cover \nselection shall consider which plants will thrive under selected trees and in shade or sun \nconditions. Ground cover shall cover the balance of the buffer area. \n4. \nFences:  shall be sight-obscuring so as to provide complete visual separation from the adjacent \nproperty. Fences shall be located on or adjacent to the property line unless otherwise indicated in \nthis Article. They also may be proposed for other locations through the alternative buffer plan \nprocess. \n5. \nWalls:  shall be a sight-obscuring fence constructed of brick, stone or concrete.  Walls shall be \nlocated on or adjacent to the property line unless otherwise indicated in this Article. They also \nmay be proposed for other locations through the alternative buffer plan process. \n6. \nBerms:  shall provide a natural appearance through undulating changes in berm height. Berms \nshall not have a slope greater than 33 percent (1 foot in vertical height for every 3 feet in \nhorizontal distance), except that one side of a berm can be supported by a retaining wall. They \nshall be landscaped with the required evergreen shrubs and trees from the buffer matrix or \nadditional shrubs and trees. Alternative berm designs can be considered as part of an alternative \nbuffer plan. \nF. \nMaintenance:  Compliance with the following criteria is required: \n1. \nInspections.  A City representative will perform a final landscape inspection to ensure that the \nlandscape demonstrates equivalent compliance with the approved landscape plan upon completion \nof the project and before issuance of a Temporary or Final Certificate of Occupancy following a \nrequest from the developer. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n \n[9.01]-4 \nCity of Gresham Development Code \n \n(01/23) \n \nThe inspection time period is from March 1 to November 15. If an inspection is requested \nbetween November 16 and the last day of February and the landscaping is not complete, or if the \napplicant requests a Temporary Certificate of Occupancy to occupy one or more buildings on site \nprior to the landscaping being completed, a financial guarantee is to be provided based on one \nhundred and ten percent (110%) of the estimated cost of plant materials and buffer elements (such \nas walls and fences) and labor for the total landscape plan as indicated in a landscape cost \nestimate. Beginning March 1, the applicant has 180 days to complete the items or the City will \ncash in the amount being held and finish the landscape job. \n2. \nEstablishment period. The establishment period for the plant material guarantee will begin at the \nFinal Certificate of Occupancy inspection approval to 2 years from that date.  All plantings shall \nbe properly planted as to be in a healthy, growing condition at commencement of the \nestablishment period. At the end of the establishment period, any plantings that are 20 percent \n(20%) dead or greater shall be replaced. \n3. \nMaintenance of required planting by the owner shall be carried out so as to present a healthy, neat \nand tidy appearance, free from refuse and debris. \n4. \nTo ensure proper maintenance and as a condition of Final Site Plan approval, the property owner \nshall enter into and record with the City a Landscape Maintenance Agreement, or include such \nprovisions as part of the condominium master deed, each of which shall be approved by the City \nAttorney.  Such instrument shall identify the minimum plan of maintenance, the person or entity \nresponsible for maintenance, and shall provide the procedure, authority and finance for City cure \nof breaches by the responsible entity. Such instrument shall also include: provisions that all \nunhealthy and dead material shall be replaced within 1 year, or the next appropriate planting \nperiod, whichever occurs first; all landscaped areas shall be provided with an operable irrigation \nsystem; tree stakes, guy wires and tree wrap are to be removed after 1 winter season; and \nplantings shall be guaranteed for 2 years after the Final Certificate of Occupancy inspection \napproval. \n5. \nResponsibility and Certificates of Occupancy.  The owner of the property subject to the \nrequirements of this Section shall be responsible for installing and maintaining landscaping per \nthe approved final landscape plan as specified in this Section. Where a person other than the \nowner occupies the property, the occupant shall also be responsible for maintenance. \nG. \nWhen the following situations exist, the buffering and screening may be reduced or eliminated, or \nalternative means of providing the desired screening may be instituted. \n1. \nExisting buffering and screening:  If the subject parcel or abutting use has provided buffering and \nscreening in compliance with this section, the buffering and screening elements already provided \n(such as trees, fences or walls in good condition, and plant material) may count toward required \nbuffering and screening requirements. For existing trees:   \na. \nExisting healthy trees of at least 2.5 inches in diameter breast height that meet the \nstandards of Section 9.0110(E)(1) for eventual height and crown at maturity may count \ntoward the trees required in Table 9.0110(B).  They shall be protected during \nconstruction following the standards in Section 9.1031.  Existing trees to be counted \ntoward this requirement must be confirmed by a Certified Arborist to be healthy trees. \nb. \nIf an existing tree or trees counts toward required buffer trees, the tree or trees satisfies \nbuffer tree requirements for the dimension specified in Table 9.0111(B) or the entire \nlength of its crown cover along the property line, whichever is larger.  To determine \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n \n[9.01]-5 \nCity of Gresham Development Code \n \n(01/23) \nbuffer tree requirements along the entire property line, applicants may subtract the \nlinear feet along the property line covered by the existing tree(s) and then determine \nhow many trees are required for the remaining linear feet, as shown in Figure \n9.0110(G). \nc. \nIf an existing tree that counts toward required trees is subsequently removed, it shall be \nreplaced according to the standards in Table 9.0111(B). \nFigure 9.0110(G) Existing Trees in Buffer \n \n2. \nAlternative plan:  In lieu of these buffer width, landscape and screening standards, and at his/her \noption, the owner may prepare a detailed plan and specifications for landscaping and screening, \nincluding plantings, fences, walls, walks, berms and other features designed to afford the degree \nof desired buffering and screening. Such plans and specifications shall be submitted to the \nManager for review.  The alternative plan shall comply with the following standards: \na. \nFor all uses except single detached dwellings and middle housing, the alternative buffer \nplan must be prepared and stamped by a licensed Landscape Architect. Landscape plans \nfor stormwater facilities may be designed by either a licensed Landscape Architect or a \nlicensed Civil Engineer; and \nb. \nIf the alternative plan contains a buffer width narrower than required in Table \n9.0111(B), the applicant must demonstrate that the buffer width requirements cannot be \nmet because the applicant desires to protect important natural features (such as a \nsignificant or major tree, wetlands, habitat) or because of constrained lot, site or \nphysical conditions; and \nc. \nThe alternative buffer shall meet the intent of the buffer width, landscaping and \nscreening standards. This includes the proper type, spacing, height, placement and \nlocation of required material, including plants, fences and walls.  Related to noise, the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n \n[9.01]-6 \nCity of Gresham Development Code \n \n(01/23) \napplicant shall demonstrate that the materials used will have similar noise absorption or \nreflection properties, such as by providing Noise Reduction Coefficient ratings or \nSound Transmission Class data for barrier materials; and \nd. \nIf the buffer width is proposed to be reduced, the number, selection and placement of \nrequired materials (such as plants, fences or walls) shall be enhanced to compensate for \nthe reduction in separation to assist in achieving the buffer width, landscape and \nscreening standard’s intent. \n3.  \nThe conversion of hotel or motel to an emergency shelter or to affordable housing under Section \n10.0420 does not require buffering and screening.  \nH. \nDevelopment of new residential structures on flag lots shall provide a landscaped area around the \nperimeter of the flag portion of the flag lot. The flagpole and lot lines that are internal to the original \nland division that created the flag lot, or adjacent to an alley, are exempt from this requirement (see \nFigure 9.0110(H)). \n1. \nThe landscaped area shall be at least 5 feet wide and include a 6-foot evergreen continuous, hedge \nor a 6-foot fence/wall along the property lines. The landscaped area can overlap with driveway \nplanting strips required in Section 4.0136. \n2. \nFor lots where the flag portion is greater than 20,000 square feet, the applicant may request to be \napproved at the Manager’s discretion a reduction in the screening (hedge or fence) requirement to \nlimit the fencing to areas where it will address privacy between residential developments near lot \nlines. \nFigure 9.0110(H) Buffers Required on Flag Lots \n \n9.0111  Buffer Matrix   \nA. \nBuffer Matrix (Table 9.0111A and B) Notes: \n1. \nType A uses are those noise sensitive uses typically subject to a Special Use Review and include: \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n \n[9.01]-7 \nCity of Gresham Development Code \n \n(01/23) \nElderly Housing, Daycare Facilities, public library, Medical uses, public urban plazas, public \nneighborhood parks, public community parks, public trails and paths, Religious Institutions and \nSchools. \n2. \nType B uses are those uses typically subject to a Special Use Review and are not included as a \nType A use. This includes: Commercial Parking, Major Event Entertainment, all Civic Uses \nexcept for libraries, Community Services, golf courses, Basic Utilities, and Heliport Facilities. \n3. \nManufactured dwelling park buffer and screening standards are found in Section 7.0410 of the \nCommunity Development Code. \n4. \nAlternative buffer and screening standards for public trails and paths are found in Section 8.0117. \nB. \nBuffer Width. Landscape and Screening Requirements (Table 9.0111(B)) Notes: \n1. \nOn lots where the height transition standard of Section 9.0600 applies and an application will \nresult in structures within 35 feet of the property line that exceed 22 feet in height, the following \nstandards apply: \na. \nIf the Buffer Width, Landscape and Screening Requirements provide more than one \noption, only Option 1 shall be used. \nb. \nAlternative buffer plans that reduce buffer width shall not be permitted. \nTable 9.0111(A) – Buffer Matrix \nABUTTING USE \n \nSingle Detached \nDwellings and \nMiddle Housing \nMultifamily \nType A \nUses \nCommercial \nType B \nUses \nOutdoor \nCommercial \nAuto-Dependent \nCommercial \nIndustrial \nSpringwater \nIndustrial \nPROPOSED \nUSE \n \n \n \n \n \n \n \n \n \nSingle \nDetached \nDwellings and \nMiddle \nHousing \n- \nA \nA \nA \nA \nA \nA \nA \nA \nMultifamily \nC \nB \nA \nC \nC \nD \nD \nE \n- \nType A Uses \nC \nA \nB \nC \nC \nD \nD \nE \n- \nCommercial  \nC \nC \nC \n- \n- \n- \n- \n- \n- \nType B Uses \nC \nC \nC \n- \n- \n- \n- \n- \n- \nOutdoor \nCommercial  \nD \nD \nD \n- \n- \n- \n- \n- \n- \nAuto-\nDependent \nCommercial \nD \nD \nD \n- \n- \n- \n- \n- \n- \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n \n[9.01]-8 \nCity of Gresham Development Code \n \n(01/23) \nIndustrial  \nE \nE \nE \n- \n- \n- \n- \n- \n- \nSpringwater \nIndustrial \nF \nF \n- \n- \n- \n- \n- \n- \n- \nTable 9.0111(B)–Buffer Width, Landscape and Screening Requirements \n(See Figure 9.0111 for buffer illustrations) \nLandscaping \nStandard \nIntent \nOptions \nMinimum \nBuffer \nWidth \nTrees \nShrubs \nScreening \n(continuous and site \nobscuring) \nA \ngeneral \nlandscaping, \nsmallest buffer \nwidth \nThe A standard is applicable where \ndistance is the primary means of buffering. \nGround cover is required. Trees and \nshrubs are encouraged on a voluntary \nbasis. \nN/A \n10 feet \nnone  \nNone \nNone \n \nB \nhigh screen, \nmoderate buffer \nwidth \n \nThe B standard is a landscape treatment \nthat provides physical separation and uses \nscreening to ensure visual separation \nbetween uses or development. Physical \nand visual separation is required. \nOption 1 \n15 feet \n1 per 30 \nlinear feet \n40 shrubs \nper 100 \nlinear foot of \nlandscaped \narea \nHigh shrubs to form \na continuous screen \na minimum of 6 feet \nhigh. (Shrubs must \nbe evergreen); or  \nA minimum 6-foot \nfence or wall \nOption 2 \n10 feet \n1 per 15 \nlinear feet \n40 shrubs \nper 100 \nlinear feet of \nlandscaped \narea  \nA minimum 8-foot \nfence or masonry \nwall \nC \nhigh screen, large \nbuffer width \nThe C standard is a landscape treatment \nthat provides more physical separation \nthan in the B landscape standard and uses \nenhanced screening to visual separation. \nReduced noise transmission is desired at \nthe ground-floor level. \nOption 1 \n20 feet \n1 per 25 \nlinear feet \n50 shrubs \nper 100 \nlinear feet of \nlandscaped \narea \nMultifamily: a \nminimum 6-foot \nfence \nOther uses: A \nminimum 6-foot \nmasonry wall  \nOption 2 \n15 feet \n1 per 15 \nlinear feet  \n50 shrubs \nper 100 \nlinear feet of \nlandscaped \narea \nMultifamily: a \nminimum 6-foot \nmasonry wall \nOther uses: a \nminimum 8-foot \nmasonry wall  \nD \nhigh wall, large \nbuffer width \n \nThe D standard is a landscape treatment \nthat provides more physical separation \nthan in the B landscape standard. Physical \nseparation is important because the uses \ninvolved have more outdoor and noise-\nproducing elements.  The D standard also \nhas enhanced screening. Reduced noise \ntransmission is desired at the ground-floor \nlevel and is even more important than in \nthe C standard because of the potential for \nnoise-producing activities.  \nN/A \n20 feet \n1 per 25 \nlinear feet \n50 shrubs \nper 100 \nlinear feet of \nlandscaped \narea \n \nA minimum 8-foot \nmasonry wall  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n \n[9.01]-9 \nCity of Gresham Development Code \n \n(01/23) \nLandscaping \nStandard \nIntent \nOptions \nMinimum \nBuffer \nWidth \nTrees \nShrubs \nScreening \n(continuous and site \nobscuring) \nE \nhigh wall and \nlarger buffer \nwidth \n \nThe E standard is a landscape treatment \nthat provides enhanced physical separation \nin addition to that provided by the C and D \nstandards because of the potential effects \nof industrial uses.  The E standard requires \nextensive visual screening and reduction of \nnoise transmission at the ground level is \nrequired.  \nN/A \n30 feet \n1 per 15 \nlinear feet \n60 shrubs \nper 100 \nlinear feet of \nlandscaped \narea \nA minimum 8-foot \nmasonry wall \nF \nhigh berm and \nmaximum buffer \nwidth \nThe F standard is intended to be used in \nspecial instances where the largest \nphysical separation is needed and the most \nextensive screening of both visual impacts \nand reduction of noise transmission is \nneeded to protect abutting sensitive uses.   \nN/A \n40 feet \n1 per 15 \nlinear feet \n(trees may \nbe placed \non berm) \n90 shrubs \nper 100 \nlinear feet of \nlandscaped \narea \n(shrubs may \nbe placed on \nberm) \nA minimum 6-foot \nberm  \nFor berms less than \n8 feet, shrubs, trees \nor a combination of \nthe two landscape \nelements must be \nplanted at or near \nthe top to ensure \nthe overall 8-foot \nscreen height \n \nFigure 9.0111Buffer Width, Landscape and Screening illustrations \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": "",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.911405",
  "extractor_version": "1.0.0"
}