{
  "metadata": {
    "filename": "dc-section-10.1000.pdf_id7881",
    "extracted_at": "2025-05-22T06:15:25.436225",
    "num_pages": 4,
    "title": "DC Section 10.1000",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615195805-07'00'",
    "modification_date": "D:20220615195833-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.10]-1 \nCity of Gresham Development Code \n \n(07/15) \n \nSECTION 10.1000 \nPRIVATE COMMUNICATION FACILITIES \nSatellite Receive-Only Antenna \n10.1001  Satellite Receive-Only Antenna General Provisions  \n10.1002  Satellite Receive-Only Antenna Development Requirements   \nAmateur Radio and Citizen Band Antenna \n10.1010  Amateur Radio and Citizen Band Antenna General Provisions   \n10.1011  Amateur Radio and Citizen Band Antennas Development Requirements   \nSatellite Receive-Only Antenna \n10.1001  Satellite Receive-Only Antenna General Provisions   \nA satellite receive-only antenna that has a diameter of 4 feet or more and is to be located in a residential district \nshall be permitted under the Type I procedure when found to be consistent with the siting and screening \nrequirements of the Community Development Code Section 10.1002(A) through (C).  The Type II procedure \nshall apply when the applicant requests consideration under Section 10.1002(D), which is an exception to the \nrear yard location and height provision requirements. \n10.1002  Satellite Receive-Only Antenna Development Requirements   \nA satellite receive-only antenna in a residential district may be erected on a parcel if it meets the following \nrequirements: \nA. \nExcept as provided by subsection (D), the antenna shall be located in the rear yard area but not closer \nthan 6 feet to a side or rear lot line; \nB. \nThe lower rim of the dish shall not be more than 4 feet above grade; and \nC. \nThe antenna is screened on all sides except for the face of the dish and the horizontal area needed to \ndirect the dish to the various satellites. The application of the screening shall apply to all dishes which \nare exposed to dwellings on adjacent lots within 100 feet. The screening shall consist of landscaping \nmaterials which will grow to obstruct view of the dish within five years of planting. A fence can be \nsubstituted for landscaping. \nD. \nExceptions to a rear yard location and height provision:  If a rear yard location or the height provision \nwould prevent reception of a satellite signal, the dish shall be located in the least visually impacting \nlocation on the property. The determination of the least visually impacting location will be based on a \ncase-by-case basis but generally is, in order of desirability: \n1. \nA side yard location; \n2. \nA front yard location; or \n3. \nOn the structure (in which case, the screening requirements will not apply).  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.10]-2 \nCity of Gresham Development Code \n \n(07/15) \n \nAmateur Radio and Citizen Band Antennas \n10.1010  Amateur Radio and Citizen Band Antenna General Provisions   \nAmateur radio and citizen band antenna support structures and amateur radio and citizen band antennas, which \nthemselves are deemed structures under the Building Code, that are located in a residential district, shall require \na development permit.  All other amateur radio and citizen band antennas that are located in residential districts \nshall not require a development permit but shall conform to the applicable provisions of the Community \nDevelopment Code. \n \nWhen a development permit is required, the application shall be processed under the Type I procedure with the \nexception of parcels in the GBSV District which are subject to the Type II procedure.  The application shall be \nfound to be consistent with the requirements of the Community Development Standards Document Section \n10.1011(A-J).  The Type II procedures shall also apply when the applicant requests consideration under Section \n10.1011(K), which is an exception to the yard setback, locational and height provision requirements. \n10.1011  Amateur Radio and Citizen Band Antenna Development Requirements  \nAmateur radio or citizen band antennas and their support structures erected in a residential district shall meet the \nfollowing requirements: \nA. \nThe amateur radio or citizen band antenna shall not be located closer than 6 feet from a dwelling other \nthan the dwelling on the same lot. \nB. \nThe maximum height of an antenna and support structure shall be 100 feet except in the GBSV District, \nwhere the maximum height of the antenna and support structure shall not exceed 35 feet. The height of a \ncrank-up tower shall be measured when fully extended. \nC. \nAntenna support structures shall be located outside of required rear and side yard setbacks and behind \nthe front building line of the dwelling or other primary structure on the site. \nD. \nTower-type vertical antennas and antenna support structures, extending more than 35 feet in height from \nmounting point shall be set back from all property lines at least a distance equal to 30 percent of their \nheight. For purposes of this subsection, the height of an antenna support structure shall include the linear \nvertical distance to the highest point of any mast and/or antenna mounted on the structure, or the highest \npoint of the support structure, whichever is greater. The setback distance shall be calculated from all \nproperty lines to the closest point of the vertical aspect of the affected antenna or support structure. \nHorizontal space occupied by an antenna shall not be included in the setback calculation. The wire \nportions of inverted-vee, dipole, sloper and similar-type antennas shall be exempt from this subsection. \nE. \nGuy wires and anchors shall be located outside of required front and street side yard setbacks. \nF. \nNo part of an antenna or its support structure including parts that can be rotated, shall extend over any \nadjacent lot. \nG. \nThe applicant shall submit a statement describing the nature and extent of any interference which may \nbe associated with the radio frequency (RF) facility and describing the applicant's responsibilities under \nfederal regulations. \nH. \nThe following color standards apply to ground-mounted amateur radio or citizen band antenna support \nstructures greater than 55 feet and up to 200 feet in height: \n1. \nMetal structures shall have a galvanized finish, or be flat or matte silver, or flat or matte gray in \ncolor. \n2. \nWooden pole antenna support structures shall be of a natural wood color or a paint or stain \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[10.10]-3 \nCity of Gresham Development Code \n \n(07/15) \n \napproximating a natural wood color. \nI. \nGround-mounted amateur radio or citizen band antenna support structures more than 200 feet in height \nshall comply with locational, painting and lighting regulations of the Oregon Department of \nTransportation Aeronautics Section, Federal Aviation Administration, and Federal Communications \nCommission. \nJ. \nIf the antenna is mounted on a dwelling or other building without an antenna support structure, then the \nantenna shall be at least 20 feet from all property lines This subsection does not apply to: the wire \nportions of inverted-vee, dipole, sloper and similar-type antennas; antennas with a wind-loading surface \narea of 3 square feet or less; wire antennas less than 3 feet above the height of the structure on which \nmounted; or \"whip\" type antennas. No antenna mounted on a dwelling or other building without an \nantenna support structure shall exceed a height of 40 feet above the top of the structure. \nK. \nExceptions to a yard setback, locational or height provisions are allowed if the yard setback, locational \nor the height provision would prevent effective amateur communications or the generation, detection or \nprocessing of radio frequency energy. The antenna and/or support structure may be excepted from the \nyard setback, locational or height provisions provided that: \n1. \nThe applicant provides documentation that the exception is needed for the operation of the \namateur radio or citizen band facility, and \n2. \nThe applicant provides documentation that the request is the minimum necessary exception from \nthe yard setback, locational or height provisions of this section, and \n3. \nIf the exception would result in any part of an antenna or support structure, including parts that \ncan be rotated, extending over any adjacent property, then the applicant shall provide a copy of an \neasement from the owner of the affected property authorizing such extension. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.436557",
  "extractor_version": "1.0.0"
}