{
  "metadata": {
    "filename": "dc-section-11.0800.pdf_id7894",
    "extracted_at": "2025-05-22T06:15:23.859904",
    "num_pages": 4,
    "title": "DC Section 11.0800",
    "author": "Katie",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615201607-07'00'",
    "modification_date": "D:20220615201624-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[11.08]-1 \nCity of Gresham Development Code \n \n(11/20) \nSECTION 11.0800 \nNEIGHBORHOOD MEETING  \n11.0800  Neighborhood Meeting  \n11.0801  Purpose \n11.0802  Applicability  \n11.0803  Procedures and Evidence of Compliance \n \n11.0800 \nNeighborhood Meeting  \n11.0801  Purpose \nThe purpose of the neighborhood meeting is to provide an opportunity for the applicant, surrounding neighbors, \ninterested parties, and representatives from a recognized neighborhood association to meet and to review a \ndevelopment proposal and identify any associated issues.  The neighborhood meeting is intended to assist the \napplicant with preparing an application that considers neighborhood interests and is consistent with the \nrequirements of the Development Code to reduce the likelihood of delays and appeals.  The city expects the \nneighbors and neighborhood association will work with the applicant to provide reasonable concerns and \nrecommendations. The city expects that the applicant will attempt to accommodate the reasonable concerns of \nthe neighbors and recognized neighborhood association.  \n11.0802  Applicability  \nA neighborhood meeting is required for all applications that require a pre-application conference as indicated in \nTable 11.0204, unless otherwise noted.  Industrial use reviews as described in Section 7.0003 and DR-C \napplications requiring a pre-application conference as described in Section 7.0003 do not require a \nNeighborhood Meeting. \n11.0803  Procedures and Evidence of Compliance  \nThe applicant shall comply with the following neighborhood meeting procedures.  \nA. \nScheduling of Meeting \n1. \nThe neighborhood meeting shall be held after the pre-application conference and before a land \nuse application is submitted to the City.   \n2. \nThe applicant is required to hold one neighborhood meeting prior to submitting an application for \na specific site.  Additional meetings may be held at the applicant’s discretion. \n3. \nApplications shall be submitted to the City within 180 calendar days of the neighborhood \nmeeting.  If an application is not submitted in this time frame, the applicant shall be required to \nhold a new neighborhood meeting. \n4. \nIf the development proposal is modified to an extent that it requires a new or follow-up pre-\napplication conference with City staff, a second neighborhood meeting is required.  \n5. \nThe date, time and location of the neighborhood meeting shall be coordinated with the \nrecognized neighborhood association in which the proposal is located.  \na. \nThe applicant shall contact the President and Land Use Chair of the neighborhood \nassociation via email to coordinate the early neighborhood meeting.  The contact \ninformation for the neighborhood association shall be obtained from the City. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[11.08]-2 \nCity of Gresham Development Code \n \n(11/20) \nb. \nThe neighborhood association designees must respond within 5 business days of the \nrequest. \nc. \nIf the neighborhood association designees fail to respond in the time allotted, the \napplicant may select the date, time and location of the meeting. \nd. \nThe neighborhood association designees and the applicant must agree upon a date, time \nand location within 10 business days.  If no agreement can be reached, the Manager \nshall decide on the date, time and location within three business days after discussions \nwith the applicant and neighborhood association President and Land Use Chair.  \nB. \nMeeting Location and Time.  Neighborhood meetings shall be held at a location in reasonable proximity \nto the subject site.  The meeting shall be held at a location open to the public that is ADA accessible. \nThe neighborhood meeting may be combined with a regularly scheduled meeting of the recognized \nneighborhood association in which the project is located, if feasible.  An 8 ½ x 11” sign shall be posted \nat the entry of the building before the meeting.  The sign will announce the meeting, state that the \nmeeting is open to the public and that interested persons are invited to attend.  The starting time for the \nmeeting shall be limited to weekday evenings between the hours of 6 pm and 8 pm or Saturdays \nbetween the hours of 10 am and 4 pm.  Neighborhood meetings shall not be held on national holidays. If \nno one arrives within 30 minutes of the scheduled starting time for the neighborhood meeting, the \napplicant may leave.   \nC. \nMailed Notice.  The applicant shall mail notice of the neighborhood meeting to owners of properties \nwithin 300 feet of the perimeter of the subject property, the President and Land Use Chair of any \nrecognized neighborhood associations whose boundaries are within 300 feet of the subject property and \nthe Manager.  The notice mailed to the President and Land Use Chair of the recognized neighborhood \nassociations within 300 feet of the subject property shall be by certified mail.  \n \nIn the GBSV District, the applicant shall mail notice of the neighborhood meeting to owners of \nproperties within 500 feet of the perimeter of the subject property, and the Presidents and Land Use \nChairs of all recognized neighborhood associations. The notice mailed to the Presidents and Land Use \nChairs shall be by certified mail. \n1. \nNotice shall be mailed at least 14 and not more than 20 calendar days prior to the scheduled \nneighborhood meeting. \n2. \nAn official list for the mailed notice may be obtained from the City of Gresham for the applicable \nfee and within 10 business days.  A mailing list may also be obtained from other sources such as \na title company, provided that the list shall be based on the most recent tax assessment rolls of the \nMultnomah County Department of Taxation and Assessment.  A mailing list is valid for use up to \n45 days from the date the mailing list was generated.   \n3. \nThe mailed notice shall: \na. \nState the date, time and location of the neighborhood meeting and invite people for a \nconversation on the proposal. \nb. \nBriefly describe the nature of the proposal (i.e., approximate number of lots or units, \nhousing types, approximate building dimensions and heights, and proposed \ndevelopment action). The description shall take into consideration information provided \nby city staff at the pre-application conference.  \nc. \nInclude the website for viewing pre-application meeting notes, and the pre-application \nconference number.  \nd. \nInclude the name of the neighborhood association in which the subject property is \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[11.08]-3 \nCity of Gresham Development Code \n \n(11/20) \nlocated.  \ne. \nInclude a copy of the tax map or a GIS map that clearly identifies the location of the \nproposed development and a conceptual site plan. The conceptual site plan shall take \ninto consideration information provided by city staff at the pre-application conference.  \n4. \nA signed and notarized affidavit of the mailed notice is required to demonstrate compliance with \nthis section.   \n5. \nFailure of a property owner to receive mailed notice shall not invalidate the neighborhood \nmeeting proceedings.  \nD. \nPosted Notice.  The applicant shall also provide notice of the meeting by posting a waterproof sign on \nthe frontage of the subject property at least 14 and not more than 20 calendar days prior to the meeting.  \nThe sign and posting requirements will be provided by the City at the pre-application conference but it \nis the applicant’s responsibility to post the sign within 30 feet of the adjacent right-of-way, viewable \nfrom the right-of-way, make sure the sign remains posted until the meeting and remove it following the \nmeeting. A signed and notarized affidavit of the posting is required to demonstrate compliance with this \nsection. If the posted sign is inadvertently removed (i.e., by weather, vandals, etc.), that shall not \ninvalidate the neighborhood meeting proceedings.  \nE. \nAgenda for Meeting.  At the neighborhood meeting, the applicant shall provide a conceptual site plan \nand describe the major elements of the proposal.  Depending on the type and scale of the particular \napplication, the applicant should be prepared to discuss proposed land uses and densities; proposed \nbuilding size and height; proposed access and parking; and proposed landscaping, buffering and/or \nprotection of natural resources.  Attendees will have an opportunity to speak at the meeting and may \nidentify any issues that they believe should be addressed. \nF. \nMeeting Notes.  The applicant shall take notes of the discussion at the neighborhood meeting, including \na summary of issues raised. Notes will indicate the names and contact information of those attending the \nmeeting. Within seven (7) calendar days of the neighborhood meeting and before submitting an \napplication to the City, the applicant shall send a copy of the meeting notes by certified mail to the \nPresident and Land Use Chair of the recognized neighborhood association in which the project is to be \nlocated. The neighborhood association may also prepare and submit notes of the neighborhood meeting. \nThe purpose of the notes is to demonstrate that the meeting occurred.  \nG. \nEvidence of Compliance.  To comply with the neighborhood meeting requirements, the following \nevidence shall be submitted with the application: \n1. \nA copy of the information mailed to surrounding property owners and the recognized \nneighborhood association(s);  \n2. \nA copy of the mailing list used to send out meeting notices; \n3. \nA certified mail receipt indicating mailing of the meeting notice to the President and Land Use \nChair of the recognized neighborhood association(s) within 300 feet of the subject property;  \n4. \nAffidavits for the mailed and posted notices;   \n5. \nOne copy of the written materials and 8 ½ x 11” plans presented by the applicant at the \nneighborhood meeting;   \n6. \nNotes of the meeting, including the meeting date, time and location, the names and addresses of \nthose attending, and a summary of oral and written comments received; and  \n7. \nA certified mail receipt indicating mailing of the meeting notes to the President and Land Use \nChair of the neighborhood association(s). \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[11.08]-4 \nCity of Gresham Development Code \n \n(11/20) \n8. \nAt the discretion of the Neighborhood Association in which the proposed development is located, \nsubmittal items (G)(3) and (G)(7) (certified mailing receipts) may be substituted with email \ndocumentation from the Neighborhood Association that sufficient notice was provided to the \nNeighborhood Association. \nAn application will not be accepted as complete for processing unless all of the evidence of compliance listed \nin subsection G (1)-(7) has been submitted with the application. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.860258",
  "extractor_version": "1.0.0"
}