{
  "metadata": {
    "filename": "dc-section-9.0300.pdf_id7866",
    "extracted_at": "2025-05-22T06:15:22.640197",
    "num_pages": 2,
    "title": "DC Section 9.0300",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615194333-07'00'",
    "modification_date": "D:20220615194349-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n \n[9.03]-1 \nCity of Gresham Development Code \n \n(01/19) \nSECTION 9.0300 \nEASEMENTS \nGeneral \n9.0301  General Utility Easements  \n \n9.0303  Conservation Easement   \n9.0304  Open Space Easements  \n9.0305  Utility Easements Owned by the Public \n \n9.0307  Private Easements  \n9.0308  Public Access Easement  \nGeneral \n9.0301  General Utility Easements  \nIn the LDR-5, LDR-7, TLDR, TR, LDR-PV, VLDR-SW, LDR-SW and THR-SW Districts, an 8-foot wide \ngeneral utility easement shall be provided along all lot lines abutting public rights-of-way and along the rear lot \nline when abutting an alley. Design, dimensioning, and use of general utility easements shall be in accordance \nwith Public Works Standards.  All easement documents and plat language relating to general utility easements \nshall be substantially in the form provided by the City and furnished to the City for review and approval prior to \nrecording.  All applicable recording fees shall be the responsibility of the developer and the City shall record the \neasements. A general utility easement may be used for City easements and by utilities with franchise or utility \nlicenses. \n9.0303  Conservation Easement   \nThe Manager may require a perpetual unobstructed easement so that the natural vegetative cover is not disturbed \nwhere such disturbance could cause damage to the public right-of-way or adjacent property. \n9.0304  Open Space Easements   \nThe approval authority may require a perpetual open space easement over areas of the Floodplain or Hillside \nPhysical Constraint Overlay Districts, areas of unique natural condition, or Greenway System retained in private \nownership. \n9.0305  Utility Easements Owned by the Public \nWhen topography or other conditions make impractical the location of drainage facilities, sanitary sewers or \nwater lines within the street right-of-way, an unobstructed easement shall be provided across the property with \nsatisfactory access to the street. These easements shall comply with Section A5.005. \n9.0307  Private Easements   \nWhen a Land Division or Lot Line Adjustment creates a property line configuration whereby an existing or \nfuture access or utility will encroach on a lot other than the one it serves, an easement shall be granted over the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n \n[9.03]-2 \nCity of Gresham Development Code \n \n(01/19) \naccess or utility as a condition of approval of the development permit.  If the subject lots are under the same \nownership, an agreement shall be executed, as a condition of approval of the development permit, requiring \ncreation of an easement upon the sale of any of the lots. \n9.0308  Public Access Easement   \nThe approval authority may require a public access easement for sidewalks, paths and trails which are required \nfor access and connectivity. Improvements within the easement shall be consistent with the Public Works \nStandards. All applicable recording fees shall be the responsibility of the developer and the City shall record the \neasements. \n \n \n \n \n \n \n \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.640454",
  "extractor_version": "1.0.0"
}