{
  "metadata": {
    "filename": "dc-section-6.0200.pdf_id7852",
    "extracted_at": "2025-05-22T06:15:25.265161",
    "num_pages": 2,
    "title": "DC Section 6.0200",
    "author": "Sarale Hickson",
    "creator": "Acrobat PDFMaker 23 for Word",
    "producer": "Adobe PDF Library 23.1.175",
    "creation_date": "D:20230419100940-07'00'",
    "modification_date": "D:20230419101018-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "Section 6.0200 Partitions and Subdivisions (4/2023) \nPage 6.02-1 \nSection 6.0200 Partitions and Subdivisions \nTABLE OF CONTENTS \nGeneral \n6.0201 Tentative Partition or Subdivision Plan  \nTentative Land Division Approval Criteria \n6.0210 Criteria for Approval of Tentative Plan \n6.0211 Phased Subdivision \n6.0212 Duration of Exemption from Subsequently Adopted Land Use Ordinance \n6.0213 Review of Lots not Lawfully Created \n6.0214 Expiration of Partitions and Subdivisions \nGENERAL \n6.0201 TENTATIVE PARTITION OR SUBDIVISION PLAN   \nAn application for a tentative partition or subdivision plan shall be processed under the Type II procedure \nexcept a plan submitted as a Planned Development, which, pursuant to Section 6.0300 of the Community \nDevelopment Code, shall be processed under the Type III procedures. \nTENTATIVE LAND DIVISION APPROVAL CRITERIA \n6.0210 CRITERIA FOR APPROVAL OF TENTATIVE PLAN \nIn approving a tentative land division plan, the approving authority shall find compliance with the relevant \nportions of the Community Development Code and the following: \nA. Development of any remainder of property under the same ownership can be accomplished in accordance \nwith this code. \nB. Adjoining land can be developed or is provided access that will allow its development in accordance with \nthis code. \n6.0211 PHASED SUBDIVISION  \nThe approval authority may authorize a time schedule for platting a subdivision in phases.  Each phase may be \nfor a period of time in excess of one year but the total time period for all phases shall not be greater than five \nyears without resubmission of the tentative plan.  Each phase so platted and developed shall conform to the \napplicable requirements of this code.   \nIf a phased development or subdivision is proposed for a development that includes townhouses, the first \nphase shall conform to density requirements without consideration of subsequent phases. Later phases shall \nconform to density requirements in a cumulative fashion, taking into account previous phases and while \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0200 Partitions and Subdivisions (4/2023) \nPage 6.02-2 \ncontinuing to meet density standards at each phase. This is calculated by adding the number of lots for the \ncurrent phase and all previous phases and dividing by the acreage of the current phase (taking into account \nsubtractions in the “Net Density” definition) and all previous phases. The result shall meet the applicable \ndensity standard. \n6.0212 DURATION OF EXEMPTION FROM SUBSEQUENTLY ADOPTED LAND USE \nORDINANCE  \nFor the purposes of ORS 92.040(2) and (3), after September 9, 1995, construction within an approved \nsubdivision shall at the Applicant’s discretion be subject to the City of Gresham land use laws that were in \neffect on the date the tentative subdivision plan application was made and shall not be subject to \nsubsequently adopted City of Gresham land use laws.  This exemption from subsequently adopted City of \nGresham land use laws shall terminate 3 years from the date of the recording of the final plat. In no instance \nshall this exemption extend beyond 10 years from tentative plan approval. \n6.0213 REVIEW OF LOTS NOT LAWFULLY CREATED  \nThe City will consider applications to partition or subdivide lots that were not lawfully created under the \nfollowing circumstances: \nA. The property is owned by more than one owner; and \nB. One or more of the owners applies for creation of the lots that were improperly formed without approval \nof the City or County, even if not all of the owners of the existing legal lot have applied for approval; and \nC. The owners of the lot are not related by blood or marriage; and \nD. The only business relationship among the owners is the transaction by which ownership interests in the \nportions of the lot were sold. \nThe application shall be subject to the City’s land division requirements and shall meet all applicable standards. \n6.0214 EXPIRATION OF PARTITIONS AND SUBDIVISIONS  \nA tentative land division plan approval expires two (2) years from the effective date. Those tentative land \ndivision plans approved on or after September 19, 2017 shall expire one (1) year from the effective date.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.265353",
  "extractor_version": "1.0.0"
}