{
  "metadata": {
    "filename": "dc-section-8.0300.pdf_id7863",
    "extracted_at": "2025-05-22T06:15:23.020323",
    "num_pages": 5,
    "title": "DC Section 8.0300",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615192649-07'00'",
    "modification_date": "D:20220615192855-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[8.03]-1 \nCity of Gresham Development Code \n \n(01/19) \n \nSECTION 8.0300 \nINSTITUTIONAL MASTER PLANS \nGeneral \n8.0301  Purpose   \n8.0302  Applicability \n8.0303  Review of Institutional Master Plans \n8.0304  Submittal Requirements \n8.0305  Duration of Institutional Master Plan Approvals \n8.0306  Review of Subsequent Developments \nStandards \n8.0310  Approval Criteria  \n8.0311  Subsequent Development Consistency   \n8.0312  Institutional Master Plan Limited Review   \nGeneral \n8.0301  Purpose   \nThe purpose of the Institutional Master Plan process is to promote and facilitate the coordinated development of \ncertain institutional uses; parks; and public multi-use trails through adoption of institutional master plans.  This \nwill add long-term predictability concerning development of the institutional master plan areas for the \napplicants, surrounding neighborhoods and the entire community while allowing for periodic institutional \nmaster plan reviews. The Institutional Master Plan process also is intended to streamline and consolidate \ndevelopment review processes, often allowing for lower-level reviews for subsequent developments that are \nconsistent with the institutional master plan. \n8.0302  Applicability   \nA. \nThe following uses are eligible to apply for an institutional master plan review:  hospitals; colleges; high \nschools; religious institutions; public community and regional parks; and public paths with associated \naccess points and trailheads. The uses must be the primary use on the site or sites. The Institutional \nMaster Plan process is voluntary. \nB. \nApplications for an institutional master plan may be submitted by applicants described in Section \n11.0201(A)(1) and may include lots not controlled by the institutional landowner if the lots are eligible \nto be included consistent with this section and the institution receives written permission from the \nproperty owners stating that they consent to be included in the institutional master plan. \nC. \nExcept for public community parks, regional parks and public multi-use paths, minimum site size shall \nbe: \n1. \n10 acres for an institution on one site. \n2. \n10 acres total and 5 acres per site for institutions on more than one site. \nFor the purposes of this section, “site” means all lots eligible to be included in the institutional master \nplan that are abutting, or lots that are adjacent and separated by any one of the following:  public open \nspace, waterways, utility corridors, or public rights of way. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[8.03]-2 \nCity of Gresham Development Code \n \n(01/19) \n \nD. \nExcept for public community and regional parks and public paths, non-abutting sites included in the \ninstitutional master plan must be within one-half mile of each other and fully contained within that one-\nhalf mile. \n8.0303  Review of Institutional Master Plans  \nA. \nInstitutional master plans and modifications of approved institutional master plans shall be reviewed as \nspecified in Table 11.0204. \nB. \nAn Institutional Master Plan Limited Review shall be required for the first development application \nonce 10 years have passed since the institutional master plan approval (or, if applicable, the final \napproval) was issued. The applicant shall file for a limited review concurrent with the first development \nreview sought after 10 years has passed. This limited review shall be conducted as specified in Table \n11.0204. \nC. \nOther reviews. The Institutional Master Plan review may integrate the following review processes: \n1. \nDetermination of allowed uses; and \n2. \nDesign review regarding relevant site design elements such as building footprints, landscape areas \nand parking lot areas. This shall not include building and landscape design; and \n3. \nModifications and variances; and \n4. \nModifications of conditions of approval on previously approved existing buildings that involve \nrelevant use or site design elements; and \n5. \nOther reviews appropriate for the institutional master plan as determined by the Manager. \n \nReviews that require City Council decisions shall receive those decisions separate from the institutional \nmaster plan review. \nD. \nInstitutional master plans reviewed through this subsection shall be subject to the applicable \nrequirements of Appendix 5.000 - Public Facilities Standards. \nE. \nAn applicant may request concurrent review of an institutional master plan and subsequent \ndevelopment(s) that rely on the institutional master plan.  \nF. \nConditions of approval for existing developments that are within the institutional master plan boundary \nat the time of approval shall be incorporated into the institutional master plan approval, unless the \nconditions are superseded by the institutional master plan approval. \nG. \nModifications of institutional master plans shall be reviewed as specified in Table 11.0204. An \napproved modification does not change the end date for the institutional master plan approval as \ndescribed in Section 8.0305. \nH.  \nIf the institutional master plan approval includes conditions that affect the site design elements of the \nplan, the applicant shall within 120 days submit an application for an Institutional Master Plan Final that \nincludes the compliance with any conditions requiring modifications to the institutional master plan. \nThis final application shall include a narrative description of how the conditions are being met and any \ndrawings or exhibits necessary to review the proposed implementation of the conditions. If site design \nelements change, a new site plan shall be submitted. The Institutional Master Plan Final shall be \nreviewed as specified in Table 11.0204.  For an Institutional Master Plan Final, the 20-year approval \nperiod shall begin at the end of the Institutional Master Plan Final appeal period. \n8.0304  Submittal Requirements  \nA. \nAn application for an institutional master plan shall provide facts and evidence sufficient to enable the \napproval authority to make a determination in compliance with the criteria set forth in this section, \nincluding submittal requirements requested on relevant submittal checklists maintained by the Manager. \nSubmittals shall include but are not limited to relevant information related to uses; boundaries; a site \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[8.03]-3 \nCity of Gresham Development Code \n \n(01/19) \n \nplan; a narrative description of the institutional master plan; proposed phasing; transportation and \nparking impacts and potential mitigation measures; and information about how the proposed uses and \ndevelopments comply with Development Code standards. The submittal shall be highly visual. \nB. \nThe applicant in the submittal shall identify which Development Code standards the application intends \nto comply with and include in the institutional master plan approval. \nC. \nThe applicant shall provide conditions of approval related to site design for applicable, previously \napproved development permits within the institutional master plan boundary. \n8.0305  Duration of Institutional Master Plan Approvals   \nThe Institutional Master Plan approval expires 20 years after the appeal period ends on its original approval, or \nif applicable, the appeal period ends on the Institutional Master Plan Final approval. After 20 years, \nsubsequent development applications shall be reviewed under other applicable sections of the Development \nCode.  Applicants also have the option of applying for another Institutional Master Plan approval if they \nremain eligible under Development Code provisions at that time. \n8.0306  Review of Subsequent Developments  \nA. \nSubsequent developments shall be reviewed for their consistency with the approved mater plan and shall \nundergo all relevant reviews as listed in Section 11.0204 of the Development Code, except reviews \nalready completed as part of the institutional master plan approval.  These reviews shall be for standards \nnot already approved as part of the institutional master plan approval and shall use the latest \nDevelopment Code standards, including applicable requirements of Appendix 5.000 – Public Facilities \nStandards.  The review shall consider the latest standards related to natural resources, resource \ndelineations and overlay districts, including but not limited to standards for Natural Resource Overlay \nand the Floodplain Overlay District. \nB. \nSubsequent development phases may be implemented in a different order than originally proposed in the \ninstitutional master plan phasing as long as the development remains in compliance with Development \nCode standards, such as those involving parking, landscape area required, stormwater treatment and \nsimilar standards. \nStandards \n8.0310  Approval Criteria   \nRequests for institutional master plans will be approved if the review body finds that the applicant has shown \nthat the following approval criteria are met: \nA. \nThe institutional master plan demonstrates that the institutional master plan boundary is of a size and \nshape to accommodate: the proposed uses; all existing and proposed development; and related yards, \nsetbacks, buffers, parking and other required elements (taking into account planned demolitions, if \napplicable); and \nB. \nThe application meets applicable Development Code standards for all reviews being considered as part \nof the institutional master plan. \n8.0311  Subsequent Development Consistency   \nA subsequent development is not consistent with the institutional master plan if the development: \nA. \nDoes not comply with conditions of approval, including conditions of approval related to Section \n8.0103; or \nB. \nWould increase the institutional master plan boundary to add land not previously inside the boundary; or \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[8.03]-4 \nCity of Gresham Development Code \n \n(01/19) \n \nC. \nWould reduce the institutional master plan boundary in a way that affects a condition of approval or \ntakes the site out of conformance, or further out of conformance, with a development standard; or \nD. \nWould add, remove or substantially change transportation access points; or \nE. \nWould substantially change the transportation circulation pattern within 50 feet of the institutional \nmaster plan boundary (and inside the boundary); or \nF. \nWould increase overall development floor area on the site more than 10 percent. For institutional master \nplans with more than one site, each site shall be considered individually; or \nG. \nWould increase floor area on any one building: \n1. \nBy more than 5,000 square feet if the building was approved in the institutional master plan at \n50,000 square feet or less; or \n2. \nBy more than 10 percent if the building was approved in the institutional master plan at more than \n50,000 square feet; or \nH. \nWould provide a number of parking spaces lower than the minimum required, higher than the maximum \nallowed or outside a range approved as part of the institutional master plan; or \nI. \nIncludes uses not approved as part of the institutional master plan; or \nJ.  \nIncludes any development not approved as part of the institutional master plan within 50 feet of the \ninstitutional master plan boundary or any development greater than 5,000 square feet that is 50 feet or \nmore from the institutional master plan boundary. \n8.0312  Institutional Master Plan Limited Review   \nInstitutional Master Plan Limited Reviews as described in Section 8.0303(B) shall provide a review of certain \nurban design standards to determine if significant changes to the Development Code have occurred since the \ninstitutional master plan was approved. The Manager may require changes to the institutional master plan and/or \nsubsequent developments that rely on the institutional master plan to ensure conformance or increased \nconformance with the Development Code. \nA. \nThe urban design review shall include applicable Development Code changes as determined by the \nManager regarding: \n1. \nThe amount of building frontage required on public streets; and \n2. \nThe location of parking as it relates to whether it is in front of buildings along streets or to the side \nor rear of buildings; and \n3. \nBuilding orientation, such as whether entries or entry features must face streets; and \n4. \nFront or side setbacks facing streets; and \n5.  \nSimilar urban design elements that affect how the site or sites are experienced from the street. \nB.  \nIn determining whether to require changes to the institutional master plan and/or subsequent \ndevelopments, the Manager shall consider whether: \n1. \nThe benefit to the City’s built environment outweighs the potential negative effects to the \ninstitutional master plan and/or subsequent developments and/or the operation of the institution, \npark or trail; and \n2. \nThe changes substantially reduce negative effects on abutting or adjacent properties and/or \nsubstantially improve the urban design of the institutional master plan and/or subsequent \ndevelopments along public rights of way. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[8.03]-5 \nCity of Gresham Development Code \n \n(01/19) \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.020737",
  "extractor_version": "1.0.0"
}