{
  "metadata": {
    "filename": "dc-section-4.1000.pdf_id7837",
    "extracted_at": "2025-05-22T06:15:23.873200",
    "num_pages": 2,
    "title": "DC Section 4.1000",
    "author": "City Staff",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220615143534-07'00'",
    "modification_date": "D:20220615143616-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[4.10]-1 \nCity of Gresham Development Code \n \n(5/09) \nSECTION 4.1000 \nPLAN DISTRICTS \nGeneral \n4.1000  Enabling Legislation  \nGeneral \n4.1000  Enabling Legislation   \nA. \nA Plan District may be designated when the city finds that conditions within a specific area are \nsuch that unique planning and regulatory tools are required to achieve desired results.  A Plan \nDistrict designation may be warranted based on specific land use, economic, transportation, \npublic facilities, historic, or natural conditions found to exist in the area.  Plan District designation \nprovides a means to create or modify development districts and standards in ways which address \nspecific opportunities and problems within the plan area.  These new or modified development \ndistricts and standards are not transferable to properties outside the boundaries of the established \nPlan District.  The Plan District designation is generally not intended to be applied to small areas \nor to small individual properties. \nB. \nExcept as provided in Section 4.1000(E), a Plan District shall be established, amended, or \nremoved at the initiative of the Planning Commission or the City Council through the Type IV \nlegislative procedure.  In establishing a Plan District, findings satisfying all of the following \ncriteria must be made: \n1. \nThe area proposed for the Plan District designation is generally affected by special \ncharacteristics or problems of a land use, economic, transportation, public facilities, \nhistoric, natural, or transitional use or development nature which are not common to other \nareas of the city. \n2. \nExisting development districts and standards applying in the area are inadequate to achieve \ngoals and implementation strategies of the Community Development Code, or to address an \nidentified problem in the area. \n3. \nThe proposed Plan District designation is the result of a study or plan which documents the \nspecial characteristics of the study area and includes measures to address the relevant \nissues. \n4. \nAny proposed policies, procedures, development standards, or other measures to be \nimplemented are in conformance with the purposes, findings and recommendations of the \nstudy or plan which serves as the basis for the Plan District. \n5. \nThe Plan District designation, and related policies, procedures, standards, and other \nmeasures are consistent with applicable policies and implementation strategies of the \nCommunity Development Code, and with any applicable locational criteria identified in the \nCommunity Development Code. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[4.10]-2 \nCity of Gresham Development Code \n \n(5/09) \nC. \nProvisions of the Plan District may modify existing standards and procedures of the Community \nDevelopment Code.  The Plan District provisions may also apply additional requirements or \nallow exceptions to general regulations.  Where there is a conflict between the provisions of the \nPlan District and those of other portions of the Community Development Code, the Plan District \nprovisions control. \nD. \nThe location and boundaries of each Plan District shall be shown on the Community \nDevelopment Plan Map. \nE. \nWithin the boundaries of a Plan District, the sub-district designation of any site or small group of \nsites may be changed to that of a different sub-district already existing within that Plan District.  \nAny such proposal shall be processed under the Type III procedure for Community Development \nPlan Map Amendments, as provided in Section 12.0001.  In seeking such an amendment, an \napplicant shall demonstrate that the proposed change is consistent with the purposes, findings, \nand recommendations of the study or plan which serves as the basis for the Plan District, and that \nthe proposed change will not have a negative impact on existing or planned public facilities and \nservices. \nF. \nPlan District designation may be removed from all or a portion of a Plan District through the \nType IV legislative procedure.  Any such action shall be initiated by the Planning Commission or \nthe City Council, and shall be based on a new study or plan containing findings which satisfy all \nof the criteria of Section 4.1000(B).  The new study or plan shall also provide for new land use \ndistrict designations and development regulations for the affected area in the form of a new Plan \nDistrict designation or through the application of conventional land use district designations. \nG. \nPolicies, procedures, standards, and other measures applying within a Plan District may be \namended through the Type IV legislative procedure.  Any such amendment intended to apply \nexclusively within a Plan District shall be initiated by the Planning Commission or the City \nCouncil, and shall be based on findings demonstrating that it is consistent with the purposes, \nfindings, and recommendations of the plan or study which serves as the basis for that Plan \nDistrict.  This subsection does not apply to general legislative amendments that will be applied \nbroadly to areas of the city at large, both within and outside of a Plan District. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.873367",
  "extractor_version": "1.0.0"
}