{
  "metadata": {
    "filename": "dc-section-10.1300.pdf_id7883",
    "extracted_at": "2025-05-22T06:15:20.260301",
    "num_pages": 2,
    "title": "DC Section 10.1300",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615195935-07'00'",
    "modification_date": "D:20220615195953-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.13]-1 \nCity of Gresham Development Code \n \n(06/22) \n \nSECTION 10.1300 \nTEMPORARY HEALTH HARDSHIP DWELLING \nGeneral \n10.1301  Purpose \nSubmittal Requirements and Development Standards \n10.1310  Development Permit for Temporary Health Hardship Dwelling   \n10.1311  Application  \n10.1312  Approval Criteria \n10.1313  Permit Renewals  \n10.1314  Removal   \n10.1315  Guarantee of Removal of Temporary Health Hardship Dwellings  \nGeneral \n10.1301  Purpose \nThe purpose of a temporary health hardship dwelling is to allow convenient support and care for infirm relatives \nby allowing temporary placement of a manufactured home as an accessory to an existing single detached \ndwelling. \nSubmittal Requirements and Development Standards \n10.1310  Development Permit for Temporary Health Hardship Dwelling  \nAn application for a temporary accessory dwelling shall be reviewed by the Manager under the Type I \nprocedure. \n10.1311  Application  \nIn addition to the applicable submittal requirements of Section 11.0900 of the Gresham Development Code, an \napplicant for a temporary health hardship dwelling development permit shall submit: \nA. \nTen copies of a proposed site plan, drawn to scale, showing all existing and proposed structure locations \nand sizes.  Show distances to other structures and property lines.  Show the location of all existing and \nproposed public facility connections, and existing easements. \nB. \nTen copies of a narrative covering each of the appropriate approval criteria pursuant to Section 10.1312. \nC. \nTen copies of the licensed physician letter pursuant to Section 10.1312(B). \n10.1312  Approval Criteria \nThe Manager shall approve an application for development permit if the applicant shows that either the primary \ndwelling or the temporary accessory dwelling will be occupied by a person with a health hardship, and that: \nA. \nThe person with a health hardship is either one of the property owners or a relative of one of the \nproperty owners.  For the purposes of this section, a relative is defined as a grandparent, parent, child, \nbrother or sister, either by blood or legal relationship. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.13]-2 \nCity of Gresham Development Code \n \n(06/22) \n \nB. \nThe person with the health hardship is unable to adequately provide daily self-care needs because of a \nphysical and/or medical impairment, based upon a statement from a licensed physician. \nC. \nThe manufactured home to be occupied as the temporary accessory dwelling is located on the site of an \nexisting single detached dwelling, or on a vacant lot abutting the site of the existing single detached \ndwelling and in the following districts: MDR-12, MDR-24, OFR, NC, RTC, SC, SC-RJ, CMF, CMU, \nCC, MC, CNTH, CNTM and CNRM. In the areas of CMF along the NE Glisan and NE 162nd Avenue \ncorridors and on lots of record in MDR-12 and OFR this standard is also applied to lots on or adjacent to \nMiddle Housing. \nD. \nThe application is consistent with the following: \n1. \nTemporary health hardship dwellings shall meet the standards of the LDR-5 or LDR-7 Districts. \n2. \nThe temporary health hardship dwelling (if placed on the same lot as the existing dwelling) shall \nbe located behind the farthest back front wall of the existing primary dwelling, when located on \nan interior lot.  When located on a corner lot, the temporary health hardship dwelling (if placed on \nthe same lot as the existing dwelling) shall be placed in conformance with streetside yard setback \nrequirements on the streetside. \n3. \nA temporary health hardship dwelling shall not be required to comply with Appendix 5.000 - \nPublic Facilities Standards, unless the proposed use will cause the capacity of existing facilities \nserving the site to be exceeded. \n4. \nNo additional off-street parking spaces are required for the temporary health hardship dwelling. \n10.1313  Permit Renewals   \nA development permit for a temporary health hardship accessory dwelling shall expire two years from the date \nof issuance of the permit.  Permits may be renewed for two year periods by the Manager under the Type I \nprocedures, provided the following criterion is met:  A recent (within 6 months prior to the expiration date) \nphysician's statement is provided, verifying that the situation described in Section 10.1312(B) still exists. \n10.1314  Removal   \nA temporary accessory dwelling shall be removed from the site within six months of the expiration of the \ndevelopment permit.  No one shall reside in the accessory dwelling following expiration of the permit. \n10.1315  Guarantee of Removal of Temporary Health Hardship Dwellings \nPrior to issuance of a building permit for the manufactured home, the applicant shall provide the City a \nGuarantee of Completion equal to 110% of the estimated cost of removing the manufactured home to ensure \nremoval of the manufactured home. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.260573",
  "extractor_version": "1.0.0"
}