{
  "metadata": {
    "filename": "dc-section-9.0500.pdf_id7868",
    "extracted_at": "2025-05-22T06:15:20.898029",
    "num_pages": 6,
    "title": "DC Section 9.0500",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615194422-07'00'",
    "modification_date": "D:20220615194446-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n \n[9.05]-1 \nCity of Gresham Development Code \n \n(01/19) \nSECTION 9.0500  GRADING AND DRAINAGE AND \nSTORMWATER MANAGEMENT REQUIREMENTS \nGeneral \n9.0501  Purpose  \n9.0502  Grading and Drainage Plans and Specifications \n9.0503  Stormwater Report   \n9.0504  Geotechnical Report   \n9.0505  Guarantees for Grading and Drainage   \nDesign Requirements \n9.0510  Design Guidelines for Grading and Drainage Improvements   \n9.0511  Cuts   \n9.0512  Fills   \n9.0513  Required Stormwater Facilities   \n9.0514  Erosion Prevention and Sediment Control Measures During Construction  \n9.0515  Establishing Protective Vegetative Cover Upon Completion of Final Grading   \n9.0516  Certification of Compliance upon Completion of the Project  \nStormwater Management Requirements \n9.0520  Applicability   \n9.0521  Data Requirements   \n9.0522  Sites Where it is Infeasible to Install On-Site Stormwater Management Facilities   \n9.0523  Maintenance and Inspection of Private Stormwater Quality Facilities   \nGeneral Requirements \n9.0501  Purpose   \nThis section of the Community Development Code specifies requirements for grading and drainage, erosion \ncontrol and stormwater management. \nThe regulations of this section require the use of Green Development and Green Streets to manage stormwater \nrunoff on-site from all development in the city. Green Development Practices treat and manage stormwater \nrunoff as close as possible to its source and mimic natural processes such as retention, infiltration, and \nevapotranspiration to treat and reduce the overall volume of stormwater runoff that drains into water bodies. \nThrough the use of Green Development Practices and Green Streets, local and downstream flooding impacts \nwill be minimized, and water quality and aquatic habitat will be protected to the maximum extent practicable.  \nGreen Development Practices are a toolbox of techniques that mimic and incorporate the predevelopment \nhydrology of a site into the future development through two processes. The first is to create a site design that \nminimizes disturbance to existing soils, tree canopy, and other sensitive natural resource features and minimizes \nimpervious surfaces to reduce the production of surface runoff. The second is to manage runoff through \ntechniques that use natural areas and landscaping to treat, retain, attenuate, and infiltrate stormwater on the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n \n[9.05]-2 \nCity of Gresham Development Code \n \n(01/19) \ndevelopment site instead of using only traditional piped collection and conveyance systems and regional \nmanagement facilities. \nTraditional systems often fail to adequately treat and reduce the volume of stormwater runoff before it is \ndischarged into waterbodies. Traditional systems also fail to infiltrate stormwater and recharge groundwater. \nThis impacts nearby streams by reducing summertime flows and magnifying wintertime flows, often \nexacerbating flooding, eroding stream channels and aquatic habitat, and contributing to excess siltation. \nAdditionally, untreated pollutants are washed into streams compromising water quality. \n9.0502  Grading and Drainage Plans and Specifications   \nA. \nUnless otherwise specified in this document, Appendix J of the current edition of the Building Code \nshall apply for all grading and drainage construction on private property. A site plan showing grading, \ndrainage, and the other information detailed in the Stormwater Management Manual shall be approved \nprior to start of construction, or final plat approval, for all development proposals. \nB. \nA stormwater report is required for any proposed development that will include public improvements or \nthat is using the Engineered Method of stormwater facility sizing described in the Stormwater \nManagement Manual. \nC. \nWhen the pre-application conference indicates the applicant's proposal involves erosion and/or runoff \nproblems, or if the subject property has shallow groundwater, is on fill, is hilly or partially within the \nHillside Physical Constraint Overlay District, the Manager may require a geotechnical report from a \nregistered geologist.  \n9.0503  Stormwater Report \nIf a Stormwater Report is required under Section 9.0502, supporting data shall be submitted that meets the \nrequirements specified in the Stormwater Management Manual. The development application, stormwater \nreport, specifications and supporting data shall be submitted and approved prior to issuance of a development \npermit. \n9.0504  Geotechnical Report   \nIf a geotechnical report is required under Section 9.0502, supporting data shall be submitted that meets the \nrequirements specified in the Public Works Standards.  \n9.0505  Guarantees for Grading and Drainage \nThe Manager shall require a Guarantee of Completion equal to 110% of the estimated cost of:  \nA. \nMeeting the grading and drainage requirements to ensure that the work is completed in accordance with \napproved plans and specifications and to correct or eliminate any hazardous conditions. \nB. \nMeeting the erosion prevention and sediment control measures to ensure that such measures are \ninstalled and maintained, including replacement and repair as needed, as required by the EPSC Manual \nand to correct or eliminate any conditions created because of the erosion or sediment from the site. \nC. \nThe construction cost of stormwater facilities required by Section 9.0520 et. seq. \nD. \nThe Manager may require a warranty guarantee in an amount deemed necessary to ensure that any \nfailure of grading and drainage, erosion control or stormwater facilities are repaired.  The warranty \nguarantee shall be in effect from the date of acceptance of privately financed public improvements for a \nperiod of two years. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n \n[9.05]-3 \nCity of Gresham Development Code \n \n(01/19) \nDesign Requirements \n9.0510  Design Guidelines for Grading and Drainage Improvements   \nPlans and specifications for grading and drainage improvements will include provisions for the following \nimprovements and/or grading operations as deemed appropriate by the Manager for the subject site. \n9.0511  Cuts  \nCuts shall not exceed in steepness a 2:1 (horizontal to vertical) ratio unless approved by the Manager. The \nManager may approve cut slopes up to a 1-1/2:1 maximum ratio if the increase in slope will result in reducing \nthe disturbance of the natural terrain. All cuts exceeding a 2:1 ratio shall be certified by a professional engineer \nto have a soil type having an appropriate nature, distribution and strength to maintain the proposed slope. \n9.0512  Fills  \nFills shall not exceed in steepness a 2:1 (horizontal to vertical) ratio. All fills, upon completion of the project \nshall be certified by a professional engineer to be adequately compacted for the intended use. If the intended use \nis open space, appropriate easements will be recorded with the title records of Multnomah County, with a \nduplicate copy being kept on file with the City of Gresham. \nA. \nThe ground surface shall be prepared to receive fill by removing vegetation, non-complying fill, top soil \nand other unsuitable materials; scarify to provide a bond with new fill and where slopes are steeper than \n15% and the high is greater than 5 feet, by benching into a competent material as determined by the \ngeotechnical report and approved by the Manager. \nB. \nStructural Fill Material - Detrimental amounts of organic material shall not be permitted in structural \nfills. Burial of tree stumps will not be allowed on any site other than an approved solid waste disposal \nsite. No rock or similar material greater than 12 inches in diameter shall be placed in a structural fill. \nThe Manager may permit placement of larger rock if the geotechnical report devises a method to \ncontinuously inspect placement and certify stability of rock disposal areas having no overlapping with \nphysical improvements and is a minimum of 5 feet below grade measured vertically. \nC. \nStructural Fill Compaction - Structural fill will be compacted to a minimum of 90% of maximum \ndensity per ASTM D-1557 or as determined by the Building Official. The soils engineer shall certify all \nstructural fills as meeting minimum bearing capacity for the intended use. \nD. \nNon-Structural Fills - Stripping materials and landscape berms, will be compacted by reasonable \nmechanical means, if greater than 3 feet in depth. \n9.0513  Required Stormwater Facilities   \nA. \nAll stormwater generated by on-lot impervious surfaces, including driveways, walkways, roof and \nfoundations drains shall be discharged to either an on-site stormwater facility, curb face outlets (if minor \nquantity), to a public or approved private storm drain, or to a natural acceptable drainageway if adjacent \nto the lot. \nB. \nAll private stormlines, roof and foundation drains shall utilize infiltration systems to the maximum \nextent possible. \nC. \nPrivate storm drainlines will be required to convey any concentration of run-off across adjoining \nproperties so as to reach an acceptable drainage facility. Private drainage easements shall be established \non the deeds or on the recorded plat face of the parcels involved with any required private drainage \neasements. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n \n[9.05]-4 \nCity of Gresham Development Code \n \n(01/19) \nD. \nSubsurface drainage facilities may be required in areas of fill if it is so determined by the geologist or \nsoils engineer that there will exist a groundwater situation that could cause stabilization problems. Any \nsubsurface natural springs shall be piped to an approved drainage facility. \nE. \nAny development that is down grade from an undeveloped parcel of ground shall intercept and divert \nthe storm water run-off to an approved storm drainage facility. The diversion ditch may not exceed a 5% \nslope, unless improved with an acceptable erosion control method as determined by the Manager. In \naddition to the diversion ditch an interceptor pipe may be required. If the cutoff ditch and interceptor \npipe is located on public open space, an easement for maintenance purposes will be established for those \nproperties benefited by the facility. \nF. \nAll drainage provisions shall be subject to the approval of the Manager and shall be of such design as to \ncarry storm and surface waters to the nearest practical street, storm drain or natural water course, \napproved by the Manager as a safe place to deposit and receive such waters.  Adequate provisions shall \nbe made to prevent any storm or surface waters from damaging the face of an excavation, the sloping \nface of a fill, any natural slope, or any natural or manmade drainageway. \nG. \nMaintenance, repair, replacement and liability from damages due to failure of private drainage systems \nshall be the responsibility of the customer.  Maintenance responsibility shall include all elements of the \nsystem up to the point of connection with a drainage structure of the public stormwater system.  Such \nconnection shall be subject to City approval.  Private stormwater facilities are subject to periodic \ninspection by the City to ensure proper maintenance and performance.  \n9.0514  Erosion Prevention and Sediment Control Measures During Construction   \nAll development, regardless of permit status, shall keep sediment laden water and any other forms of stormwater \npollution from entering the public stormwater system. \nThe requirements for erosion prevention and sediment control shall be implemented in accordance with the \nErosion Prevention and Sediment Control (EPSC) requirements included in the City of Gresham’s Stormwater \nManagement Manual. \nThe applicant for a development permit shall submit an EPSC plan as part of their application specifying \nappropriate best management practices (BMPs). For sites larger than 1 acre, the applicant must demonstrate that \nthey have a DEQ-approved 1200-C permit. \nThe applicant for a development permit is ultimately responsible for retaining all soil on the project site and \nmust recognize the potential for changing or unexpected site and weather conditions. If at any time the DEQ or \nCity approved EPSC plan is determined to be ineffective, the City will require additional controls to be \nimplemented until a site is stabilized. The applicant is responsible for updating the EPSC plan and resubmitting \nto DEQ and the City. \n9.0515  Establishing Protective Vegetative Cover Upon Completion of Final Grading  \nTo prevent and minimize erosion, all development shall implement best management practices as required by \nthe Erosion Prevention and Sediment Control requirements in the Stormwater Management Manual including, \nbut not limited to, the following stages of a project:  \nA. \nVegetation is to be established as soon as practicable after completion of grading to minimize erosion. \nB. \nPrior to final project acceptance, the site shall be permanently stabilized with seed and mulch, or \npermanent landscaping. \nC. \nIn cases of a land division, temporary groundcover will be accepted on each lot where home \nconstruction will begin within 30 days of project completion. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n \n[9.05]-5 \nCity of Gresham Development Code \n \n(01/19) \nD. \nTo the extent practicable, all stormwater facilities and open channel conveyances shall be permanently \nstabilized prior to use. \nE. \nErosion control measures shall be continued after construction until the vegetative ground cover for the \nsite is established and functioning such that erosion has ceased. \nF. \nThe developer will be responsible for all erosion prevention and sediment control for individual lots \nuntil ownership has changed. \nG. \nIn cases with developments with 1200-C permits, the developer is responsible for erosion prevention \nand sediment control until the 1200-C permit is terminated by the state. \nH. \nTemporary sediment control measures shall be removed by the developer when permanent stabilization \nor landscaping has been installed and is functioning. \n9.0516  Certification of Compliance upon Completion of the Project   \nA registered professional civil engineer in the State of Oregon shall be responsible for the preparation of revised \nplans and the submission of as-graded plans upon completion of the project. The grading contractor shall \nsubmit, in a form prescribed by the Manager, a statement of compliance to said as-built plans. The project \nprofessional engineer shall certify all areas of compaction as meeting the minimum standards for the intended \nuse. \nStormwater Management Requirements \n9.0520  Applicability \nThe requirements for stormwater management are described in the Stormwater Management Manual and apply \nto all development that will add or replace 1,000 square feet or more of impervious area. \nNon-residential development may have additional source control requirements depending upon the materials and \nactivities planned for the site. The required improvements described in the Stormwater Management Manual \napply to vehicle and equipment washing, vehicle maintenance, fueling, outdoor storage tanks, outdoor storage of \nbulk materials, loading docks, parking structures, and solid waste storage areas. \n9.0521  Data Requirements \nAll development permit applications meeting the applicability conditions specified in Section 9.0520, and \nfurther described in the Stormwater Management Manual, shall provide sufficient information for the Manager \nto evaluate the applicant’s intent to include on-site stormwater management in order to fully infiltrate, or at a \nminimum, reduce the volume and load of sediments and other stormwater pollutants to the storm sewer or \nnatural drainage channel (e.g., stream).  The applicant for a development permit shall submit a site plan and, if \napplicable, a stormwater report as part of their application utilizing appropriate best management practices \n(BMPs) and other details outlined in the Stormwater Management Manual.  \n9.0522   Sites Where it is Infeasible to Install On-Site Stormwater Management \nFacilities \nOn-site stormwater management is required for all development applications, unless it can be demonstrated that \non-site control is not feasible based on limiting physical site constraints. If on-site management is not feasible, \nthe Manager may allow for an off-site stormwater facility to be constructed. If an off-site stormwater facility is \ninfeasible, then the Manager may establish payment of in-lieu-of fees that would be used by the City to fund \nretrofit projects to improve stormwater treatment within the city.  In-lieu-of fees shall be based on estimated \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n \n[9.05]-6 \nCity of Gresham Development Code \n \n(01/19) \ncapital cost for typical on-site systems, as well as assuming the typical lifecycle cost of the public stormwater \nfacility likely to be constructed.  \n9.0523   Maintenance and Inspection of Private Stormwater Quality Facilities \nMaintenance of private stormwater quality systems shall be the responsibility of the owner. Maintenance \nresponsibility shall include all elements of the system up to the point of connection with a drainage structure of \nthe public stormwater system.  Such connection shall be subject to the City approval.  Maintenance requirements \nare specified in the Stormwater Management Manual or in a recorded maintenance plan, if submitted at the time \nof project acceptance.  Private stormwater quality facilities are subject to periodic inspection by the City to \nensure proper maintenance and performance.   \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.898440",
  "extractor_version": "1.0.0"
}