{
  "metadata": {
    "filename": "dc-section-4.1100.pdf_id7838",
    "extracted_at": "2025-05-22T06:15:20.269561",
    "num_pages": 126,
    "title": "DC Section 4.1100",
    "creator": "Adobe InDesign 19.0 (Windows)",
    "producer": "Adobe PDF Library 17.0",
    "creation_date": "D:20240102103018-08'00'",
    "modification_date": "D:20240102103911-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "City of Gresham\nDOWNTOWN \nDesign Manual\nPLAN DISTRICT\nSection 4.1100\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "[4.11]-2\n(06/22)\nCity of Gresham Development Code \nintentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "[4.11]-3\nCity of Gresham Development Code\n(06/22)\nGeneral\n4.1101 Purpose\nThe 2009 City of Gresham Downtown vision includes Downtown that is one of the region’s \ngreat urban settings - a lively, diverse and appealing place to live, work, shop and play as \nthe basis for a truly sustainable City. The Downtown will be the most active, intense and \nurban area in the city, with consistent building edges at or near the sidewalk that help \ncontribute to these qualities. This Development Code will help implement that vision, \nproviding specific urban design strategies and recommendations that raise the bar for \ndesign excellence in the built environment. Downtown public and private entities working \ntogether will make this vision for Downtown Gresham a reality. This document aims to \ninspire and guide development proposals toward meeting this goal. \nThe Development Code contains Design Guidelines and Standards that provide a \nframework within which to review projects in Downtown, aiding architects, designers, \ndevelopers and the community in understanding the City’s urban design expectations. \nCity staff and the City’s Design Commission are responsible for reviewing the design of \nnew and significantly modified buildings Downtown, evaluating their contribution to the \npublic’s enjoyment of the building and the immediate vicinity.\nThe Design Guidelines and Standards contained in the Development Code provide the \nmeasures that the Design Commission and staff use to determine a proposal’s success. \nWhere there is a conflict between the provisions of the Downtown Plan District and those \nof other provisions of the Community Development Code, the Downtown Plan District’s \nprovisions control. \nA.\t Design Review Process:\n\t\nNew development and additions and remodels within the Downtown sub-districts \nare subject to design review as described in Article 7 Design Review for determination \nof consistency with the guidelines and/or standards contained in this Code. Projects \nsubject to design review are either brought before the Design Commission or \nadministered by the Manager. For projects subject to 4.1151 either the Commission \nor the Manager shall make findings and decisions concerning conformance with the \ndesign standards or guidelines, based on which review track is selected.\n1.\t \tTwo Tracks: \nThe City has set up two alternative Design Review tracks: \n•\t\nThe Discretionary Track; and\n•\t\nThe Clear and Objective Track. \n\nApplicants have the choice of complying with either option. If the Clear and \nObjective Track is chosen, the applicant must meet all development standards. \nDeviation from any of the standards in 4.1100 or referenced standards in Article 7 \nmean the application must use the Discretionary Track. \na.\t \tDiscretionary Track: The Discretionary Track is intended for applicants that \nwould prefer to propose a quality project that might not comply with all \nor some of the standards in 4.1100 or referenced standards in Article 7. \nThe aim is to encourage applicants to propose exciting, innovative designs, \nwhile still ensuring the City’s design concerns and objectives for Downtown \ndevelopment are met. In this case, applicants shall meet the design \nguidelines. The Design Commission may waive a guideline or guidelines to \nachieve the flexibility necessary to support a particularly creative proposal. \nApproval requires the applicant to demonstrate to the Design Commission \nthat the waiver from the guideline(s) would result in a development that \nbetter meets the applicable Downtown Design Principles and the intent \nstatement preceding the guidelines.\nb.\t \tClear and Objective Track: The Clear and Objective Track includes measurable \nregulations used in a predictable review process to meet the desired urban \nform. The standards ensure a degree of order, scale and proportion within \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "[4.11]-4\n(06/22)\nCity of Gresham Development Code \nthe built environment. That said, the standards are written in a way to offer \nchoices and allow for projects that are interesting and of superior design as \nindividual buildings while also contributing to a cohesive Downtown district.\nB.\t \tHow to Use the Code:\n\t\nThis document guides the Design Review for any new Downtown project or projects \nthat exceed the limits described in Article 7 Design Review. It has four sections:\n1.\t \tDesign Principles: \nThe Design Principles are the general, over-arching statements and considerations \nthat guide the design of the built environment in design districts like Downtown. \nThe Guidelines and Standards are written to support and carry out the principles \non a project-specific level. In instances where the applicant chooses the \ndiscretionary process, the relevant principles will be reviewed for compliance \nduring the decision-making process.\n2.\t \tDowntown Sub-Districts and Development Standards: \nThis section describes the land use sub-districts in the Downtown and the \napplicable basic Development Standards. The Development Standards prescribe \nthe basic building envelope and site requirements necessary to ensure compact \nforms of development appropriate for an urban environment. These Standards \ninclude permitted uses, building heights, floor area ratios, densities, setbacks, \nbonus provisions and other basic regulations.\n3.\t \tStreet Type Standards\nA set of Street Types is included in this document. The Street Types are indicated \non the Downtown Street Types Map. When consulting the Code, project \napplicants shall look at the Street Type Map for their project site to determine \nthe Street Type. The respective Street Type Standards provide important direction \nconcerning building locations and relationships to adjacent streets, efficient multi-\nmodal circulation, and the provision of public spaces and pedestrian amenities. \nThe Street Type standards are not discretionary. The cross-sections shown are \nconceptual and specific details of street design and engineering are found in the \nCity’s Public Works Standards. Developments must comply with the Public Works \nStandards. \n4.\t \tDowntown Design Guidelines and Standards\nThe Downtown-Wide Guidelines and Standards are divided into Site Design \nand Building Design sections, each of which include several topics addressing a \nparticular set of design considerations for Downtown. For each topic, there is an \nintroductory statement describing the design intent, a list of all Design Principles \nthat apply to that particular topic, followed by specific Guidelines or Standards. \n\nThe intent statement describes what the Guidelines and Standards are designed \nto achieve and sets expectations for high-quality site and building design. \n\nThe Design Guidelines are the discretionary design parameters for development \nthat provide a statement of intent by which to evaluate the acceptability of a \nproject’s design. Design Guidelines provide the opportunity for creative design \nflexibility.\n\nThe Design Standards are the objective requirements for development in design \ndistricts that are based on Design Principles. Design Standards provide a clear and \nobjective way of evaluating the acceptability of a project’s design. \na.\t Site Design:\nSite Design Guidelines and Standards primarily address the organization and \narrangement of a project’s components in two dimensions. They deal with \nthe location of buildings and site features such as open space, landscaping, \nparking and service areas. Good site planning can minimize a project’s impacts \non its neighbors, improve the quality of the streetscape, relate to or establish \ndesirable development patterns, promote sustainability and make better \nconnections.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": "[4.11]-5\nCity of Gresham Development Code\n(01/24)\nb.\t Building Design: Guidelines and Standards in this section deal with the \nmassing and exterior architectural elements of buildings – components that \ndefine the scale, quality and character of a building, such as roofs, entries, \nwindows, materials and details.\n\nExcellent building design contributes to improving the quality of life for \nresidents by enhancing the appearance of the City, by establishing a sense \nof community pride and by improving the long-term economic value of the \nproperty.\n5.\t Images:\nMost images, including photographs, illustrations, and maps, included in the \nDowntown Plan District Design Manual (4.1100) are not part of the Development \nCode and do not act as guidelines or standards. These images are provided to \nassist readers in envisioning the intent and potential outcomes of the Guidelines \nand Standards. Images that are not part of the Development Code are labeled \nas figures. Images that are part of the Development Code are labeled with a \nDevelopment Code section number.\n6.\t Compliance with other Code sections includes but is not limited to: \na.\t Section 9.0800: Parking.\nb.\t Section 9.0100 – Buffering and Screening Requirements: New development in \nthe Downtown Plan District is exempt from the provisions of Section 9.0100, \nexcept where the proposed development abuts a lot that is outside the \nDowntown Plan District. \nc.\t Appendix 5, Section A5.510 - Utilities: Undergrounding of utilities in the \nDowntown Plan District shall be in accordance with Appendix 5, Section \nA5.510 - Underground Utilities. \nd.\t Appendix 6.000 - Signage:\n1.\t \tApplicability: The regulations of Appendix 6.000 Sign Regulations shall \napply in the Downtown Plan District. Section 4.1151(B)(4) shall apply \nin the following situations and shall supersede Appendix 6.000 where \nconflicts occur:\na.\t New Commercial and Industrial development in DCC.\nb.\t \tNew Commercial and Industrial development in DTM and DMU sub-\ndistricts not visible from the Urban Boulevard street type.\n2.\t  Signs in DRL-1 and DRL-2: \na.\t For subdivisions in the DRL-1 and DRL-2 sub-districts, the regulations \nof Appendix 6, Section A6.091 Subdivisions Signs apply. \nb.\t For non-residential uses in the DRL-1 and DRL-2 sub-districts, the \nregulations of Appendix 6, Section A6.094 Signs for Permitted \nCommercial uses in the OFR District shall apply. \n3.\t \tMultifamily, Elderly Housing and Mixed-Use: See applicable signage \nGuidelines and Standards in Corridor Design District Section 7.0101 \n- 7.0103 for multifamily, elderly housing and mixed-use (residential \ncomponent) developments requiring design review.\ne.\t Community Development Plan Volume 4 - Transportation System Plan: \nDowntown Plan Street Types of Section 4.1140 supersede the Transportation \nSystem Plan Functional Classification System.\nf.\t Section 7.0400 Residential Design Standards: For single detached dwellings \nand middle housing in the DRL-1 and DRL-2 sub-districts, the regulations of \n7.0400 apply.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "[4.11]-6\n(06/22)\nCity of Gresham Development Code \n7.\t Downtown developments are exempt from the following standards, unless \notherwise specified within Section 4.1100:\na.\t Section 7.0100 Corridor Design District Guidelines and Standards; and\nb.\t Section 7.0210 Transit and Pedestrian Design Criteria and Standards; and\nc.\t Section 7.0432 Corridor District Townhouse Design Standards; and; \nd.\t Section 7.0310 Commercial (Except Those in a Design District), Institutional, \nand Mixed Use Developments (Non-Residential Component); and\ne.\t Section 7.0320 Industrial Developments.\nApproval Criteria and Standards\n4.1102 Downtown Design Principles\nA.\t \tOffer a Vibrant Mix of Uses and a Variety of Housing Types: A mix of uses and a \nvariety of housing types shall be developed to support a more diverse, vibrant, 18-\nhour Downtown for a broad range of ages and backgrounds. Mixed-use development \nmay be either horizontal or vertical, depending on the scale and intensity appropriate \nfor a specific sub-area.\nB.\t \tPromote Excellence in Design and Architectural Expression:  Each site, building and \nstreetscape improvement must be treated as a long-term addition to Downtown. \nExterior design and building materials shall exhibit both the permanence and quality \nappropriate to an urban district setting. Great visual interest and innovative design are \ncritical elements of this principle, with buildings that assist in defining, enlivening the \npublic realm and accentuating the main Gateways into the Downtown. \nC.\t \tCreate a Unique and Exciting Public Realm: Emphasize building and site design \nelements that reinforce the experience of walking and biking, and promote active \nstreets and lively public spaces. This helps achieve the Downtown Plan area goal to \ncreate a cohesive, linked system of animated public and private open spaces, parks, \nplazas and pedestrian pathways. \nD.\t \tCreate strong connections between Sub-Districts and Plan Districts: Each \ndevelopment shall contribute aspects of City-wide connectivity, whether through \nbig moves like through-block connections, or small surprises like distinct lighting, to \nsustain attention and lead the eye down the street. The Downtown sub-districts shall \nhave a strong connection to Civic Neighborhood.\nE.\t \tIncorporate Sustainability: A project’s design approach to infrastructure and site \ndevelopment shall reflect a commitment to sustainable development that contributes \nto a healthier and greener community.\nF.\t Provide Context Sensitivity: The Downtown Plan District is composed of several sub-\nareas, each with their own unique characteristics and potential to enhance district \nidentity. Context-sensitive redevelopment must take into account proximity to existing \nuses, height and massing relationships, surrounding building character, street widths \nand functions, open spaces, desired land uses and view corridors. \nG.\t \tPreserve and Enhance Historic Character: Where appropriate, new developments \nshall build on historic and other cultural assets by recognizing the smaller patterns of \nthe townscape without being historicist. \nH.\t \tCreate Appropriate Transitions in Height, Bulk and Scale: New development must \nstrive to be compatible in scale with its surroundings. Elements which contribute to \nthe perceived scale of new construction are addressed in the context of specific site \nconditions, as well as in relationships between sub-districts.\nI.\t \tIncrease Transportation Accessibility: Building, site and street design shall increase \naccessibility to and within the Downtown Plan area by encouraging transportation by \nmany modes including pedestrians, automobiles, bicycles, transit and other vehicles in \na functional and visually attractive manner.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": "[4.11]-7\nCity of Gresham Development Code\n(06/22)\n3RD\nMAIN\nPOWELL\nDIVISION\n4TH\nBURNSIDE\n8TH\nKELLY\nHOOD\n1ST\n9TH\n18TH\nROBERTS\n2ND\nLINDEN\nTH\nH\n12TH\n13TH\nMILLER\n16TH\n17TH\nNORMAN\nELLIOTT\nLIBERTY\n20TH\n14TH\n10TH\nVISTA\nBEECH\n7TH\nWALTERS\n19TH\nFAIRVIEW\nEVELYN\nJUNIPER\nMORLAN\nVICTORY\nSPRUCE\nMIGNONETTE\nBLAINE\nMAPLE\n18TH\n4TH\nH\nKELLY\nJUNIPER\nLIBERTY\n11TH\nLINDEN\n14TH\n20TH\n20TH\nH\nELLIOTT\n6TH\nVICTORIA\n19TH\nJUNIPER\n4TH\n2ND\n6TH\n2ND\n5TH\n19TH\n18TH\n2ND\nLINDEN\nNORMAN\nROBERTS\nAVA\n2ND\n10TH\nVISTA\nAVA\nDTM\nDCC\nDCL\nDCL\nDMU\nDEM\nDRL-2\nDRL-1\nDTM\nDRL-2\nDRL-1\nHOGAN\nEASTMAN\nBURNSIDE\nCLEVELAND\n20TH\nMAIN\n18TH\n1/4 miles\nDowntown Sub-Districts Characteristics \nDevelopment within each Sub-District is governed by a different combination of basic \nregulations such as uses, height limits, allowable floor area ratios and densities. \nMap 4.1109:  Downtown Sub-Districts\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": "[4.11]-8\n(06/22)\nCity of Gresham Development Code \nDowntown Sub-Districts Characteristics \n4.1110 Downtown Commercial Core (DCC):\nThe DCC is the City’s long-standing center and features unique local businesses, small-\nscale storefronts, and intimate sidewalks. Main Avenue has a small-scale, walkable quality \nappreciated by residents and visitors. This sub-district is intended to preserve this small-\nscale character on Main Avenue while encouraging an active, engaging mix of old and new \nuses. \nThe DCC sub-district allows a wide range of uses – retail, service, office and residential – \nthat will help create a vibrant sub-district that is active all day and much of the night. \n4.1111 Downtown Mixed Use (DMU):\nThis sub-district is intended to evolve over time from a shopping center largely organized \naround automobile trips and parking into a mixed-use sub-district with jobs, housing and \ncommercial opportunities. This full-service sub-district will contain new shopping streets, \npublic spaces and better pedestrian and automobile connections to the DCC sub-district \nand to the Civic Neighborhood. \nThis DMU sub-district allows a mixture of employment, retail, office and residential uses in \na very dense, compact urban form by permitting the most intense, tallest development in \nDowntown.\n4.1112 Downtown Transit Mid-Rise (DTM):\nThis mixed-use sub-district provides a mid-rise, mixed-use character in the center of \nDowntown near the light-rail stations. Because of its proximity to transit, this sub-district \nprovides access opportunities for those who live Downtown to use buses and MAX light \nrail to get to jobs and other destinations. It also supports the creation of employment uses \nDowntown so those who live outside the Downtown have opportunities and easy access \nto work Downtown. \nThis sub-district supports the continued presence of institutional uses, such as \ngovernment offices. It also allows a mix of residential, commercial and employment uses \nat a mid-rise intensity.\n4.1113 Downtown Employment Mid-Rise (DEM):\nThis mixed-use area is envisioned as one that could support significant employment, \nwhether retail or office in nature. It has excellent access to light rail as well as several \nmajor streets – Hogan, Burnside, and Division. Buildings are allowed to have multiple \nstories with larger footprints here to accommodate market demand. \nThis sub-district allows for a substantial amount of general office, financial, corporate and \ninstitutional uses that employ large numbers of people. It also allows a significant retail \npresence and residential uses.\n4.1114 Downtown Residential Low-Rise-1 (DRL-1):\nThis mixed-use sub-district will encourage some residential areas to gently transform \ninto a broader mix of residential uses. This sub-district is intended to create distinctive, \nwalkable neighborhoods within a short distance of transit and the Downtown core.\nThe sub-district encourages single detached dwellings to remain and allows duplexes, \ntriplexes, quadplexes, townhouses, and cottage clusters, but not multifamily. This sub-\ndistrict also will allow small-scale commercial uses only on certain streets where it is most \nappropriate. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": "[4.11]-9\nCity of Gresham Development Code\n(06/22)\n4.1115 Downtown Residential Low-Rise-2 (DRL-2):\nThis mixed-use sub-district will allow a gradual transformation into more varied and full-\nservice residential neighborhoods that can take advantage of their proximity to transit and \nnearby shopping and job centers. \nThis predominantly residential sub-district will allow single detached dwellings to remain \nwhile also allowing duplexes, triplexes, quadplexes, townhouses, cottage clusters, small-\nscale multifamily, and small-scale commercial activities.\n4.1116 Downtown Commercial Low-Rise (DCL):\nThis sub-district contains major corridors with the types of businesses, services, stores, \nand offices that demand a higher level of automobile access to employees and customers. \nStructures may be single use and aimed at regional traffic. This sub-district will still serve \nthis role, but the corridors will become more balanced over time to meet the needs \nof pedestrians as well as automobile traffic. The sub-district’s character will evolve as \nbuildings and more walkable streets become prominent and parking is located to the side \nor rear or properties. This sub-district allows commercial, residential, and employment \nuses, including auto-related uses such as service stations, auto repair, and car washes. \n4.1117 Split-Zoned Development Sites:\nWhen a single development site in the Downtown Plan sub-district is affected by two or \nmore of the following sub-districts, the entire site may be developed in conformance with \npermitted uses and development standards of any of those sub-districts applying to the \nsite: DCC, DMU, DTM, DEM, DRL-1, DRL-2, and DCL.\n4.1120 Permitted Land Uses:\nTable 4.1120 lists the types of land uses that are permitted in the Downtown Plan District.\n1.\t P = Permitted uses.\n2.\t L = Use is permitted, but it is limited in the extent to which it may be permitted.\n3.\t \tNP = Use not permitted.\n4.\t SUR = Use permitted subject to a Special Use Review.\nEach of these uses must comply with the land-use district standards of this section and all \nother applicable requirements of the Community Development Code.\n“NP” is only used if the use category is “P” or “L” in another sub-district within the \nDevelopment Code. Other categories not listed also are not permitted. Existing uses \nthat are not permitted in a Downtown sub-district may continue in existence, subject to \nprovisions of Development Code Section 8.0200: Existing and Nonconforming Uses and \nDevelopment. Community Service uses are permitted as indicated in Table 4.1120 and as \nprovided in Section 8.0100: Community Services. \nIn addition to permitted commercial and employment land use types listed in Table \n4.1120, the Manager may permit other commercial and employment uses found to be \nsupportive of, and consistent with, the Downtown Plan District (Section 4.1100), with the \nfindings and conclusions of the Gresham Downtown Plan, and with applicable land use \npolicies and implementation strategies of the Community Development Code.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": "[4.11]-10\n(01/23)\nCity of Gresham Development Code \nTable 4.1120: Permitted Uses in the Downtown Plan District\nUSES\nDCC\nDMU\nDTM\nDEM\nDRL-1\nDRL-2\nDCL\nRESIDENTIAL\nSingle Detached Dwelling \nNP \nNP \nNP \nNP \nP \nP \nNP \nDuplex \nL1\nL1\nL1\nNP\nP \nP \nNP \nTriplex\nL1\nNP\nL1\nNP\nP\nP\nNP\nQuadplex\nL1\nNP\nL1\nNP\nP\nP\nNP\nTownhouse\nP \nL2\nP \nP \nP \nP \nP \nCottage Cluster\nNP\nNP\nNP\nNP\nP\nP\nNP\nMultifamily20\nP3 \nP3 \nP3 \nP3 \nL3 \nP3 \nP3 \nElderly Housing\nSUR\nSUR\nSUR\nSUR\nNP\nSUR\nSUR\nManufactured Dwelling Park\nNP\nNP\nNP\nNP\nNP\nNP\nNP\nResidential Facility \nP \nP \nP \nP \nNP \nP \nP \nResidential Home \nNP \nNP \nNP \nNP \nP \nP \nNP \nAffordable Housing\nP4\nP4\nP4\nP4\nP4\nP4\nP4\nCOMMERCIAL\nAuto-Dependent Use \nNP \nNP \nNP \nNP \nNP \nNP \nL3\nBusiness and Retail Service and Trade\nP\nP\nP\nP\nL6 \nL7\nP\nClinics \nP \nP \nP \nP \nL6\nL7\nP \nCommercial Parking\nL8\nL8\nL8\nL8\nNP\nL8\nL8\nDaycare Facilities\nP\nP\nP\nP\nSUR\nSUR\nP\nLive/work \nP \nP \nP \nP \nNP \nP \nP \nMajor Event Entertainment\nSUR\nSUR\nSUR\nSUR\nNP\nNP\nSUR\nMini-Storage Facilities\nNP\nNP\nNP\nNP\nNP\nNP\nNP\nOutdoor Commercial \nNP \nNP \nNP \nNP \nNP \nNP \nL9 \nINDUSTRIAL\nConstruction \nNP \nNP\nNP\nNP\nNP \nNP\nNP\nExclusive Heavy Industrial Uses \nNP \nNP\nNP\nNP\nNP \nNP\nNP\nIndustrial Office\nNP \nNP\nNP\nNP\nNP \nNP\nNP\nInformation Services\nP \nP\nP\nP\nNP \nNP\nP\nManufacturing\nL10\nL10\nL10\nL10\nNP \nNP\nL10\nMiscellaneous Industrial \nNP \nNP\nNP\nNP\nNP \nNP\nNP\nTrade Schools\nNP \nNP\nNP\nNP\nNP \nNP\nNP\nTransportation/Distribution\nNP \nNP\nNP\nNP\nNP \nNP\nNP\nWarehousing/Storage\nNP11\nNP11\nNP11\nNP11\nNP11\nNP11\nNP11\nWaste Management\nNP \nNP\nNP\nNP\nNP \nNP\nNP\nWholesale Trade\nNP \nNP\nNP\nNP\nNP \nNP\nNP\nINSTITUTIONAL USES\nCivic Uses\nSUR\nSUR\nSUR\nSUR\nSUR\nSUR\nSUR\nCommunity Services\nSUR\nSUR\nSUR\nSUR\nSUR\nSUR\nSUR\nMedical\nSUR\nSUR\nSUR\nSUR\nSUR\nSUR\nSUR\nParks, Open Spaces and Trails\nL/SUR12\nL/SUR12\nL/SUR12\nL/SUR12\nL/SUR12\nL/SUR12\nL/SUR12\nReligious Institutions\nP\nP\nP\nP\nSUR\nSUR\nP\nSchools\nP/SUR13\nP/SUR13\nP/SUR13\nP/SUR13\nSUR\nSUR\nP/SUR13\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": "[4.11]-11\nCity of Gresham Development Code\n(01/23)\n4.1120 Table Notes\nThe following describe limitations on use categories marked as limited or special use \nreview in Table 4.1120. \n1.\t \tDuplexes are allowed in the following situations provided density standards are \nmet:\na.\t In DTM and DMU on a lot of record that is 6,500 square feet or smaller and \nhas 70 feet of street frontage or less; or \nb.\t In DCC north of Eighth Street on a lot of record that is 7,600 square feet or \nsmaller and has 70 feet of street frontage or less.\n2.\t Townhouse structures are prohibited in DMU within 320 feet of the center line \nof Eastman Parkway.\n3.\t \tConversion of a hotel or motel to an emergency shelter or to affordable housing \nis permitted. See Section 10.0420.\n4.\t \tAffordable Housing development is permitted. See Section 10.1700.\n5.\t \tSee limits on auto sales and service in the Outdoor Commercial configuration in \nSection 4.1120 Table Note 7.\n6.\t Clinics and Business and Retail Service and Trade: The total floor area of all \nthese uses combined is limited to 5,000 square feet per site in DRL-1, and these \nuses are limited to lots with frontage on Main Avenue or Ava Avenue. In a \nmixed-use building, the total square footage of Clinics and Business and Retail \nService and Trade cannot exceed 5,000 square feet in DRL-1. \n7.\t Clinics and Business and Retail Service and Trade: The total floor area of all \nthese uses combined is limited to 7,500 square feet per site in DRL-2. In a \nmixed-use building, the total square footage of Clinics and Business and Retail \nService and Trade cannot exceed 7,500 square feet in DRL-2. \n8.\t Structured parking only as per Section 9.0852(B)(5). \n9.\t Outdoor Commercial is limited to DCL and allowed only if: \na.\t The site has frontage on Burnside Road or Hogan Road; or \nb.\t The site has frontage on Powell Boulevard east of Cleveland Avenue and \nwest of Hogan Road and the use is not auto sales and service (auto sales \nand service is allowed if not in a configuration that meets the definition of \n“Outdoor Commercial”); and\nTable 4.1120: Permitted Uses in the Downtown Plan District\nUSES\nDCC\nDMU\nDTM\nDEM\nDRL-1\nDRL-2\nDCL\nRENEWABLE ENERGY16\nSolar Energy Systems\nL/SUR17\nL/SUR17\nL/SUR17\nL/SUR17\nL17\nL17\nL/SUR17\nWind Energy Systems\nL/SUR18\nL/SUR18\nL/SUR18\nL/SUR18\nL18\nL18\nL/SUR18\nBiomass Energy Systems\nL19\nL19\nL19\nL19\nL/SUR19\nL/SUR19\nL19\nGeothermal Energy Systems\nL/SUR20\nL/SUR20\nL/SUR20\nL/SUR20\nL20\nL20\nL/SUR20\nMicro-Hydro Energy Systems\nL21\nL21\nL21\nL21\nL21\nL21\nL21\nOTHER\t\nBasic Utilities\n\t\nMinor basic utilities\n\t\nMajor basic utilities\nP\nSUR\nP\nSUR\nP\nSUR\nP\nSUR\nP\nL/SUR14\nP\nL/SUR14\nP\nSUR\nHeliports\nSUR15\nSUR15\nSUR15\nSUR15\nSUR15\nSUR15\nSUR15\nWireless Communications Facilities\nSUR\nSUR\nSUR\nSUR\nSUR\nSUR\nSUR\nTemporary, Intermittent & Interim \nUses \nP \nP \nP \nP \nP \nP \nP \nMarijuana Businesses \nNP\nNP\nNP\nNP\nNP\nNP\nNP\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": "[4.11]-12\n(01/23)\nCity of Gresham Development Code \nc. \t The amount of total site area covered by buildings shall amount to no less \nthan 25 percent of the amount of site area used for outdoor storage or \ndisplay; and\nd.\t Screening shall be provided along any portion of the site’s frontage which \nis not occupied by a building or parking area, in a manner which satisfies \nstandards for Landscape/Screening along a Public Right-of-Way, as contained \nin Section 9.0823(C)(3). \n10.\tManufacturing uses shall be compatible with other Downtown uses and are \nallowed only if all of the following conditions are met: \na.\t The manufacturing component shall be allowed in conjunction with an \nallowed Business and Retail Service and Trade use; and \nb.\t In DCC, DMU, and DTM, the manufacturing component shall occupy no \nmore than 10,000 square feet of floor area per site. In DEM and DCL, the \nmanufacturing component shall occupy no more than 20,000 square feet of \nfloor area per site; and\nc.\t The emission of air pollutants and odorous gasses and changes in temperature \ndetectable by the human senses without the aid of instruments at any point \nbeyond the property line is prohibited; and\nd.\t Electrical disturbances that interfere with the normal operation of equipment \nor instruments on adjacent properties are prohibited; and\ne.\t Operations that produce heat or glare shall be conducted entirely within an \nenclosed building; and\nf.\t \tLoud, unnecessary or unusual noise that endangers health, peace or safety is \nprohibited.\n11.\tThe prohibition on warehousing and storage as a stand-alone use does not \npreclude the on-site storage of materials associated with another use Downtown, \nsuch as the storage of goods and supplies as an accessory use to another allowed \nuse. The prohibition on distribution does not preclude the distribution of goods \nproduced on-site to locations off-site as an accessory use to another allowed use \nor the delivery of goods to an allowed use.\n12.\t Golf courses are not permitted.\n13.\t Schools are permitted without a Special Use Review if they are occupying an \nexisting commercial space. Schools must pursue a Special Use Review if they are \nproposing new construction.\n14.\t Electrical generating facilities and sewage treatment plants are not permitted \nthrough the Special Use Review process.\n15.\t Permitted as an accessory use to Medical and Civic Uses through the Special Use \nReview.\n16.\tSee Section 10.0900 for additional standards that apply.\n17.\tFor limitations, see Section 4.1134 Solar Energy System Standards for Downtown \nDistricts.\n18.\tFor limitations, see Section 4.1135 Wind Energy System Standards for Downtown \nDistricts.\n19.\tFor limitations, see Section 4.1136 Biomass Energy System Standards for \nDowntown Districts.\n20.\tFor limitations, see Section 4.1137 Geothermal Energy System Standards for \nDowntown Districts.\n21.\tFor limitations, see Section 4.1138 Micro-Hydro Energy System Standards for \nDowntown Districts.\n22.Transitional housing for individuals transitioning from incarceration facilities are \nsubject to a Special Use Review\n4.1121 Required First-floor uses \nA.\t In the following locations, a minimum of 75 percent of the street-facing ground-floor \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": "[4.11]-13\nCity of Gresham Development Code\n(01/23)\nlevel shall have Commercial uses or Civic uses that generate a significant number of \ncustomer visits:\n1.\t The north side of Powell Boulevard between Miller and Roberts. \n2.\t Main Avenue: Main between Powell and Fourth.\n3.\t Third Avenue between Main and Hood and the north side of Third Avenue \nbetween Hood and Kelly.\n4.1130 Downtown Plan Sub-District Standards \nTable 4.1130 summarizes development standards that apply in the Downtown Plan \nDistrict. The standards contained in this Table are supplemented by referenced \nsub-sections of 4.1100 which provide additional clarification and guidance. Existing \ndevelopments that do not meet the standards specified for a particular sub-district \nmay continue in existence and be altered, subject to provisions of Section 8.0200, \nExisting and Nonconforming Uses and Development. There are two key factors of \ndevelopment potentially allowable on parcels and development sites for each district \nwith the Downtown: building height and floor area ratio. To determine the development \npotential of a property, the FAR number is multiplied by the site area. For example: A \nsite area of 20,000 square feet multiplied by an FAR of 3.0 yields 60,000 square feet of \nfloor area that can be built on that site.\nA.\t Development on a site must achieve at least the Minimum Floor Area Ratio and can \nbuild up to the Maximum Floor Area Ratio. \nB.\t Additional FAR, shown in the Maximum Floor Area Ratio with Bonuses column, \ncan be achieved by including bonus elements and attributes (described in Section \n4.1131). Multiple bonus elements can be used in combination to achieve the \nmaximum FARs listed in the Maximum Floor Area Ratio with Bonuses column \nin Table 4.1130. Each bonus element can be used only once, unless otherwise \nindicated in the bonus element descriptions. This method allows for many \ncombinations of uses, intensities and different features within each development.\n1.\t With bonuses, residential-only buildings can achieve a maximum FAR up to \nwhat is shown in the Residential column under Maximum Floor Area Ratio \nwith Bonuses. Maximum heights cannot be exceeded in the DRL-1 and DRL-2 \ndistricts. \n2.\t With bonuses, buildings that do not include a residential use can achieve \na maximum FAR up to what is shown in the Non-residential column under \nMaximum Floor Area Ratio with Bonuses.\n3.\t With bonuses, buildings that combine both residential and non-residential uses \ncan achieve a maximum FAR up to what is shown in the combined column under \nMaximum Floor Area Ratio with Bonuses.\nC. \tFor purposes of minimum floor-area-ratio calculations in DCC, DMU and DTM, \napplicants may include the following in the ground-level floor area up to a total of \n1,000 square feet or 10 percent of the site, whichever is larger: \n1.\t Publicly accessible open space. \n2.\t Required minimum setbacks. \n3.\t Area removed from the first-floor building footprint to create corner features \nto comply with Section 4.1151(B)(8). For example, a beveled corner will have a \nslightly smaller footprint than a 90-degree corner because of the bevel. \n4.\t Areas between the minimum and maximum front setbacks for Commercial, \nIndustrial and Institutional uses that are provided for usable, pedestrian-\noriented uses such as walkways and outdoor dining areas.\nD. \tFor purposes of minimum floor-area ratio calculations in all sub-districts, the \nfollowing may be counted as ground-level floor area. \n1.\t Utility easements. \n2.\t Structured parking at grade or above.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": "[4.11]-14\n(01/23)\nCity of Gresham Development Code \nTable 4.1130\nDCC\nDMU\nDTM\nDEM\nDRL-1\nDRL-2\nDCL\nMain \nsee \n4.1130(A)\nMaximum Height \n1,2,3,4,5 (feet)\n85\n45 1\n125\n85\n70\n35\n50\n65\nMinimum Floor Area Ratio for \nnon-residential and mixed-use \nprojects (base) 1,6,9\nSee Map 4.1130: Minimum Floor Area Ratio\nMaximum Floor Area Ratio 6,9\n3.0\n1.5 1\n3.5\n3.0\n2.5\n1.0\n1.0\n1.0\nMaximum Floor Area \nRatio with bonuses\n(see 4.1131) 6,9\nResiden­\ntial\n3.5\n2.0 1\n5.0\n3.5\n3.0\n2.0\n2.0\n2.0\nNon-\nresidential\n4.5\n3.0 1\n6.0\n4.5\n3.0\n3.0\n3.0\n2.5\nCombined\n5.0\n4.0 1\n7.0\n5.0\n5.0\n4.0\n4.0\n3.0\nMinimum Residential Net Density \nfor all residential projects (not \nmixed use) (units per acre)8\n(See definition of Net Density in Article 3)\n        17\n20\n20\n17\n8.71\n8.71\n17\nMaximum Residential Net Density \n(units per acre)\n(See definition of Net Density in Article 3)\nNo maximum\nNo \nmaximum\nNo \nmaximum\nNo \nmaximum\nTownhouse:\n25\nAll other \nuses: 12.459\nNo \nmaximum\n609\nStreet types\nUrban \nBoulevard\n(in feet)\nDowntown \nLocal\n(in feet)\nBeech\n(in feet)\nMain\n(in feet)\nStanley\n(in feet)\nCleveland\n(in feet)\nCommercial, Industrial, Institutional (excluding Parks, Open Spaces and Trails) (including \nmixed-use building with Commercial or Institutional uses on the first floor)\nMinimum \nBuilding \nSetbacks11 \nFront: 0\nSide: 0 12\nRear: 0 12\nAlley: 3\nFront: 0\nSide: 0 12\nRear: 0 12\nAlley: 3\nFront: 0\nSide: 0 15 \nRear: 0 12\nAlley: 3\nFront: 0\nSide: 0 15 \nRear: 0\nAlley: 3\nFront: 0\nSide: 0 15\nRear: 0\nAlley: 3\nFront: 5\nSide: 0 12, 15\nRear: 0  \nAlley: 3\nMaximum \nBuilding \nSetbacks6 \nFront: 5 17 \nFront: 5 17\nFront: 5 17\nFront: 5 17\nFront: 5 17\nFront: 10 17\nMultifamily\nMinimum \nBuilding \nSetbacks 11\nFront: 10\nSide: 0 12 \nRear: 5 12 \nAlley: 3\nFront: 0\nSide: 0 12 \nRear: 5 12 \nAlley: 3\nFront: 5\nSide: 0 15 \nRear: 5\nAlley: 3\nFront: 0\nSide: 0 15 \nRear: 0\nAlley: 3\nFront: 0\nSide: 0 15 \nRear: 0\nAlley: 3\nFront: 5\nSide: 0 12, 15 \nRear: 5 12 \nAlley: 3\nMaximum \nBuilding \nSetbacks\nFront: 20 13, 17 \nFront: 10 13, 17 Front: 10 17 \nFront: 5 17\nFront: 10 13, 17 Front: 20 17\nTable 4.1130 Continued\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": "[4.11]-15\nCity of Gresham Development Code\n(01/23)\nStreet types\nUrban \nBoulevard\n(in feet)\nDowntown \nLocal\n(in feet)\nBeech\n(in feet)\nMain\n(in feet)\nStanley\n(in feet)\nCleveland\n(in feet)\nTownhouse in DCC, DMU, DTM, DEM, and DCL\nMinimum \nBuilding \nSetbacks11 \nFRONT\nFaçade: 10\nPorch: 6\nGarage: 10 16 \nSIDE14 \nInterior: 5\nCommon: 0\nStreet porch: 5\nREAR\nNo alley: 10\nAlley: 3\nFRONT\nFaçade: 5\nPorch: 3\nGarage: 5 16 \nSIDE14 \nInterior: 5\nCommon: 0\nStreet porch: 5\nREAR\nNo alley: 10\nAlley: 3\nFRONT\nFaçade: 5\nPorch: 3\nGarage: 5 16 \nSIDE14 \nInterior: 5\nCommon: 0\nStreet porch: 5\nREAR\nNo alley: 10\nAlley: 3\nNot \nallowed \non this \nstreet \ntype.\nFRONT\nFaçade: 5\nPorch: 3\nGarage: 5 16 \nSIDE14 \nInterior: 5\nCommon: 0\nStreet porch: 5\nREAR\nNo alley: 10\nAlley: 3\nFRONT\nFaçade: 5\nPorch: 3\nGarage: 5 16\nSIDE14 \nInterior: 5\nCommon: 0\nStreet porch: 5\nREAR\nNo alley: 10\nAlley: 3\nMaximum \nBuilding \nSetbacks 6 \nFront: 20 13, 17 \nGarage: 5\nFront: 20 13, 17 \nGarage: 5\nFront: \n15 13, 17 \nGarage: 5\nFront: \n15 13, 17 \nGarage: 5\nFront: \n20 13, 17 \nGarage: 5\nSingle detached, duplex, triplex, and quadplex dwellings in any district, and Townhouse and Cottage Cluster in DRL-1 and \nDRL-2\nMinimum \nBuilding \nSetbacks 11 \nFRONT\nFaçade: 10\nPorch: 6\nGarage: 20\nSIDE\nInterior: 5\nStreetside: 10\nStreet porch: 6\nGarage: 5\nCommon \n(Townhouse): 0\nREAR\nNo alley: 10\nAlley: 6\nFRONT\nFaçade: 10\nPorch: 6\nGarage: 20 18\nSIDE\nInterior: 5\nStreet-side: 10\nStreet porch: 6\nGarage: 5\nCommon \n(Townhouse): 0\nREAR\nNo alley: 10 18\nAlley: 6 \nFRONT\nFaçade: 10\nPorch: 6\nGarage: 20 18\nSIDE\nInterior: 5\nStreet-side: 10\nStreet porch: 6\nGarage: 5\nCommon \n(Townhouse): 0\nREAR\nNo alley: 10 18\nAlley: 6 \nN/A\nN/A\nFRONT\nFaçade: 10\nPorch: 6\nGarage: 20\nSIDE\nInterior: 5\nStreet-side: 10\nStreet porch: 6\nGarage: 5\nCommon \n(Townhouse): 0\nREAR\nNo alley: 10\nAlley: 6\nMaximum \nBuilding \nSetbacks\nFront: 20 13\nFront: 20 13\nFront: 15 13\nN/A\nN/A\nFront: 20 13\nMinimum \nlot size\nSingle detached and middle housing in DRL-1 and DRL-2: 4,000 square feet\nDuplex, triplex, and quadplex in DCC, DTM, DMU, DEM: 5,000\nTownhouse: None\nMinimum \nlot \ndimensions\nWidth at building line, interior lot: 35 feet single detached, duplex, triplex, and quadplex; 16 ft. Townhouse \nWidth at building line, corner lot: 40 feet single detached, duplex, triplex, and quadplex; 20 ft. Townhouse\nDepth, interior lot: 70 feet\nDepth, interior lot: 70 feet\nWidth at building line, Townhouse: 16 ft. interior, 20 ft. corner \nMinimum \nstreet \nfrontage\n35 feet, except corner lots shall be 40 feet as measured from the corner radius end point to the property \ncorner. A reduction in the minimum street frontage may be approved when the applicant can document \ncompliance with Section 10.1520 of the Community Development Code\nTownhouse: 16 ft. interior, 20 ft. corner \nTable 4.1130 (continued)\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": "[4.11]-16\n(01/23)\nCity of Gresham Development Code \n4.1130 Table Notes: \n1.\t The maximum height and FAR for the portion of development sites within 110 \nfeet of the center line of Main Avenue between Powell Boulevard and Fifth \nStreet are limited to those shown in Table 4.1130 for DCC - Main. A minimum \n10-foot building stepback on Main Avenue is required on all stories above 35 feet. \nAffordable housing development under Section 10.0420 may add the applicable \nheight bonus to the maximum height for DCC -Main and the building setback on \nMain Avenue.\n2.\t Floor heights by building type for new buildings:\na.\t Commercial/industrial/institutional uses: 12 feet minimum height between the \ntop of floor and the lowest structural element of the ceiling.\nb.\t Multifamily, Elderly Housing and Residential Facilities: 10 feet minimum height \nbetween the top of floor and the lowest structural element of the ceiling.\n3.\t Building heights in all Downtown sub-districts except DRL-1 and DRL-2 shall be \nallowed to exceed the maximum up to 8 feet to allow for architectural elements \nnot suitable for occupancy, such as parapet walls and pitched roofs. \n4.\t For developments abutting a land-use district where the maximum building height \nHOGAN\nEASTMAN\nBURNSIDE\nCLEVELAND\n20TH\nMAIN\n18TH\n3RD\nMAIN\nPOWELL\nDIVISION\n4TH\nBURNSIDE\n8TH\nKELLY\nHOOD\n1ST\n9TH\n18TH\nROBERTS\n2ND\nLINDEN\n6TH\nTH\n12TH\nH\n13TH\nMILLER\n16TH\n17TH\nNORMAN\nELLIOTT\nLIBERTY\n20TH\n14TH\n10TH\nVISTA\nBEECH\n7TH\nWALTERS\n19TH\nFAIRVIEW\nEVELYN\nJUNIPER\nMORLAN\nVICTORY\nSPRUCE\nMIGNONETTE\nBLAINE\nMAPLE\n18TH\n4TH\nTH\nKELLY\nJUNIPER\nLIBERTY\n11TH\nLINDEN\n14TH\n20TH\n20TH\n7T\nELLIOTT\n6TH\nVICTORIA\n19TH\nJUNIPER\nH\n4TH\n2ND\n6T\n2ND\n5TH\n19TH\n18TH\n2ND\nLINDEN\nNORMAN\nROBERTS\nAVA\n2ND\n10TH\nVISTA\nAVA\n1/4 miles\n0.7\n0.7\n0.5\n0.5\n0.7\n0.7\n0.5\n0.5\n0.4\n0.4\n0.4\n0.4\n0.2\n0.2\n0.35\n0.35\n0.35\n0.35\n00\n00\n0.25\n0.25\n0.35\n0.35\n0.35\n0.35\n0.35\n0.35\nMap 4.1130 Minimum Floor Area Ratio\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 17,
      "text": "[4.11]-17\nCity of Gresham Development Code\n(01/23)\n\t\nis 40 feet or less, the maximum building height within 50 feet of that low-height-\nlimit district or sub-district shall be 45 feet. Maximum building height shall \nbe 50 feet in DCC along the north side of Division Street. Affordable housing \ndevelopment under Section 10.0420 may add the applicable height bonus to \nthese maximum building heights.\n5.\t A height bonus applies to affordable housing development. See Section 10.1700.\n6.\t The following uses are exempt from minimum floor-area ratio and maximum \nsetback requirements:\na.\t Transit facilities such as bus shelters and storage/utility sheds;\nb.\t Parks, Open Space and Trails;\nc.\t Basic Utilities;\nd.\t Wireless Communication Facilities;\ne.\t Heliports;\nf.\t Portable classrooms;\ng.\t Cemeteries and mausoleums;\nh.\t Sewer and water utility structures such as storage reservoirs and pump \nstations; and\ni.\t Museums.\n7.\t Flag pole portions of lots, which allow access to the portions of the lot away from \nstreets, are not counted as part of the site size in floor-area ratio calculations. \nThe remainder of the lot not needed for access would be required to meet FAR \nrequirements. \n8.\t Minimum residential net density does not apply to affordable housing \ndevelopment. See Section 10.70.\n9.\t A density bonus applies to affordable housing development. See Section 10.1700.\n10.\tCivic Uses and schools that comply with Section 4.1151(A)(1)(d)(14) are exempt \nfrom maximum setback requirements.\n11.\tFor purposes of Table 4.1130 side setbacks:\na.\t Interior means interior side (not common wall)\nb.\t Common means interior side with common wall\nc.\t Street façade means streetside façade\nd.\t Street porch means streetside porch\ne.\t Garage means streetside garage face\n12.\tSide setback is 10 feet when side yard abuts DRL-1, DRL-2, LDR-5, LDR-7, TR or \nTLDR; rear setback is 10 feet when rear yard abuts DRL-1, DRL-2, LDR-5, LDR-7, TR \nor TLDR.\n13.\tCourtyard-type developments are exempted from maximum setbacks for that \nportion of the building or buildings having a courtyard area between it and the \nstreet.\n14.\tFor townhouses, the street façade and garage side setbacks shall be equal to the \nfront façade setback on the street type that applies to the side street. \n15.\tFor Commercial, Industrial, Institutional and Multifamily, the streetside setbacks \nshall be equal to the front façade setback on the street type that applies to the \nside street.\n16.\tTownhouses are encouraged to be accessed from a rear alleyway on all street \ntypes where townhouses are allowed. \n17.\tMaximum front setbacks do not apply on a site once all minimum building \nfrontage requirements of the street type have been satisfied. For example, if a \nstreet type requires that 75% of the frontage must be occupied by a building and \nthat requirement has been satisfied, other buildings can be constructed behind \nthat building beyond the maximum setback.\n18.\tIf rear and garage setbacks combine to leave less than 22 feet for a garage depth, \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 18,
      "text": "[4.11]-18\n(01/23)\nCity of Gresham Development Code \n\t\nthe Manager or Design Commission may reduce setbacks on a case-by-case basis \nto provide adequate room for a garage. First, the rear setback may be reduced \nby 5 feet to reach the 22-foot area for garage depth. If that is not sufficient, the \nManager or Design Commission may approve a maximum garage setback of 5 feet \nso the garage can be brought near the street.\n19.\t Encroachments may project into the public right-of-way provided that the \nencroachments are between 9 and 12 feet above the sidewalk height, subject to \nCity approval. They must not obstruct or prevent the placement of street trees or \nother improvements within the public right-of-way.\n4.1131. Bonus Elements:\nThe future vision for Downtown Gresham calls for a series of amenities that will lead to a \nmore livable and complete community. As a means of encouraging new development to \nincorporate these amenities, a series of development bonuses are included in the Code \nthat offer additional development potential in the form of floor area. Most projects will \nrequire a mixture of various elements. \nA.\t \tFor each of the following, an FAR increase of .5 shall be granted: \n1.\t LEED Silver Certification \nA development shall be LEED Silver Certified, according to criteria established by \nthe U.S. Green Building Council (USGBC). The applicant is responsible for providing \nLEED Silver Pre-Certification documentation and an annotated checklist to the \nCity to receive this bonus. The applicant also must provide documentation of \nLEED compliance 9 months after building occupancy and, if certification was not \nattained within 9 months, at the time of LEED certification or denial. \n2.\t Exterior Art Elements\nExterior art element(s) shall be equivalent to at least 1% of the total value of \nthe project’s construction cost. Such elements include but are not limited to \nfree-standing sculptures, bas-reliefs on walls, metalwork on walls and murals. \nDocumentation shall be provided of the construction value and the value of the \nart as appraised by an art appraiser. Art elements shall be visible to the public at \nall times and will be reviewed and approved for artistic merit by an arts review \nbody designated by the City. \n3.\t Water Feature(s)\nAny decorative water feature(s) shall be equivalent to at least 1% of the total \nvalue of the project’s construction costs. Documentation shall be provided of \nthe construction value and the cost of the water feature. Water features shall be \ndirectly accessible by the public or shall be visible to the public by being adjacent \nto a sidewalk or through-block connection.\n4.\t Alley Enhancements\nEnhancements to an alley shall include elements that create a pedestrian-friendly \nsetting such as stone, brick, unit pavers or textured paving; pedestrian-scaled \nlighting that could be wall-mounted; and landscape plantings such as vines \nsplayed on walls, trees, and irrigated planters that do not obstruct the movement \nof vehicles. The result shall be a place that appears safe, inviting and allow for \npublic enjoyment. Features such as entrances with canopies or stoops shall \nalso qualify so long as vehicular movement is maintained. Entrances to uses are \npermitted and encouraged.\n5.\t Canopy Over Sidewalks Where Not Otherwise Required\nA canopy shall be a permanent structure of steel and glass that projects over a \npublic sidewalk from a building face at least 5 feet in horizontal distance. The \nheight of a canopy above the sidewalk shall be between 8 and 12 feet. \t Canopies \nmay be intermittent or continuous provided the total length is at least 75% of the \nfrontage along the public sidewalk.\n6.\t Through-Block Connection\nA through-block connection is a pedestrian walkway and accompanying \nlandscaping that shall be at least 15 feet wide and extend along a property line or \nthrough a site to allow the public to pass from one street to either another street \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 19,
      "text": "[4.11]-19\nCity of Gresham Development Code\n(01/23)\n\t\nor an alley that is either parallel or perpendicular. The surface shall be accessible \nand consist of stone, unit pavers or textured concrete. The connection shall \ninclude pedestrian scaled lighting along the length at intervals no less than 50 \nfeet, that can either be wall-mounted or freestanding.\n7.\t Public Meeting Room\nThis is a room that shall be available to the community for meetings and events. \nThe size shall allow for at least 30 people to occupy it (300 square feet) and it \nshall be accessible either directly from the outside or from a controlled lobby that \nallows public access. There shall be no fees imposed on user groups, other than \nfor basic maintenance. The room shall have windows on at least one side.\n8.\t Multi-Modal Pathway:\nA multi-modal pathway shall be a pathway for the movement of pedestrians and \nbicyclists that is consistent with the City’s Parks and Recreation Master Plan and \napproved by the City staff.\n9.\t MAX Pathway Landscaping\nMAX pathway landscaping shall include landscape elements such as trees, \nshrubs, groundcovers and perennials that are consistent with the City’s Parks \nand Recreation Master Plan and approved by City staff. The entire development \nfrontage on the Pathway shall be landscaped. \nB.\t For each of the following, an FAR increase of 1.0 shall be granted:\n1.\t LEED Gold Certification \nA development shall be LEED Gold Certified, according to criteria established by \nthe U.S. Green Building Council (USGBC). The applicant is responsible for providing \nLEED Gold Pre-Certification documentation and an annotated checklist to the \nCity to receive this bonus. The applicant also must provide documentation of \nLEED compliance 9 months after building occupancy and, if certification was not \nattained within 9 months, at the time of LEED certification or denial. \n2.\t Structured Parking, On-Grade or Above-Grade\nAt least 80% of the parking shall be contained within a structure. The structure \nmay be part of the building or a separate structure. The structure shall be \ndesigned so that no parked cars are visible from the street and active commercial, \nemployment, mixed-use, live/work or residential uses occupy the street level if \nthe structure is on a street frontage. Any wall openings necessary for ventilation \nshall be screened with decorative metalwork or irrigated planters. Interior lighting \nshall be shielded to obscure visibility from outside.\n3.\t Public Plaza\nThis is an outdoor space available to the public at all times. It shall be equivalent \nto at least 2% of the interior floor area but shall not be less than 400 square feet. \nNo dimension shall be less than 10 feet. At least 70% of the area shall be paved \nwith stone, brick, unit pavers or textured paving. One tree (with a minimum \ncaliper of 2 ½ inches) shall be provided for every 600 square feet of area. A \nquantity of one bench or seating unit at least 24 inches wide shall be provided for \neach 100 square feet of area. Seating placement shall be artfully designed. If a \nproject includes more than one Public Plaza that meets these standards, each can \ngenerate bonus FAR.\n4.\t Public Greenspace\nThis is an outdoor space available to the public at all times. It shall be visible \nand accessible from a public sidewalk. It shall be equivalent to at least 2% of \nthe interior floor area but shall not be less than 400 square feet. No dimension \nshall be less than 10 feet. At least 70% of the space shall be planted with grass \nor walkable ground cover. One tree (with a minimum caliper of 2 ½”) shall be \nprovided for every 600 square feet of area. One seating unit, which may be in the \nform of benches or ledges at lest 24 inches wide, shall be provided for each 100 \nsquare feet of area. If a project includes more than one Public Greenspace that \nmeets these design standards, each can generate bonus FAR.\n5.\t Public Indoor Wintergarden\nThis is an interior space available to the public during normal business hours. It \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 20,
      "text": "[4.11]-20\n(01/23)\nCity of Gresham Development Code \n\t\nThis is an interior space available to the public during normal business hours. It \nshall be equivalent to at least 2% of the interior floor area but shall not be less \nthan 1000 square feet. No dimension shall be less than 20 feet. At least 50% of \nthe ceiling and at least one wall of the wintergarden shall be glass to allow for day \nlighting. One seating unit, which may be in the form of benches or ledges, shall be \nprovided for each 100 square feet of area.\nC.\t For each of the following, an FAR increase of 1.5 shall be granted:\n1.\t LEED Platinum Certification \nA development shall be LEED Platinum Certified, according to criteria established \nby the U.S. Green Building Council (USGBC). The applicant is responsible for \nproviding LEED Platinum Pre-Certification submittal documentation and an \nannotated checklist to the City to receive this bonus. The applicant also must \nprovide documentation of LEED compliance 9 months after building occupancy \nand, if certification was not attained within 9 months, at the time of LEED \ncertification or denial. \n2.\t Roof Garden\nRoof gardens shall provide usable outdoor space and gardening opportunities \nto the building residents, tenants and/or visitors. The roof garden shall occupy a \nminimum of 50% of the roof surface and result in an accessible rooftop terrace \nwith defined growing areas, seating and additional landscaping.\n3.\t Eco (Green) Roof\nA roof garden shall be a combination of landscape plantings and a growing \nmedium installed on a roof deck that performs functions of collecting, absorbing \nand filtering rain water and shall occupy a minimum of 50% of the roof surface. \nThe result shall be visually interesting and it shall accomplish environmental \nobjectives such as reducing the amount of run-off that reaches the ground, \nreducing heat gains and losses from the building, and recycling gray water. \n4.\t Underground Parking\nAt least 80% of the parking shall be contained within a structure that is below \ngrade with an energy efficient system developed to maintain the parking \nunderground. Any parking stalls not located in the below-grade structure shall \nbe within a structure that is on-grade or above-grade that shall meet the design \nstandards for the bonus feature of Structured Parking, On-Grade or Above-Grade.\n4.1132 Limitations on Outdoor Commercial Activity\nIn all Downtown sub-districts except the DCL sub-district, the amount of site area for \noutdoor display of materials for retail sales shall not exceed 15% of the ground-floor \narea of buildings on the site with which the display is associated or 1,000 square feet, \nwhichever is less.\n4.1133 Limitations on Drive-Throughs\nA.\t New drive-through facilities are limited in DCC, DMU and DEM and allowed only under \nthe following conditions:\n1.\t In DCC, no new drive-through facility can be constructed unless there was a legal \ndrive-through on the site on July 16, 2009. \n2.\t In all sub-districts where drive-throughs are limited:\na.\t Direct drive-through lane access onto an Urban Boulevard street type is \nprohibited; and\nb.\t The drive-through shall be part of a development that meets the minimum \nFAR requirements of the sub-district; and\nc.\t Drive-through stacking lanes and service areas shall not be located between \nthe street and the building and shall be located to the rear of the property; \nand\nd.\t Goods and services provided to drive-through customers also must be \navailable to pedestrian customers inside a building on the same site.\nB.  Drive-through uses are permitted in the DCL district.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 21,
      "text": "[4.11]-21\nCity of Gresham Development Code\n(06/22)\n4.1134 Solar Energy Standards for Downtown Districts\nSolar energy systems are limited in Downtown districts as follows:\nA.\t Scale.  \n1.\t \tDRL-1 and DRL-2:  Small scale solar energy systems are permitted in these districts.\n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Small and medium scale solar energy systems \nare permitted in these districts.  Large scale systems are permitted with a Special \nUse Review. \nB.\t Type. \n1.\t \tDRL-1 and DRL-2: Roof-top, flat-roof, integrated and ground-mounted solar energy \nsystems are permitted in these districts. \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Roof-top, flat-roof, integrated and ground-\nmounted solar energy systems are permitted in these districts.  \nC.\t Height.  \n1.\t \tDRL-1 and DRL-2:  The following limitations on maximum height apply to all solar \nenergy systems in these districts:   \na.\t \tRoof-top, Flat-roof and Integrated.  Solar energy systems shall not exceed the \ndistrict height limit in which they are located and shall not exceed the roof \nheight on which the system is installed.  \nb.\t \tGround-mounted.  Ground-mounted solar energy systems shall not exceed 6 \nfeet in height.\n2.\t \tDCC, DMU, DTM, DEM, and DCL:  The following limitations on maximum height \napply to all solar energy systems in these districts:   \na.\t \tRoof-top, Flat-roof and Integrated.  \n1.\t \tFor roofs that are flat or the horizontal portion of mansard roofs, the solar \nenergy systems on frames shall not exceed 10 feet above the roof height \non which the system is installed.  \n2.\t \tFor pitched, hipped or gambrel roofs, the solar energy system panels shall \nnot exceed 18 inches in height from the surface of the roof on which the \nsystem is installed.\nb.\t \tGround-mounted.  Ground-mounted solar energy systems shall not exceed 20 \nfeet in height.\nD.\t Setbacks and Yards.  \n1.\t \tDRL-1 and DRL-2:  Solar energy systems are not allowed in the required front, \nstreet-side or side setbacks and are not allowed in the front yard between the \nbuilding and the street in these districts.\n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Solar energy systems are not allowed in the \nrequired front or street-side setback.\n4.1135 Wind Energy Standards for Downtown Districts\nWind energy systems are limited in Downtown districts as follows:\nA.\t Scale\n1.\t \tDRL-1 and DRL-2:  Small scale wind energy systems are permitted in these districts.  \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Small and medium scale wind energy systems \nare permitted in these districts.  Large scale systems are permitted with a Special \nUse Review.\nB.\t Type.  \n1.\t \tDRL-1 and DRL-2:  Roof-top wind energy systems are permitted in these districts.  \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Roof-top and ground-mounted wind energy \nsystems are permitted in these districts.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 22,
      "text": "[4.11]-22\n(06/22)\nCity of Gresham Development Code \nC.\t Height.  \n1.\t \tDRL-1 and DRL-2:  The following limitations on maximum height apply to all \nwind energy systems in these districts:   \na.\t \tRoof-top.  Wind energy systems shall not exceed the district height limit \nin which they are located and shall not exceed 10 feet above the height \nof the roof on which the system is installed.  \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  The following limitations on maximum \nheight apply to all wind energy systems in these districts:   \na.\t \tRoof-top.  The height of roof-top wind energy systems shall not exceed \na value equal to the building height when the building height is 45 feet \nor less.  For buildings which exceed 45 feet in height, the wind energy \nsystem shall not exceed 45 feet maximum.      \nb.\t \tGround-mounted.  The height of ground-mounted wind energy systems \nshall not exceed 45 feet as measured from the grade at the base of the \nequipment to the top of the system.  The height limit of 45 feet can be \nexceeded up to 110 feet with a Special Use Review. \nD.\t Setbacks and Yards.  \n1.\t \tDRL-1 and DRL-2:  Wind energy systems are not allowed in the required \nfront, street-side, side or rear setbacks or in any yards in these districts.\n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Wind energy systems are not allowed in the \nrequired front, street-side, side or rear setbacks and are not allowed in the \nfront yard or street-side yard between the building and the street in these \ndistricts.\n4.1136 Biomass Energy Standards for Downtown Districts\nBiomass energy systems are limited in Downtown districts as follows:\nA.\t Scale.\n1.\t \tDRL-1 and DRL-2:  Small scale biomass energy systems are permitted in these \ndistricts with a Special Use Review.  \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Small scale biomass energy systems are \npermitted in these districts.  \nB.\t Type.  \n1.\t \tDRL-1 and DRL-2:  Non-hazardous biomass systems are permitted in these \ndistricts.  \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Non-hazardous biomass systems are \npermitted in these districts.  \nC.\t Height.\n1.\t \tDRL-1 and DRL-2:  Biomass energy systems shall not exceed the maximum \ndistrict height limits in these districts. \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Biomass energy systems shall not exceed \nthe maximum district height limits in these districts.\nD.\t Setbacks and Yards.  \n1.\t \tDRL-1 and DRL-2:  Biomass energy systems are not allowed in the required \nfront, street-side, side or rear setbacks, and are not allowed in the front or \nstreet-side yards between the building and the street, or in the side yards in \nthese districts.\n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Biomass energy systems are not allowed \nin the required front, street-side, side or rear setbacks and are not allowed \nin the front yard or street-side yard between the building and the street in \nthese districts.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 23,
      "text": "[4.11]-23\nCity of Gresham Development Code\n(06/22)\n4.1137 Geothermal Energy Standards for Downtown Districts\nGeothermal energy systems are limited in Downtown districts as follows:\nA.\t Scale.  \n1.\t \tDRL-1 and DRL-2:  Small scale geothermal energy systems are permitted in these \ndistricts.\n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Small scale geothermal energy systems are \npermitted in these districts.  Large scale systems are permitted with a Special Use \nReview.    \nB.\t Type. \n1.\t \tDRL-1 and DRL-2:  Closed-loop geothermal energy systems that are not in any well \nfield protection areas are permitted in these districts.  \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Closed-loop geothermal energy systems that are \nnot in any well field protection areas are permitted in these districts.  \nC.\t Height\n1.\t \tDRL-1 and DRL-2:  Geothermal systems shall not exceed the maximum district \nheight limits in these districts.  \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Geothermal systems shall not exceed the \nmaximum district height limits in these districts. \nD.\t Setbacks and Yards.  \n1.\t \tDRL-1 and DRL-2:  Geothermal systems are not allowed in the required front, \nstreet-side, side or rear setbacks in these districts, except that small geothermal \nheating and cooling units such as heat pumps, can project into the setbacks per \nSection 9.0900 Projections.  \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Geothermal systems are not allowed in the \nrequired front, street-side, side or rear setbacks in these districts, except that \nsmall geothermal heating and cooling units like heat pumps can project into the \nsetbacks per Section 9.0900 Projections.  \n4.1138 Micro-Hydro Energy Standards for Downtown Districts\nMicro-hydro energy systems are limited in Downtown districts as follows:\nA.\t Scale.  \n1.\t \tDRL-1 and DRL-2:  Small scale micro-hydro energy systems are permitted in these \ndistricts.\n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Small scale micro-hydro energy systems are \npermitted in these districts.\nB.\t Type.  \n1.\t \tDRL-1 and DRL-2:  In-pipe micro-hydro energy systems such as systems within \nwater, stormwater or wastewater pipe are permitted in these districts.  \n2.\t \tDCC, DMU, DTM, DEM, and DCL: In-pipe micro-hydro energy systems such as \nsystems within water, stormwater or wastewater pipe are permitted in these \ndistricts.   \nC.\t Height.  \n1.\t \tDRL-1 and DRL-2:  Generally the district height limits apply.  However, in-pipe \nsystems may exceed the district height limit as allowed for mechanical equipment \nin these districts.  If supplemental equipment structures accompany the in-pipe \nsystems, then the district height limit would apply.  \n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Generally the district height limits apply in these \ndistricts.  However, in-pipe systems may exceed the district height limit as allowed \nfor mechanical equipment.  If supplemental equipment structures accompany the \nin-pipe systems, then the district height limit would apply.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 24,
      "text": "[4.11]-24\n(06/22)\nCity of Gresham Development Code \nD.\t Setbacks and Yards.  \n1.\t \tDRL-1 and DRL-2:  Micro-hydro energy systems contained within piping are allowed \nand pipe can run within the required setbacks in these districts.  However, if \nsupplemental equipment structures accompany the in-pipe systems, then the district \nsetbacks limits apply.\n2.\t \tDCC, DMU, DTM, DEM, and DCL:  Micro-hydro energy systems contained within piping \nare allowed and pipe can run within the required setbacks in these districts.  However, \nif supplemental equipment structures accompany the in-pipe systems, then the district \nsetbacks limits apply.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 25,
      "text": "[4.11]-25\nCity of Gresham Development Code\n(06/22)\nDowntown Street Types\n4.1140 Street Type Purpose \nThe Street Types sections contain non-discretionary standards that \napplicants must meet as part of the design review process to ensure \npositive building-to-sidewalk relationships and well-designed streetscapes. \nThe life of Downtown shall be closely tied to the character of its public \nspace, and it is especially important to acknowledge the importance \nof street as public space. Street design features, and building-to-street \nrelationships will support the development of the Downtown area as a \nfocus of the community and as pedestrian-oriented, transit-supportive \nSub-Districts. Special features have been incorporated into several street \ndesign classifications included in this document. This section includes several \ndifferent street types applied to streets throughout Downtown, recognizing \nthat street design and how buildings interface with the street varies based \non function, location, land uses and multi-modal capacity.\nMap 4.1140: Downtown Street Types\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 26,
      "text": "[4.11]-26\n(06/22)\nCity of Gresham Development Code \nThese Street Type requirements will ensure consistent application of appropriate \ntreatments based on mixes of uses and levels of intensity throughout the sub-districts. \nThis section includes standards for the following Street Type designations (refer to Map \n4.1140 for specific designations of each Street Type Downtown):\n\t\n• Urban Boulevard (Arterial) (See 4.1143(A))\n\t\n• Downtown Local (See 4.1143(B))\n\t\n• Unique Streets (Beech (See 4.1143(C)), Main Avenue (See 4.1143(D)), Stanley Av­\nenue (See 4.1143(E)), Cleveland Avenue (See 4.1143(F)))\n\t\n• Any unclassified or future street bounded by Burnside, Eastman, Hogan, and Powell, \nshall be classified as Downtown Local streets. Any unclassified street outside of that \nboundary shall be classified and dimensioned per the Transportation System Plan \nand shall meet the frontage, setback, and street type guidelines and standards of the \nDowntown Local street type.\nAs new streets are constructed or existing streets are redeveloped, environmental friendly \nfeatures for stormwater management are required. See Street Types and the Gresham’s \nPublic Works Standards for requirements.\n4.1141 Public Works Standards Coordination\nApplicants shall consult specific street engineering construction standards in the Public \nWorks Standards and the Stormwater Management Manual in combination with these \nStreet Type Standards and the street standards included elsewhere in the Gresham \nCommunity Development Code. If compliance with the standards results in a conflict \nbetween the Community Development Code and Public Works Standards, the Public \nWorks Standards govern the street design. The Department of Environmental Services \nmay grant exceptions to the Public Works Standards through the Design Modification \nProcess if the City receives benefit from the suggested standard deviation.\nExisting curb-to-curb dimensions may vary from what is shown in street type cross-\nsections. Applicants shall consult the Public Works Standards to determine how to \nimplement the street type cross-sections in different situations.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 27,
      "text": "[4.11]-27\nCity of Gresham Development Code\n(06/22)\nintentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 28,
      "text": "[4.11]-28\n(06/22)\nCity of Gresham Development Code \n4.1143\tDowntown Street Type\nStandards\nA. Urban Boulevard (Arterial)\nFor the Urban Boulevard Street Type, all the following \nStreet Type Standards shall be met:\n1.\t Street functional classification shall correspond \nwith the Transportation System Plan, including \nthe boulevard treatment. Applicants shall \nalso consult the Public Works Standards and  \nstandards included elsewhere in the Gresham \nCommunity Development Code. \n2.\t No parking shall be permitted on any corners \nfacing public streets. \n3.\t A 16-foot height Downtown Decorative Lighting \nPole and Luminaire is required as detailed in the \nPublic Works Standards. \n4.\t If on-street parking is included, curbed bulb-\nouts at the street intersections are required. \n5.\t Comply with Section 9.0200 – Clear Vision Area. \n6.\t Except in the DRL-1 and DRL-2 subdistricts, \naccess to townhouses is prohibited directly from \nUrban Boulevard streets. Access from rear alleys \nand side streets is allowed.\n7.\t Development along Powell Boulevard may be \nrequired to provide on-street parking. When \non-street parking is required, the amenity \nzone and/or sidewalk widths may be reduced, \nas determined by the Manager, to ensure the \n96-foot standard right-of-way width is not \nexceeded.\nFig. A planted median\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 29,
      "text": "[4.11]-29\nCity of Gresham Development Code\n(06/22)\nintentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 30,
      "text": "[4.11]-30\n(06/22)\nCity of Gresham Development Code \n4.1143\tDowntown Street Type\nStandards\nB. Downtown Local\nFig. B furnishing zone with trees, lights, benches, trash \nreceptacles and decorative paving\nFor the Downtown Local Street Type, all the following \nStreet Type Standards shall be met:\n1.\t Applicants shall also consult the Public Works \nStandards and standards elsewhere in the \nGresham Community Development Code. \n2.\t There shall be a clear, accessible walking route \nof 5 feet in an 11-foot zone that includes the \ncurb, amenity zone and monumentation zone. \nAppurtenances can protrude 1 foot into the \nwalk width.  \n3.\t There shall be a 4-foot amenity zone provided. \nThis amenity zone may consist of street trees, \nstreet lighting, stormwater facilities, landscaping \nand/or seating. \n4.\t No parking shall be permitted on any corners \nfacing public streets. \n5.\t A 14-foot height Downtown Decorative Lighting \nPole and Luminaire is required as detailed in the \nPublic Works Standards. \n6.\t If on street parking is included, curbed bulb-\nouts at the street intersections are required. \n7.\t No curb cuts are permitted without permission \nof the City and shall be allowed only in instances \nthat permit no other options. \nFig. B.2 with 5-foot walk zone\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 31,
      "text": "[4.11]-31\nCity of Gresham Development Code\n(06/22)\n4.1143\tDowntown Street Type\nStandards\nB. Downtown Local\n7-foot \nparking \nlane\n58-foot right of way\n4-foot \namenity \nzone\n4-foot \namenity \nzone\n6-foot \nwalk\n6-foot \nwalk\n6-inch \nmonumentation \nzone\n6-inch \ncurb\n7-foot \nparking \nlane\n11-foot \ntravel \nlane\n11-foot \ntravel \nlane\n6-inch \nmonumentation \nzone\n6-inch \ncurb\nR\nO\nW\nR\nO\nW\nFigure: Urban Commercial cross-section\nFigure: Urban Commercial plan view\nNot to scale\n7-foot \nparking \nlane\n11-foot sidewalk and \namenity zone\n(including curb and \nmonumentation zone)\n11-foot sidewalk and \namenity zone\n(including curb and \nmonumentation zone)\nBuilding\nBuilding\n7-foot \nparking \nlane\n11-foot \ntravel \nlane\n11-foot \ntravel \nlane\nFigure: Downtown Local cross section\nFigure: Downtown Local plan view\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 32,
      "text": "[4.11]-32\n(06/22)\nCity of Gresham Development Code \nintentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 33,
      "text": "[4.11]-33\nCity of Gresham Development Code\n(06/22)\nintentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 34,
      "text": "[4.11]-34\n(06/22)\nCity of Gresham Development Code \n4.1143\tDowntown Street Type\nStandards\nC. Beech (NE 3rd to NE 7th)\nFig. D.3 large planted trees\nFig. D.6 curbless street\nFor the Beech Street Type, all the following Street Type \nStandards shall be met:\n1.\t Applicants shall also consult the Public Works \nStandards and standards elsewhere in the \nGresham Community Development Code.\n2.\t There shall be a clear accessible walking route of 9 \nfeet provided. The pedestrian walk width shall be \n10 feet. Appurtenances can protrude 1 foot into \nthe walk width.\n3.\t There shall be a 12-foot meandering amenity zone \nprovided. This amenity zone may consist of large, \nheavily planted street trees, stormwater facilities, \nstreet lighting, landscaping and/or seating.\n4.\t No parking shall be permitted on any corners \nfacing public streets.\n5.\t A 14-foot height Downtown Decorative Lighting \nPole and Luminaire is required as detailed in the \nPublic Works Standards.\n6.\t Curbs shall be de-emphasized or eliminated.\n7.\t Special paving materials shall be provided \nthroughout the street as approved by the \nDepartment of Environmental Services.\n8.\t Rain gardens or appropriate stormwater \ntreatment facilities shall be provided.\n9.\t Access to townhouses is prohibited directly from \nBeech. Access from rear alleys or side streets is \nallowed.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 35,
      "text": "[4.11]-35\nCity of Gresham Development Code\n(06/22)\n4.1143\tDowntown Street Type\nStandards\nC. Beech (NE 3rd to NE 7th)\nmeandering \nlandscaped \nareas\npervious \npaving\nFigure: Beech Plan View\nFigure: Beech Cross-section\nFig. D.7 street runnels and special paving\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 36,
      "text": "[4.11]-36\n(01/19)\nCity of Gresham Development Code \n4.1143\tDowntown Street Type\nStandards\nA. Urban Boulevard\n4.1143\tDowntown Street Type \nStandards\nD. Main Avenue (Powell to 4th)\nFor the Main Avenue Street Type, all the following \nStreet Type Standards shall be met:\n1.\t Applicants shall also consult the Public Works \nStandards and standards elsewhere in the \nGresham Community Development Code. \n2.\t There shall be a clear minimum accessible \nwalking route width of  5 feet. The pedestrian \nwalk width shall be 6 feet. Appurtenances can \nprotrude 1 foot into the walk width. \n3.\t No parking shall be permitted on any corners \nfacing public streets. No parking access or \nloading access shall be provided directly from \nthis street. No parking is allowed between the \nbuilding and the street. \n4.\t A 14-foot height Downtown Decorative Lighting \nPole and Luminaire is required as detailed in the \nPublic Works Standards. \n5.\t Amenities, including street trees, will be located \noutside of the accessible route in the required \nbulb-out areas near the street intersections. \nFig. E. Main Ave\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 37,
      "text": "[4.11]-37\nCity of Gresham Development Code\n(01/19)\n4.1143\tDowntown Street Type\nStandards\nA. Urban Boulevard\n4.1143\tDowntown Street Type \nStandards\nD. Main Avenue (Powell to 4th)\n7-foot \nparking \nlane/\namenity \nzone\n7-foot \nparking \nlane/\namenity \nzone\n50-foot right of way\n6-foot \nwalk\n6-foot \nwalk\n6-inch \nmonumentation \nzone\n6-inch \ncurb\n11-foot \ntravel \nlane\n11-foot \ntravel \nlane\n6-inch \nmonumentation \nzone\n6-inch \ncurb\nR\nO\nW\nR\nO\nW\nFigure: Main Avenue cross-section\nFigure: Main Avenue plan view\nNot to scale\n7-foot \nsidewalk \nand amenity \nzone\n(including \ncurb and \nmonumen-\ntation zone)\n7-foot \nsidewalk \nand amenity \nzone\n(including \ncurb and \nmonumen-\ntation zone)\nBuilding\nBuilding\n11-foot \ntravel \nlane\n11-foot \ntravel \nlane\n7-foot \nparking \nlane/\namenity \nzone\n(amenities \nin curb \nbumpouts \nor between \nparking \nspaces)\n7-foot \nparking \nlane/\namenity \nzone\n(amenities \nin curb \nbumpouts \nor between \nparking \nspaces)\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 38,
      "text": "[4.11]-38\n(01/19)\nCity of Gresham Development Code \n4.1143\tDowntown Street Type \nStandards\nE. Stanley\nFor the Stanley Street Type, all the following Street \nType Standards shall be met:\n1.\t Applicants shall also consult the Public Works \nStandards and standards elsewhere in the \nGresham Community Development Code. \n2.\t There shall be a clear accessible walking route \nof 9 feet provided. The pedestrian walk width \nshall be 10 feet. Appurtenances can protrude \none foot into the walk width. \n3.\t There shall be a 6-foot amenity zone provided. \nThis amenity zone may consist of street trees, \nstormwater facilities, street lighting, landscaping \nand/or seating. \n4.\t No parking shall be permitted on any corners \nfacing public streets. No parking access or \nloading access shall be provided directly from \nthis street. \n5.\t A 14-foot height Downtown Decorative Lighting \nPole and Luminaire is required as detailed in the \nPublic Works Standards. \n6.\t If on-street parking is included, curbed bulbouts \nat the street intersections are required. \nFig. F.2 envisioned new Stanley Street in Town Fair District\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 39,
      "text": "[4.11]-39\nCity of Gresham Development Code\n(07/13)\n4.1143\tDowntown Street Type \nStandards\nE. Stanley\n7-foot \nparking \nlane\n70-foot right of way\n6-foot \namenity \nzone\n6-foot \namenity \nzone\n10-foot \nwalk\n10-foot \nwalk\n6-inch \nmonumentation \nzone\n6-inch \ncurb\n7-foot \nparking \nlane\n11-foot \ntravel \nlane\n11-foot \ntravel \nlane\n6-inch \nmonumentation \nzone\n6-inch \ncurb\nR\nO\nW\nR\nO\nW\nFigure: Stanley cross-section\nFigure: Stanley plan view\nNot to scale\n17-foot sidewalk and \namenity zone\n(including curb and \nmonumentation zone)\n17-foot sidewalk and \namenity zone\n(including curb and \nmonumentation zone)\nBuilding\nBuilding\n7-foot \nparking \nlane\n7-foot \nparking \nlane\n11-foot \ntravel \nlane\n11-foot \ntravel \nlane\ny\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 40,
      "text": "[4.11]-40\n(01/19)\nCity of Gresham Development Code \nintentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 41,
      "text": "[4.11]-41\nCity of Gresham Development Code\n(01/19)\nintentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 42,
      "text": "[4.11]-42\n(01/19)\nCity of Gresham Development Code \n4.1143 Downtown Street Type \nStandards\nF. Cleveland Avenue (Collector)\nFig. H.4 residential transitional spaces\nFor the Cleveland St. Street Type, all the following \nStreet Type Standards shall be met:\n1.\t Street functional classification shall correspond \nwith the Transportation System Plan. Applicants \nshall also consult the Public Works Standards \nand standards elsewhere in the Gresham \nCommunity Development Code. \n2.\t There shall be a minimum clear accessible \nwalking route of 5 feet provided. \n3.\t There shall be a 6-foot amenity zone provided. \nThis amenity zone may consist of street trees, \nstormwater facilities, street lighting, landscaping \nand/or seating. \n4.\t Transitional setback spaces shall allow porches, \nstoops, small front yards, landscaping and \ngardens. \n5.\t A 14-foot height Downtown Decorative Lighting \nPole and Luminaire is required as detailed in the \nPublic Works Standards. \n6.\t If on-street parking is included, curbed bulbouts \nat the street intersections are required. Rain \ngardens are required in bulb-outs.\nFig. H.3 rain gardens in planting area\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 43,
      "text": "[4.11]-43\nCity of Gresham Development Code\n(01/19)\nintentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 44,
      "text": "[4.11]-44\n(06/22)\nCity of Gresham Development Code \nintentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 45,
      "text": "[4.11]-45\nCity of Gresham Development Code\n(01/23)\nEach project is subject to either the Downtown \nDesign Standards or Guidelines, depending on the \nproject’s review track. The Downtown Guidelines and \nStandards set the criteria and provide measurable or \ndescriptive ways depending on the review process \nchosen for evaluating how well the project meets the \ndesign principles established for Downtown.\nThe Guidelines and Standards are organized under \ntwo principal categories, site design and building \ndesign. Each general category includes basic \ntopics, such as Integrated Site Planning or Building \nMassing. Each of these includes the design principles \napplicable to the specific topic, and a list of guidelines \n(descriptive methods and techniques to meet the \nintent of the design principles) and standards (clear \nand objective, measurable requirements to carry out \nthe design principles).\nGuidelines correspond to the standard of the same \nnumber and vice versa. For example, the fifth \nguideline corresponds to the fifth standard. Guidelines \nlisted as a range apply to all standards in that range \n(such as a guideline labeled “1 through 5” applying to \nstandards 1, 2, 3, 4 and 5).\nSection 4.1151 does not apply to single detached \ndwellings, duplexes, triplexes, and quadplexes; \ntownhouses and cottages clusters in the DRL-1 and \nDRL-2 sub-districts; residential homes; park-and-ride \nfacilities; cemeteries and mausoleums; equipment \nstorage facility for transit; park and ride transit \nfacilities; parks, open space and trails; conversion \nof a hotel or a motel to an emergency shelter or to \naffordable housing under Section 10.0420 and uses \nin the “Other” category, including basic utilities, \nheliports, wireless communications facilities and \ntemporary uses, and similar uses/structures as \ndetermined by the Manager or Design Commission. \nSection 4.1151 also does not apply to public facilities \n(as described in Appendix 5: Public Facilities).\nDuplexes, triplexes, and quadplexes in the DCC, DMU, \nand DTM subdistricts shall follow the Section 7.0100 \nCorridor Design District Guidelines and Standards.\nSingle detached dwellings and middle housing in \nthe DRL-1 and DRL-2 sub-districts shall follow the \napplicable design standards in Section 7.0400.\nHeadings in this section apply to (except as exempted \nabove): \nAll Development: All developments except \ntownhouses. \nCommercial, Industrial, Institutional: All \ndevelopments that are commercial, industrial or \ninstitutional uses. \nMultifamily Residential: Multifamily (including \ntownhouse style multifamily and cluster style \nmultifamily), Residential Facilities and Elderly Housing, \nunless otherwise specified.\nTownhouse: Townhouses.\nExisting Development: Guidelines and standards in \nSection 4.1151(A) shall apply as determined by the \nManager or Design Commission when the standards \ncan reasonably apply to existing development. For \nexample, landscaping guidelines and standards \nmay apply when new landscaping is being added. \nGuidelines and standards in Section 4.1151(B) apply \nto buildings constructed prior to July 16, 2009, \nas indicated by the standards under the “Existing \nDevelopment” heading in those sections. For Sections \n4.1151(A) and (B), site and building modifications \nneeded to comply with Section 8.0200 shall comply \nwith applicable guidelines and standards. \nStandards and guidelines with no heading shall \nbe considered to be under the “All Development” \nheading. \nFor mixed-use developments:\n•\t Guidelines and standards under the Commercial, \nIndustrial and Institutional heading apply to those \nparts of the building designed for those uses, and \nthe guidelines and standards under multifamily \nand townhouse headings apply to those parts \nof the building designed for those uses. The “All \nDevelopment” standards apply to the entire \nbuilding.\n•\t If any conflicts exist among the standards in DCC, \nDMU, DTM DEM and DCL, the guidelines and \nstandards under the commercial, industrial and \ninstitutional heading will supersede the guidelines \nand standards under the Multifamily Residential \nand Townhouse headings. \n•\t If any conflicts exist among the standards in \nDRL-1 and DRL-2, the guidelines and standards \nunder the Multifamily Residential and Townhouse \nheadings will supersede the guidelines and \nstandards under the Commercial, Industrial and \nInstitutional heading.\nDowntown Design Guidelines and Standards\n4.1151. Downtown Design Guidelines and Standards: Purpose\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 46,
      "text": "[4.11]-46\n(06/22)\nCity of Gresham Development Code \nA.\t Intent: To ensure that the placement of buildings, \nparking, service access, plazas and courtyards \nrecognize the important relationship between \npublic and private space in creating a walkable and \npedestrian-friendly environment.\nB.\t Applicable Downtown Design Principles:\nA.\t Provide a Vibrant Mix of Uses.\nC.\t Create a Vibrant Public Realm.\nD.\t Create strong connections between Plan \nDistricts and Sub-Districts.\nF.\t Context Sensitivity.\nG\t Preserve and Enhance Historic Character.\nC.\t Guidelines:\nAll Development and Townhouse\n1 through 5: Sufficient length of buildings shall \nbe present to maintain a continuous building \nstreet wall and in general limit spatial gaps to \nthose necessary to accommodate vehicular and \npedestrian access in order to define the street \nedge.\n6.\t Developments may pull back from the street \nedge to accommodate plazas, outdoor cafe \nareas, or gracious entry fore-courts, provided \nstreet continuity is not unduly interrupted along \nthe majority of the block.\n7.\t Buildings shall be located with the primary \nfaçade oriented to the sidewalk. The pedestrian \nshall have primary access into the building from \nthe sidewalk. Clear pedestrian connections shall \nbe established on site that are well marked \nand gracious; for example, direct pedestrians \nfrom surface parking or parking structures to \nbuildings, streets, and public spaces. \n8 through 11: Site parking, loading and services:\na.\t Site parking, loading service and vehicular \ncirculation areas shall be located so as to \nallow desired uses and activities to face the \nstreet and to support pedestrian-oriented \nstreets. \nb.\t The majority of parking, loading service and \nvehicular circulation areas shall be located \nto the rear or in structures to support \npedestrian-oriented streets. \nc.\t Service items such as loading docks, \nmechanical equipment, and garbage \ndumpsters shall be buffered from \n1.\tIntegrated Site Planning\nFig. A.1.c.1 through 5 and 7: Principal facade defines street \nedge and provides connection from sidewalk to building\nFig. A.1.c.7: Building with primary facades and entrances \noriented toward the sidewalk.\nFig. A.1.c.8 through 11: Parking and loading is provided in the \nrear (with rear entrances to stores) so the building’s front facade \nand doors can be along the sidewalk facing the street.\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 47,
      "text": "[4.11]-47\nCity of Gresham Development Code\n(06/22\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n1.\tIntegrated Site Planning \ncontinued\n\t\npedestrian areas. Enclosing and integrating \nthese items into the building is strongly \nencouraged. \nCommercial, Industrial and Institutional \n12.\tBuildings shall be located with the primary \nfaçade oriented to the sidewalk. The pedestrian \nshall have primary access into the building from \nthe sidewalk. Clear pedestrian connections shall \nbe established on site that are well marked \nand gracious; for example, direct pedestrians \nfrom surface or structure parking to buildings, \nstreets, and public spaces.\n13.\tSite parking and loading services shall be \nlocated so as to allow desired uses and activities \nto face the street and to support pedestrian-\noriented streets. Service items such as loading \ndocks, mechanical equipment, and garbage \ndumpsters shall be buffered from pedestrian \nareas. Enclosing and integrating these items into \nthe building is strongly encouraged.\n14.\tCivic buildings and schools shall be placed \nto provide continuous visual interest to the \npedestrian. \nMultifamily Residential \n15.\tBuildings shall be located with the principal \nfaçade oriented to the street or a street-facing \nopen space such as a courtyard.\n16.\tIn DRL-1 and DRL-2: \na.\t Consider single detached dwelling \ndevelopment patterns in the front yard site \ndesign of multifamily development when \nadjacent to single detached developments. \nb.\t Consider a combination of landscaping and \nstructural elements to buffer multifamily \nactivities from adjacent single detached \ndwellings. \nc.\t Consider providing multiple residential \nbuilding entrances that activate and are \noriented to the street.\nd.\t Consider providing entry porches and \nstoops as a transitional space between the \nsidewalk and residential building.\n17.\tNo exterior waste collection and recycling area \nshall be located within 25 feet of property lines \nabutting LDR-5, LDR-7, TLDR or TR designated \nproperty.\nFig. A.1.c.13: Site plan with access to parking behind buildings \nfronting the street and connections through the site to \nsurrounding streets\nstreet\nparking\npedestrian \nconnection\nbuilding\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 48,
      "text": "[4.11]-48\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nMultifamily & Townhouse\n18.\tStorage: The standard in Section 4.1151(A)(1)\n(D)(18) is required.\n19.\tVehicular circulation and parking shall be \nprovided in accordance with City standards.\nTownhouse\n20.\tThe visual impact driveways and parking shall \nbe minimized.\n21.\tDevelopment shall respond to future street \nplans by orienting buildings to the future streets \nwhere appropriate.\n22.\tBuildings that front on two streets shall provide \na welcoming entrance on at least one street.\n23.\tTownhouse developments shall provide site \ndesign that orients units toward the street to \nprovide a welcoming and interesting face to \nthe public realm and limits the visual presence \nof access and parking. Developments also \nshall provide site design that provides a highly \nfunctional and attractive relationship between \nthe buildings, such as by minimizing front-to-\nback relationships. \n24.\tThe impact of street-facing garages and \ndriveways on the pedestrian environment shall \nbe minimized. Building faces, entrances and \nlandscaping that create a positive pedestrian \nenvironment shall be maximized along the \nstreet.\n25.\tDesign shall encourage an attractive \nappearance that minimizes the visual effects of \nloading, garbage/recycling and service areas; \ntransformers; mechanical equipment; and utility \ninfrastructure. Developments also shall provide \nadequate private storage areas. \n1.\tIntegrated Site Planning \ncontinued\nFig. A.1.c.24: Layers of landscaping, stoops, and railing creating \na positive pedestrian environment between the residence and \nthe street.\nFig. A.1.c.24: The visual impact of street-facing driveways and \nparking is limited by providing one driveway width for two units.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 49,
      "text": "[4.11]-49\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nD.\t Standards:\nAll Development and Townhouse\n1.\t In each development, the minimum percentage \nof site frontage that must be occupied by a \nbuilding shall be: \na.\t Urban Boulevard (Arterial)\t\n1.\t \t50 percent, except on the north side of \nPowell Boulevard between Miller and \nRoberts.\n2.\t 60 percent on the north side of Powell \nBoulevard between Miller and Roberts.\n3.\t For Multifamily and Townhouse, \nbuilding facades up to 15 feet from \nthe front property line can be counted \ntoward meeting the requirement for \nfrontage that must be occupied by a \nbuilding. \nb.\t Downtown Local: 75 percent, except for \nMultifamily Residential and Townhouse\nc.\t Beech: 75 percent\nd.\t Main Avenue: 90 percent\ne.\t Stanley Avenue: 90 percent\nf.\t Cleveland Avenue: 75 percent, except for \nMultifamily Residential and Townhouse, \nwhere facades up to 15 feet from the \nfront property line can be counted toward \nmeeting the requirement for frontage \noccupied by a building.\n\t\nMinimum and maximum setbacks apply. For \nthe purposes of the minimum frontage percent­\nage required to be occupied by a building on a \nstreet type, the building facade must be at or \nbetween the minimum and maximum setback. \nBuilding facades with recesses incorporated to \ncomply with façade articulation requirements \nare considered to be occupying the site front­\nage if the recesses do not exceed 24 inches. \n\t\nUnlisted/undesignated street types: Follow the \nstandards for Downtown Local.\n2.\t If the development site has frontage on more \nthan one street type, the minimum percentage \nof street frontage that must be occupied by \na building façade may be reduced up to 25 \npercent of the total frontage along that street \n1.\tIntegrated Site Planning \ncontinued\nsidewalk\nsetback\nproperty line\nminimum percentage of building frontage\nFig. A.1.d.1 (1): Commercial building placement\nFig. A.1.d.1 (2): Building placement\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 50,
      "text": "[4.11]-50\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n1.\tIntegrated Site Planning \ncontinued\ntype as part of the clear-and-objective track, \nexcept that the reduction shall not be on the \nMain, Third, Stanley or Urban Boulevard Street \nTypes. For example, a requirement that 75 \npercent of the frontage must be occupied by a \nbuilding façade could be reduced to 50 percent \nof the frontage on that one street type.\n3.\t The minimum amount of building frontage \nrequired on the front setback line may be \nreduced by the Design Commission or Manager \nif an adjustment is required to allow a driveway \nwith the required minimum width on street \ntypes where driveways are allowed. \n4.\t For courtyard developments involving \nmultifamily or townhouses, the minimum \namount of building required on the frontage is \n40 percent. \n5.\t Lots whose frontage on a street includes \nonly vehicular access, such as a flag pole, are \nnot required to meet the requirements for \nminimum building on the frontage. \n6.\t For all streets types except Urban Boulevards, \npublicly accessible open spaces may count \ntoward the frontage requirement up to 10 \npercent of the total requirement when:\na.\t Publicly accessible open spaces is between \nthe right-of-way and the building façade, as \nlong as the building façade is not more than \n40 feet from the right-of-way; and\nb.\t The space contains vertical elements that \nscreen any off-street parking that would be \nvisible from the street through the open \nspace and define the street edge.\n7.\t Connections to principal pedestrian entrances \nshall be directly from the public sidewalk.\n8.\t Parking, loading service and vehicular \ncirculation areas not within a building or a \nparking structure shall be: \na.\t To the rear of the buildings constructed \nalong the street frontage; or \nb.\t To the side of buildings constructed along \nthe street frontage; or\nc.\t In the interior of the site if the site has \nmultiple buildings.\n9.\t Parking located to the side of the building shall \nbe limited to a maximum of 25 percent \nFig. A.1.d.7 (1): Connection to principal entrance directly from \nsidewalk.\nPrincipal\nentrance\nFig. A.1.d.7 (2): Connection to principal entrance directly from \nsidewalk.\nFig. A.1.d.7 (3): Connection to principal entrance directly from \nsidewalk.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 51,
      "text": "[4.11]-51\nCity of Gresham Development Code\n(07/13)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n1.\tIntegrated Site Planning \ncontinued\n\t\nof the frontage, except in DCL where parking \ncan occupy a maximum of 50 percent of the \nfrontage.\n10.\tParking, loading service and vehicular \ncirculation areas shall be behind the maximum \nsetback or behind a line drawn parallel to the \nstreet at the point where the building is closest \nto the street, whichever is closest to the street. \nIn no circumstance shall the parking be closer \nthan the minimum building setback. For sites \nwith multiple frontages, parking may be allowed \nup to the minimum setback regardless of \nbuilding location as approved by the Manager \nor Design Commission. Standards for minimum \nbuilding frontage along a street shall be \nconsidered when making this determination. \n11.\tSolid waste and recycling collections areas shall \nbe screened according to standards in Section \n7.0212.\nCommercial, Industrial and Institutional\n12.\tIn developments with commercial, industrial or \ninstitutional uses occupying the ground floor, \nbuilding facades shall directly abut the sidewalk, \nwith no intervening in-ground landscaping.\n13.\tDedicated loading facilities:\na.\t In DCL and DEM, when dedicated off-street \nloading facilities are required:\n1.\t Loading areas shall be located at the \nrear of the building or in other locations \nas approved by the Manager or Design \nCommission. If loading areas cannot be \nlocated at the rear of the building, they \nmay be placed along the side of \nFig. A.1.d.8 and 10: Parking within the building provides spaces to the interior of the site while ensuring active uses are along the street.\nFig. A.1.d.12: Building facades directly abutting the sidewalk.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 52,
      "text": "[4.11]-52\n(01/19)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n\t\nthe building and recessed from the \nfront façade a distance which prevents \nservice vehicles from extending into \nadjacent walkways. Required loading \narea dimensions can be found in \nSection 9.0840; and\n2.\t Loading areas shall be screened parallel \nto the building wall with liner spaces \nor walls integrated into the building \nand no less than 14 feet in height. The \nliner spaces or walls shall fully conceal \nservice vehicles except at the entry \nto allow for safe vehicular movement \nwhile exiting; and\n3.\t Liner spaces and screening walls shall \nbe designed consistently with the \nremainder of the building and design \nregulation in Section 4.1151(B); and\nb.\t When located next to residential uses, \nservice vehicles shall not be left idling in \nexcess of 10 minutes between the hours of \n10 p.m. and 6 a.m. Signage shall be posted \nin a visible location within the loading area \nto inform drivers of this requirement.\nc.\t Service and loading areas shall be visually \nscreened from a light-rail station or transit \nway.\n14.\tTo provide greater flexibility and to emphasize \ntheir importance, civic uses and schools do not \nhave to meet maximum setback requirements \nso long as parking is not located between \nthe building frontage and the primary street \nfrontage. Alternative frontage treatments shall \nmeet the following objectives, as determined by \nthe Manager or Design Commission:\na.\t The building(s) shall emphasize civic \nuse(s) and shall include visually prominent \narchitecture visible from the primary \nadjoining public street according to the \nfollowing hierarchy: Urban Boulevard, Main \nAvenue, other Unique Street, Downtown \nLocal or to the primary street as determined \nby the Manager or Design Commission; and\nb.\t The site design treatment shall contribute \nto Downtown’s pedestrian-oriented \ncharacter by providing public open space of \na minimum of 600 square feet in size; and\n1.\tIntegrated Site Planning \ncontinued\nFig. 1.A.d.14 (1): Civic buildings may have increased setbacks \nso long as no parking is located between the building and the \nstreet.\nFig. 1.A.d.14 (2): Civic building with corner plaza space.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 53,
      "text": "[4.11]-53\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n1.\tIntegrated Site Planning \ncontinued\nc.\t There is a direct and inviting pedestrian \nconnection between the building and the \nstreet.\nMultifamily Residential \n15.\tFor buildings with a central courtyard space, \nthe primary entry or entries for all ground-floor \nresidential units abutting the street or courtyard \nshall open directly onto the street right of \nway or onto a central courtyard. Secondary \nentrances may face parking lots or other interior \nsite areas. Secondary entrances facing the street \nright of way shall present the same finished \nappearance as the front and shall not include \nrear patios or sliding glass doors.\n16.\t In DRL-1 and DRL-2: \na.\t The front of buildings within 25 feet of the \nfront line, except for frontages on courtyard \nspace, shall include primary building \nentrance(s) that face the street. \nb.\t When a multifamily project is adjacent to \na single detached dwelling, the building’s \nfront setback shall be within 5 feet of the \nsetback provided by the single detached \ndwelling. For example, if the single \ndetached dwelling setback is 20 feet, then \nthe multifamily setback shall be 15 feet. This \nstandard shall not cause a front setback to \nexceed 15 feet. \nc.\t A 10-foot buffer shall be provided between \na multifamily development and property \nlines abutting a single detached dwelling. \nSite obscuring landscaping shall be required, \nincluding a 6-foot, site-obscuring fence \nwith shade trees planted a maximum 30 \nfeet on center (2.5-inch caliper at planting); \nand/or other landscaping to provide visual \nbuffering approved by the Manager or \nDesign Commission.\n17.\tNo exterior waste collection and recycling area \nshall be located within 25 feet of property lines \nabutting LDR-5, LDR-7, TLDR or TR designated \nproperty.\nMultifamily Residential and Townhouse\n18.\tStorage: Space shall be provided for garbage, \nrecycling and storage in accordance with the \nfollowing standards:\nFig. A.1.d.15 (1): Primary entries open directly to central \ncourtyard.\nFig. A.1.d.15 (2): Primary entries open directly to central \ncourtyard.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 54,
      "text": "[4.11]-54\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\na.\t Exterior garbage collection and recycling \nareas shall be entirely screened by the \nemployment of a vegetative screening and/\nor minimum 6-foot high sight-obscuring \nfence or wall. This requirement applies \nto townhouses only if common garbage \ncollection and recycling facilities are \nprovided for the site.\nb.\t Outdoor storage facilities shall be provided \nfor articles such as barbecues, outdoor \nfurniture, etc. The storage facility shall be a \nminimum 6 feet high and 24 square feet in \narea. The facility shall either be connected \nto each unit, within a garage that belongs \nwith a unit, or easily accessible (such as in \na central facility), be completely enclosed \nand capable of being locked. If located \nwithin a garage, the storage space must be \nseparate from and in addition to the area \nrequired for vehicle parking so as to not \nimpede vehicle parking. (Elderly Housing \nand Residential Facilities need not comply \nwith this requirement.)\nc.\t No exterior waste collection and recycling \narea shall be located within 25 feet of \nproperty lines abutting LDR-5, LDR-7, TLDR \nor TR designated property.\n19.\tVehicular Circulation and Parking: Vehicular \ncirculation and parking shall be provided in \naccordance with the following standards:\na.\t Public streets shall be dedicated within \nthe site and connected to adjacent streets \nas required to create blocks and street \nintervals that are consistent with Section \nA5.402(D). The names of any such streets \ndedicated by deed, without a plat, shall be \nreviewed by and approved by the Manager \nprior to recording. Where public streets \nare required, the Manager may require \nthat traffic-calming features, such as speed \nhumps, curb extensions, and enhanced \npedestrian crosswalks be included in the \ndesign and construction of the streets.\nb.\t Where new parcels or blocks are created \nwithin a development site as a result \nof required public street dedications, \nindividual parcels or blocks need not meet \nminimum residential density standards for \n1.\tIntegrated Site Planning \ncontinued\nFig. A.1.d.18.b: Outdoor storage facilities shall be provided.\nFig. A.1.d.18.a: Garage and recycling area screened with wall.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 55,
      "text": "[4.11]-55\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n1.\tIntegrated Site Planning \ncontinued\n\t\nthe district, provided the development as \na whole meets the standard. The Manager \nor Design Commission may require that \ndeed restrictions be recorded to ensure that \nwhere project amenities such as swimming \npools, community centers, and shared \nopen space are on separate parcels within \nthe same development, all residents of the \ndevelopment will have on-going access to \nthose amenities and facilities.\nTownhouse\n20.\tExcept for individual driveways which may \ninclude parking for townhouses, on-site surface \nparking areas, garages, and vehicular circulation \nareas shall not be located between a building \nand an abutting street right-of-way.\n21.\tThe Manager or Design Commission may \nrequire that a building that will abut a future \nstreet right-of-way, as shown on an approved \nfuture street plan or neighborhood circulation \nplan, be oriented to that future right-of-way.\n22.\tWhere a building is on a corner lot and fronts \non two abutting streets, a dwelling unit at the \ncorner of the building need be oriented to only \none of the streets.\n23.\tStreet Frontage and Building Orientations: The \nfollowing standards are intended to promote \nand maintain an orientation to the street for \ntownhouse developments.\na.\t Townhouse units are not allowed to be \nconstructed on flag lots except in cases \nwhere minimum density standards would \notherwise not be met. The end unit abutting \nthe street (as applicable) must have its \nprimary entrance oriented to the street.\nb.\t Where a property configuration is such that \ndevelopment cannot occur in standard row \nto row relationships, fronts of units shall \nnot be permitted to face non-street fronting \nsides or rear of the site.\nc.\t Back-to-front facing relationships between \ngroups of buildings (such as front doors \nfacing rear yards or service areas) are not \nallowed.\nd.\t Projects that include a courtyard fronting a \nFig. A.1.d.20 (1): Townhouses with no vehicular circulation areas \nbetween the building and the right of way.\nFig. A.1.d.20 (2): Townhouses with no vehicular circulation areas \nbetween the building and the right of way.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 56,
      "text": "[4.11]-56\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n1.\tIntegrated Site Planning \ncontinued\n\t\npublic street must provide a street-fronting \nbuilding orientation and doorway access for \nthose portions of the project that directly \nface and abut a street and are not between \nthe street and courtyard. Courtyard \ndevelopment building facades separated \nfrom a street by an approved courtyard \nare exempt from street orientation \nrequirements.\ne.\t Where two groups of townhouse buildings \nin a complex face each other, a minimum \nseparation of 30 feet shall be required \nbetween front building facades, inclusive \nof setbacks. If such a grouping is provided \ninternally within a townhouse complex, the \nseparation area shall include, at minimum, a \nshared pedestrian walkway.\nf.\t Buildings shall face one another with \na front-to-front and a back-to-back \nrelationship whether on either side of a \nstreet, alley or open space. An exception \nto this is with oddly configured properties \nwhere a partial building grouping accessed \n(for example) by a short section of public or \nprivate street or alley might be located to a \nside in a side-to-rear relationship.\ng.\t Townhouse units are required to be located \nadjacent to public streets and alleys and \noriented to public streets. Private streets \nor alleys may be utilized only in districts \nthat permit these following adopted public \nstreet and public works standards and \nappropriate design modifications.\nh.\t In the case of townhouse complexes, private \nshared accesses to the rear or to common \nparking areas may be provided, subject \nto City circulation and parking standards. \nSuch shared access and parking areas may \nbe located in easements or tracts and shall \nnot take the place of street orientation \nprovisions.\ni.\t Garage facades shall not be closer to the \nstreet than portions of the unit containing \nliving space.\n24. Driveways and Unit Access: The following \nstandards are intended to promote access at \nFig. A.1.d.23.i: Garage facades not closer to the street than \nportions of the units containing living space.\nFig. A.1.d.23.h: Shared driveway and parking areas..\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 57,
      "text": "[4.11]-57\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n1.\tIntegrated Site Planning \ncontinued\n\t\nthe rear of the lots so as to limit the number \nof driveways to the street and to allow for \navailability of on-street parking.\na.\t Townhouse lots shall be accessed from the \nrear by alleyway, rather than from a public \nstreet except as otherwise authorized \nwithin this section. Exceptions to this are: \nlots at least 30 feet wide may directly access \na public street or a development of 5 or \nless lots may access the street directly. \nPrivate alleys or access drives may be \nsubstituted where allowed by the district, \nwhere extension potential is not feasible \nand if appropriate maintenance provisions \nare established. In addition, a private side \naccess to a common parking area may also \nbe permitted if parking section standards \nare met. (Note: Townhouse developments \non large parcels are not permitted to avoid \nalleyway and rear access requirements by \nutilizing multiple structures of five or fewer \nunits/lots or providing serial or sequential \nland divisions from one “parent” parcel.)\nb.\t Up to 20 percent of proposed lots less than \n30 feet wide in a townhouse development \nand not covered by subsection (a) above \ncan be accessed from the front.\nc.\t The maximum width for individual single \ngarage driveways located at the front of a \ndwelling unit is 10 feet wide (excluding the \ndriveway approach width). Alternately, a \ndriveway may be wider to access a garage \nthat has a width no larger than 50 percent \nof the total dwelling width.\nd.\t The maximum width for a shared driveway \nthat serves two units or a double car (side-\nby-side) garage is 16 feet (excluding the \ndriveway approach width).\ne.\t A minimum distance of 20 feet shall be \nbetween driveways, whether shared or \nindividual, so as to allow for on-street \nparking.\nf.\t In the case of a single-loaded public \nalleyway or private street or alley utilized \nfor access, provide a 6-foot-high, sight-\nobscuring fence or wall and a 5-foot-wide \nFig. A.1.d.24 (1): Required off-street parking is located to the \nrear the dwelling structure.\nFig. A.1.d.24 (2): Required off-street parking is located to the \nrear the dwelling structure.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 58,
      "text": "[4.11]-58\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n\t\nlandscape planter strip along the side of the \nalleyway/private street that abuts adjoining \nproperties. Plant materials shall include \na combination of ground cover, shrubs \nand trees and follow the planting size \nrequirements in Section 4.1151(A)(5).\ng.\t When common area courtyards are \nbeing provided that face the street, \nprivate rear access and parking may be \nestablished provided secondary access or \nadequate turnaround area is available and \nmaintenance provisions are adopted.\nh.\t When property configuration is such \nthat rear access cannot be provided in \nconsideration of setback and separation \nstandards, parking to the side in a common \nparking area may be provided, or shared \ndriveway accesses to the street may be \nallowed up to the limit of minimum site \ndensity.\ni.\t If common rather than individual (per unit) \nparking areas are proposed, the General \nDesign Standards for Surface Parking Lots \n(Section 9.0820-9.0826) shall apply to the \ncommon parking areas. Such common \nparking areas may be within easements \nor on commonly owned tracts held and \nmaintained by a homeowners association. \nProvide a 6-foot-high sight obscuring fence \nor wall and a 5-foot-wide landscaped \nplanter strip along any side(s) of the \ncommon parking area that abuts adjoining \nproperties. Plant materials shall include \na combination of ground cover, shrubs \nand trees and follow the planting size \nrequirements in Section 4.1151(A)(5).\n25.\tMiscellaneous Standards for Townhouses\na.\t A minimum 6-foot-high sight obscuring \nfence or wall shall screen common loading, \ngarbage/recycling, and other service areas \nthat are shared by two or more townhouse \nunits within a development.\nb.\t Screen transformers and heating, \nventilation and air conditioning (HVAC) \nequipment.\nc.\t Screen freestanding HVAC units with a \n1.\tIntegrated Site Planning \ncontinued\nFig. A.1.d.25: Screen heating, ventilation and air conditioning \nequipment.\nFig. A.1.d.24: Townhouse with automobile access in the rear \nand on-street parking.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 59,
      "text": "[4.11]-59\nCity of Gresham Development Code\n(07/13)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n\t\nsight-obscuring fence, wall or evergreen \nlandscaping if located adjacent to a property \nline shared with another residential unit/\nbuilding or adjacent to open space.\nd.\t Provide utility meter/box screening from \nthe street or from public view.\ne.\t Private storage areas are required for each \nunit. Each storage space shall consist of an \nenclosed closet type space at least 6 feet in \nheight with at least 24 square feet of floor \narea. Optionally, the storage space may \nbe in a central storage facility close to the \nunit or as designated storage area within \na garage dedicated to said unit. If garage \nlocated, the storage unit shall be separate \nfrom and not impede parking within the \ngarage.\n1.\tIntegrated Site Planning \ncontinued\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 60,
      "text": "[4.11]-60\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nA.\t Intent: To provide an enhanced pedestrian \nexperience by creating a network of privately \nprovided and maintained public spaces, courtyards, \nand other gathering spaces. To provide private \nopens spaces for buildings that create opportunities \nfor private enjoyment of the outdoors.\nB.\t Applicable Downtown Design Principles:\nA.\t Provide a Vibrant Mix of Uses.\nC.\t Create a Vibrant Public Realm.\nD.\t Create strong connections between Plan \nDistricts and Sub-Districts.\nE.\t Incorporate Sustainability.\nF.\t Provide Context Sensitivity.\nC.\t Guidelines:\nAll Developments\n1.\t and 2: For development on sites larger than \n40,000 square feet, provide publicly accessible \nopen space that include a variety of public \nspaces, both hardscaped and landscaped, such \nas on-site plazas, interior courtyards, patios, \nterraces and gardens. Public spaces shall \nincorporate features that advance sustainable \nprinciples, such as use of gray water, solar \ncollection for powering pumps or lighting, \nrain gardens, pervious paving, containers for \nrecycling, and benches made from recycled \nmaterials.\n3.\t Public spaces intended for public use shall be \nlocated at/or near street grade to promote \nphysical and visual connection to the street.\nCommercial, Industrial and Institutional \n4.\t Public spaces shall be flanked by uses that \nactivate the space and complement street \nactivity with elements such as shops, outdoor \ncafes and vendors within the space. \n5.\t Public spaces can be located between a building \nand the sidewalk, so long as active ground floor \nuses are accessible to and from the space and \nthe desired street wall and/or retail continuity is \nnot adversely impacted by the presence of this \nspace. Locate plazas intended for public use at/\nor near street grade to promote physical and \nvisual connection to the street.\n2. Open Spaces\nFig. A.2.c.1 & 5: Public on-site plaza incorporating a variety of \nhardscaped and landscaped treatments to create an engaging \nspace\nFig. A.2.c.6: Public space lined by outdoor cafe \nFig. A.2.d.4: Water feature\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 61,
      "text": "[4.11]-61\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n2. Open Spaces continued\nMultifamily Residential\n6.\t Adequate private open space shall be provided \nfor the residents of multifamily residential \nunits to provide for outdoor recreation, \nentertainment, scenic amenity or shared \nexterior space for people to gather.\n7.\t and 8: Adequate, usable shared open space \nshall be provided for multifamily developments \nthat provides a place for residents to gather for \nrecreation, entertainment or enjoyment of a \nhigh-quality outdoor space.\n9.\t Children’s play areas shall be designed to \npromote safety, creative play and exercise and \nshall be adequate for the number of units in the \ndevelopment.\n10.\tThe standard of Section 4.1151(A)(2)(D)(10) \nis required as determined by the Manager or \nDesign Commission.\n11.\tThe design of developments shall promote \nsafety of outdoor common areas by ensuring \nthey are visible from a sufficient number of \nadjoining units to provide opportunities for \nsurveillance.\nTownhouse\n12.\tAdequate, usable shared open space shall \nbe provided for developments that provide a \nplace for residents to gather for recreation, \nentertainment or enjoyment of a high-quality \noutdoor space. Children’s play areas shall be \ndesigned to promote safety, creative play and \nexercise and shall be adequate for the number \nof units in the development. A mechanism shall \nbe established that provides for the continued \nmaintenance of the shared space.\n13.\tAdequate private open space shall be provided \nfor the residents of residential units to provide \nfor outdoor recreation, entertainment, scenic \namenity or shared exterior space for people to \ngather.\nFig. A.2.c.7 and 8 (1): Adequate places for residents to gather \nfor recreation, entertainment or enjoyment of outdoor space..\nFig. A.2.c.7 and 8 (2): Adequate places for residents to gather \nfor recreation, entertainment or enjoyment of outdoor space..\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 62,
      "text": "[4.11]-62\n(09/17)\nCity of Gresham Development Code \nFig. A.2.d.2: Courtyard with seating, landscaping and lighting\nD.\t Standards:\nAll Developments\n1.\t For sites of 40,000 square feet or larger, at \nleast 3 percent of the development site shall be \nallocated and designed as publicly accessible \nopen space, such as a plaza. \nFor sites larger than 20,000 square feet that are \nproviding public open space, at least 3 percent \nof a development site greater than 20,000 \nsquare feet shall be allocated and designed as \npublicly accessible open space, such as a plaza. \nPublic spaces shall be placed at high pedestrian \nactivity areas, with western or southern \nexposure.\n2.\t Public spaces shall incorporate the following:\na.\t At least 30 percent of the area shall be \nplanted with trees, shrubs, groundcover and \nperennial landscape plantings.\nb.\t At least 30 percent of the area shall be \nhardscaped with decorative paving \nc.\t At least one bench or seating unit for each \n200 square feet of area, (seating may be \ngroup into benches or ledges)\nd.\t Pedestrian-scaled lighting fixtures \ne.\t One element with sustainability attributes \n(rain garden, solar powered lights or \nequipment, pervious paving, container for \nrecycling, or benches made from recycled \nmaterials.)\nf.\t Artistic design elements such as decorative \npaving patterns, ornamental art features, \ncreative lighting elements.\n3.\t Public spaces shall be accessible at grade \nadjacent to the sidewalk to promote physical \nand visual connection to the street. Portions \nof public spaces such as plazas may be above \nor below grade to accommodate a variety of \noutdoor gathering spaces. \nCommercial, Industrial and Institutional \n4.\t Except for civic uses, street-facing public spaces \nshall not exceed 20 percent of the total building \nfootprint or 2,000 square feet, whichever is less. \nSuch space shall have a minimum width of 30 \nfeet and a minimum depth of 20 feet, unless \notherwise approved by the Manager or Design \n2. Open Spaces continued\nFig. A.2.d.1: Public plaza directly facing principal street\nFig. A.2.d.2: Public plaza with pervious paving for improved \nstormwater management\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 63,
      "text": "[4.11]-63\nCity of Gresham Development Code\n(06/22)\n\t\nCommission because of site constraints.\n5.\t Except for civic uses, public spaces located \nbetween a building and a sidewalk shall be \nabutted on at least two sides by retail shops, \nrestaurants, primary residential or office \nentrances or services with their windows and \ndoors fronting on the space.\nMultifamily Residential\n6.\t Private open space shall be required and can be \nmet by complying with one of the following:\na.\t Provide 48 square feet of private open \nspace attached and directly accessible from \neach unit.\n1.\t Each unit’s private open space must be \nable to fit a 5-foot by 6-foot rectangle \ninside of it; and\n2.\t Each private open space must be \nscreened or otherwise designed to \nprovide privacy from adjacent units; and\n3.\t Balconies that do not meet the \ndimensional requirements (such as \nJuliet balconies) are allowed but do \nnot count toward the minimum private \nopen space standard; or \nb.\t Provide shared private open space or spaces \nincluding but not limited to courtyards \nor rooftop decks. Shared private open \nspace at a minimum shall be provided at \nthe rate of 48 square feet per unit up to \na maximum of 2,000 square feet for sites \n20,000 square feet or fewer or a maximum \nof 10 percent of the site for sites larger \nthan 20,000 square feet. The minimum \nsize for any private, shared open space to \nsatisfy this requirement shall be 400 square \nfeet. Applicants may voluntarily provide \nadditional shared private open space \nbeyond the maximums in this standard; or \nc.\t Provide a combination private open \nspace that complies with standards in \n(a)(1) through (a)(3) and dimensional \nrequirements in (b). If the shared private \nopen space reaches the maximum sizes in \n(b), the private open space requirement is \nsatisfied. \n7.\t For dwelling structures containing four or more \nunits, a minimum of 4 percent of the gross site \n2. Open Spaces continued\nFig. A.2.d.6 (1): Balconies are one option for providing private \nopen space.\nFig. A.2.d.6 (2): Rooftop decks are an option for private open \nspace.\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 64,
      "text": "[4.11]-64\n(09/17)\nCity of Gresham Development Code \n\t\narea but not less than 1,000 square feet shall be \nshared open space for sites 20,000 square feet \nand above in gross site area. \n\nFor sites under 20,000 square feet in gross site \narea, a minimum of 4 percent of the gross site \narea but not less than 500 square feet shall be \nshared open space. The minimum dimensions \nfor any shared open space shall be 20 feet in \nlength and width. A shared private open space \nprovided to comply with Section 4.1151(A)(2)\n(D)(6) may satisfy this standard as long as it \nmeets the size requirements of this standard.\n8.\t A shared open space may be any of the \nfollowing: recreational facilities such as tennis, \nracquetball and basketball courts; recreation \nbuilding (not including office space); swimming \npools and spas; gathering spaces such as \ncourtyards, gazebos, picnic and barbecue \nareas; gardens; preserved natural areas; lawns; \ndual use areas (such as a basketball court \nthat doubles as a loading space); children’s \nplay areas; and other recreational facilities \nas approved by the Manager or Design \nCommission. The shared open space may not \nbe within any buffer or yard setback area unless \nthe open space includes preserved natural \nareas.\n9.\t Children’s Play Area.\na.\t A minimum of 50 percent of the above \nminimum required shared open space shall \nbe a children’s play area. (Elderly Housing \ndevelopments and Residential Facilities \nneed not comply with the children’s play \narea requirement but shall provide the \nspecified shared open space in Section \n4.1151(A)(2)(d)(6)). However, the minimum \ndimensions for any children’s play area shall \nbe 20 feet in length and width, and be a \nminimum of 500 square feet in size for sites \nwith a gross site area of 20,000 square feet \nand greater.\n\nFor sites with a gross site area of under \n20,000 square feet, the children’s play area \nmust include a minimum length and width \ndimension of 12 feet with a minimum total \narea of 250 square feet.\n2. Open Spaces continued\nFig. A.2.d.9: Children’s play area with play equipment\nFig. A.2.d.9: Children’s play area with play equipment as part of \nopen space\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 65,
      "text": "[4.11]-65\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n2. Open Spaces continued\nFig. A.2.d.6 (1): Common open space in a residential \ndevelopment\nFig. A.2.d.6 (2): Common open space\nb.\t The children’s play area shall have a \nminimum of three types of play equipment \nsuch as slides, swings, towers, jungle \ngyms and other natural play elements \nas approved by the Manager or Design \nCommission. A Landscape Architect or a \nplayground recreation expert shall design \nthe children’s play area, including selection \nof the play equipment to ensure that the \nequipment is compatible, fun and promotes \nsome form of exercise or movement.\nc.\t The children’s play area shall be centrally \nlocated where it is visible from 50 percent \nof the abutting units that front the space. \nChildren’s play areas shall be outside of the \nrequired yard setbacks and buffer areas.\nd.\t The children’s play area(s) shall be enclosed \nby any or a combination of any of the \nfollowing: a 2.5-foot to 3-foot high wall, \nplanter, decorative fence; or by 18-inch \nhigh benches or seats; or by other means \nacceptable to the Manager or Design \nCommission.\n10.\tThe Manager or Design Commission may \nrequire that deed restrictions be recorded \nto ensure that where project amenities such \nas swimming pools, community centers, and \nshared open spaces are on separate parcels \nwithin the same development, all residents of \nthe development will have on-going access to \nthose amenities and facilities.\n11.\tFor all complexes, all outdoor common areas \nand streets shall be visible from 50 percent of \nthe units that face it. Common areas include but \nare not limited to shared open spaces; laundry \nrooms; recreation, pool and similar common \nfacilities; children’s play areas; walkways; \nand parking areas. A unit meets this criterion \nwhen at least one window of a frequently used \nroom such as a kitchen, living room and dining \nroom, but not bedroom or bathroom, faces the \ncommon area. \nTownhouse\n12.\tTownhouse development of 20 or more units \nshall comply with the following:\na.\t Developments of 20 or more units \n(including elderly housing multifamily\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 66,
      "text": "[4.11]-66\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n\t\ncomplexes of 20 or more units) shall provide \none or more common open spaces with \na minimum combined total area of 800 \nsquare feet. For developments of more than \n20 units, add an additional 200 square feet \nof open space for every additional 10 units. \nFor phased developments, open space \nrequirements shall be met per phase.\nb.\t No common open space area is to be less \nthan 400 square feet in area nor have a \nhorizontal dimension less than 12 feet.\nc.\t Up to 40 percent of the common open \nspace area may be hard surfaced (preferably \npervious), improved and dedicated for a \nspecific use (barbecue areas, tennis court, \nrecreation building, community garden, \nplayground, etc.), subject to approval by the \nManager or Design Commission.\nd.\t Required open space area landscaping shall \ninclude lawn, groundcover, shrubs and \ntrees. Landscaping shall meet applicable \nrequirements in Section 4.1151(A)(5).\ne.\t Children’s play areas shall be provided for \ndevelopments of 20 or more units following \nthe dimensional, equipment and perimeter \nstandards of Section 4.1151(A)(2)(d)(9), \nexcept if the development is Elderly Housing \nor a Residential Facility. In addition, the \nfollowing are required for children’s play \nareas:\n1.\t Shall be located outside of required \nyard setbacks and buffer areas.\n2.\t Must be located so as to be visible \nfrom living area windows of at least 3 \ndwelling units.\nf.\t If a private open space (in a front, rear \nor side yard) is adjacent to common or \npublic open space, parking, or a property \nline at the perimeter of the development, \nprovide a visual separation consisting of \nat minimum a 3-foot high fence, wall, or \nlandscaping capable of growing to a 3-foot \nheight between the private open space and \nthe adjacent element.\ng.\t Homeowners associations, site \nmanagement offices, or other acceptable \n2. Open Spaces continued\nFig. A.2.d.12.d: Open space with lawn, groundcover and trees.\nFig. A.2.d.12: Shared private open space.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 67,
      "text": "[4.11]-67\nCity of Gresham Development Code\n(07/13)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n\t\nmeans shall be established for purposes \nof maintaining all common areas. An \nongoing financial mechanism and oversight \nfunctions to provide for maintenance shall \nbe established prior to occupancy of any \nunit.\n13.\tPrivate Open Space: Each unit shall provide its \nown private space so as to maintain a feeling of \nlivability and to not encourage crowding. The \nspace shall be provided by one of the following, \nin which no dimension of private open space \narea shall be less than 6 feet:\na.\t Each townhouse unit shall have an attached \nprivate open space area located at the rear \nof the unit of at least 120 square feet in \nsize. The area shall be enclosed, screened or \notherwise designed to provide privacy with \nelements such as 6 feet high sight-obscuring \nfencing, building offsets, and/or vegetative \nscreening. The combined total area of a \ndeck or balcony and patio/rear yard area \nmay be used to obtain the required private \narea square footage; or\nb.\t Where it is not possible to locate the private \nopen space entirely at the rear of the unit, \na private open space may be located on the \nfront façade in the form of an upper story \nbalcony and the square footage will count \ntoward the 120-square-foot requirement.  \n2. Open Spaces continued\nFig. A.2.d.6: Shared private open space\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 68,
      "text": "[4.11]-68\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nA.\t \tIntent: To improve the pedestrian environment \nby making it easier, safer, and more comfortable \nto walk among residences, businesses, open space \nareas, the street sidewalk, transit stops, through \nparking areas, adjacent properties, and connections \nthroughout Downtown. \nB.\t Applicable Downtown Design Principles: \nA.\t Provide a Vibrant Mix of Uses. \nC.\t Create a Vibrant Public Realm. \nD.\t Create strong connections between Plan \nDistricts and Sub-Districts. \nE.\t Incorporate Sustainability. \nI.\t Increase Transportation Accessibility. \nC.\t Guidelines \nAll Development\n1.\t Walkways shall provide clear connections \nbetween building entrances and off-site \npedestrian walkways.\n2.\t Walkways shall connect building entrances \nwithin the development.\n3.\t Walkways shall incorporate sustainability \nfeatures such as pervious paving or french \ndrains to direct run-off. Private developments \nare encouraged to use a variety of stormwater \ninfiltration and conveyance systems, such \nas french drains and valley drains, provided \nmaintenance is ensured.\n4.\t Walkways shall include amenities that enhance \nthe pedestrian experience such as planters, \nbenches, other seating opportunities, overhead \nweather protection, or art. They shall be \ndenoted with architectural features so that \npedestrian routes are clear, safe and distinct \nfrom vehicular areas.\n5.\t Walkways shall provide appropriate connections \nto transit stops. Where a building is close to \na transit stop and adequate shelter does not \nexist, consider including a covered and lighted \nentrance where people can wait for transit out \nof the weather. If the development includes a \nretail use, locate the storefront and weather \nprotection close to the transit stop.\n6.\t Walkways in parking lots shall provide clear \nconnections without winding through parking \nspaces and shall accommodate at least two \n3. Walkways and Pedestrian \nCirculation\nFig. A.3.c.5: Walkway connecting to a major transit stop\nFig. A.3.c.1 through 4: Pedestrian walkway through development \nsite provides generous width, landscaping, special lighting, \nand active facades to create a safe, stimulating and appealing \npedestrian environment.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 69,
      "text": "[4.11]-69\nCity of Gresham Development Code\n(06/22)\n\t\npeople side by side.\n7.\t Parked vehicles shall not encroach upon the \nareas designed for pedestrian circulation.\n8.\t Walkways shall have adequate lighting to \nincrease the personal safety of pedestrians.\n9.\t In DMU and DTM, larger projects shall \nincorporate frequent passageways. Consider \nusing architectural features to further enhance \nthe pedestrian experience in these important \ncommunity connectors: \na.\t Special paving \nb.\t Landscaping \nc.\t Lighting such as lighted bollards along the \nwalkway and accent lighting on abutting \nstructures \nd.\t Trellis \nAll Development \n10.\tThe site shall be designed to achieve uniform \nillumination levels with minimum glare to \nadjacent properties to create a comfortable and \nsafe environment in harmony with the character \nof the surrounding areas.\nMultifamily Residential & Townhouse\n11.\tThe on-site pedestrian circulation system shall \nbe continuous and connect the following: \nstreets abutting the site; ground-level units’ \nentrances and common parking areas; shared \nopen space and children’s playground areas; \nabutting transit facility; and any pedestrian \namenities such as plazas, resting areas and \nviewpoints.\n12.\tThe on-site shared pedestrian circulation system \nfor all developments, including townhouses, \nshall be designed to meet the accessibility \nstandards of the Building Code. \n3. Walkways and Pedestrian \nCirculation continued\nFig. A.3.c.6: Gracious and landscaped walkway\nFig. A.3.c.4: Way-finding signage integrated into the design of a \nsite\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 70,
      "text": "[4.11]-70\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nD.\t Standards: \nAll Development\n1.\t Walkways shall connect public sidewalks with \nbuilding entrances not fronting on public \nstreets. \n2.\t Walkways shall connect building entries to other \nentries within the development. \n3.\t Walkways shall incorporate at least one of the \nfollowing elements: \na.\t pervious paving for at least 50 percent of \nsurface area, including sand set decorative \npaving; stone; porous concrete; or \ninterlocking concrete paver system with \ngaps to allow water infiltration. \nb.\t \twalkways that direct surface runoff to \npervious areas. \nc.\t \thigh-quality, durable seating every 50 feet. \n4.\t Walkways shall be distinctively paved and \nmarked so that the public has a clear sense \nof where they can travel on foot. Acceptable \npavement treatments include: \na.\t scored or sawcut concrete in a grid pattern \nb.\t decorative troweling patterns \nc.\t colored surfaces such as Lithocrete \nd.\t concrete with inset art objects \n5.\t Walkways shall be located to provide an obvious \nconnection to transit stops. \n6.\t  Walkways having a width of at least 5 feet shall \nbe provided in all parking lots with more than \n60 stalls or development sites greater than \n40,000 square feet. Walkways shall be located \nto provide convenient access for the greatest \namount of users.\n7.\t Walkways that abut the head of vehicle parking \nspaces shall be 7 feet wide unless wheel stops \nare used to ensure a minimum 5-foot-wide clear \nwalk. \n8.\t Pedestrian circulation plans shall incorporate \nall of the following techniques to increase the \npersonal safety of pedestrians: \na.\t Provide lighting so that walkways shall \nbe illuminated to a minimum of 0.5 foot-\ncandles at any one point, a minimum \naverage of 1.5 foot-candles over the entire \n3. Walkways and Pedestrian \nCirculation continued\nFig. A.3.d.4: Minimum 5-foot walkway with scoring\nFig. A.3.d.3: Porous walkway\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 71,
      "text": "[4.11]-71\nCity of Gresham Development Code\n(07/13)\n\t\nsurface and a maximum average of 3 foot-\ncandles over the entire surface during the \nhours of darkness. Average foot candles \nshall be the average amount of light at a \n3-foot height above a surface as determined \nusing a photometric plan with 1-foot grid \nspot foot-candle readings. The Manager \nor Design Commission may modify these \nlevels if such modifications are deemed \nnecessary and appropriate for the use and \nsurrounding area. Lighting shall be designed \nso as to not shine directly into residential \nunits by the use of cut-off or directional \nfeatures; and \nb.\t When walkways are between two buildings, \nprovide at least one of the following: \n1.\t Access control (such as a gate) to limit \naccess to the walkway; \n2.\t Surveillance opportunities for the \nlength of the walkway, such as views \nfrom streets, public sidewalks or from \nwindows in adjacent buildings; \n3.\t Mirrors or other elements that \nprovide views around corners where \npedestrians would have difficulty seeing \npart of the walkway because of blind \ncorners or other building obstructions.\n9.\t In DMU and DTM:\na.\t Through-block walkways shall be required \nfor new development every 200 to 300 feet \nin DMU and at least every 200 feet in DTM.\nb.\t Walkways shall be at least 10 feet wide and \nincorporate lighting for pedestrian safety.\nc.\t Walkways shall connect destinations such as \nparking areas, buildings, streets and public \nspaces. \n10.\t The site shall be designed to achieve uniform \nillumination levels with a minimum glare \nto adjacent properties in order to create a \ncomfortable and safe environment.\na.\t The following areas shall be illuminated \nduring the hours of darkness: driveways; \nopen parking lots and carports; on-site \npedestrian circulation walks; and entries to \ncommon buildings. \n1.\t Light fixtures shall not exceed 25 feet in \nheight.\n3. Walkways and Pedestrian \nCirculation continued\nFig. A.3.d.1 and 2: Walkway through residential development \nwith benches\nFig. A.3.d.9: Walkway connecting parking and building \nentrances to the street.\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 72,
      "text": "[4.11]-72\n(09/17)\nCity of Gresham Development Code \nb.\t The following illumination levels plus those \nstated in Table 4.1151(A)(3) shall act as \nminimum standards for all exterior lighting.\n1.\t Maximum average lighting will be \ngoverned by the 6:1 ratio of maximum \naverage to minimum illumination of \nthe surface being lit as stated in Table \n4.1151(A)(3). \n2.\t Generally, maximum illumination at \nthe property line shall not exceed \none-half foot candle. However, where \na site abuts a non-residential district, \nmaximum illumination at the property \nline shall not exceed 1 foot candle. \n3.\t No direct light source shall be visible \nat the property line (adjacent to \nresidential) at ground level. \n4.\t Average foot candles shall be the \naverage amount of light at 3-foot height \nabove a surface as determined using a \nphotometric plan with 1- foot grid spot \nfoot-candle readings. \n5.\t The Manager or Design Commission \nmay modify these levels if such \nmodifications are deemed necessary \nand appropriate for the use and \nsurrounding area. \nc.\t Developments shall use full cut-off lighting \nfixtures to avoid off site lighting, night sky \npollution and shining lights into residential \nunits. Fixtures shall have a cut-off angle \nof 90 degrees as measured perpendicular \nto the ground. The Manager or Design \nCommission may choose to waive or alter \ncut-off requirements of this section when \nappropriate historic or decorative fixtures \nare proposed (e.g. use of decorative up-\nlighting to illuminate the underside of a \ncanopy or columns on a facade, where \na canopy or roof projection restricts the \nprojection of the light into the night sky or \nbollards). Weather- and vandalism-resistant \ncovers shall protect lighting devices.\n3. Walkways and Pedestrian \nCirculation continued\nFig. A.3.d.12: Pedestrian circulation with adequate lighting.\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 73,
      "text": "[4.11]-73\nCity of Gresham Development Code\n(09/17)\nTable 4.1151(A)(3)\nArea \nof Illumination\nIllumination Level\n(foot candles)*\nParking Areas\n0.5 minimum\nLoading and \nUnloading Areas\n0.5 minimum\nWalkways\n0.5 minimum with an average of 1.5\nBuilding Entrances - \nFrequent Use\n1.0 minimum with an average of 3.5\nBuilding Entrances - \nInfrequent Use\n1.0 minimum with an average of 2.0\n*\t The minimum light measured in foot-candles at the \npoint of least illumination when measured at 3 feet \nabove ground level.\n3. Walkways and Pedestrian \nCirculation continued\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 74,
      "text": "[4.11]-74\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nA.\t Intent: To reduce the visual impact of surface lots \nand parking structures. \nB.\t Applicable Downtown Design Principles: \nB.\t Promote Excellence in Design. \nC.\t Create a Vibrant Public Realm. \nE.\t Incorporate Sustainability. \nF.\t Context Sensitivity. \nH.\t Create Appropriate Transitions in Height, Bulk \nand Scale.\nC.\t Guidelines: \nAll Development \n1.\t Section 9.0823(C)(4) Landscaping of Parking \nLots: Perimeter Screening applies to all new \ndevelopments. The following additional \nguidelines supplement this Section. A departure \nfrom the referenced Code Section requires \ndemonstration of meeting the intent statement \nand approval by the Manager or Design \nCommission. \n2.\t Although parking lots are to be located behind \nbuildings or within structures, there may be \nconditions where parking lots are visible from \npublic streets, alleys or walkways. Screening \nshall be used to obscure this visibility and soften \nthe relationship between public places and \nlarge paved areas for vehicles. In DCC, facades \non all sides of the building shall be lined with \nactivated uses such as, retail, residences with \nentries and windows, or offices. Screening \nmethods for parking lots shall use vegetation \nand or walls, along with landscaping. \n3.\t On the ground-floor level facing street \nfrontages, parking structures shall provide \na perimeter of active use spaces such as \ncommercial, industrial, institutional or \nresidential uses unless substitutions are \napproved by the decision authority, either \nthe Design Commission or the Manager. \nSubstitutions for active uses may include trees \nand other vegetation or artfully designed walls \nor grillwork. Parking structures shall be viewed \nnot merely as utilitarian but as contributions \nto the architectural quality and character of \nDowntown, with materials and details that \nreflect the composition of the building and the \n4. Parking Lot/Parking Garage \nScreening\nFig. A.4.c.3 (2): Parking structure with decorative metal \nscreening\nFig. A.4.c.3 (1): Parking structure softened with lattice and \nvegetation\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 75,
      "text": "[4.11]-75\nCity of Gresham Development Code\n(01/19)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n\t\nsurrounding buildings.\n4.\t Low-impact development stormwater practices \nshall be incorporated into parking lots.\n5.\t Parking entrances/exists shall be limited so as to \nminimize the number of vehicular crossings of \npedestrian areas while still ensuring adequate \nsite circulation.\n6.\t Screening shall incorporate high-quality \nmaterials.\n7.\t Parking structures shall contribute to the \narchitectural quality and active street life of the \nDowntown.\n8.\t In DCC, low screening that helps reduce the \nappearance of gaps in the street wall shall be \nprovided for parking lots near streets.\n9.\t In DCC and DMU:\na.\t Along downtown local streets, facades on all \nsides of the parking structure shall be lined \nwith active retail spaces or residences with \nentries and windows. \nb.\t Uses lining parking structures shall \nincorporate transparent glass to allow for \nvisual interaction with the building interior \nfrom pedestrian areas. \n4. Parking Lot/Parking Garage \nScreening continued\nFig. A.4.c.3 (3): Parking structure designed with architectural \nfacades on all sides and ground level retail\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 76,
      "text": "[4.11]-76\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nD.\t Standards: \nAll Development \n1.\t Section 9.0823(C)(4) Landscaping of Parking \nLots: Perimeter Screening applies to all new \ndevelopments. The following additional \nstandards supplement this Section. \n2.\t Surface parking lots shall be screened to \na height of 3 feet using at least one of the \nfollowing: \na.\t A combination of evergreen and deciduous \nshrubs spaced no more than 3 feet apart \nplanted in an area at least 5 feet wide. The \nheight shall be met at installation. \nb.\t Ornamental masonry wall clad with brick or \ntile \nc.\t Ornamental metal fence \nd.\t A combination of a masonry wall and \nornamental metal fencing \ne.\t Other elements that meet the intent, \nas approved by the Manager or Design \nCommission. \n3.\t Parking structures visible from the street shall \nbe screened using at least one of the following: \na.\t A permitted use such as commercial, \nindustrial, institutional or residential use \nwith a minimum depth of 20 feet \nb.\t An ornamental screen made of metal work \nc.\t Trees with a minimum caliper of 2 inches at \n6 feet above grade and maximum spacing of \n25 feet, along with shrubs, and understory \nplanting \nd.\t Bas-relief sculpture \ne.\t Another approved device that meets the \nintent \n4.\t Rain gardens shall be incorporated into planting \nareas. \n5.\t Parking entrances/exits shall be limited to one \nper each street face. \n6.\t Chain link fencing, plain metal bars, concrete \nblock or plywood are not acceptable for \nscreening materials. \n7.\t Parking structures must have flat floors on \nstreet frontages. Ramps and slanted floors may \nbe used in areas that have less visibility from \n4. Parking Lot/Parking Garage \nScreening continued\nFig. A.4.d.2 (1): Parking lot landscaping screen\nFig. A.4.d.2 (2): Parking lot landscaping and masonry wall \nscreen\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 77,
      "text": "[4.11]-77\nCity of Gresham Development Code\n(07/13)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n\t\nthe street, such as the center of the structure or \nat the rear away from street frontages. \n8.\t In DCC, for parking lot screening, a structure, \nsuch as an architectural fence or low masonry \nwall 3 feet in height, shall be built at the back \nedge of the sidewalk.\n9.\t In DCC and DMU, structured parking facing \npedestrian streets within the district shall \nbe lined with uses that provide visibility into \nbuilding interiors. Other sides of the building \nshall be treated with other architectural or \nlandscaping means to break up and screen the \nblank wall surface.\n4. Parking Lot/Parking Garage \nScreening continued\nFig. A.4.d.3: Active street-level use lining a parking structure\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 78,
      "text": "[4.11]-78\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nA.\t Intent: To utilize landscape features to improve \nthe appearance of Downtown sites, provide \nopportunities for stormwater management, \nprovide opportunities for shading to reduce the \ntemperature difference between developed and \nundeveloped areas, and to create comfortable \nplaces for residents that are amendable to social \nactivity. \nB.\t Applicable Downtown Design Principles: \nA. Provide a Vibrant Mix of Uses. \nB. Promote Excellence in Design. \nC. Create a Vibrant Public Realm. \nE. Incorporate Sustainability. \nF. Context Sensitivity. \nC.\t Guidelines: Parking lot Landscaping and Lighting\nAll Development  and Townhouse\n1.\t Licensed Design Professional. The landscape \nplan shall be created by a licensed design \nprofessional such as a Landscape Architect, \nArchitect or Civil Engineer. The landscape plan \nshall exhibit the following characteristics:\na.\t The overall design of the site and the design \nof the proposed landscape materials shall \nachieve unique, attractive and significant \nlandscaping on the site as a whole;\nb.\t The proper type, spacing, height, placement \nand location of plant materials shall be \nprovided to ensure that the intent of this \nordinance is met;\nc.\t The choice and selection of plant materials \nshall insure that root systems will not \ninterfere with public utilities and so that \nfruit and other debris, except leaves, will \nnot constitute a nuisance within public \nrights-of-way or to abutting property \nowners;\nd.\t The choice and selection of plant materials \nshall ensure that the type of plantings \nselected will be of a type that will survive \nand thrive in the area in which they are to \nbe located; and\ne.\t The proper relationship between deciduous \nand evergreen plant materials shall exist \nso as to ensure that the desired buffering \neffect will be accomplished.\n5. Landscaping\nFig. A.5.c.3 (2): A rich array of plantings creates an appealing \nresidential street scene\nFig. A.5.c.3 (1): A landscaped area which utilizes a variety of \ncomplementary plant material.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 79,
      "text": "[4.11]-79\nCity of Gresham Development Code\n(07/13)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nf.\t Plant sizes shall provide a more mature \nappearance at installation. \n2.\t Landscape Maintenance: The standards of \nSection 4.1151(A)(5)(d)(2) shall be met.\n3.\t Site Landscaping\na.\t Use a rich, yet coordinated palette of \nlandscape materials throughout the site \nto provide scale, texture and color that \nsupports the design intentions of the \nbuilding architecture.\nb.\t For an entry way, planting shall be massed \nand scaled as appropriate to demarcate the \nentrance.\nc.\t Enhance the site with ornamental plant \nmaterial, such as ornamental trees, \nflowering shrubs and perennials and ground \ncovers.\nd.\t Extend the landscape character of the area \ninto the site; in particular, include mature \nshade trees where appropriate.\ne.\t Automatic watering systems and drought \ntolerant species are encouraged to \npromote water conservation and reduce \nmaintenance concerns.\nf.\t In DRL-1 and DRL-2:\n1.\t Use a landscape palette that reflects \nthe climate and positive landscape \ncharacter found in the neighborhood. \nIn general, use a rich yet coordinated \npalette of landscape materials to \nprovide scale, texture and color. \n2.\t Extend the landscape character to the \npublic realm by providing shade trees \nin the planting strip and understory \nthat will enhance the street level \nenvironment. \n4.\t Parking lot landscaping \na.\t Section 9.0823 Landscaping of Parking \nLots applies to all new developments. \nThe following additional guidelines \nsupplement this Section. A departure \nfrom the referenced Code Section requires \ndemonstration of meeting the intent \nstatement and approval by the Manager or \nDesign Commission. \nb.\t Within parking lots, parking shall be divided \n5. Landscaping continued\nFig. A.5.C.4: Dense plantings are used to enhance the \nappearance of an entry to a parking area.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 80,
      "text": "[4.11]-80\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n\t\nwith landscaped parking bays/islands to \nminimize the impact of the parking. \nc.\t Lighting fixtures shall be pedestrian-scaled \nand designed to prevent glare. \nd.\t Stormwater management techniques shall \nbe incorporated into the design of parking \nlots. \ne.\t Parking lot landscaping and decorative \npaving shall be used to soften the visual \nimpact on adjacent buildings and public \nspaces. \nMultifamily Residential and Townhouse\n5.\t Shared Open Space\na.\t Make plazas, courtyards, patios and lawns \ncomfortable for human activity and social \ninteraction - standing, sitting, talking, eating \nand playing.\nb.\t Create a pleasant climate, including shade \nfrom summer sun and access to winter \nsunlight. Locate seating with consideration \nto sun and shade.\nc.\t Use plants, furniture and lighting to shape, \nenliven, and give purpose to outdoor space.\nd.\t Consider adding a focal element, such as a \nsculpture or fountain to outdoor space.\ne.\t Design outdoor space with safety in mind. \nOn-site plazas and courtyards shall promote \nvisibility from the street, and lighting to \nenhance nighttime security.\nf.\t Enhance the front of the building with \nornamental plant material, such as \nornamental trees, flowering shrubs and \nperennials and ground covers.\ng.\t For townhouses, landscaping or other \ntreatments between driveways shall be \nutilized to break up continuous pavement \nand provide rainwater infiltration.\n5. Landscaping continued\nFig. A.5.c.4.e: Decorative paving, bollards and trees in parking \nareas \nFig. A.5.c.4: Landscaped swale through parking lot provides low \nimpact stormwater infiltration\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 81,
      "text": "[4.11]-81\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nD.\t Standards: \nAll Development and Townhouse\n1.\t A professional licensed Landscape Architect \nshall complete and stamp the landscape plan for \nthe development.\n2.\t Landscape Maintenance. Compliance with the \nfollowing criteria is required:\na.\t Inspections. A City representative will \nperform a final landscape inspection to \nensure that the landscaping demonstrates \nequivalent compliance with the approved \nlandscape plan upon completion of the \nproject and before issuance of a Temporary \nor Final Certificate of Occupancy, following a \nrequest from the developer. The inspection \ntime period is from March 1 to November \n15. If an inspection is requested between \nNovember 16 and the last day of February \nand the landscaping is not complete, or \nif the applicant requests a Temporary \nCertificate of Occupancy to occupy one \nor more buildings on site prior to the \nlandscaping being completed, a financial \nguarantee shall be provided. This will be \nbased on 110 percent of the estimated cost \nof plant materials and labor for the total \nlandscape plan as indicated in a landscape \ncost estimate. Beginning March 1, the \nApplicant has 180 days to complete the \nitems or the City will cash in the amount \nbeing held and finish the landscape job.\nb.\t Establishment Period. The establishment \nperiod for the plant material guarantee will \nbegin at the Final Certificate of Occupancy \ninspection approval and extend to two \nyears from that date. All plantings shall \nbe properly planted as to be in a healthy, \ngrowing condition at commencement of \nthe establishment period. At the end of the \nestablishment period, any plantings that \nare 20 percent dead or greater shall be \nreplaced.\nc.\t Maintenance:\n1.\t Maintenance of required plantings by \nthe owner shall be carried out so as \nto present a healthy, neat and orderly \nappearance, free from refuse and \ndebris.\n5. Landscaping continued\nFig. A.5.d.1 and 3: Attractive and well-maintained landscaping\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 82,
      "text": "[4.11]-82\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n2.\t To insure proper maintenance and \nas a condition of Final Site Plan \napproval, the property owner shall \nenter into and record with the City a \nLandscape Maintenance Agreement, or \ninclude such provisions as part of the \ndeveloper’s agreement or deed, each \nof which shall be approved by the City \nAttorney. Such instrument shall identify \nthe minimum plan of maintenance, \nthe person or entity responsible for \nmaintenance, and shall provide the \nprocedure, authority and finance for \nCity cure of breaches by the responsible \nentity. Such instrument shall also \ninclude: \na.\t Provisions that all unhealthy and \ndead material shall be replaced \nwithin one year, or the next \nappropriate planting period, \nwhichever occurs first;\nb.\t All landscaped areas shall be \nprovided with an automatic and \noperating irrigation system;\nc.\t Tree stakes, guy wires and tree wrap \nare to be removed after one winter \nseason; and\nd.\t Plantings shall be guaranteed for \ntwo years after the Final Certificate \nof Occupancy inspection approval.\n3.\t Responsibility and Certificates of \nOccupancy. The owner of the property \nsubject to the requirements of this \nSection shall be responsible for \ninstalling and maintaining landscaping \nper the approved final landscape plan \nas specified in this Section.\n3.\t Site Landscaping\na.\t At least 15 percent of the site area shall be \nlandscaped. Required sidewalk easements \ncan be subtracted from the site area for \npurposes of this calculation.\nb.\t At least 70 percent of the front yard setback \narea shall be landscaped in meeting the 15 \npercent site area total. Use of ornamental \ngrass lawns shall be limited to 20 percent of \nthis requirement in the front yard. \n5. Landscaping continued\nFig. A.5.d.3 (2): A variety of plantings enhances the walkway \nthrough the site\nFig. A.5.d.3 (1): Meeting the landscaping requirement can be \naccomplished through a number of site features\ncommon \nopen space\nfront yards\nwalkways\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 83,
      "text": "[4.11]-83\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n\t\nExceptions:\n1.\t In townhouse developments with \ndriveways in the front, the driveway \narea defined by the minimum driveway \nwidth through the front setback may be \nexcluded from total front setback area \nfor the calculation; and\n2.\t For Commercial, Industrial and \nInstitutional uses providing a publicly \naccessible walkway or publicly \naccessible open spaces or outdoor \ndining areas between the right of way \nand the building frontage, the front \nsetback landscape percentage may \nbe reduced by the Manager or Design \nCommission to as low as 10 percent.\nc.\t Landscaping as defined in Section 3.0010, \nall landscaped setback areas, landscaped \npublic and private common open space, \neco-roofs, preserved natural areas, planter \nareas, landscaped screening areas, as well \nas landscaped strips located between the \ncurb and sidewalk can be included to meet \nthe 15 percent landscaping requirement. \nIn addition, walkways that provide access \nthrough common landscaped areas may \ncount for up to 66 percent of the total \nrequired landscape area.\nd.\t A minimum of 20 percent of landscape \nareas shall be planted with drought-\nresistant canopy trees, shrubs, \ngroundcovers, perennials and grasses. \ne.\t In addition to required street trees, site \ntrees shall be required at a rate of one \ntree per 3,000 square feet of gross site \narea. Existing regulated major trees may \nbe counted as two required site trees. \nExisting trees to be counted toward this \nrequirement must be confirmed by a \nConsulting Arborist, Qualified Arborist or \na Registered Consulting Arborists to be \nhealthy trees. Buffer, yard, drive and parking \nlot tree requirements may count toward the \nsite tree requirement. \nf.\t Trees, including those in parking area \nlandscaping and buffering, shall be planted \nat sizes no less than the following:\n5. Landscaping continued\nFig. A.5.d.3 (1): Setback landscaping may count toward \nlandscaping requirements. \nFig. A.5.d.3 (2): Setback landscaping may count toward \nlandscaping requirements. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 84,
      "text": "[4.11]-84\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n1.\t Deciduous canopy trees shall be a \nminimum of 2.5 inch caliper size and \nshall be balled and burlapped or \ncontainer stock.\n2.\t Deciduous ornamental trees shall be a \nminimum of 2-inch caliper size and shall \nbe balled and burlapped or container \nstock.\n3.\t Evergreen trees shall be a minimum of \n6 foot in height and shall be balled and \nburlapped or container stock.\n4.\t New site trees shall be distributed \nthroughout the project rather than \nclumping them in one location.\n5.\t New site trees shall be supported (by \nuse of stakes, wire or similar material) \nfor at least one year to prevent damage \nby strong winds. \ng.\t Shrub sizes shall be as follows:\n1.\t Evergreen and deciduous shrubs, with \nthe exception of dwarf shrubs such as \nboxwood, must be a minimum of 24 \ninches high from finished grade and a \nminimum of 1 gallon size at planting; \n2.\t Perennials shall be a minimum of 1 \ngallon size; and\n3.\t Ground covers shall be well-rooted in \neither flats or a minimum of 1-gallon \npots.\nh.\t All landscaped areas shall be irrigated with \nan in-ground irrigation system, unless a \nlicensed landscape architect submits written \nverification that the proposed planting \nmaterials do not require irrigation.\n4.\t Parking Lot Landscaping and Lighting\na.\t Section 9.0823 Landscaping of Parking \nLots applies to all new developments. The \nfollowing additional standards supplement \nthis Section.\nb.\t Within parking lots, an average of 1 (one) \nlandscaped parking bay/island shall be \ninstalled per nine parking stalls. The parking \nbays/islands shall be distributed throughout \nthe parking lot.\nc.\t Parking lot light fixtures shall be cut-off \nfixtures and shall be shielded to prevent \n5. Landscaping continued\nunderstory \nplantings\n9’ min from inside curb \nto inside curb\ncut-off \nlight fixture\nFig. A.5.d.4 (2): Landscaped island\nFig. A.5.d.4 (1): A range of required parking lot landscaping as a \nsite amenity\nFig. A.5.d.5: Generous landscaping in the landscaped strip \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 85,
      "text": "[4.11]-85\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n\t\nglare and lighting into abutting buildings \nand properties.\nd.\t Parking lot light fixtures shall be between 18 \nfeet and 24 feet in height.\ne.\t Stormwater management, including rain \ngardens, stormwater planters, and swales \nfor sites larger than 20,000 square feet shall \nbe applied to all landscaped areas so that \nrun-off is captured and filtered into the \nground.\nf.\t Any planting areas within parking lots that \nare not part of a parking island shall have a \nminimum depth of 5 feet.\nMultifamily Residential and Townhouse\n5.\t Shared Open Spaces shall provide at least three \nof the following amenities to accommodate a \nvariety of ages and activities. Amenities include:\na.\t Site furnishings (seating areas, tables)\nb.\t Patios, plazas, or courtyards\nc.\t Tot lots\nd.\t Gardens\ne.\t Open lawn\nf.\t Play fields\ng.\t Sports courts, such as tennis or basketball \ncourts\nh.\t Architectural lighting\ni.\t Fountain\nj.\t Art piece\n5. Landscaping continued\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 86,
      "text": "[4.11]-86\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nA.\t \tIntent: To create designs that enhance the natural \nenvironment by reducing water use, minimizing \npollution and maximizing the project’s positive \neffects on the built and natural environment.\nB.\t Applicable Downtown Design Principles\nB. Promote Excellence in Design. \nE. Incorporate Sustainability. \nF. Context Sensitivity. \nI. Increase Transportation Accessibility\nC.\t Design Guidelines:\nAll Development\n1.\t and 2: Developments shall utilize strategies that \nreduce water and energy usage attributed to \nsite and building development, building use, and \nthe transportation of building users while not \ndetracting from good site and building design. \nHealthy and sustainable communities shall \nbe created that incorporate “best practices” \nsuch as LEED for Neighborhood Development \nto conserve natural resources, reduce carbon \nemissions and promote interaction between \nresidents. Landscape practices and strategies \nthat reduce wasteful water practices shall be \nincluded in all developments in a creative way.\nD.\t Standards:\nAll Development\n1.\t Water conservation and treatment shall be \npromoted through a minimum of two of the \nfollowing:\na.\t The irrigation system shall minimize water \nusage by incorporating at least one of the \nfollowing:\n1.\t A rain sensor to prevent watering during \na rain event;\n2.\t Rotor irrigation heads; or\n3.\t A drip irrigation system.\nb.\t On-site rain gardens and stormwater \nfacilities shall be incorporated and designed \nin accordance with Gresham Green \nDevelopment Practices for Stormwater \nManagement.\nc.\t Rainwater shall be used in public spaces to \nactivate the space via art elements, water \nfeatures, etc.\n6. Sustainable Design\nFig A.6.c.1 and 2: An open space which incorporates stormwater \ninfiltration facilities.\nFig A.6.c.1 and 2: A modular vegetated roof system reduces \nstormwater and insulates the roof surface.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 87,
      "text": "[4.11]-87\nCity of Gresham Development Code\n(07/13)\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\nd.\t Permeable paving over at least 40 percent \nof all paved surfaces.\ne.\t Other Low Impact Development features \nthat capture and filter runoff into the \nground as approved by the Manager or \nDesign Commission.\n2.\t Energy conservation in site and building \ndevelopment shall be promoted through any of \nthe following:\na.\t One of the following passive energy \nefficiency measures:\n1.\t Include protected double door lock \nentry doors on the north and east sides \nof the structure or add an effective \nwindbreak such as a wall; \n2.\t Orient the long axis of the building \neast and west, with unobstructed solar \naccess to the south wall and roof;\n3.\t Locate the windows to take advantage \nof passive solar collection and include \narchitectural shading devices (such \nas window overhangs) that reduce \nsummer heat gain while encouraging \npassive solar heating in the winter;\n4.\t Skylights or another daylighting \nsystem that illuminates 75 percent of \nthe building floor area, with skylights \noccupying a minimum of 3 percent of \nthe roof area with spacing between the \nskylights not greater than 1.4 times the \nceiling height.\nb.\t Provide an on-site alternative transportation \ninfrastructure, including;\n1.\t An on-site alternative fuel refueling \nstation (such as an electric, biodiesel, or \nnatural gas fueling station). An electric \nfueling station shall be within sight of a \nfunctional building entry; and\n2.\t Bicycle facilities including employee \nshowers and changing areas.\nc.\t Install solar energy panels on the roof of \nthe building or other location. The location \nand configuration of solar energy panels \nshall be approved by the Manager or Design \nCommission depending on the procedure \ntype only as permitted in Section 4.1100, \n4.1134-4.1138 and 10.0900. Solar energy \n6. Sustainable Design \ncontinued\nFig A.6.d.1: A public art piece collects rain water and discharges \nit into a stormwater area.\nFig A.6.d.2: This green roof system absorbs rainwater to minimize \nstormwater run-off and provides opportunity for possible water \nre-use. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 88,
      "text": "[4.11]-88\n(09/17)\nCity of Gresham Development Code \n\t\npanels shall be integrated into the building \ndesign or shall be designed to have minimal \nadverse visual effects on other surrounding \nareas. The quantity of solar energy panels \nshall:\n1.\t Generate at least 10 percent of the \ntypical energy usage for the building. \nThe typical energy model for the \nbuilding shall be determined by \nreferencing the LEED standards; or\n2.\t Comprise an area greater than or equal \nto 20 percent of the roof area.\nd.\t Plant a vegetated eco-roof on top of the \nbuilding or carport that covers 20 percent of \nthe building footprint;\ne.\t Source sustainable and local materials that \nare within 500 miles of the development \nsite or provide 20 percent sustainably \nharvested Forestry Stewardship Council \n(FSC) rating construction materials; and\nf.\t Preserve 50 percent of existing regulated \nmajor trees on site. Major trees must be \nhealthy as determined by a consulting \narborist, a qualified arborist or a registered \nconsulting arborist.\ng.\t At least 20 percent of trees, 20 percent \nof shrubs, and 20 percent of groundcover \nplants shall be food-producing perennial \nspecies, such as named varietals of cherries, \napples, hazelnuts, blueberries, strawberries, \netc. Parking lot and street trees shall be \nselected from the Recommended Parking \nLot and Street Tree Lists.\n6. Sustainable Design \ncontinued\nFig A.6.d.2.d: This green roof provides an attractive, sustainable \nhabitat for wildlife.\nFig A.6.D.2.g: Many species of creeping raspberries (such as \nthe Rubus pentalobus) create dense groundcover, are drought \nresistant and shade tolerant, and can handle light to medium \nfoot traffic. \n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 89,
      "text": "[4.11]-89\nCity of Gresham Development Code\n(07/13)\nIntentionally blank\n4.1151 \tDowntown Design \nGuidelines and Standards\nA. Site Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 90,
      "text": "[4.11]-90\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nA.\t Intent: To improve the appearance and reduce the \nvisual scale of large buildings by interrupting long \nexpanses of walls.\nB.\t Applicable Downtown Design Principles:\nE.\t Incorporate Sustainability.\nF.\t Context Sensitivity.\nG.\t Preserve and Enhance Historic Character.\nH.\t Create Appropriate Transitions in Height, Bulk \nand Scale\nC.\t Guidelines:\nAll Development\n1.\t Buildings shall be designed with volumes \nto maintain a compatible scale with their \nsurroundings. Volumes shall reinforce a human \nscale within the built environment.\n2.\t The massing changes shall create an attractive \nbuilding with enhanced visual interest for the \npublic.\n3.\t and 4: In DCC and DMU:\na.\t Employ design strategies and incorporate \narchitectural elements that reinforce the \nDowntown core’s unique and positive \nqualities; in particular, compatible design \nshall respect the scale and massing of \nadjacent buildings. \nb.\t New development shall employ appropriate \nheight and massing transitions to adjacent \nbuildings. \nCommercial, Industrial and Institutional \n5.\t The quantity of masses required shall be \nsufficient to add interest to buildings of that \nscale.\n6.\t Buildings shall not include long, monotonous, \nuninterrupted walls and shall utilize design \nstrategies which create depth and add interest \nto the facade. Changes in masses shall be \nsufficient to provide visual distinction between \nwall planes.\n7.\t Buildings shall utilize building masses to \nframe and define streets and public spaces, \nestablishing more prominence at these \nlocations.\n8.\t Building masses shall emphasize highly visible \nareas including street intersections.\n1.\tMassing\nFig. B.1.c.1 (2): Upper story stepbacks create a transition in \nheight, bulk and scale\nFig. B.1.c.1 (1): Orientation and massing of a tall building’s base \nplaces strong emphasis on the street and creates a humane \nstreet environment\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 91,
      "text": "[4.11]-91\nCity of Gresham Development Code\n(06/22)\n1.\tMassing (continued)\nMultifamily and Townhouse \n9.\t and 10: Multifamily and townhouse \ndevelopments shall:\na.\t Avoid long, monotonous, uninterrupted \nwalls if the buildings front the public realm; \nand\nb.\t Be modulated to prevent large, \nuninterrupted, monotonous walls; and\nc.\t Differentiate between the base of the \nbuilding and the top of the building to \nenhance the pedestrian realm. Base \ntreatments shall be cohesive across facades \nand integrated with the architectural \ncharacter of the building.\nExisting Development\n11.\tExisting buildings shall follow the above \nguidelines when significant changes are made to \nthe building envelope.\n12.\tNew additions to historic buildings shall \ncomplement the original façade without \ncompeting with it.\nD.\t Standards\nAll Development\n1.\t The minimum building mass or volume change \nshall be 25 percent of the total volume of the \noverall building.\n2.\t The changes in mass shall be visible from the \npublic street.\n3.\t In DMU, developments shall have a 45-foot \nheight limit within 50 feet of sub-districts that \nhave a maximum height limit of 45 feet or less.\n4.\t In DCC, to integrate new development with the \nscale of its surroundings, buildings shall provide \na step back of at least 6 feet for all floors above \n35 feet. This can be counted towards meeting \nthe project’s Downtown Massing requirement. \nCommercial, Industrial and Institutional\n5.\t Building shall have a quantity of masses that \ncorrespond to the footprint size:\na.\t Building with footprints up to and including \n30,000 square feet may consist of one mass \nor building volume.\nb.\t Building with footprints greater than 30,000 \nFig B.1.c.1: Changes in massing reinforce a human scale that \nrelates to the pedestrian.\nFig B.1.d.1: A building with a large footprint is divided into \nmultiple masses, each greater than 25% of the footprint.\n1\n2\n3\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 92,
      "text": "[4.11]-92\n(06/22)\nCity of Gresham Development Code \n\t\nsquare feet shall be comprised of at least \ntwo masses or building volumes.\n6.\t Mass changes shall be distinct building \nvolumes, façade jogs or other façade changes \nas approved by the Manager or Design \nCommission. Changes in mass shall include a \nchange in the depth greater than that used \nfor articulating features as specified in Section \n4.1151(B)(2).\n7.\t To frame the street and public spaces:\na.\t One-story buildings (or portions of \nbuildings) shall have a front facade elevation \nof at least 15 feet, including roof forms, for \nat least 60 percent of the facade length. \nb.\t When the building is on the corner of two \nstreets, the tallest mass shall be at the \ncorner or along the primary street.\n8.\t Buildings on the north side of Third between \nMain and Kelly are encouraged to have a \ncolonnade feature on the first floor of the \nbuilding. Colonnades constructed shall have a \nminimum depth of 10 feet from the back of the \ncurb to the building face. Colonnade ceilings \nshall be at least 16 feet tall to allow sufficient \nlight into the space under the colonnade. \nBuildings with colonnades may exceed the \nmaximum building setback to achieve the \nminimum colonnade depth as approved by the \nManager or Design Commission. The square \nfootage under the colonnade may count toward \nthe building square footage in calculating \nwhether the project meets the minimum floor \narea ratio standard.\nMultifamily Residential\n9.\t Structures shall not have an overall horizontal \ndistance exceeding 160 linear feet, measured \nfrom end wall to end wall. Structures facing a \nstreet can increase to 200 linear feet provided \na courtyard, portal to a shared parking area or \nother open space is provided that breaks up the \nbuilding wall. Open spaces shall be a minimum \nof 35 feet in width and depth. \n10.\tExcept for single story structures, buildings shall \nhave, at a minimum, a base and top. \na.\t The top of the base shall consist of a distinct \nphysical transition between the base and \nthe upper floors. The base treatment shall \n1. Massing continued\nFig B.1.d.7: The tallest mass of the building is placed along the \nprimary street on which the building is located.\nFig. B.1.d.9: Structures facing a street can increase horizontal \nlength to 200 feet by providing an internal courtyard with a \nminimum 35-foot width.\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 93,
      "text": "[4.11]-93\nCity of Gresham Development Code\n(09/17)\n1. Massing continued\n\t\nbe located on a majority of the length of \neach building facade, and shall wrap all \nvisible building corners. The base height \nshall be from grade to a minimum of the \ntop of the first floor and a maximum of \nthe top of the second floor. The transition \nelement (such as change in brick pattern \nand other materials, articulation of a floor \nline, change in window types, etc.) shall be \ncompatible, where possible, with datums on \nsurrounding buildings.\nb.\t The top of the building shall be considered \neither the upper story or the top of the \nfaçade and shall have a distinct visual design \nfrom the base by material treatment, color, \ntexture or change in materials or roof form.\nExisting Development\n11.\tRenovations of existing buildings with footprints \nover 30,000 square feet that add 5,000 square \nfeet of footprint or greater shall have no less \nthan two masses at the discretion of the \nManager or Design Commission. Renovations \nthat do not change the existing building \nenvelope are exempt from standards specified \nin Building Massing.\n12.\tNew additions to buildings designated as \nhistoric on the City of Gresham’s Historic and \nCultural Landmarks List shall be complementary \nand a separate distinct mass from the existing \nbuilding.\nFig B.1.D.12: An addition (above the original three stories) to a \nhistoric building that is visually distinct and complimentary to the \noriginal form. \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 94,
      "text": "[4.11]-94\n(09/17)\nCity of Gresham Development Code \nA.\t Intent: To establish a set of contextually responsive, \nclear and pleasing set of proportions that will \ncontribute to a coherent building design and \npromote architectural excellence within the \nDowntown. Long sections of blank wall are \ndiscouraged.\nB.\t Applicable Downtown Design Principles:\nA.\t Provide a Vibrant Mix of Uses.\nB.\t Promote Excellence in Design.\nC.\t Create a Vibrant Public Realm.\nE.\t Incorporate Sustainability.\nF.\t Context Sensitivity.\nG.\t Preserve and Enhance Historic Character.\nC.\t Guidelines\nAll Development \n1.\t Mechanical Screening: The Standard in Section \n4.1151(B)(2)(D)(1) is required. Utilities shall be \nscreened from the public realm and the internal \npublic or private areas.\n2.\t Mechanical equipment and individual \nthrough wall units shall not detract from the \nbuilding architecture and façade composition \nand shall be designed to minimize their \nvisibility. Equipment shall not project \nbeyond the adjacent finished wall plane and \nshall be screened and integrated into the \nbuilding’s overall architectural design, facade \ncomposition, and detailing.\nCommercial, Industrial and Institutional \n3.\t Buildings shall not include long, monotonous, \nuninterrupted walls and shall utilize design \nstrategies that create depth and add interest to \nthe facade. Changes in depth shall be sufficient \nto provide visual distinction between wall \nplanes.\na.\t Articulating elements shall provide surface \nrelief, depth and shadows to the facade by \nbeing recessed and/or projected.\nb.\t Changes in building depth shall reinforce \nand create a consistent street wall.\n4.\t Buildings shall create a rhythm of repeating \nelements that help establish continuity in the \nfacade.\n5.\t Upper-floor facades shall have adequate upper-\n2.\tFaçade Composition\nFig. B.2.c.4: Belt line above the ground level and regular \ncadence of bays and storefronts.\nFig B.2.c.4: Horizontal elements, including a series of belt \ncourses, the cornice and the bulkhead, establish rhythm in the \nstorefront.\nbulkhead\nbelt course\ncornice\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 95,
      "text": "[4.11]-95\nCity of Gresham Development Code\n(06/22)\n\t\nfloor glazing to ensure highly articulated facades \nand provide sufficient street surveillance.\n6.\t Sustainable features shall be incorporated into \nthe façade articulation where feasible.\n7.\t In DCC:\na.\t A cohesive and continuous building street \nwall, composed of a stock of well-built, \n“background” buildings is the backbone of \na quality downtown. However, buildings \nstriving to have a heightened civic or \nsocial function are encouraged to include \nmore visually prominent and dramatic \narchitectural elements. \nb.\t Consider retaining historically or \narchitecturally significant buildings on a site \nthrough adaptive use. \nc.\t Rehabilitate and restore historically \nsignificant buildings on a site according \nto the Secretary of Interior’s Section 106 \nStandards. \n8.\t Window recesses shall be sufficient to support \nfaçade articulation and provide surface relief, \ndepth and shadow.\n9.\t Use elements such as vegetation, artwork, \ntrellis structures, architectural detailing, \nreveals and/or contrasting materials to provide \nvisual interest on what otherwise would be \nblank walls. These shall be used in a manner \nconsistent with other façade composition \nelements.\nMultifamily Residential \n10.\tChanges in wall planes, layering, horizontal \ndatums, vertical datums, building materials, \ncolor, or fenestration shall be incorporated to \ncreate simple and visually interesting buildings.\n11.\tWindows and doors shall be designed to create \ndepth and shadows and to emphasize wall \nthickness and give expression to residential \nbuildings. Windows shall be used on the façade \nto provide articulation to the façade and \nvisibility into the street.\n12.\tBlank, windowless walls in excess of 750 \nsquare feet are prohibited when facing a public \nstreet unless required by the Building Code. \nIn instances where a blank wall exceeds 750 \nsquare feet, it shall be articulated or intensive \n2.\tFaçade Composition \n(continued)\nFig. B.2.c.10 (2): Building materials and colors create simple \nand interesting façades.\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 96,
      "text": "[4.11]-96\n(06/22)\nCity of Gresham Development Code \n\t\nlandscaping shall be provided.\n12.\tBuilding Façade Transition. Adjacent building \nfaçades shall be compatible. \n13.\tGarage doors shall be integrated into the design \nof the larger façade in terms of color, scale, \nmaterials, and building style.\n14.\tUpper-floor facades shall have adequate \nupper-floor glazing to ensure highly articulated \nfacades, provide sufficient street surveillance, \nand assist in indicating the rhythm of residential \nunits.\nTownhouse \n15.\tBuilding lengths shall be broken up to limit the \napparent mass of townhouse development and \nenhance pedestrian connections through the \nsite.\n16.\tOffset dwelling units to provide building \narticulation.\n17.\tMake entries more prominent with architectural \nfeatures that make them stand out and provide \nlanding space at the front door to add to the \nlayers of elements between the sidewalk and \nthe front door.\n18.\tProvide roof elements that define the top of the \nbuilding.\n19.\tWindow trim shall highlight windows and give \nexpression to residential buildings.\n20.\tFaçade articulation such as banding, window \ntrim, corner trim and other elements shall be \nprovided on all sides of a building that are not \nshared with another building.\n21.\tProvide a variety of architectural elements to \nprovide articulation to the residential units and \navoid flat-faced facades.\n22.\tProvide variation to exterior finishes to avoid \nmonotonous building facades.\n23.\tCorner buildings shall respond to the corner \nlocation with architectural features that \nemphasize and address the corner.\n24.\tCourtyard buildings shall feature orientation \nof the buildings or courtyard to the street. \nThis shall include de-emphasizing parking and \nautomobile access.\n25.\tThe entry and living portions of the façade shall \nbe emphasized, with the garage and automobile \n2.\tFaçade Composition \ncontinued\nFig. B.2.d.22: Bays reduce townhouse style building facades \ninto smaller volumes to achieve residential scale and unified \nbuilding appearance.\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 97,
      "text": "[4.11]-97\nCity of Gresham Development Code\n(09/17)\n2.\tFaçade Composition \ncontinued\n\t\naccess portions of the façade de-emphasized.\n27.\tStreet-facing garages shall not dominate the \nfaçade.\n28.\tBuildings shall feature adequate glazing to \nestablish scale and give expression to residential \nbuildings and provide sufficient surveillance \nopportunities from all facades.\n29.\tBuilding design shall reflect that the building is \ndivided into individual units. \nExisting Development\n30.\tExisting buildings shall follow the appropriate \nbuilding façade guidelines when changes to the \nbuilding façade are reviewed for a permit.\nD.\t Standards\nAll Development \n1.\t Mechanical and communication equipment \nand components shall be screened so they are \nnot visible from streets and other street level \npublic spaces, including alleys. They shall be \nscreened in a manner that is compatible with \nthe architectural character of the building. \nAppropriate screening for rooftop equipment \nincludes parapet walls or architecturally \ncompatible fabricated enclosures such as \npanels and walls. The Manager or Design \nCommission may require a review of rooftop \nequipment screening by requesting sight line \nstudies. Utilities such as transformers, heating \nand cooling, electric meters and other utility \nequipment shall not be located within 5 feet of \nthe front entrances and shall be screened with \nevergreen landscape materials of a height and \nspacing at time of planting that will screen the \nequipment or with fencing that is opaque and \nscreens the equipment.\n2.\t Packaged Terminal Air Conditioners, Package \nTerminal Heat Pumps and similar systems with \nindividual through-wall heating/cooling that are \nvisible, including from internal public or private \nareas, shall not be allowed.\nCommercial, Industrial and Institutional \n3.\t Building walls shall be articulated with design \nfeatures that add visual interest and prevent the \nappearance of blank walls. Facades visible from \nstreets, public spaces and parking areas shall \nFig. B.2.d.3: Pedestrian experience is enhanced by ground-floor \nstorefronts, rhythmic recesses and projections.\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 98,
      "text": "[4.11]-98\n(09/17)\nCity of Gresham Development Code \n\t\nutilize at least one of the following strategies:\na.\t A repeating pattern of wall recesses and/\nor projections that has a relief of at least \n12 inches (such as recessed structural bays \nor recessed window openings between \ncolumns). Wall recessions and projections \nshall be at intervals of not greater than 30 \nfeet with customer entries and those facing \nthe street and at intervals not greater than \n100 feet on remaining facades; or \nb.\t Changes in wall plane with a depth of \nat least 24 inches which respond to the \nbuilding module. These changes in wall \nplane shall occur at intervals of not less \nthan 25 feet and not more than 100 feet.\n4.\t All facades shall establish a rhythm by repeating \ndesign elements at regular spacing along the \nlength and/or height of the facade. All facades \nshall contain at least one of the following design \nfeatures: \na.\t Columns or pilasters with plinths at regular \nintervals no greater than 30 feet apart. \nb.\t Major vertical mullions of at least 6 inches \nin width, and larger than other mullions \nin the same window opening, on all-glass \nfacades.\nc.\t Vertical reveals no less than 6 inches.\nd.\t Belt courses above ground floor level and \nalong the entire facade.\ne.\t Lintels or arches over the windows and \ndoors.\n5.\t On the facade facing the principal street, upper \nfloors shall provide a minimum of 25 percent \nglazing in the total area as measured above the \nfirst floor, excluding roof shapes such as gables.\n6.\t If sustainable features on the facade, such as \nsun shades and rain water harvesting features, \nare used they shall be used to organize the \nfacade composition either horizontally or \nvertically. \n7.\t In DCC, the architectural character of adjacent \nhistoric or noteworthy building shall be \ncomplemented; however, imitation of historical \nstyles is discouraged. New buildings shall \naccomplish this by taking visual cues from the \nimmediate area and interpreting them in a \ncontemporary manner. This includes: \n2.\tFaçade Composition \ncontinued\nFig B.2.d.4: A building which is designed with pilasters and belt \ncourses to enhance the facades.\nFig B.2.d.4: Major vertical mullions, in conjunction with a change \nin plane, visually break up an all glass facade.\nFig. B.2.d.7: In DCC, buildings should establish base, middle \nand top. \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 99,
      "text": "[4.11]-99\nCity of Gresham Development Code\n(06/22)\na.\t Establishing a base, middle and top; and\nb.\t Recessed, rather than strip windows on \nupper levels are required; and\nc.\t Horizontal datum lines, such as belt lines \nand cornices shall line up with adjacent \nfacades if applicable.\n8.\t Windows shall be recessed at least 4 inches to \nreinforce rhythms and cast shadows.\n9.\t If a blank wall greater than 30 feet long for \nbuildings with up to a 30,000-square-foot \nfootprint and 50 feet long for larger buildings \nis unavoidable, one of the following shall be \nincorporated throughout the length of the blank \nwall:\na.\t A trellis or trellises that cover 40 percent \nof the blank wall with vines planted that \nwill grow vertically of sufficient density \nand height so that they provide significant \ncoverage of the blank wall. The plantings \nshall be at least 4 feet tall or cover at least \n50 percent of each trellis at the time of \nplanting; or\nb.\t Decorative tile work that covers at least 40 \npercent of the blank wall; or\nc.\t Artwork reviewed and approved by the \nManager or Design Commission that covers \nat least 40 percent of the blank wall; or\nd.\t Evergreen hedge with a minimum of 1 \ngallon size and 3 feet in height at planting \nevery 3 feet on center for the 80 percent of \nthe blank wall length; or\ne.\t Screening incorporating sub-canopy trees \n(trees that will be 25 feet or shorter at \nmaturity) every 15 feet along the wall. \nThe trees shall meet size requirements in \n4.1151(A)(5).\nMultifamily Residential\n10.\tStreet-facing elevations shall be divided into \nwall planes that reflect living unit modules. \nGenerally wall planes over 750 square feet \nshall be divided into distinct planes. This can be \nachieved by:\na.\t Incorporating elements such as porches or \ndecks into the wall plane;\nb.\t Recessing the building a minimum of 2 feet \nover 6 feet in width; or\n2.\tFaçade Composition \ncontinued\nFig. B.2.d.10 (1): No contiguous wall planes over 750 square \nfeet.\nFig. B.2.d.10 (2): Wall planes over 750 square feet are divided \ninto distinct planes by incorporating porches and/or extending \nan architectural bay.\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 100,
      "text": "[4.11]-100\n(06/22)\nCity of Gresham Development Code \nc.\t Extending an architectural bay a minimum \nof 2 feet from the primary street facing \nfaçade.\n11.\tExterior windows shall have a minimum of 2 \ninch reveal (depth) to create a shadow line that \nhighlights materials and the thickness of the \nwall.\n12.\tBlank, windowless walls are prohibited when \nfacing a public street unless required by the \nBuilding Code. Blank walls are discouraged in all \nother situations. Where the construction of a \nblank wall is required and it exceeds 750 square \nfeet, it shall be articulated.\n13.\tWithin a development, the building façades \nshall transition from one building face \nto an adjacent building face through the \nuse of compatible materials, glazing and \nscale elements such as porches and decks. \nArchitectural elements such as posts, beams \nand planting walls shall be scaled to reflect their \nfunction. Tacked-on faux architectural elements \nare prohibited.\n14.\tGarage doors shall match the main building in \nterms of color, materials, and trim.\n15.\tOn facades facing streets, the area for windows \nand doors on upper floors shall be at least of 25 \npercent of the total area as measured above the \nfirst floor excluding roof shapes such as gables. \nTownhouse \n16.\tNo building exterior wall dimension or row \nof contiguous dwellings (in one structure) \nshall exceed 100 feet in continuous building \nlength. An exception to this are courtyards (“U” \nshaped) developments where no unbroken (i.e. \ncontinuous) section of the “U” shall exceed \n100 feet. (Note: courtyard developments may \nalso include multiple buildings that create a \ncourtyard effect as long as individual building \nlengths do not exceed 100 feet.)\n17.\tOffset every two dwelling units from the next \ndwelling unit by at least 4 feet in exterior wall \noffset for buildings 2 stories or taller and over \n50 feet in length, or, at least 2 feet in offset for \nbuildings one story in height or less than 50 feet \nin length.\n2.\tFaçade Composition \ncontinued\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 101,
      "text": "[4.11]-101\nCity of Gresham Development Code\n(09/17)\n18.\tFor each entry, provide a covered porch or \nportico with a floor area of at least 40 square \nfeet.\n19.\tRoof eaves shall be provided (minimum 12-inch \nprojection).\n20.\tWindow trim shall be provided (minimum \n3-inches wide).\n21.\tFaçade (wall) treatments (including exterior \nfinish patterns, story lines/floor banding, \nwindow trim, corner trim/corner boards, and \nrelated items) shall be provided on all sides of \nthe building.\n22.\tThe applicant shall also provide a minimum of \nfour of the following architectural elements in \nthe building design:\na.\t Dormers\nb.\t Gables\nc.\t Recessed entries\nd.\t Cupolas or towers\ne.\t Pillars or columns\nf.\t Additional offsets in building face or roof \n(minimum 16-inches)\ng.\t Bay windows\nh.\t Decorative and/or alternating patterns on \nthe exterior finish (e.g. scales/shingles, trim \nboards, ornamentation or similar features)\ni.\t Decorative cornice or pediment\nj.\t For one story buildings, the use of at least \n2 or more different exterior finishes and \npatterns including such types as masonry, \nstone, stucco, wood, terra cotta, and tile\nk.\t Where masonry is used for exterior finish, \napply decorative bonds and a range of \ncolors\nl.\t Cantilevers\nm.\tEnergy Conservation features including non-\nwindow elements and other design features \nthat channel natural light from exterior \nwalls or roof (such as by the use of skylights, \nsolar tubes, atriums, and related features)\nn.\t Windows on all non-street fronting building \nends\n23.\tProvide at least 2 different exterior finish \npatterns for all multi-story buildings.\n2.\tFaçade Composition \ncontinued\nFig B.2.c.19: Roof eaves help define the top of the structure.\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 102,
      "text": "[4.11]-102\n(06/22)\nCity of Gresham Development Code \n24.\tThe design of corner buildings that have \nfacades facing both streets shall include a \nunique feature at the corner such as a tower, \ncorner bay or gable, or a combination of \narchitectural elements that visually enhance the \nbuilding corner. As an alternative, a functional \n(i.e. usable) and decorative pedestrian or \nlandscaping feature of not less than 300 square \nfeet in ground area may be provided.\n25.\tNon lineal (“U” or other shaped) building \nfootprints that create common area courtyards \nmay be permitted if proper rear access is \nprovided.  \n26.\tGarage facades shall not be located closer to \na street than façade portions of the structure \nfacing said street containing living space (i.e. no \n“snout” units are permitted).\n27.\tStreet-facing garages associated with duplexes \nand multifamily townhouse configuration shall \nhave a maximum width of 50 percent of the \noverall building width.\n28.\tWindows shall occupy a minimum of 20 percent \nof the total street facing façade. A minimum of \n25 percent of the ground floor living units shall \nbe windows.\n29.\tHorizontal facades longer than 30 feet shall \nbe reduced into smaller volumes as individual \nunits to achieve a residential scale and a unified \nbuilding appearance. A minimum of one of the \nfollowing methods shall be used:\na.\t Variation in the building form by using bays, \nshifts in massing or distinct roof shapes;\nb.\t Diversity of window size, shape or patterns \nthat relate to the interior function;\nc.\t Emphasis of building entries through a \nprojecting or recessed form, detail, color, \nand/or materials; or\nd.\t Variation in detailing including sills, headers, \nbelt courses, reveals, pilasters, window \nbays, and similar features.\nExisting Development \n30.\tRenovations that modify the exterior building \nfacades and require a permit shall follow \nSection 4.1151(B)(2)(D) at the discretion of the \nManager or Design Commission.\n2.\tFaçade Composition \ncontinued\nFig. B.2.d.28: Street-facing facade is composed of a minimum of \n20 percent glazing (25 percent on the ground floor).\nFig. B.2.d.24: A unique building feature at the corner with \ninteresting facades facing both streets.\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 103,
      "text": "[4.11]-103\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nIntentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 104,
      "text": "[4.11]-104\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nA.\t Intent: To reinforce the streetscape by encouraging \nthe greatest amount of visual interest along the \nground level of buildings facing pedestrian streets.\nB.\t Applicable Downtown Design Principles:\nA.\t Provide a Vibrant Mix of Uses.\nB.\t Promote Excellence in Design.\nC.\t Create a Vibrant Public Realm.\nD.\t Create strong connections between Plan \nDistricts and Sub-Districts.\nG.\t Preserve and Enhance Historic Character.\nC.\t Guidelines\nCommercial, Industrial and Institutional\n1.\t \tStreet-facing facades shall have additional \ndesign elements at the street level to add \ninterest, enhance the building appearance, \nestablish greater depth in the facade and \nenliven the pedestrian realm. These features \nshall complement those used to satisfy the \nGuidelines and Standards of Section 4.1151(B)\n(2) Facade Composition.\n2.\t Storefront windows shall utilize a bulkhead or \nother design feature to transition the building to \nthe ground and establish depth and interest in \nthe facade.\n3.\t Buildings shall feature an architecturally distinct \nbase to address and enhance the meeting of the \nbuilding and ground.\n4.\t Building bases shall be proportional to the size \nof the building and shall be visually pleasing.\n5.\t \tCommercial, mixed-use and civic buildings \nshall be designed to allow easy access between \npublic areas and the building’s interior.\nMultifamily Development\n6.\t Multifamily Buildings: Multifamily buildings \nshall contain features and design strategies \nthat create defensible space and a separation \nbetween public and private spaces.\n7.\t Provide a transitional design feature(s) between \npublic spaces and residential spaces at the \nground floor to distinguish between the public \nand private realms.\nExisting Development\n8.\t Existing buildings shall follow the appropriate \n3.\tGround-level Details\nFig. B.3.c.1: Colorful, expressive ground-level facade elements \nhelp animate the street.\nFig B.3.c.1 and 5: The ground level is enhanced by features \nincluding awnings, pedestrian-scale signage and recessed \nwindows. The roll-up door and regular pedestrian door provide \neasy access between the public sidewalk and building interior.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 105,
      "text": "[4.11]-105\nCity of Gresham Development Code\n(12/15)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n\t\nground-level details guidelines when changes to \nthe building façade are reviewed for a permit.\nD.\t Standards\nCommercial, Industrial and Institutional\n1.\t Ground-floor, street-facing facades of \ncommercial, industrial and institutional \nbuildings shall incorporate at least three of the \nfollowing: \na.\t Medallions at regular intervals no greater \nthan 30 feet.\nb.\t Transom windows above storefront \nwindows and doors.\nc.\t Projecting sills, a minimum of 2 inches from \nthe window pane.\nd.\t Lintels or arches (including but not limited \nto flat, segmented and round arches) over \nwindows and doors. \ne.\t Ornamental brick or tile work, such as a \nherringbone pattern, on a minimum of 5 \npercent of the ground level facade.\nf.\t Pedestrian-scaled lighting fixtures or wall-\nmounted projecting lighting fixtures such as \nwall sconces at regular spacing no greater \nthan 30 feet.\ng.\t Awnings, canopies or solar shades/\nreflectors placed over windows, doors or \noutdoor spaces with a minimum projection \nof 4 feet in an amount and configuration \napproved by the Manager or Design \nCommission that is compatible with the \narchitecture of the building, adds façade \ndepth and significantly contributes to the \npedestrian environment.\nh.\t Projecting signs or banners oriented toward \npedestrian walks.\n3.\tGround-level Details \ncontinued\nFig. B.3.d.1: Awnings, ornamental tile and projecting sills provide \nground-level details.\ncanopy\nseasonal \nplanter\nstorefront \nwindow\nbulkhead\npedestrian \nscale signs\npedestrian \nscale lights\nrecessed entry\nprojecting sill\nFig. B.3.d.1: \nGround--level diagram\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 106,
      "text": "[4.11]-106\n(06-22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\ni.\t Outdoor seating areas enclosed by a fence, \nwall or landscaping at a height of 30 inches.\nj.\t Planter boxes, a minimum of 6 square feet, \nand not in an accessible pedestrian walk.\nk.\t In all sub-districts except DCC, bulkheads for \nstorefront windows, 1-2 feet from ground \nlevel.\nl.\t Other feature approved by the Manager or \nDesign Commission.\n2.\t In DCC, ground-floor storefronts shall be \ndesigned with bulkheads that extend between 1 \nand 2 feet above ground level.\n3.\t Building facades shall include design elements \nwhich establish a building base. Building bases \nshall consist of a visible change in the building \nfacade, and include one of the following:\na.\t A change in material;\nb.\t Texture;\nc.\t Pattern; \nd.\t Ornamentation; or \ne.\t A change in depth no less than 4 inches. \nThe required change in depth for bases may \nbe reduced to 2 inches when they intersect \nother articulating features, such as pilasters, \nin order to provide visual distinction.\n4.\t The building base shall be a minimum height \nno less than 5 percent of the facade height \nand shall not exceed 20 percent of the facade \nheight. At the discretion of the Manager or \nDesign Commission, multi-story buildings of \nthree levels or greater may have a building base \nequal to the wall area attributed to the ground \nfloor. A landscape area at the base of the \nbuilding with plant material at least 5 percent \nof the facade height may count toward the \nbuilding base requirement.\n5.\t On street-facing facades, ground floor \ncommercial, employment and live/work uses \nshall be at the sidewalk elevation. \nMultifamily Residential\n6.\t When multifamily space is present on the \nground floor, one of the following features shall \nbe present on street facing facades:\na.\t Building base landscaping no less than 5 \nfeet deep. \n3.\tGround-level Details \ncontinued\nFig B.3.d.4 (1): A building base that utilizes a change in material.  \nFig B.3.d.4 (2): A building base that utilizes a change in material.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 107,
      "text": "[4.11]-107\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nb.\t On street frontages, a space-defining \ndecorative fence, wall, hedge or retaining \nwall 30 inches in height located at the \nproperty line or setback no more than 5 \nfeet.\n7.\t Multifamily space on the ground floor, excluding \nmixed-use buildings with commercial ground \nfloors, shall provide a transition between public \nspace and private space by incorporating a \nminimum of one of the following transition \nelements:\na.\t Elevate the first floor a minimum of 3 feet \nabove grade. Entries may be at grade; or\nb.\t Set back the building an additional 5 feet \nbeyond the minimum setback or recess the \nfirst floor an additional 5 feet beyond the \nsecond-floor facade; or\nc.\t Provide a front porch that is a minimum of \n48 square feet with minimum dimensions \nto fit a 5-foot by 6-foot rectangle inside the \nporch area; or\nd.\t Provide a front landscaped courtyard of \nat least 60 square feet separated by a \nminimum 30-inch-tall hedge or decorative \nfence; or\ne.\t Provide raised planter(s) between 18 \ninches and 30 inches in height and 4 feet in \ndepth as measured from the point of the \nplanter nearest the front property line. The \nplanter(s) shall occupy at least 50 percent \nof the frontage of each unit and be planted \nwith perennial landscaping; or\nf.\t Other strategy as determined by the \nManager or Design Commission.\nExisting Development \n8.\t Renovations that modify the exterior building \nfacades and require a permit shall follow \nSection 4.1151(B)(3)(D) at the discretion of the \nManager or Design Commission.\n3.\tGround-level Details \ncontinued\nFig B.3.d.7 and 8: Elevated landscaped area and a decorative \nwall create a division between public and private space..\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 108,
      "text": "[4.11]-108\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n4.\tSign Design\nA.\t Intent: To ensure that signage is part of an \nintegrated design approach to a project and to \nencourage interesting, creative and personalized \nelements in the public realm.\nB.\t Applicable Downtown Design Principles:\nA.\t Provide a Vibrant Mix of Uses.\nB.\t Promote Excellence in Design.\nC.\t Create a Vibrant Public Realm.\nG.\t Preserve and Enhance Historic Character.\nC.\t Guidelines\nCommercial, Industrial and Institutional \n1.\t Wall signs shall be proportional to the building \nfaçade, be integrated into the design of the \nbuilding and reflect its function. Creative signs \nwith personality that are an expression of the \nbusiness are encouraged.\n2.\t Projecting signs shall be oriented to the \npedestrian and promote safety and walkability \nin their location, size and clearance above the \nground. Creative signs with personality that are \nan expression of the business are encouraged.\n3.\t Window signs shall be limited to maximize \nvisibility into active spaces. Creative signs \nwith personality that are an expression of the \nbusiness are encouraged.\n4.\t Signs that feature lighting shall be carefully \nilluminated to provide a high-quality \nappearance that is well-integrated into the sign \ndesign and building architecture and character. \nTownhouse\n5.\t Addressing systems shall be provided consistent \nwith Section 4.1151(B)(4)(d)(5).\nD.\t Standards\nCommercial, Industrial and Institutional \n1.\t Wall Signs: \na.\t Area: The maximum permitted area of a \nwall sign shall be 8 percent of the wall area \nupon which the sign is located.\nb.\t Types: Fascia, mansard wall, awning, \nmarquee and painted wall signs are \npermitted. \nc.\t Location:\n1.\t Fascia signs for ground-floor commercial \nFig. B.4.c.1 (1): Well-crafted wall sign adds to the street-level \nexperience\nFig. B.4.c.2: Projecting sign\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 109,
      "text": "[4.11]-109\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n4.\tSign Design continued\n\t\nand industrial uses shall fit into a sign \nband of fascia or directly above the \nground-level facade to help reinforce \nhorizontal lines along the street.\n2.\t Fascia signs shall not extend beyond the \nouter edges of the building front. \n2.\t Projecting Signs: \na.\t Area: The maximum size of an individual \nprojecting sign (one face) shall be 8 ft2. \nb.\t Height: A projecting sign shall not extend \nabove the roof line at the wall or above the \ntop of the parapet wall, whichever is higher. \nIn no case shall any portion of a projecting \nsign exceed a height of 25 feet above grade.\nc.\t Clearance: Projecting signs shall have a \nminimum clearance of 8 feet between the \nbottom of the sign and the ground. \nd.\t Location: The sign shall not extend from the \nbuilding facade for a distance greater than 6 \nfeet, or a distance equal to 2/3 the width of \nthe abutting sidewalk, whichever is less. \n3.\t Window Signs: The maximum area of window \nsignage shall not exceed 20 percent of the \nwindow.\n4.\t Internal illumination of signs shall not be \npermitted. Neon is allowed.\nTownhouse\n5.\t An addressing system shall be provided and \nshall consist of the following:\na.\t Individual building addresses shall be \nclearly visible (as determined by the Fire \nMarshal) from the abutting public street \nright-of-way or from the abutting driveway \nor private street, shall be at least 6 inches in \nheight, shall be of a contrasting color to the \nbackground and shall be illuminated so as \nto be visible during the hours of darkness. \nBuilding addresses (including any building \nidentification letters) shall be clearly visible \non all sides of the buildings.\nb.\t Each individual unit within a complex shall \ndisplay a unit number that shall be at least \n4 inches in height and illuminated during \nthe hours of darkness. Each breezeway \nshall also be posted with appropriate \nunit numbers and, when applicable, with \nappropriate building addresses or letters for \nthe breezeway.\nFig. B.4.d.1: Wall sign in sign band about storefront.\nFig. B.4.d.1 & 2: Ground-floor sign diagram\nBooks and More\nwall sign meeting \ndimension, placement \nand coverage \nrequirements\nprojecting \nsign\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 110,
      "text": "[4.11]-110\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nA.\t Intent: To promote the use of building facades to \nprovide safe and comfortable waiting areas for \ntransit and provide visual connections between \nactivities inside and out.\nB.\t Accompanies Design Principles:\nA.\t Provide a Vibrant Mix of Uses.\nC.\t Create a Vibrant Public Realm.\nC.\t Guidelines:\nAll Development and Townhouse\n1.\t through 3: Promote pedestrian-oriented uses \nwith a high degree of transparency along the \nstreet. Uses shall be readily discernible to \npassers-by. \nCommercial, Industrial and Institutional \n4.\t Reflective, opaque, and highly tinted glass shall \nbe avoided in storefront windows and doors. \n5.\t Window features used to satisfy the \ntransparency requirements shall be usable and \nprovide visual interest along the façade.  \n6.\t Features used to satisfy transparency \nrequirements shall remain transparent and add \nvisual interest to the façade. \nExisting Development\n7.\t Existing buildings under renovation that require \na building permit shall maximize transparency if \nwindows are being replaced.\nD.\t Standards:\nAll Development and Townhouse\n1.\t For ground-level facades on Downtown \nstreets without a street type designation that \nare visible from any street, a minimum of 25 \npercent of façade areas with a residential use \nmust be clear, transparent glass and a minimum \nof 40 percent of facades with commercial uses \nmust be clear, transparent glass.\n2.\t In each building, the ground-level facade \narea shall contain clear, transparent glass on \nfacades visible from any street at the following \npercentages (by use and Street Type):\na.\t Urban Boulevard: 25 percent for Multifamily \nResidential and Townhouse and 50 percent \nfor Commercial, Industrial and Institutional \nuses.\n5. Transparency\nFig. B.5.c.2: Generous ground-level transparency\nFig. B.5.c.1: Merchandise and activity inside is highly visible \nfrom along the sidewalk.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 111,
      "text": "[4.11]-111\nCity of Gresham Development Code\n(06/22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n5. Transparency continued\nb.\t Downtown Local: 25 percent for Multifamily \nResidential and Townhouse and 50 percent \nfor Commercial, Industrial and Institutional \nuses. \nc.\t Beech: 25 percent for Multifamily \nResidential and Townhouse and 50% for \nCommercial, Industrial and Institutional \nuses.\nd.\t Main Avenue: 50 percent\ne.\t Stanley Avenue: 25 percent for Multifamily \nResidential and Townhouse uses and 50 \npercent for Commercial, Industrial and \nInstitutional uses.\nf.\t Cleveland Avenue: 25 percent for \nMultifamily Residential and Townhouse and \n50 percent for Commercial, Industrial and \ninstitutional uses.\n3.\t The minimums above shall be calculated on the \narea of the ground-floor facade between 2 feet \nand 12 feet above grade.\nCommercial, Industrial and Institutional\n4.\t To meet the clear, transparent glass \nrequirement, windows shall have a Visible \nTransmittance value of 60 percent or greater.\n5.\t For commercial uses, display windows for \nmerchandise (that do not provide views into \nthe store) can satisfy the clear, transparent \nglass requirement if the display windows are \nat least 24 inches deep and can contain three-\ndimensional objects, such as product displays or \nmannequins.\n6.\t Films or other substances applied to the \nwindow to reduce the Visible Transmittance \nvalue below 60 percent shall be prohibited.\nExisting Development\n7.\t Existing buildings with levels of transparency \nless than the amount specified shall not lessen \nthe amount of transparency during renovations \nthat require a permit if the exterior building \nfaçade is altered.\nFig. B.5.d 1 & 2: Ground-level transparency must provide \nvisibility into and from the interior use.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 112,
      "text": "[4.11]-112\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nA.\t Intent: To design and orient building entrances \nthat readily inform people of their access and use. \nA main lobby entrance serves a different purpose \nthan a storefront entrance to a shop, and these \ndifferences should be reinforced in their design. \nHowever, all public and prominent entrances should \nadd character, identity and interest along the street.\nB.\t Applicable Downtown Design Principles:\nA.\t Provide a Vibrant Mix of Uses.\nB.\t Promote Excellence in Design.\nC.\t Create a Vibrant Public Realm.\nD.\t Create strong connections between Plan \nDistricts and Sub-Districts.\nC.\t Guidelines\nCommercial, Industrial and Institutional \n1.\t and 2: The primary (front) building façade and \nmain entry of non-residential buildings shall \nbe well-marked, articulated and oriented to \nand facing the primary public street. Place the \nmain building entrance at a street corner where \nfeasible.\n3.\t Entries shall include a change in form of \nsufficient dimension to visually distinguish \nthe entry from the remainder of the building \nfaçade.\n4.\t Entries facing public streets shall be made \nvisually prominent and receive architectural \nemphasis. A variety of techniques to accomplish \nthis include:\na.\t recessed entries\nb.\t projecting entries\nc.\t elevated entries with stairways for \nresidential uses\nd.\t entry-related cover and/or roof line \narticulation (such as canopy articulation; \nparapet-roof articulation)\ne.\t arched entries\nf.\t decorative lintels of molding above \ndoorways\ng.\t landscape treatment and emphasis\nh.\t surface treatment (such as paver or tiles)\ni.\t entry courtyard\nj.\t transom windows\n6. Prominent Entrances\nFig. B.6.c.4 (1): oversized canopy and columns emphasize the \nmain entry\nFig. B.6.c.3: Trellis and landscape create a gracious main entry\nFig. B.6.c.4 (2): Arched entry\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 113,
      "text": "[4.11]-113\nCity of Gresham Development Code\n(06-22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nk.\t signage\nl.\t pilasters or columns supporting and/or \nframing the entrance\nm.\tother techniques as appropriate\n5.\t Prominent entrances shall be located on the \nmost important street, such as streets with high \nvisibility or streets with more pedestrian traffic.\nMultifamily Residential\n6.\t All building entrances shall be enhanced \narchitecturally. \n7.\t Entries shall be highlighted and visible from the \nstreet.\n8.\t Ground-level entry patios shall be screened \nfrom the street.\n9.\t Visual emphasis shall be placed on building \nfacades, with corridors and stairs incorporated \ninside the building or minimized.\n10.\tStair landings shall be designed to promote \nsurveillance opportunities and safety of those \nusing the stairs.\nMultifamily Residential & Townhouse \n11.\tUnit entrances shall be highlighted and visible \nfrom the street.\nExisting Development\n12.\tExisting building entries that are renovated \nand require a permit shall comply with the \nappropriate guidelines and standards specified \nin this section.\n6. Prominent Entrances \ncontinued\nFig. B.6.d 5 & 6: Double-height entrance and stoop \ndefines the main entry to a multifamily building\nFig. B.6.d 6 & 7: Minor grade separation from \nresidence to street and clear visual connection into \nthe site balances the need for privacy with a strong \nrelationship between the public and private realm.\nFig. B.6.d.8: \nOverhead \nweather \nprotection, \nlandscaping \nand benches \nprovide \npedestrian \ncomfort.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 114,
      "text": "[4.11]-114\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nD.\t Standards\nCommercial, Industrial and Institutional \n1.\t Buildings designed for commercial, industrial \nand institutional uses shall be designed to \nencourage multi-tenant occupancy and walk-\nin traffic at the street level. The following shall \nbe incorporated in the design of street level \nfacades:\na.\t Larger main entrances shall be \ndifferentiated from smaller storefront \nentries. The larger entrance shall be \nsupported by a pair of large piers, while \nsmaller entrances shall be framed with a \npair of smaller columns; and\nb.\t Building entrances shall not be located at \nintervals of more than 75 feet along the \nelevation facing the principal street; and\nc.\t For corner lots, buildings on the corner shall \nplace an entry within 10 feet of the building \ncorner.\n2.\t For mixed-use buildings, at least one \ncommercial, industrial or institutional use shall \nprovide an entrance on the principal street. \nResidential uses shall provide entrances on \neither the principal street or the secondary \nstreet. A corner door, such as one at a \n45-degree angle to the primary street, qualifies \nas being an entrance “on the primary street.” \n3.\t Building entries shall include a visible change \nin building form from adjacent façade sections \nwith a change in depth of at least 12 inches. This \ncould include recessed building entries, changes \nin mass or smaller changes in wall plane.\n4.\t Primary entrances to the building shall have \na dominant presence in the building facade; \nincorporate three of the following features:\na.\t recessed doorway, at least 2 feet from \nsurrounding facade\nb.\t overhang/canopy with a distinct form and \nlarger size than other overhangs on the \nfacade\nc.\t windows, a minimum of 18 inches tall \nabove the door and above the width of the \nentrance.\nd.\t glass windows flanking the doorway, a \nminimum of 1 foot wide and the height of \n6. Prominent Entrances \ncontinued\nFig. B.6.d.4: Large, distinctive canopy highlights a main \nentrance\nFig. B.6.d.3 and 4: Recessed doorway with tile accent at entry\nFig. B.6.d.4: Columns, light fixtures and ornamental landscaping \nframe the primary building entrance\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 115,
      "text": "[4.11]-115\nCity of Gresham Development Code\n(06-22)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n\t\nthe doorway.\ne.\t ornamental light fixtures, flanking both \nsides of the door\nf.\t oversized entry door(s)\ng.\t stone, masonry, or tile paving in entry, a \nminimum of a 6 square feet\nh.\t planters with ornamental landscaping\ni.\t seating, along at least one edge of the entry \nway\n5.\t For the purposes of this prominent entrances \nsubsection, the primary street shall be \naccording to the following street type hierarchy \nor as approved by the Manager or Design \nCommission: Urban Boulevard, Main Avenue, \nUrban Local, other Unique Street.\nMultifamily Residential \n6.\t Multifamily entrances that face the street shall \norient the front door to the street or to a central \ncourtyard. All entries shall be made visually \nprominent and receive architectural emphasis. \nPossible techniques to accomplish this include \nbut are not limited to:\na.\t Recessed entries;\nb.\t Corner entries;\nc.\t Projecting entries, including porches, \ncanopies and articulated lintels above the \ndoorway;\nd.\t Pilasters or columns supporting and/or \nframing the entrance;\ne.\t Elevated entries with transparent stairways \nthat are compatible with the architecture; \nor\nf.\t Landscape treatments that connect the \npublic realm to the private realm.\n7.\t Entrances shall be highlighted by incorporating \ntwo or more of the following elements:\na.\t Landscaping (ground cover, shrubs and \ntrees) that emphasize seasonal color and \ninterest;\nb.\t An entry courtyard;\nc.\t Ornamental glazing, railings and \nbalustrades;\nd.\t Prominent landscape feature, such as a \n6. Prominent Entrances \ncontinued\nFig. B.6.d.6 (1): Multiple entrances and generous landscaping \nFig. B.6.d.6 (2): Main residential entrance facing the street\nFig. B.6.d.7: Entry courtyard directly from the street into the site\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 116,
      "text": "[4.11]-116\n(06/22)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\ntrellis or an arbor;\ne.\t Ornamental gate and/or fence;\nf.\t Water features; or \ng.\t Year-round site furnishings, including \nbenches, tables and sitting areas.\n8.\t Ground-level entry patios are not permitted \nfacing the street, unless landscaped screening is \nprovided on all sides of the patio.\n9.\t For multifamily developments, exterior \ncorridors and stairs visible from the street are \nnot permitted, except for main entry stairs \nleading to the building entrance. \n10.\tThe area of the railings on stair landings shall \nbe a minimum of 50 percent transparent. The \narea of the railing is the height of the railing \nmultiplied by the length of the railing.\nMultifamily Residential  & Townhouse \n11.\tFor developments with multiple ground-related \nunits, such as townhouses, every unit facing the \nstreet shall have an entrance on the street.\nExisting Development\n12.\tWhen existing building entries are renovated \nand require a permit, the buildings shall comply \nwith entry standards. If the building exterior \nis not changed and the entry feature does not \ninclude a change in form, these entry standards \nshall not be required.\n6. Prominent Entrances \ncontinued\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 117,
      "text": "[4.11]-117\nCity of Gresham Development Code\n(07/13)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nIntentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 118,
      "text": "[4.11]-118\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nA.\t Intent: To break up the overall massing of the roof, \nenhance the quality and character of the building, \nand identify different functional areas within the \nbuilding.\nB.\t Applicable Downtown Design Principles:\nB.\t Promote Excellence in Design.\nE.\t Incorporate Sustainability.\nF.\t Context Sensitivity.\nH.\t Create Appropriate Transitions in Height, Bulk \nand Scale\nC.\t Guidelines\nAll Developments\n1.\t and 2: Express roofs in a visually interesting \nmanner that complements the composition of \nthe building and the surrounding area.\nD.\t Standards\nAll Developments\n1.\t Roof forms may be flat or sloped. All flat roofs \nshall employ trim, variation in brick coursing, \na projecting cornice or projecting parapet to \nvisually “cap” the building.\na.\t Cornices shall have a maximum projection \nof 2 feet\nb.\t Parapets must be a minimum 36 inches with \na maximum 2-foot projection\nc.\t False storefront parapets, larger than 15% \nof the height of the supporting wall, are not \npermitted.\n2.\t Sloping roofs shall include at least two of the \nfollowing design elements:\na.\t Slope of at least 4:12\nb.\t Two or more slope planes\nc.\t Overhanging eaves extending at least 1 foot \nbeyond the supporting wall\nd.\t Acceptable sloping roofs include gable, \nhipped, shed, and butterfly roof forms\n7. Roof Lines\nFig. B.7.c.1 and 2: Over-sized projecting eave highlights an \nimportant corner\nFig. B.7.d.1: Treatment of a flat roof\nFig. B.7.d.2: Varied roof form helps break down the scale of the \nbuilding\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 119,
      "text": "[4.11]-119\nCity of Gresham Development Code\n(07/13)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nIntentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 120,
      "text": "[4.11]-120\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nA.\t Intent: To create a strong architectural statement \nand/or enhance access at street corners to signify \none’s arrival into a district or important intersection, \nenhance way-finding and create visual interest and \nactivity in the public realm.\nB.\t Applicable Downtown Design Principles:\nB.\t Promote Excellence in Design.\nC.\t Create a Vibrant Public Realm.\nD.\t Create strong connections between Plan \nDistricts and Sub-Districts.\nH.\t Create Appropriate Transitions in Height, Bulk \nand Scale\nC.\t Guidelines:\nAll Development\n1.\t Minor Gateways are:\na.\t 6th and Eastman\nb.\t 3rd and Eastman\nc.\t Main and Powell\nd.\t \tBeech and Division, and\ne.\t \tMain and Division\n2.\t Development at minor gateways shall:\na.\t Create a strong architectural statement at \ngateway locations to help create a strong \nidentity \nb.\t Use highly crafted materials for lighting, \npaving, bollards and other streetscape \nelements or civic art pieces to accentuate \nthe appearance of entrances and building \nform at all gateways.\n3.\t Major Gateways are:\na.\t Burnside and Eastman,\nb.\t Division and Eastman,\nc.\t Powell and Eastman,\nd.\t Powell and Hogan, and\ne.\t Division and Burnside.\n4.\t Development at major gateways shall, In \naddition to the standards for minor gateways, \nplace significant public space at the corner for \nmajor gateways.\n5.\t In DMU:\na.\t Gateways shall take advantage of \nopportunities to showcase sustainable \n8. Gateways\nFig. B.9.c.2 (1): Prominent architectural features such as double \nstory windows and entry plaza reinforce the corner and highlight \nentry to an important location\nFig. B.9.c.2 (2): Fountain plaza at a major gateway\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 121,
      "text": "[4.11]-121\nCity of Gresham Development Code\n(07/13)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n\t\nfeatures such as green walls, use of \nsalvaged or recycled materials, and unique \nstormwater treatments.\nb.\t Gateways are transition locations and \nopportunities to announce that visitors \nare entering a special place. Developments \nat gateway locations shall mark entry \nor departure points to a district for \nautomobiles and pedestrians by providing \na combination of significant public open \nspace (plazas, fore-courts, greens), \ninteresting building orientation and signage, \nlighting, artwork and façade treatments. \nc.\t Gateways shall embrace opportunities to \nframe or directly link the areas of interest.\nD.\t Standards:\nAll Development \n1.\t Minor Gateways are:\na.\t 6th and Eastman\nb.\t 3rd and Eastman\nc.\t Main and Powell\nd.\t Beech and Division, and\ne.\t Main and Division\n2.\t Developments at minor gateways shall:\na.\t Locate the main double-door entry within \n10 feet of the corner of the building.\nb.\t Incorporate at least three features from the \nfollowing list:\n1.\t major entrance: double doors, large \noverhang, recessed entry\n2.\t tower forms: minimum of one-third \nadditional height to ground-level floor\n3.\t oversized windows: at least one-third \nDiagrams 4.1151(B)(8)(d): appropriate building corner treatments\n8. Gateways continued\nFig. B.9.d.2 (2): Plaza design at a major gateway\nFig. B.9.d.2 (1): Building form and main entrance orientation\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 122,
      "text": "[4.11]-122\n(07/13)\nCity of Gresham Development Code \n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n\t\nlarger pane than the rest of the ground \nlevel-facade windows\n4.\t expressive canopies: colors and \nmaterials distinctive from the rest of the \nbuilding\n5.\t higher bays: minimum 18 feet\n6.\t plaza: minimum 600 square feet\n7.\t forecourt: minimum 400 square feet\n8.\t pilasters\n9.\t cupola\n10.\tturrets\n11.\tOne of the features from (Diagrams \n4.1151(B)(8)(d) or an alternative \napproved by the Manager or Design \nCommission.\n3.\t Major Gateways are:\na.\t Burnside and Eastman,\nb.\t Division and Eastman,\nc.\t Powell and Eastman,\nd.\t Powell and Hogan, and\ne.\t Division and Burnside.\n4.\t Developments at major gateways shall:\na.\t Locate the main double-door entry within \n10 feet of the corner of the building.\nb.\t Incorporate at least four features from the \nlist above (Section 4.1151(B)(8)(d)(2)(b)).\n5.\t In DMU:\na.\t Developments at gateway locations shall \nprovide 1 square foot of public space for \nevery 20 square feet of building floor area. \nb.\t Gateway public space shall include \nhardscaping, landscaping, pedestrian-scaled \nlighting and seating (formal or informal).\n8. Gateways continued\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 123,
      "text": "[4.11]-123\nCity of Gresham Development Code\n(07/13)\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\nIntentionally blank\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 124,
      "text": "[4.11]-124\n(06/22)\nCity of Gresham Development Code \nA.\t Intent: To value each building as a high-quality, \nlong-term addition to downtown. Smaller-scale, \nnatural materials are encouraged, as are sustainably \nharvested, salvaged, recycled or reused products.\nB.\t Applicable Downtown Design Principles:\nB.\t Promote Excellence in Design.\nE.\t Incorporate Sustainability.\nF.\t Context Sensitivity.\nG.\t Preserve and Enhance Historic Character.\nC.\t Guidelines\nAll Development & Townhouse \n1.\t Materials:\n•\t The predominant building materials shall be \nhigh-quality, durable and attractive.\n•\t The predominant building material may be \ncomplimented with other secondary materi­\nals which may be used in limited areas of the \nfacade to highlight architectural features. \n•\t Accent materials, which would generally not \nbe acceptable on large areas of the facade, \nmay be used in limited areas of the facade to \nhighlight architectural features. \n2.\t Materials identified as prohibited shall not be \nused on any building.\n3.\t Fencing shall be durable, maintainable and \nattractive. \nExisting Development\n4.\t Renovated façade sections shall utilize high-\nquality, attractive and durable materials.\n5.\t When buildings are renovated, high-quality \noriginal materials shall be exposed.\nD.\t Standards (see Table 4.1151(B)(9)):\nAll Development & Townhouse\n1.\t Materials:\n•\t Buildings shall utilize primary materials for \nno less than 65 percent of each building \nfacade area.\n•\t Secondary materials are prohibited as \nprimary cladding on building facades and \nshall not be allowed on more than 35 \npercent of each building facade area.\nFig B.7.C.1 (1): Finished wood compliments the brick, concrete \nand glass structure.\nFig 1.B.7.C.1 (2): A brick storefront enhanced with ceramic tiles \nhighlighting the windows.\nFig 1.B.7.C.1 (3): Stone can create a simple yet elegant facade.\n9. Materials\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 125,
      "text": "[4.11]-125\nCity of Gresham Development Code\n(06/22)\n•\t Accent materials are permitted on no greater \nthan 5 percent of each facade as trims or \naccents (e.g. flashing, projecting features \nornamentation, etc.)\n2.\t Buildings shall not utilize materials listed as \nprohibited.\n3.\t Fencing materials shall be durable, maintainable \nand attractive.\nExisting Development\n4.\t Façade modifications that affect more \nthan 50 percent of the façade shall comply \nwith standards in Section 4.1151(B)(9)\n(d) at the discretion of the Manager or the \nDesign Commission. The Manager or Design \nCommission may waive this requirement if \napplication of the standards would create a \nincongruous appearance of existing and new \nmaterials.\n5.\t Existing brick and stone buildings undergoing \nfaçade renovations that affect more than 50 \npercent of the façade shall remove any paint, \npaneling or other covering applied to these \nmaterials to reveal original surfaces.\nP:   Primary Material\nS:   Secondary Material\nA:  Accent Material\nN:  Prohibited Material or\n     Prohibited Fencing Type\nAll \nDevelopment\nMultifamily \nResidential & \nTownhouse\nFull Brick\nP\nP\nStone/masonry\nP\nP\nStucco\nP\nP\nGlass\n(transparent, spandrel)\nP\nP\nGlass block\nA\nP\nFactory or naturally finished flat, \nprofiled, fluted or ribbed metal1\nP\nP\nFinished wood, wood veneers and \nwood siding\nS\nP\nConcrete blocks with integral \ncolor (ground, polished or glazed \nfinishes)\nS\nS\nConcrete \n(poured in place or precast)\nS\nS\nFiber reinforced cement siding \nand panels\nS\nS\nCeramic tile\nS\nS\nOther material as approved by the \nManager or Design Commission\nP/S\nP/S\nConcrete blocks with integral \ncolor (split face finish)\nA\nA\nStanding seam metal1\nS\nS\nVegetated wall panels or trellises\nA\nA\nVinyl siding\nN\nN\nT-111 Plywood\nN\nN\nExterior Insulation Finishing \nSystem (EIFS)\nN\nN\nPlastic or vinyl fencing\nN\nN\nChain link fencing\nN\nN\nNotes:\n 1Metals shall be of a size, thickness and detailing that \nwill remain free of visual defects and visual distortion \nsuch as oil canning, ski sloping and shadowing.\n9. Materials continued\nTable 4.1151(B)(9): Primary, secondary, accent \nand prohibited materials\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 126,
      "text": "[4.11]-126\n(07/19)\nCity of Gresham Development Code \nIntentionally blank\n4.1151 \tDowntown Design \nGuidelines and Standards\nB. Building Design\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.289035",
  "extractor_version": "1.0.0"
}