{
  "metadata": {
    "filename": "dc-section-4.1200.pdf_id7839",
    "extracted_at": "2025-05-22T06:15:23.275434",
    "num_pages": 97,
    "title": "DC Section 4.1200",
    "creator": "Adobe Acrobat Pro (64-bit) 23.6.20380",
    "producer": "Adobe PDF Library 17.0",
    "creation_date": "D:20240102104139-08'00'",
    "modification_date": "D:20240102104451-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "City of Gresham Development Code\nSection 4.1200 \nCivic Neighborhood Plan District \nDesign Manual\n[4.1200] - 1\n(06/22)\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nIntroduction\n[4.1200] - 2\n(06/22)\nIntroduction\n4.1201 Purpose\nThe City has prioritized high quality design for new development and redevelopment \nthroughout the city. It is also recognized that Gresham is comprised of many districts and \nneighborhoods – each one unique with distinct physical, social, and economic conditions and \nspecial assets to build upon to attract quality investment. Therefore, certain districts have \ntheir own design standards and guidelines to address design concerns that have cultural, \narchitectural, or even market significance to that area. \nThe vision for the Civic Neighborhood is for it to be made up of a distinctively urban mixture \nof uses and people. Inviting, tree-lined streets lead past lively storefronts and high quality \nbuildings with convenient places to live, work, and shop. The neighborhood’s parks and \nplazas provide great places to gather, while its active transportation network provides easy \naccess to regional trails, Downtown, surrounding neighborhoods, and the greater metro \narea. The Civic Neighborhood Plan District Design Manual will help implement that vision, \nproviding specific urban design strategies and recommendations that raise the bar for design \nexcellence in the built environment. This document aims to inspire and guide development \nproposals toward meeting this goal. \nThe Civic Neighborhood Plan District Design Manual provides development regulations for \nthe neighborhood that promote good site and building design, facilitating the development \nof high quality, attractive, innovative, sustainable, and livable developments that foster \na true sense of community. Where there is a conflict between the provisions of the Civic \nNeighborhood Plan District and those of other provisions of the Community Development \nCode, the Civic Neighborhood Plan District’s provisions shall take precedent. \nA.\t Design Review Process\n\t\nNew development, additions, and remodels within the Civic Neighborhood sub-districts \nare subject to design review as described in Article 7 Design Review for determination of \nconsistency with the guidelines and/or standards contained in this Code. Projects subject \nto design review are either brought before the Design Commission or administered by \nthe Manager. Either the Design Commission or the Manager shall make findings and \ndecisions concerning conformance with the design standards and/or guidelines based on \nwhich review track is selected.\n1.\t Two Tracks\nThe City has set up two alternative Design Review tracks: \n•\t\nThe Discretionary Track; and \n•\t\nThe Clear and Objective Track. \nApplicants have the choice of complying with either option. If the Clear and Objec­\ntive Track is chosen, the applicant must meet all development standards. Deviation \nfrom any of the standards in 4.1250 (choosing to follow one or more guidelines) \nmeans the application is using the Discretionary Track. \na.\t Clear and Objective Track: The Clear and Objective Track includes measurable \nregulations used in a predictable review process to meet the desired urban \nform. The standards ensure a degree of order, scale, and proportion within the \nbuilt environment. That said, the standards are written in a way to offer choices \nand allow for projects that are interesting and of superior design as individual \nbuildings while also contributing to a cohesive neighborhood.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nIntroduction\n[4.1200] - 3\n(06/22)\nb.\t Discretionary Track: The Discretionary Track is intended for applicants that \nwould prefer to propose a high quality project that might not comply with \nsome or all of the standards in 4.1250. The aim is to encourage applicants \nto propose exciting, innovative designs while still ensuring the City’s design \nconcerns and objectives for development in Civic Neighborhood are met. In this \ncase, applicants shall meet the design guidelines. The Design Commission may \nwaive a guideline or guidelines to achieve the flexibility necessary to support a \nparticularly creative proposal. Approval requires the applicant to demonstrate \nto the Design Commission that the waiver from the guideline(s) would result \nin a development that better meets the applicable Civic Neighborhood Design \nPrinciples and the intent statement preceding the guidelines.\nB.\t How to Use the Code\n\t\nThis document provides the sub-district development standards for new development \nand re-development within the Civic Neighborhood Plan District, and guides the Design \nReview of projects within the Civic Neighborhood as described in Article 7 Design \nReview. It has four sections:\n1.\t Design Principles\nThe Section 4.1210 Design Principles are the general, over-arching statements \nand considerations that guide the design of the built environment in the Civic \nNeighborhood Design District. The Guidelines and Standards are written to support \nand carry out the Principles on a project-specific level. In instances where the \napplicant chooses the Discretionary Track, the relevant Principles will be reviewed \nfor compliance during the decision-making process.\n2.\t Civic Neighborhood Sub-Districts and Development Standards\nSections 4.1220 and 4.1230 describe the land use sub-districts in the Civic \nNeighborhood and the applicable basic Development Standards. The Development \nStandards prescribe the basic building envelope and site requirements necessary \nto ensure compact forms of development appropriate for an urban environment. \nThese Standards include permitted uses, building heights, floor area ratios, densities, \nsetbacks, and other basic regulations.\n3.\t Street Type Standards\nThe Section 4.1240 Street Types are indicated on the Civic Neighborhood Street \nTypes Map. When consulting the Code, project applicants shall look at the Street \nType Map for their project site to determine the Street Type. The respective Street \nType Standards provide important direction concerning building locations and \nrelationships to adjacent streets, efficient multi-modal circulation, and the provision \nof public spaces and pedestrian amenities. The Street Type standards are not \ndiscretionary. The cross sections shown are conceptual, and specific engineering \ndetails are found in the City’s Public Works Standards. Developments must comply \nwith the Public Works Standards. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nIntroduction\n[4.1200] - 4\n(05/18)\n4.\t Civic Neighborhood Design Guidelines and Standards\nThe Section 4.1250 Design Guidelines and Standards provide a framework within \nwhich to review projects in Civic Neighborhood, aiding architects, designers, \ndevelopers, and the community in understanding the City’s urban design \nexpectations. The Civic Neighborhood Guidelines and Standards are divided into \nSite Design and Building Design sections, each of which includes several topics \naddressing a particular set of design considerations for the neighborhood. \na.\t Site Design: Site Design Guidelines and Standards primarily address the \norganization and arrangement of a development’s components. They \nfocus on the location and orientation of buildings and site features such as \nparking, service areas, landscaping, and open space. Good site planning can \nimprove the aesthetics of a community, minimize a project’s impacts on its \nneighbors, improve the quality of the streetscape, reflect or establish desirable \ndevelopment patterns, promote sustainability, and enhance neighborhood \nconnectivity.\nb.\t Building Design: Building Design Guidelines and Standards address the massing \nand exterior architectural elements of buildings, including components that \ndefine the scale, quality, and character of a building, such as roofs, entries, \nwindows, materials, and details. Excellent building design enhances the quality \nof life for residents by improving the appearance of the city, by establishing a \nsense of community pride, and by improving the long-term economic value of \nthe properties.\nFor each topic included in the Site Design and Building Design sections, there is an \nintroductory statement describing the design intent and a list of all Design Principles \nthat apply to that particular topic, followed by specific Guidelines and Standards. \nThe intent statement describes what the Guidelines and Standards are designed to \nachieve and sets expectations for high quality site and building design. \nThe Design Guidelines are the discretionary design parameters for development that \nprovide a statement of intent by which to evaluate the acceptability of a project’s \ndesign. Design Guidelines provide the opportunity for creative design flexibility.\nThe Design Standards are the objective requirements for development in design \ndistricts that are based on Design Principles. Design Standards provide a clear and \nobjective way of evaluating the acceptability of a project’s design. \nFor each item either the Guideline or the Standard shall be followed. Guidelines \ncorrespond to the standard of the same number and vice versa. For example, the \nfifth guideline corresponds with the fifth standard (such as a guideline labeled \n“G5” corresponding with standard “S5”). Sub-bullets under the Guidelines do not \nnecessarily correlate to sub-bullets of the same letter under the corresponding \nStandard.\n5.\t Images\nMost images, including photographs and illustrations, are not part of the \nDevelopment Code and do not act as Guidelines or Standards. These images are \nprovided to assist readers in envisioning the intent and potential outcomes of the \nGuidelines and Standards. Images that are not part of the Development Code are \nlabeled as figures. Images that are part of the Development Code will be labeled \nwith Development Code section numbers.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nIntroduction\n[4.1200] - 5\n(01/24)\n6.\t Compliance with other Code sections includes but is not limited to: \na.\t Article  5: Overlay Districts.\nb.\t Article  7: Design Review.\nc.\t Appendix 5, Section A5.510 - Utilities: Undergrounding of utilities in the Civic \nNeighborhood Plan District shall be in accordance with Appendix 5, Section \nA5.510 - Underground Utilities. \nd.\t Appendix 6.000 - Signage: The regulations of Appendix 6.000 Sign Regulations \nshall apply in the Civic Neighborhood Plan District. Section 4.1250(B)(6) shall \napply for all new signs in Civic Neighborhood and shall supersede Appendix \n6.000 where conflicts occur.\ne.\t Community Development Plan Volume 4 - Transportation System Plan: Civic \nNeighborhood Plan Street Types of Section 4.1240 supersede the Transportation \nSystem Plan Functional Classification System.\n7.\t Civic Neighborhood developments are exempt from the following standards unless \notherwise specified within Section 4.1200:\na.\t Section 7.0100 Corridor Design District Guidelines and Standards; \nb.\t Section 7.0430 Townhouse Design Standards;\nc.\t Section 7.0310 Commercial (except those in a Design District), Institutional, and \nMixed Use Developments (Non-Residential Component);\nd.\t Section 7.0320 Industrial Developments; \ne.\t Section 7.0210 Transit and Pedestrian Design Criteria and Standards; \nf.\t\nSection 9.0100 – Buffering and Screening Requirements: Except where a \nproposed development abuts a lot that is outside the Civic Neighborhood Plan \nDistrict, new development in the Civic Neighborhood Plan District is exempt \nfrom the provisions of Section 9.0100; and\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Design Principles\n[4.1200] - 6\n(05/18)\n4.1210 Civic Neighborhood Design Principles\nThe design principles identified in this section shall be used as \napproval criteria to help interpret the Civic Neighborhood Design \nGuidelines and Standards. The principles establish the fundamental \ndirection to guide future design and development in the Civic Neigh­\nborhood, and set the tone for the design guidelines and standards. \nA.\t Reflect Neighborhood Identity: Natural features, public spaces, \nactive streetscapes, and high quality, timeless developments \ncreate a strong neighborhood identity and sense of place. \nHigh levels of development intensity establish a district that is \nattractive, stimulating, active, and safe. \nB.\t Support a Mixed-use Community: Developments provide \na rich mixture of complementary uses including a variety of \ncommercial, residential, and institutional uses supporting a \nconvenient, urban lifestyle. This mix of uses and variety of \nhousing types supports a diverse population, generates 18-hour \nactivity, and provides options for jobs, housing, shopping, and \nservices.\nC.\t Provide Pedestrian and Transit Orientation: Pedestrian-oriented \ndesigns support and encourage multi-modal transportation \noptions including walking, driving, biking, transit, and other \nmodes in a functional, safe, and visually attractive manner.\nD.\t Create Active Streetscapes: Building, site, and street designs \nsupport multi-modal users, are scaled appropriately for their \nlocation, and promote active and engaging streets and public \nspaces at the pedestrian level. \nE.\t Enhance Connectivity: Interconnected streets, sidewalks, transit \nroutes, and trails form a pedestrian friendly transportation \nnetwork to and within the neighborhood, which is convenient, \nsafe, and accessible by multiple modes of travel. \nF.\t Integrate Public Amenities and Green Spaces: Integrate a wide \nvariety of interconnected public areas, parks, plazas, green \nspaces, and other landscape features which connect to nearby \nstreets and trails, create a sense of identity, support urban tree \ncanopy, and serve as centers of activity and social interaction. \nG.\t Utilize Sustainable Development Practices: Developments \nutilize best practices to promote the efficient and equitable use \nof land and resources; conserve and protect mature trees, water, \ntopography, and wildlife habitat; minimize energy usage and life \ncycle costs; support residents’ health; and maximize a building’s \npositive impact on the built and natural environment. \nH.\t Promote High Quality Design: Create aesthetically pleasing, \ndurable architecture with diverse, innovative designs that \nenliven the public realm and contribute to the sense of place, \nneighborhood, and pride in the City. \nI.\t\nDesign at a Human Scale: Promote development that is oriented \ntowards and welcoming to pedestrians, creates a strong \nrelationship between the building and the street, and creates \nenjoyable, pedestrian scaled spaces and streetscapes for people \nto occupy. \nFig. A:  Reflect neighborhood identity\nFig. D: Create active streetscapes\nFig. H: Promote high quality design\nFig. I:  Design at a human scale\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Sub-Districts\n[4.1200] - 7\n(06/22)\n4.1220 Civic Neighborhood Sub-Districts \nMap 4.1221: Civic Neighborhood Sub-Districts\n \n                              \n       \n  \n  \n  \n  \nN\nW \nSh\natt\nuc\nk \nW\nay\nNW\n Fa\nnni\nng \nWa\ny\nNW\n Co\nunc\nil D\nr\nNW Burnside Rd\nNW Wallula Ave\nNW Eastman Pkwy\nNW Division St\nNW Civic Dr\nNW Council Dr\nFlorence Ave\nNW 16th St\nNW 15th St\nNW 15th St\nNW 13th St\nNW 13th St\nNW 11th St\nNW 12th St\nNW Overlook Ave\nNW Ava Ln\nNW Sleret  Ave\nNW Norman Ave\nMAX Line\nCNTM\nCNTM\nCNTM\nCNTH\nCNRM\n1/4 miles\nThe Civic Neighborhood is divided into the following three sub-districts:\n•\t\nCivic Neighborhood Residential Mid-Rise (CNRM)\n•\t\nCivic Neighborhood Transit Moderate Density (CNTM)\n•\t\nCivic Neighborhood Transit High Density (CNTH)\nDevelopment within each sub-district is governed by a different combination of basic regula­\ntions such as uses, height limits, allowable floor area ratios, and densities. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Sub-Districts\n[4.1200] - 8\n(06/22)\n4.1222 Civic Neighborhood Residential Mid-Rise (CNRM)\nThis predominantly residential sub-district supports a transition between the lower-scale \nneighborhood west of NW Wallula Avenue into the more urban scale at the core of the Civic \nNeighborhood. Areas designated CNRM are moderate to high density residential uses, with \na lower scale fronting NW Wallula Avenue. Typical forms of housing include row houses, gar­\nden apartments, condominiums, and multifamily apartments. Commercial uses are allowed \nto locate on sites fronting an Arterial Street.\n4.1223 Civic Neighborhood Transit Moderate Density (CNTM)\nThe CNTM sub-district includes convenient access to arterial streets as well as local and \nregional transit routes including light rail stations, bus lines, and bike and pedestrian paths. \nThis sub-district is intended to evolve over time from a shopping center largely organized \naround automobile trips and parking, into a full-service area with a diverse mix of jobs, hous­\ning, and commercial opportunities. The sub-district allows for the widest range of intensities \nin the neighborhood, supporting diverse projects with varied uses, scales, and ownership \nstructures.\n4.1224 Civic Neighborhood Transit High Density (CNTH)\nThis sub-district, centered around the two light rail stations, is the core of the Civic Neigh­\nborhood and permits the highest intensity of development. This walkable urban center \nincludes a range of public spaces, paths, and amenities connected by active street fronts and \nmulti-modal paths. The CNTH sub-district includes an active, engaging mix of uses – retail, \nservice, office, and residential - that will help create a vibrant area that is active all day and \nthrough the evening. \n4.1225 Split-Zoned Development Sites\nWhen a single development site is affected by both the CNTM and the CNTH sub-districts, \nthose areas of the site may be developed in conformance with permitted uses and develop­\nment standards of either the CNTM or the CNTH sub-district. If a split-zone property includes \na portion in the CNRM district, that portion shall be developed according to the CNRM stan­\ndards. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Sub-Districts\n[4.1200] - 9\n(01/23)\nTable 4.1226: Permitted Uses in the Civic Neighborhood Plan District\nResidential Uses1\nCNTH\nCNTM\nCNRM\nSingle Detached Dwelling \nNP \nNP \nNP \nDuplex \nNP\nNP\nNP\nTriplex\nNP\nNP\nNP\nQuadplex\nNP\nNP\nNP\nTownhouse\nP \nP\nP \nCottage Cluster\nNP\nNP\nNP\nMultifamily19\nP2\nP2\nP2\nElderly Housing\nSUR\nSUR\nSUR\nManufactured Dwelling Park\nNP\nNP\nNP\nResidential Facility \nP \nP \nP \nResidential Home \nNP \nNP \nNP \nAffordable Housing\nP3\nP3\nP3\nTable 4.1226 Notes\n1Temporary health hardship dwellings may be permitted in conjunction with a pre-existing single \ndetached dwelling.\n2Conversion of a hotel or motel to an emergency shelter or to affordable housing is permitted. See \nSection 10.0420.\n3Affordable housing development is permitted. See Section 10.1700.\n4.1226 Permitted Land Uses\nTable 4.1226 lists the types of land uses that are permitted in the Civic Neighborhood Plan \nDistrict.\nP =  Permitted uses.\nL =  Use is permitted, but it is limited in the extent to which it may be permitted.\nNP = Use not permitted.\nSUR = Use permitted subject to a Special Use Review.\nEach of these uses must comply with the land-use district standards of this section and all \nother applicable requirements of the Community Development Code.\n“NP” is only used if the use category is “P” or “L” in another sub-district within the Develop­\nment Code. Other categories not listed also are not permitted. Existing uses that are not per­\nmitted in a Civic Neighborhood sub-district may continue in existence, subject to provisions \nof Development Code Section 8.0200 Existing and Nonconforming Uses and Development. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Sub-Districts\n[4.1200] - 10\n(01/23)\nCommercial Uses\nCNTH\nCNTM\nCNRM\nAuto-Dependent Use \nNP \nNP \nNP \nBusiness and Retail Service and Trade4\nP\nP\nL5\nClinics \nP \nP \nL5\nCommercial Parking\nSUR\nSUR\nSUR/L5\nDaycare Facilities\nP\nP\nP\nLive/Work \nP \nP \nP \nMajor Event Entertainment\nSUR\nSUR\nNP\nMini-Storage Facilities\nNP\nNP\nNP\nOutdoor Commercial \nNP \nNP \nNP \nTable 4.1226 Notes, Continued\n4Also see Section 4.1232 Limitations on Outdoor Commercial Activity\n5Limited to sites fronting NW Burnside Road and NW Division Street.\nIndustrial Uses\nCNTH\nCNTM\nCNRM\nConstruction \nNP \nNP\nNP\nExclusive Heavy Industrial Uses \nNP \nNP\nNP\nIndustrial Office\nNP \nNP\nNP\nInformation Services\nNP \nNP\nNP\nManufacturing\nL/SUR6\nL/SUR6\nNP\nMiscellaneous Industrial \nNP \nNP\nNP\nTrade Schools\nNP \nNP\nNP\nTransportation/Distribution\nNP \nNP\nNP\nWarehousing/Storage\nNP\nNP\nNP\nWaste Management\nNP \nNP\nNP\nWholesale Trade\nNP \nNP\nNP\nTable 4.1226 Notes, Continued\n6Manufacturing uses shall be compatible with other Civic Neighborhood uses and are allowed only if \nall of the following conditions are met:\na.\t The manufacturing component shall be allowed in conjunction with an allowed Business and \nRetail Service and Trade use; and\nb.\t The manufacturing component shall occupy no more than 10,000 square ft. of floor area per \nsite; and\nc.\t The emission of air pollutants and nuisance odorous gases and changes in temperature \ndetectable by the human senses without the aid of instruments at any point beyond the \nproperty line is prohibited; and\nd.\t Electrical disturbances that interfere with the normal operation of equipment or instruments on \nadjacent properties are prohibited; and\ne.\t Operations that produce heat or glare shall be conducted entirely within an enclosed building; \nand\nf.\t Loud, unnecessary, or unusual noise that endangers health, peace or safety is prohibited.\nTable 4.1126, Continued\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Sub-Districts\n[4.1200] - 11\n(01/23)\nInstitutional Uses\nCNTH\nCNTM\nCNRM\nCivic Uses\nSUR\nSUR\nSUR\nCommunity Services\nSUR\nSUR\nSUR\nMedical\nSUR\nSUR\nL8\nParks, Open Spaces and Trails\nL/SUR9\nL/SUR9\nL/SUR9\nReligious Institutions\nP\nP\nP\nSchools\nP/SUR10\nP/SUR10\nP/SUR10\nTable 4.1226 Notes, Continued\n8Limited to sites fronting NW Burnside Road and NW Division Street. \n9Golf courses are not permitted in the Civic Neighborhood Plan District. \n10Schools are permitted without a Special Use Review if they are occupying an existing commercial \nspace.  Schools must pursue a Special Use Review if they are proposing new construction.\nRenewable Energy Uses11\nCNTH\nCNTM\nCNRM\nSolar Energy Systems\nL/SUR12\nL/SUR12\nL/SUR12\nWind Energy Systems\nL/SUR13\nL/SUR13\nL/SUR13\nBiomass Energy Systems\nL14\nL14\nL14\nGeothermal Energy Systems\nL/SUR15\nL/SUR15\nL/SUR15\nMicro-Hydro Energy Systems\nL16\nL16\nL16\nTable 4.1226 Notes, Continued\n11See Section 10.900 for additional standards that apply. \n12For limitations, see Section 4.1234 Solar Energy System Standards for Civic Neighborhood Districts.\n13For limitations, see Section 4.1235 Wind Energy System Standards for Civic Neighborhood Districts.\n14For limitations, see Section 4.1236 Biomass Energy System Standards for Civic Neighborhood \nDistricts. \n15For limitations, see Section 4.1237 Geothermal Energy System Standards for Civic Neighborhood \nDistricts. \n16For limitations, see Section 4.1238 Micro-Hydro Energy System Standards for Civic Neighborhood \nDistricts.\nOther Uses\nCNTH\nCNTM\nCNRM\nBasic Utilities\n\t Minor basic utilities\n\t Major basic utilities17\nP\nSUR\nP\nSUR\nP\nL/SUR\nHeliports\nSUR\nSUR\nSUR\nWireless Communications Facilities\nSUR\nSUR\nSUR\nTemporary, Intermittent & Interim Uses\nP\nP\nP\nMarijuana Businesses\nL18\nL18\nNP\nTable 4.1226 Notes, Continued\n 17Electrical generating facilities and sewage treatment plants are not permitted in the Civic \nNeighborhood Plan District.\n 18For limitations, see Gresham Revised Code (GRC) 9.63.090.\n19Transitional housing for individuals transitioning from incarceration facilities are subject to a \nSpecial Use Review.\nTable 4.1126, Continued\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Sub-Districts\n[4.1200] - 12\n(01/23)\nTable 4.1230.A summarizes development standards which apply within the Civic Neighborhood Plan District. The \nstandards contained in this table are supplemented by subsections of Section 4.1200, which provide additional clar­\nification and guidance. Existing developments that do not meet the standards specified for a particular sub-district \nmay continue in existence and be altered, subject to provisions of Section 8.0200 Existing and Nonconforming Uses \nand Development. \nTable 4.1230.A: Civic Neighborhood Sub-District Standards\nCNTH\nCNTM\nCNRM\nMaximum Building Height1\n10 stories\n8 stories\n6 stories, or 4 stories \nwithin 50 ft. of the NW \nWallula Ave. right of way\nFloor Area Ratio for \nnon-residential and \nmixed-use projects 2\nMinimum\n0.9\n0.5\n0.3\nMaximum\nnone\nnone\n0.9\nResidential Net Density \n(units per acre)\nMinimum3\n30\n24\n17\nMaximum\nnone\nnone\n304\nScreening & Buffering Required \n(Section 9.0100)\nNew development in the Civic Neighborhood Plan District is exempt from the provi­\nsions of Section 9.0100, except where the proposed development abuts a lot that is \noutside the Civic Neighborhood Plan District. \nClear Vision Area (Section 9.0200)\nNot applicable except for developments with frontage on an Urban Boulevard (Arteri­\nal) Street Type.\nHeight Transition (Section 9.0600)\nYes\nYes\nYes\nTable 4.1230.A Notes:\n1A height bonus applies to affordable housing development. See Section 10.1700.\n2The following uses are exempt from minimum floor-area ratio and maximum setback requirements:\na.\t Transit facilities such as bus shelters and storage/utility sheds;\nb.\t Parks, Open Space, and Trails;\nc.\t Basic Utilities;\nd.\t Wireless Communication Facilities;\ne.\t Heliports;\nf.\t Portable Classrooms; and\ng.\t Museums.\n3Minimum residential density does not apply to affordable housing development. See Section 10.1700.\n4A density bonus applies to affordable housing development. See Section 10.1700.\n4.1230 Civic Neighborhood Sub-District Standards \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Sub-Districts\n[4.1200] - 13\n(06/22)\nTable 4.1230.B: Civic Neighborhood Setbacks Standards\nSetbacks are based on the sites primary frontage. See Section 4.1240 Civic Neighborhood Street Types and Map \n4.1243: Civic Neighborhood Streets and Future Streets to identify the primary street type. Also See Section \n4.1250(A)(2) for frontage standards. \nStreet types\nUrban Boulevard \n(Arterials)\nCivic Drive\nWallula Avenue\nCivic \nNeighborhood \nConnector1\nCivic \nNeighborhood \nLocal \nTownhouse\nMinimum Building \nSetbacks  (in feet)2\nFront: 10\nStreet Side: 53\nSide: 0\nRear: 5\nFront: 5\nStreet Side: 5 \nSide: 5\nRear: 5\nFront: 10\nStreet Side: 5\nSide: 5 \nRear: 5\nFront: 5\nStreet Side: 5\nSide: 5\nRear: 5\nFront: 5\nStreet Side: 5\nSide: 5\nRear: 5\nMaximum Building \nSetbacks (in feet)4, 5\nFront: 20\nStreet Side: 103\nFront: 10\nStreet Side: 10\nFront: 20\nStreet Side: 10\nFront: 10\nStreet Side: 10\nFront: 10\nStreet Side: 10\nMinimum Lot      \nDimensions\nWidth at building line, interior lot: 16 ft.\nWidth at building line, corner lot: 25 ft.\nMinimum Lot Size\nnone\nMultifamily\nMinimum Building \nSetbacks (in feet)2\nFront: 10\nStreet Side: 53\nSide: 0\nRear: 5\nFront: 5\nStreet Side: 5\nSide: 5\nRear: 5   \nFront: 10\nStreet Side: 5\nSide: 5\nRear: 5\nFront: 5\nStreet Side: 5\nSide: 5\nRear: 5\nFront: 5\nStreet Side: 5\nSide: 5\nRear: 5\nMaximum Building \nSetbacks (in feet)4, 5\nFront: 20\nStreet Side: 103\nFront: 8\nStreet Side: 8 \nFront: 20\nStreet Side: 10\nFront: 10\nStreet Side: 10\nFront: 10\nStreet Side: 10\nMinimum Lot Size\nnone\nCommercial, Industrial, Institutional\nMinimum Building \nSetbacks (in feet)2\nFront: 0\nStreet Side: 03\nSide: 0\nRear: 0\nFront: 0\nStreet Side: 0\nSide: 0\nRear: 0\nFront: 10\nStreet Side: 5\nSide: 5\nRear: 5\nFront: 0\nStreet Side: 0\nSide: 0\nRear: 0\nFront: 0\nStreet Side: 0\nSide: 0 \nRear: 0\nMaximum Building \nSetbacks  (in feet)4,5\nFront: 5\nStreet Side: 53\nFront: 5\nStreet Side: 5\nFront: 20\nStreet Side: 10\nFront: 8\nStreet Side: 8\nFront: 10\nStreet Side: 10\nMinimum Lot Size\nnone\nTable 4.1230.B Notes: \n1Including undesignated street types and primary internal drives.\n2For the purposes of Table 4.1230.B, side setbacks means interior side (not common wall).\n3If the street side fronts NW Wallula Avenue, the street side setback shall be a minimum 10 ft. and a maximum 20 ft.\n4Maximum front setbacks do not apply on a site once all minimum building frontage requirements of the street type have \nbeen satisfied. For example, if a street type requires that 75% of the frontage must be occupied by a building and that re­\nquirement has been satisfied, other buildings can be constructed behind that building beyond the maximum setback.\n5The following uses are exempt from minimum floor area ratio and maximum setback requirements:\na.\t Transit Facilities such as Bus Shelters and Storage/Utility Sheds;\nb.\t Parks, Open Space, and Trails;\nc.\t Basic Utilities;\nd.\t Wireless Communication Facilities;\ne.\t Heliports;\nf.\t Portable Classrooms; and\ng.\t Museums.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Sub-Districts\n[4.1200] - 14\n(05/18)\n4.1231 Floor Area Ratio\nA.\t For purposes of minimum floor area ratio calculations in the Civic Neighborhood Plan \nDistrict, applicants may include the following in the ground-level floor area up to a total \nof 1,000 sq. ft. or 10 percent of the site, whichever is larger: \n1.\t Publicly accessible open space. \n2.\t Area removed from the first-floor building footprint to create corner features to \ncomply with Section 4.1151(B)(8). For example, a beveled corner will have a slightly \nsmaller footprint than a 90-degree corner because of the bevel. \n3.\t Areas between the minimum and maximum front setbacks for Commercial, \nIndustrial, and Institutional uses that are provided for usable, pedestrian-oriented \nuses such as walkways and outdoor dining areas.\nB.\t For mixed-use developments in areas with a minimum commercial floor area ratio (FAR) \nand a minimum residential density requirement, minimum FAR and residential density \nrequirements are satisfied when consistent with the following formula:\n     Number Of Proposed Dwelling Units     +     Proposed Commercial Floor Area                    ≥ 1\n     Minimum Number Of Units Required           Minimum Required Commercial Floor Area\nC.\t For mixed-use developments in areas with a maximum commercial floor area ratio (FAR) \nand a maximum residential density requirement, maximum FAR and residential density \nrequirements are satisfied when consistent with the following formula:\n     Number Of Proposed Dwelling Units     +    Proposed Commercial Floor Area                     < 1\n     Maximum Number Of Units Required         Maximum Required Commercial Floor Area\n4.1232 Limitations on Outdoor Commercial Activity\nIn all Civic Neighborhood sub-districts, the amount of site area used for outdoor commercial \nactivity (such as sales, display, and storage) excluding outdoor dining areas, shall not exceed \n15% of the ground-floor area of buildings on the site with which the activity is associated or \n1,000 sq. ft., whichever is less.\n4.1233 Drive-Through Uses. \nDrive-through uses are not permitted in the Civic Neighborhood Plan District.\n4.1234 Solar Energy Standards for Civic Neighborhood Districts. \nSolar energy systems are limited in all Civic Neighborhood districts as follows:\nA.\t Scale.  Small and medium scale solar energy systems are permitted. Large scale systems \nare permitted with a Special Use Review.\nB.\t Type.  Roof-top, flat-roof, integrated, and ground-mounted solar energy systems are \npermitted. \nC.\t Height.  The following limitations on maximum height apply to all solar energy systems:\n1.\t Roof-top, Flat-roof, and Integrated.\na.\t For roofs that are flat or the horizontal portion of mansard roofs, the solar \nenergy systems on frames shall not exceed 10 ft. above the roof height on which \nthe system is installed.\nb.\t For pitched, hipped, or gambrel roofs, the solar energy system panels shall not \nexceed 18 inches in height from the surface of the roof on which the system is \ninstalled. \n2.\t Ground-mounted.  Ground-mounted solar energy systems shall not exceed 20 ft. in \nheight.\nD.\t Setbacks and Yards.  Solar energy systems are not allowed in the required front or street-\nside setback.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Sub-Districts\n[4.1200] - 15\n(05/18)\n4.1235 Wind Energy Standards for Civic Neighborhood Districts\nWind energy systems are limited in all Civic Neighborhood districts as follows:\nA.\t Scale.  Small and medium scale wind energy systems are permitted. Large scale systems \nare permitted with a Special Use Review.\nB.\t Type.  Roof-top and ground-mounted wind energy systems are permitted.\nC.\t Height.  The following limitations on maximum height apply to all wind energy systems:\n1.\t Roof-top. Wind energy systems shall not exceed the district height limit in which \nthey are located and shall not exceed 10 ft. above the height of the roof on which \nthe system is installed.\n2.\t Ground-mounted.  The height of ground-mounted wind energy systems shall not \nexceed 45 ft. as measured from the grade at the base of the equipment to the top of \nthe system. The height limit of 45 ft. can be exceeded up to 110 ft. with a Special Use \nReview.\nD.\t Setbacks and Yards.  Wind energy systems are not allowed in the required front, street-\nside, side, or rear setbacks and are not allowed in the front yard or street-side yard \nbetween the building and the street.\n4.1236 Biomass Energy Standards for Civic Neighborhood Districts\nBiomass energy systems are limited in all Civic Neighborhood districts as follows:\nA.\t Scale.  Small scale biomass energy systems are permitted.\nB.\t Type.  Non-hazardous biomass systems are permitted.\nC.\t Height.  Biomass energy systems shall not exceed the maximum district height limits.\nD.\t Setbacks and Yards.  Biomass energy systems are not allowed in the required front, \nstreet-side, side, or rear setbacks, and are not allowed in the front or street-side yards \nbetween the building and the street.\n4.1237 Geothermal Energy Standards for Civic Neighborhood Districts\nGeothermal energy systems are limited in all Civic Neighborhood districts as follows:\nA.\t Scale.  Small scale geothermal energy systems are permitted. Large scale systems are \npermitted with a Special Use Review.\nB.\t Type.  Closed-loop geothermal energy systems that are not in any wellfield protection \nareas are permitted.\nC.\t Height.  Geothermal systems shall not exceed the maximum district height limits.\nD.\t Setbacks and Yards.  Geothermal systems are not allowed in the required front, street-\nside, side, or rear setbacks, except small geothermal heating and cooling units such as \nheat pumps can project into the setbacks per Section 9.0900 Projections. \n4.1238 Micro-Hydro Energy Standards for Civic Neighborhood Districts\nMicro-hydro energy systems are limited in all Civic Neighborhood districts as follows:\nA.\t Scale.  Small scale micro-hydro energy systems are permitted.\nB.\t Type.  In-pipe micro-hydro energy systems such as systems within water, stormwater, or \nwastewater pipe are permitted.\nC.\t Height.  Generally the district height limits apply.  However, in-pipe systems may \nexceed the district height limit as allowed for mechanical equipment.  If supplemental \nequipment structures accompany the in-pipe systems, then the district height limit \nwould apply.\nD.\t Setbacks and Yards.  Micro-hydro energy systems contained within piping are allowed \nand pipe can run within the required setbacks.  However, if supplemental equipment \nstructures accompany the in-pipe systems, then the district setback limits apply.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 16\n(01/19)\n4.1240 Civic Neighborhood Streets\n4.1241 Street Type Purpose \nThe Street Types sections contain non-discretionary standards that developments must meet \nas part of the design review process to ensure positive building-to-sidewalk relationships \nand well-designed streetscapes. Street design features and building-to-street relationships \nwill support the development of the Civic Neighborhood as pedestrian-oriented and transit-\nsupportive. Special features have been incorporated into several street design classifications \nincluded in this document. \nThe 4.1243 Civic Neighborhood Streets and Future Streets map supersedes the \nTransportation System Plan Functional Classification Plan, and streets, accessways, and multi-\nuse pathways shall be constructed per the standards contained in Section 4.1243(A)-(E) and \nfollowing the Section 4.1250 Design Guidelines and Standards. \nThis section includes several different street types applied to streets throughout the Civic \nNeighborhood, recognizing that street design and how buildings interface with the street \nvaries based on function, location, land uses, and multi-modal capacity. These Street Type \nrequirements will ensure consistent application of appropriate treatments based on mixes \nof uses and levels of intensity throughout the sub-districts. This section includes standards \nfor the following Street Type designations listed in order of highest functional class to \nlowest (refer to Map 4.1243 for specific designations of each Civic Neighborhood street and \ndesignated future street):\n•\t\nUrban Boulevard (Arterial)\n•\t\nCivic Drive\n•\t\nWallula Avenue\n•\t\nCivic Neighborhood Connector\n•\t\nCivic Neighborhood Local\nAs new streets are constructed or existing streets are redeveloped, environmentally friend­\nly features for stormwater management are required. See Street Types and the Gresham’s \nPublic Works Standards for requirements.\n4.1242 Public Works Standards Coordination\nApplicants shall consult specific street engineering construction standards in the Public \nWorks Standards and the Stormwater Management Manual in combination with these Street \nType Standards and the street standards included elsewhere in the Gresham Community De­\nvelopment Code. If compliance with the standards results in a conflict between the Commu­\nnity Development Code and Public Works Standards, the Public Works Standards govern the \nstreet design. The Department of Environmental Services may grant exceptions to the Public \nWorks Standards through the Design Modification Process if the City receives benefit from \nthe suggested standard deviation.\nExisting curb-to-curb dimensions may vary from what is shown in street type cross sections. \nApplicants shall consult the Public Works Standards to determine how to implement the \nstreet type cross sections in different situations.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 17,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 17\n(11/20)\n4.1243 Civic Neighborhood Street Type Standards \nMap 4.1243: Civic Neighborhood Streets and Future Streets\nMap 4.1243 Note: Any unclassified or future street bounded by Burnside, Eastman, Division and Wallula, shall be \nclassified as Civic Neighborhood Local streets. Any unclassified street outside of that boundary shall be classified and \ndimensioned per the Transportation System Plan and shall meet the frontage, setback, and street type of the Urban \nBoulevard or Civic Neighborhood Local, whichever is more similar.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 18,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 18\n(01/19)\nFor the Urban Boulevard (Arterial) Street Type, all the following \nStreet Type Standards shall be met:\n1.\t See Diagrams A.1 and A.2 for a typical cross section and plan \nview of the Urban Boulevard (Arterial) Street Type. \n2.\t Applicants shall also consult the Public Works Standards and  \nstandards included elsewhere in the Gresham Community \nDevelopment Code. \n3.\t There shall be a clear, accessible walking route of a minimum \n5 ft. in width provided in a sidewalk of 6 ft. in width. \nAppurtenances may protrude 1 ft. into the 6-ft. sidewalk width \nat the discretion of the Manager or Design Commission. The \n5-ft. clear accessible walking route shall be contiguous across \nadjacent lots.\n4.\t There shall be an 8-ft. amenity zone provided. The amenity \nzone may consist of features such as street trees, street lighting, \nlandscaping, additional walk width, stormwater plantings, and/\nor seating. \n5.\t Street trees shall be selected from the City’s Recommended \nStreet Tree list. Recommended street tree species for the Civic \nDrive street type include: \n•\t\nOak (Crimson Spire, Forest Green, or Columnar English)\n•\t\nLinden (Summer Sprite, Redmond Bigleaf, Chancellor, or \nCorinthian) \n•\t\nElm (Emerald Sunshine)\n•\t\nZelkova (City Sprite or Musashino)\n6.\t Decorative pedestrian scale street lighting is required as \nspecified in the Public Works Standards. \n7.\t Comply with Section 9.0200 – Clear Vision Area.\n8.\t All crosswalks shall have a contrasting color and texture \ndetail, with colored pavers or concrete required per Public \nWorks Standards Drawings 628: Crosswalk, Concrete and 629: \nCrosswalk, Paver. \nA. Urban Boulevard (Arterial)\nFig. A.1  Existing street view of an Urban Boulevard \n(Arterial) Street Type frontage with parallel parking and \nbike lane.\nFig. A.2  A landscaped median.\n4.1243 Civic Neighborhood Street Type Standards, Continued \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 19,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 19\n(05/18)\nA. Urban Boulevard (Arterial), Continued\nDiagram A.1: Urban Boulevard (Arterial) Street Type Cross Section Diagram\nDiagram A.2: Urban Boulevard (Arterial) Street Type Plan View Diagram\nNot to scale\n4.1243 Civic Neighborhood Street Type Standards, Continued \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 20,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 20\n(05/18)\nB. Civic Drive\nFor the Civic Drive Street Type, all the following Street Type Stan­\ndards shall be met:\n1.\t See Diagrams B.1 and B.2 for a typical cross section and plan \nview of the Civic Drive Street Type. \n2.\t Applicants shall also consult the Public Works Standards and \nstandards elsewhere in the Gresham Community Development \nCode. \n3.\t There shall be a clear, accessible walking route of a minimum \n5 ft. in width provided in a sidewalk of 10 ft. in width. \nAppurtenances may protrude 1 ft. into the sidewalk width at the \ndiscretion of the Manager or Design Commission. \n4.\t There shall be a 4-ft. amenity zone provided. The amenity zone \nmay consist of features such as street trees, street lighting, \nlandscaping, stormwater plantings, and/or seating. \n5.\t Street trees shall be selected from the City’s Recommended \nStreet Tree list. Recommended street tree species for the Civic \nDrive street type include: \n•\t\nMaple (Queen Elizabeth, Rocky Mountain Glow, Armstrong, \nBowhall, Apollo)\n•\t\nLinden (Summer Sprite, Redmond Bigleaf, Chancellor, or \nCorinthian) \n•\t\nGinkgo (Princeton Sentry)\n6.\t Curbed bulb-outs shall be provided at all street intersections and \ncrosswalks.\n7.\t Decorative pedestrian scale street lighting is required as \nspecified in Public Works Standards Drawings 638: Streetlight, \nArchitectural.  \n8.\t All crosswalks shall have a contrasting color and texture \ndetail, with colored pavers or concrete required per Public \nWorks Standards Drawings 628: Crosswalk, Concrete and 629: \nCrosswalk, Paver. \nFig. B.2  Existing Civic Drive improvements with a \ncommercial frontage and planter.\nFig. B.1  Existing Civic Drive improvements with distinct intersection paving and \ndecorative street lights.\n4.1243 Civic Neighborhood Street Type Standards, Continued \nFig. B.3  Existing Civic Drive improvements with \ndistinct crosswalk paving\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 21,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 21\n(05/18)\nB. Civic Drive, Continued\nDiagram B.1: Civic Drive Street Type Cross Section\nDiagram B.2: Civic Drive Street Type Plan View Diagram\nNot to scale\n4.1243 Civic Neighborhood Street Type Standards, Continued \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 22,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 22\n(01/19)\nC. Wallula Avenue\nFor the Wallula Avenue Street Type, all the following Street Type \nStandards shall be met:\n1.\t NW Wallula Avenue shall follow the Public Works Standards for \na Standard Collector Street type. See Diagrams C.1 and C.2 for \nan example cross section and plan view of the Wallula Avenue \nStreet Type. \n2.\t Applicants shall also consult the Public Works Standards and \nstandards elsewhere in the Gresham Community Development \nCode. \n3.\t There shall be a clear, accessible sidewalk of 5 ft. in width \nprovided. The 5-ft. clear sidewalk shall be contiguous across \nadjacent lots.\n4.\t There shall be a 6-ft. landscaped amenity zone provided. The \namenity zone may consist of features such as street trees, street \nlighting, landscaping, stormwater plantings, and/or seating.\n5.\t The location of the amenity zone and 5-ft. clear sidewalk shall \nbe varied where necessary to maintain healthy regulated trees \nof the following species in and adjacent to the right of way (see \nDiagrams C.1 and C.2 for example). A varied walk and amenity \nzone may be provided to preserve unlisted species of regulated \ntrees at the discretion of the Manager or Design Commission. \nTrees must be healthy and viable, as determined by a consulting \narborist, a qualified arborist or a registered consulting arborist. \n•\t\nDouglas Fir\n•\t\nWestern Red Cedar or Hogan Cedar\n•\t\nCoast Redwood\n•\t\nGiant Sequoia  \n6.\t Street trees shall be selected from the City’s Recommended \nStreet Tree list. Where space allows, street tree species for the \nWallula Avenue street type shall be one of the following: \n•\t\nDouglas Fir\n•\t\nWestern Red Cedar\n•\t\nIncense Cedar\n•\t\nCoast Redwood\n•\t\nGiant Sequoia  \nIn smaller planting areas, recommended street tree species for \nthe Wallula Avenue street type include: \n•\t\nMaple (Metro Gold, Rocky Mountain Glow, Queen Elizabeth, \nCommemoration)\n•\t\nOak (Skymaster, Forest Green, Swamp White)\n7.\t Decorative pedestrian scale street lighting is required as \nspecified in Public Works Standards Drawings 638: Streetlight, \nArchitectural. \n8.\t All crosswalks shall have a contrasting color and texture \ndetail, with colored pavers or concrete required per Public \nWorks Standards Drawings 628: Crosswalk, Concrete and 629: \nCrosswalk, Paver. \nFig. C.1 The location of the existing 5-ft. clear walkway \nmoves to maintain mature trees along the NW Wallula \nAvenue frontage.\n4.1243 Civic Neighborhood Street Type Standards, Continued \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 23,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 23\n(01/19)\nC. Wallula Avenue, Continued\nDiagram C.1: Wallula Avenue Street Type Cross Section\nDiagram C.2: Wallula Avenue Street Type Plan View Diagram\nNot to scale\n4.1243 Civic Neighborhood Street Type Standards, Continued \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 24,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 24\n(05/18)\nD. Civic Neighborhood Connector\nFor the Civic Neighborhood Connector Street Type, all the following \nStreet Type Standards shall be met:\n1.\t See Diagrams D.1 and D.2 for a typical cross section and plan \nview of the Civic Neighborhood Connector Street Type. \n2.\t Applicants shall also consult the Public Works Standards and \nstandards elsewhere in the Gresham Community Development \nCode. \n3.\t There shall be a clear accessible walking route of a minimum 5 \nft. in width provided in a sidewalk of either 6 ft. or 7 ft. in width. \nAppurtenances may protrude 1 ft. into the sidewalk width at the \ndiscretion of the Manager or Design Commission. The 5-ft. clear \naccessible walking route shall be contiguous across adjacent lots.\n4.\t Where a 6-ft. wide sidewalk is provided, there shall be a 5-ft. \nwide amenity zone. Where a 7-ft. wide sidewalk is provided, \nthere shall be a 4-ft. wide amenity zone. The amenity zone \nmay consist of features such as street trees, street lighting, \nlandscaping, stormwater plantings and/or seating. \n5.\t Street trees shall be selected from the City’s Recommended \nStreet Tree list. Recommended street tree species for the Civic \nNeighborhood Connector street type include: \n•\t\nGinkgo (Princeton Sentry, Autumn Gold, Saratoga, or Halka)\n•\t\nCherry (Columnar Sargent , Pink Flair, Snow Goose, or \nCascade Snow) \n•\t\nHoneylocust (Shade Master, Skyline, or Street Keeper)\n•\t\nZelkova (City Sprite or Musashino)\n6.\t Curbed bulb-outs shall be provided at all at street intersections \nand crosswalks. \n7.\t Decorative pedestrian scale street lighting is required as \nspecified in Public Works Standards Drawings 638: Streetlight, \nArchitectural. \n8.\t All crosswalks shall have a contrasting color and texture \ndetail, with colored pavers or concrete required per Public \nWorks Standards Drawings 628: Crosswalk, Concrete and 629: \nCrosswalk, Paver. \nFig. D.3 Rain gardens in amenity zone.\nFig. D.1  Wide sidewalks with active uses and tree \nwells in amenity zone.\nFig. D.2  Landscaped amenity zone with wide sidewalk.\n4.1243 Civic Neighborhood Street Type Standards, Continued \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 25,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 25\n(01/19)\nDiagram D.2: Civic Neighborhood Connector Street Type Plan View Diagram\nD. Civic Neighborhood Connector, Continued\n4.1243 Civic Neighborhood Street Type Standards, Continued \nDiagram D.1: Civic Neighborhood Connector Street Type Cross Section\nNot to scale\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 26,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 26\n(05/18)\nE. Civic Neighborhood Local\nFor the Civic Neighborhood Local Street Type, all the following Street \nType Standards shall be met:\n1.\t See Diagrams E.1 and E.2 for a typical cross section and plan \nview of the Civic Neighborhood Local Street Type. \n2.\t Applicants shall also consult the Public Works Standards and \nstandards elsewhere in the Gresham Community Development \nCode. \n3.\t There shall be a clear accessible walking route of a minimum 5 \nft. in width provided in a sidewalk of either 5 ft. or 6 ft. in width. \nAppurtenances may protrude 1 ft. into the sidewalk width at the \ndiscretion of the Manager or Design Commission. The 5-ft. clear \naccessible walking route shall be contiguous across adjacent lots.\n4.\t Where a 5-ft. wide sidewalk is provided’ there shall be a 5-ft. \nwide amenity zone. Where a 6-ft. wide sidewalk is provided’ \nthere shall be a 4-ft. wide amenity zone. The amenity zone \nmay consist of features such as street trees, street lighting, \nlandscaping, stormwater plantings and/or seating.\n5.\t Street trees shall be selected from the City’s Recommended \nStreet Tree list. Recommended street tree species for the Civic \nNeighborhood Local street type include: \n•\t\nGinkgo (Princeton Sentry, Autumn Gold, Saratoga, or Halka)\n•\t\nCherry (Columnar Sargent , Pink Flair, Snow Goose, or \nCascade Snow) \n•\t\nHoneylocust (Shade Master, Skyline, or Street Keeper)\n•\t\nZelkova (City Sprite or Musashino)\n6.\t Curbed bulb-outs shall be provided at all at street intersections \nand crosswalks. \n7.\t Decorative pedestrian scale street lighting is required as \nspecified in Public Works Standards Drawings 638: Streetlight, \nArchitectural. \n8.\t All crosswalks shall have a contrasting color and texture \ndetail, with colored pavers or concrete required per Public \nWorks Standards Drawings 628: Crosswalk, Concrete and 629: \nCrosswalk, Paver. \nFig. E.3 Rain gardens in planting area\nFig. E.1 A 4-ft. amenity zone, wide sidewalk, and \nlandscaped setback.\nFig. E.2 Sidewalk with wide, landscaped amenity zone.\n4.1243 Civic Neighborhood Street Type Standards, Continued \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 27,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\nCivic Neighborhood Streets\n[4.1200] - 27\n(11/20)\nE. Civic Neighborhood Local, Continued\nDiagram E.1: Civic Neighborhood Local Street Type Cross Section\nDiagram E.2: Civic Neighborhood Local Street Type Plan View Diagram\n4.1243 Civic Neighborhood Street Type Standards, Continued \nNot to scale\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 28,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nIntroduction\n[4.1200] - 28\n(01/23)\nPurpose:  The Civic Neighborhood Design Guidelines and Standards set the criteria and pro­\nvide measurable or descriptive ways, depending on the review process chosen, for evaluat­\ning how well a project meets the design principles established for the neighborhood.\nThe Guidelines and Standards are organized under two principal categories, Site Design and \nBuilding Design. Each general category includes basic topics, such as Integrated Site Planning \nor Building Massing. Each of these includes a list of the design principles most applicable to \nthe specific topic, and a list of guidelines (descriptive methods and techniques to meet the \nintent of the design principles) and their corresponding standards (clear and objective, mea­\nsurable requirements to carry out the design principles). For each item either the Guideline \nor the Standard shall be followed. Guidelines correspond to the standard of the same num­\nber and vice versa. For example, the fifth guideline corresponds with the fifth standard (such \nas a guideline labeled “G5” corresponding with standard “S5”).\nThis section shall apply to all commercial, mixed-use, multifamily, townhouse, and industrial \ndevelopment within the Civic Neighborhood Plan District. This section also applies to the \nfollowing institutional uses: Civic Uses, Community Services, Medical, Religious Institutions, \nand Schools. \nSection 4.1250 does not apply to park-and-ride facilities; cemeteries and mausoleums; \nequipment storage facilities for transit; park and ride transit facilities; parks, open space, and \ntrails; conversion of a hotel or motel to an emergency shelter or to affordable housing under \nSection 10.0420; and the following uses in the “Other” category: basic utilities, heliports, \nwireless communications facilities and temporary uses, and similar uses/structures as deter­\nmined by the Manager or Design Commission. Section 4.1250 also does not apply to public \nfacilities (as described in Appendix 5: Public Facilities).\n4.1250 Civic Neighborhood Design Guidelines and Standards\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 29,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nIntroduction\n[4.1200] - 29\n(06/22)\nHeadings in this section apply to (except as exempted above):\nAll Development: All developments including Townhouses, unless otherwise noted.\nCommercial, Industrial, and Institutional: All developments that are commercial uses, \ninstitutional uses, or those industrial uses allowed in the Civic Neighborhood, \nincluding commercial, institutional, or industrial uses as components of mixed-use \nstructures. However, Parks, Open Spaces, and Trails are not included.\nMultifamily: Multifamily, residential components of mixed-use buildings, Elderly Housing, \nResidential Facilities, and Townhouse Style Multifamily, unless otherwise specified.\nTownhouse: Townhouse and, where noted, Townhouse Style Multifamily.\nMixed-Use Development: For mixed-use developments, guidelines and standards under the \nCommercial, Industrial, and Institutional heading apply to those parts of the building \nand site designed for those uses, and the guidelines and standards under multifamily \nand townhouse headings apply to those parts of the building and site designed for \nthose uses. The “All Development” standards apply to the entire building.\n\t\n\t\nIf any conflicts exist among the standards for development in the CNTM or CNTH \nzone districts, the guidelines and standards under the Commercial, Industrial, \nand Institutional heading will supersede the guidelines and standards under the \nMultifamily Residential and Townhouse headings.\n\t\n\t\nIf any conflicts exist among the standards for development in the CNRM zone \ndistrict, the guidelines and standards under the Multifamily Residential and \nTownhouse headings will supersede the guidelines and standards under the \nCommercial, Industrial, and Institutional heading.\nExisting Development: Guidelines and standards in Section 4.1250 shall apply as determined \nby the Manager or Design Commission when the standards can reasonably apply to \nexisting development, and as indicated under the “Existing Development” headings. \nFor example, landscaping guidelines and standards may apply when new landscaping \nis being added. For Sections 4.1250(A) and (B), site and building modifications \nneeded to comply with Section 8.0200 shall comply with applicable guidelines and \nstandards. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 30,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 30\n(06/22)\nDesign Guidelines\nAll Development\nG1.\t The 4.1250(A)(1)(S1) standard shall be \nmet.\nG2.\t The 4.1250(A)(1)(S2) standard shall be \nmet.\nG3.\t The 4.1250(A)(1)(S3) standard shall be \nmet.\nDesign Standards\nAll Development\nS1.\t All new developments shall be designed in a manner that is \nconsistent with and responds to the City’s approved Future \nStreet Plan. Future Street Plans may be required at the \ndiscretion of the Manager and shall be prepared and approved \nas required by Section 9.0700.\nS2.\t Where public streets are required, the Manager may require \nthat traffic-calming features such as speed bumps, curb \nextensions, and enhanced pedestrian crosswalks be included \nin the design and construction of the streets.\nS3.\t Public streets shall be dedicated within the site and connected \nto adjacent streets with a maximum block length of 300 ft. \nby 300 ft. from curb to curb. Departures shall be considered \nby the Manager or Design Commission based on one or more \nitems listed below:\na.\t Topography, right-of-way, existing construction or \nphysical conditions, or other geographic conditions that \nimpose an unusual hardship on the project applicant, \nand an equivalent alternative which can meet the \nCivic Neighborhood Connectivity goals and policies, as \napplicable, if available; or \nb.\t A departure provides the opportunity for a public open \nspace or other public amenity that would otherwise not be \npossible and does not create a significantly greater spacing \nthan necessary to accommodate the amenity;  or\nc.\t The location of an institutional use that requires a larger \nblock size; or \nd.\t In place of the public street, a primary internal drive(s) \nmeeting the standards of 4.1250(A)(1)(S5) may be used \nto meet cross circulation Standards as determined by the \nManager or Design Commission.\n1.\t Integrated Site Design\nFig. A.1.S2: Enhanced pedestrian crosswalk.\nIntent:\t To design sites in a manner that creates connections to \nsurrounding properties and areas, reducing the distance \nrequired to access the site while encouraging walking and \nalternate modes of transportation. Block structures shall \nbe used to break down the scale of the site, creating an \nenvironment which is comfortable for people and allows for \nimproved infill development and redevelopment potential.\nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nB.\t Support a Mixed-use Community\n\t\n\t\nC.\t Provide Pedestrian and Transit Orientation\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nE.\t Enhance Connectivity \n\t\n\t\nF.\t Integrate Public Amenities and Green Spaces\n\t\n\t\nG.\t Utilize Sustainable Development Practices\n\t\n\t\nI.\t\nDesign at a Human Scale\nFig. A.1: Site design creates connections to the \nsurrounding area.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 31,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 31\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG4.\t Publicly accessible pedestrian \nconnections should be provided at \nregular, convenient spacing through \nlarger sites. Connections shall include \nan accessible walkway framed by \nlandscaping, with lighting and other \npedestrian amenities provided along \nthe pathways length to promote a safe \nand inviting environment.\nDesign Standards\nAll Development, Continued\nS4.\t If the length of frontage between a public street or primary \ninternal drive is greater than 300 ft. (for example, as provided \nfor in 4.1250(A)(1)(S3)(a)-(c)), a mid-block pedestrian pathway \nshall be provided to connect to surrounding public spaces \nsuch as streets, primary internal drives, public open spaces, \npedestrians pathways, trails, and nearby transit facilities. \nPedestrian pathways shall:\na.\t Be fully accessible at all times to the public, and connect at \ngrade to adjoining public sidewalks; \nb.\t Provide predominantly direct access and visual \nconnections through the site for the full depth of the \nblock;\nc.\t Provide convenient pedestrian access to abutting \nbuildings;\nd.\t Be a minimum of 16 ft. in width, and include: \ni.\t\nAn accessible paved walkway of at least 6 ft. in width; \nand\nii.\t Significant landscaping including trees, shrubs, \ngroundcover, and perennial landscape plantings on \neither side of the walkway.\ne.\t Pedestrian scaled lighting fixtures no taller than 18 ft.; and \nf.\t\nPedestrian amenities such as benches, decorative paving, \nand artistic elements are encouraged to be spaced at \nregular intervals along the path. \nFig. A.1.S4.b: Landscaped pedestrian path with decorative paving and seating \namenities.\n1.\t Integrated Site Design, Continued\nFig. A.1.S4.a: Pedestrian path with decorative paving, \nlandscaping, and seating amenities.\nFig. A.1.S3: Illustration of maximum block lengths.\n300’\n300’\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 32,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 32\n(06/22)\nDesign Standards\nAll Development, Continued\nS5.\t Primary internal drives shall be consistent with the section \nshown in Figures A.1.S5.a and b. Primary internal drives shall \nconsist of an 18-ft., two-way drive lane, on both sides of which \nshall include a clear accessible walking route of a minimum 5 \nft. in width provided in a sidewalk of either 5 ft. or 6 ft. wide. \nWhere a 5-ft. sidewalk is provided, there shall be a 5-ft. wide \namenity zone, where a 6-ft. sidewalk is provided, there shall be \na 4-ft. wide amenity zone. Primary internal drives may include \n7-ft. wide lanes for parallel parking in locations approved by \nthe Manager or Design Commission.\na.\t Primary internal drives shall be built to public works \nstandards.\nb.\t Primary Internal Drives shall be fully accessible to the \npublic.\nc.\t Primary internal drives shall be located to align compatibly \nalong their length, and with surrounding primary internal \ndrives, streets, and designated future public streets.\nd.\t The specific drive lanes may be required to be a minimum \nwidth of 26 ft. to accommodate emergency vehicles as \ndetermined by the Manager. \ne.\t The maximum width of the primary internal drive, \nincluding amenity and walk areas, shall not exceed 64 ft. \nunless required for emergency vehicles as determined by \nthe Manager.\nf.\t\nWhere feasible, drives shall be oriented within 15 degrees \nof north-south or east-west to provide for solar orientation \nin lot development. \ng.\t Sidewalks, pedestrian walkways, and drives shall connect \nto and align with surrounding pedestrian and vehicular \ncirculation patterns.\nh.\t Crosswalks shall be provided on primary internal drives \nto align with corners, pedestrian paths, and public areas. \nCrosswalks shall receive enhanced paving that creates \na visual distinction between the crosswalk and the \nsurrounding surfaces.\ni.\t\nThe amenity zone shall be landscaped and/or paved to \nmatch or accent the sidewalk using concrete, decorative \npaving, or paving which allows stormwater infiltration as \napproved by the Manager.\nj.\t\nWhen primary internal drives include parking, bump outs \nshall be provided at intersections which extend to the \ndepth of the parking lane to lessen crossing distances for \nthe pedestrian. \nk.\t Trees selected from the City of Gresham Recommended \nStreet Trees list shall be planted in the amenity zone at an \naverage spacing of one per 30 ft. The trees shall be of a \nsize no smaller than 2.5-in. caliper at time of planting.\nl.\t\nPedestrian scaled lighting fixtures no taller than 18 ft. shall \nbe provided. Illumination levels shall be as specified in \nSection 4.1250(A)(7).\nDesign Guidelines\nAll Development, Continued\nG5.\t Internal drives and walkways shall \nfunction as pedestrian-friendly streets \nand establish a pedestrian scaled block \npattern. Shared pedestrian/vehicle \n(woonerf) streets may be utilized. \na.\t The 4.1250(A)(1)(S5)(a-d) \nstandards shall be met.\nb.\t Roadways shall be designed to \nlook and function like public \nstreets with planting strips, street \ntrees, sidewalks, and parallel \nparking where appropriate per the \nManager or Design Commission.\nc.\t Internal drives shall provide \nfor the functional and visual \nintegration of buildings, services, \nvehicular access and parking, and \npedestrian circulation.\nd.\t Layout of drives shall relate to \nsurrounding circulation patterns \nand solar orientation.\ne.\t Visually distinct crosswalks shall \nbe provided to enhance the \nappearance of the development.\nf.\t\nWhen parking is present on \ninternal drives, the amenity zone \nshall be appropriately designed \nand efforts shall be taken to \nensure pedestrian safety when \ncrossing the roadway.\ng.\t Trees shall be planted along \ninternal drives in a pattern \nconsistent with those on public \nstreets.\n1.\t Integrated Site Design, Continued\nFig. A.1.S5: Landscaping, street trees, and pedestrian \nscaled lighting enhance the pedestrian areas on a \nprimary internal drive. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 33,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 33\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nCommercial, Industrial, and Institutional\nG6.\t Vehicle connections shall be provided \nto abutting properties to prevent \nunnecessary traffic on public streets.\nMultifamily and Townhouse\nG7.\t The 4.1250(A)(1)(S7) standard is \nrequired at the discretion of the Fire \nChief or Fire Marshall.\nDesign Standards \nCommercial, Industrial, and Institutional\nS6.\t When public streets or primary internal drives are not present \nto connect to neighboring commercial properties, vehicular \nand pedestrian connections shall be provided to existing or \nfuture parking areas on adjacent properties as required by \nSection 9.0822(A)(8).\nMultifamily and Townhouse\nS7.\t Private Driveway Accesses: When private driveway accesses \nare provided for multifamily developments such as \ncondominiums and apartments, they shall be designed as \nfollows:\na.\t Dead-end private driveway accesses shall not exceed 600 \nft. in length nor serve more than one hundred dwelling \nunits. Dead-end private driveway accesses that exceed \n150 ft. in length shall be provided with an approved turn-\naround.\nb.\t Dead-end private driveway accesses that serve more than \ntwenty-five units shall be designed as follows:\ni.\t\nA driveway width of not less than 32 ft.; and\nii.\t No segment of the driveway will be in excess of 400 ft. \nin length before there is a Fire Department approved \nturn-around (including a looped driveway) or turnout.\nc.\t For dead-end private driveway accesses, “PRIVATE ACCESS \nONLY” signage and driveway approach shall be placed at \nthe intersection with the public street to clearly identify \nthe private driveway access.\nd.\t Private maintenance of private driveway accesses shall \nbe provided by a Homeowners’ Association or other \nappropriate entity. Maintenance shall ensure continual \nemergency access at all times.\ne.\t Location of private driveway accesses shall meet the \nOregon Uniform Fire Code and shall be consistent with \nAppendix A5.501 (G)(4) and A5.503.\nFig. A.1.S5.a: Plan view diagram of Primary Internal \nDrive showing optional parallel parking.\n1.\t Integrated Site Design, Continued\nFig. A.1.S5.b: Section diagram of Primary Internal Drive showing optional parking.\nNot to scale\nNot to \nscale\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 34,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 34\n(06/22)\nIntent: To locate and orient buildings appropriately to enhance \npedestrian accessibility and place the most visually interesting \nfacade in public view while reinforcing the urban character of \nthe neighborhood, and providing for active, pedestrian scaled \nstreetscapes. \nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nB.\t Support a Mixed-use Community\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nF.\t Integrate Public Amenities and Green Spaces\n\t\n\t\nI.\t\nDesign at a Human Scale\nTable 4.1250.A.2 Civic Neighborhood Street Classification \nHierarchy\nIn order of highest functional class to lowest, the Civic \nNeighborhood Street Types include:\n•\t\nUrban Boulevard (Arterials)\n•\t\nCivic Drive\n•\t\nWallula Avenue\n•\t\nCivic Neighborhood Connector\n•\t\nCivic Neighborhood Local and Undesignated\n•\t\nPrimary Internal Drives\n2.\t Building Frontage and Placement \nDesign Standards:\nAll Development\nS1.\t Building Frontage: Building frontage shall be measured by \nthe length of the building present between the minimum \nand maximum setback. Space attributed to public streets, \ndriveways (excluding driveways for townhouse and townhouse \nstyle units), primary internal drives, and Clear Vision Areas \nwithin the setback area shall be subtracted from the total \nlength of the frontage calculations. Lots whose frontage on a \nstreet includes only vehicular access, such as a flag pole, are \nnot required to meet the requirements for minimum building \non the frontage. The minimum percentage of site frontage that \nmust be occupied by a building shall be dependent upon their \nstreet location and shall be no less than the following values \n(to identify street types, see Map 4.1243: Civic Neighborhood \nStreets and Future Streets):\na.\t Urban Boulevard (Arterials): 60 percent\nb.\t Civic Drive: 90 percent \nc.\t Wallula Ave: 75 percent\nd.\t Civic Connector: 75 percent\ne.\t Civic Local, undesignated street types, and primary \ninternal drives: 60 percent\nDesign Guidelines:\nAll Development\nG1.\t Sufficient length of buildings shall be \npresent along a frontage to maintain \na continuous building street wall, and \nin general, limit spatial gaps to those \nnecessary to accommodate vehicular \nand pedestrian access in order to \ndefine the street edge. The amount \nof frontage shall be related to the \nstreet type, and shall be sufficient \nto promote active spaces along the \nfrontage at the pedestrian level.\nFig. A.2.S1.a: Building frontage should reinforce the \nurban character of the neighborhood.\nFig. A.2.S1.b: Building frontage should reinforce the \nurban character of the neighborhood.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 35,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 35\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards:\nAll Development, Continued\nS2.\t If a building resides on a corner with frontage on both streets:\na.\t The building frontage requirement shall apply to the street \nwith the highest functional classification. If the streets \nhave equal functional class the applicant may determine \nthe primary frontage. \nb.\t One hundred percent of the frontage at street \nintersections shall be occupied by buildings or pedestrian-\noriented open spaces for a minimum distance of 60 ft. \nalong each frontage, as measured along the minimum \nsetback line, except as required to meet clear vision \nrequirements, where applicable.\nc.\t Frontages on streets or primary internal drives other than \nthe primary frontage shall provide one of the following \npedestrian amenities:\ni.\t\nMeet the building frontage requirement of that street \ntype; \nii.\t Provide enhanced landscaping (in addition to that \nrequired by 4.1250(A)(6)) along the length of the \nfrontage not occupied by buildings, including trees, \ndeciduous shrubs, and groundcovers; or \niii.\t Provide regularly spaced pedestrian amenities along \nthe frontage not occupied by buildings such as seating, \nshelters, street furniture, decorative lighting, public \nart, kiosks, and street vending.\nd.\t The Manager may require that a building that will abut a \nfuture street right-of-way, as shown on an approved future \nstreet plan or neighborhood circulation plan, be oriented \nto that future right-of-way.\nDesign Guidelines:\nAll Development, Continued\nG2.\t Greater concentrations of buildings \nand building mass shall be present at \nthe intersection of streets to better \ndefine these areas. \na.\t Buildings at intersections shall \nprovide a primary frontage along \nthe street of higher classification.\nb.\t Buildings at corners shall provide \nbuilding frontage on both streets \nat the corner, or may be set back \nwith public open space to promote \nvisibility in these locations.\nc.\t Frontages on streets or primary \ninternal drives other than the \nprimary frontage shall provide \nenhanced pedestrian amenities \nalong the length of the frontage(s) \nto enhance the pedestrian-\noriented character of the \nneighborhood.\nd.\t Section 4.1250(A)(2)(S2)(d) shall \nbe met.\n2.\t Building Frontage and Placement, Continued\nFig. A.2.S2.a: Corner building located with frontage \nalong both streets and oriented to the street with higher \nfunctional class.\nCorner \nCorner \nopen \nopen \nspace\nspace\nFig. A.2.S2.b: Diagram illustrating 75 percent building frontage including a pedestrian \nopen space at the corner that is lined by buildings.\nPedestrian \nPedestrian \nWalk\nWalk\nParking behind buildings\nParking behind buildings\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 36,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 36\n(06/22)\nDesign Standards:\nAll Development, Continued\nS3.\t Pedestrian-oriented open spaces, meeting the requirements \nof Section 4.1250(A)(5) may count towards the frontage \nrequirement along a street frontage on public streets \nor primary internal drives up to 10 percent of the total \nrequirement when:\na.\t The pedestrian-oriented open space has a clear visual and \nphysical connection to the street.\nb.\t Pedestrian-oriented open spaces may be between the \nright of way and the building facade as long as the building \nfacade is not more than 40 ft. from the right of way. \nc.\t The space contains design elements that define the street \nedge and screen any off-street parking that would be \nvisible from the street through the open space.\nS4.\t If a pedestrian-oriented open space is present at an \nintersection of two public streets, its internal site edges shall \nbe lined by buildings for a minimum of 80 percent of their \nlength. \nS5.\t Civic Uses: To provide greater flexibility and to emphasize the \nimportance of civic uses, civic buildings do not have to meet \nthe maximum setback requirements. However, alternative \nfrontage treatments shall meet the following objectives, as \ndetermined by the Manager or Design Commission: \na.\t Parking shall not be located between the building frontage \nand the primary street frontage; \nb.\t The building(s) shall emphasize civic use(s) and shall \ninclude visually prominent architecture visible from the \nadjoining public street(s);\nc.\t The site design treatment shall contribute to the desired \npedestrian-oriented character of the neighborhood by \nproviding public open space of a minimum of 600 sq. ft. in \nsize adjacent to a public street; and\nd.\t There is a direct and inviting pedestrian connection \nbetween the building and the street(s).\nDesign Guidelines:\nAll Development, Continued\nG3.\t Active public open spaces meeting \nthe requirements of Section 4.1250(A)\n(5) may contribute to the required \nsite frontage when they maintain an \nactive, pedestrian-oriented street edge \nand do not unduly interrupt street \ncontinuity.\nG4.\t If an open space is present at an \nintersection, buildings shall be present \non internal site edges to define and \nactivate the space.\nG5.\t Civic Uses: Civic buildings shall be \nplaced to provide continuous visual \ninterest to the pedestrian, support \npedestrian connections to and through \nthe site, and provide active spaces \nalong the street(s).\n2.\t Building Frontage and Placement, Continued\nFig. A.2.S3: Pedestrian-oriented open space that \nprovides visual connection with the street and contains \ndesign elements to help define the street edge.\nFig. A.2.S5: Civic building with open space and increased setback.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 37,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 37\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards:\nMultifamily\nS6.\t Where more than one residential building on a site faces one \nanother, a minimum separation of 20 ft. shall be required \nbetween front building facades, inclusive of setbacks. The \nseparation area shall include at minimum a shared pedestrian \nwalkway and landscaping. \na.\t If any portion of a residential building is within 50 ft. of \nan abutting LDR-5, LDR-7, TLDR or TR District, it shall be \nseparated from other occupied buildings by a minimum of \n15 ft.\nTownhouse and Townhouse Style\nS7.\t Where more than one building on a site is proposed, the \nminimum separations between buildings shall be as follows:\na.\t Buildings containing dwelling units:\ni.\t\nFront to front: 20 ft., with a landscaped pedestrian \nwalkway provided in the area between buildings\nii.\t Front to side:  15 ft., with a landscaped pedestrian \nwalkway provided in the area between buildings\niii.\t Front to rear: 20 ft., with a landscaped pedestrian \nwalkway provided in the area between buildings\niv.\t Side to side: 10 ft.\nv.\t Side to rear: 10 ft.\nvi.\t Rear to rear: 20 ft.\nb.\t All buildings: 10 ft.\nc.\t If any portion of a residential building is within 50 ft. of \nan abutting LDR-5, LDR-7, TLDR or TR District, it shall be \nseparated from other occupied buildings by a minimum of \n15 ft.\nDesign Guidelines:\nMultifamily\nG6.\t Provide adequate separation between \nmultifamily buildings to allow for sun, \nlight, and air as a means of reducing \nshadows on public and semi-public \nopen spaces and privacy between \nbuildings. \n\nTownhouse and Townhouse Style\nG7.\t Provide adequate separation between \nbuildings to allow for circulation and \nprivacy between buildings, for sun, \nlight and air access, and as a means of \nreducing shadows on public and semi-\npublic open spaces. \n2.\t Building Frontage and Placement, Continued\nFig. A.2.S7: Townhouse styles buildings with sufficient \nspace between them to provide for landscaping, \npedestrian circulation, and daylighting.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 38,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 38\n(06/22)\n3.\t Pedestrian Circulation\nIntent: Create a network of pedestrian-oriented connections that \nsupports the larger street and open space network and \nencourages appropriately scaled and oriented development.\nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nB.\t Support a Mixed-use Community\n\t\n\t\nC.\t Provide Pedestrian and Transit Orientation\n\t\n\t\nE.\t Enhance Connectivity\n\t\n\t\nF.\t Integrate Public Amenities and Green Spaces\nDesign Standards \nAll Development\nS1.\t Developments shall provide an on-site pedestrian circulation \nsystem that is convenient, direct, and barrier-free. \na.\t The on-site pedestrian circulation system shall be \ncontinuous and connect the following: adjacent streets, \nprimary internal drives, public pathways, trails, transit \nstops and facilities, building entries and future building \nentries, vehicular and bicycle parking areas, open spaces, \nplay areas, other amenities on site, and other important \nlocations such as view points at the discretion of the \nManager or Design Commission.\nb.\t Buildings and sites located within 300 ft. of a light rail \nstation shall provide clear on-site pedestrian circulation \nconnections to the station. Pedestrian activity centers \nwithin 500 ft. should also be considered in the layout of \nthe on-site pedestrian circulation system.\nc.\t The system shall minimize out of direction travel and \nprovide reasonably direct connections between all \ndestinations. The pedestrian circulation system shall give \npriority to providing direct connections between all public \nstreets, transit stops, primary internal drives, and the \nprimary building(s) or use(s) on the site.\nd.\t On-site vehicular and pedestrian circulation design shall \nminimize vehicular/pedestrian conflicts (e.g. driveway \ncrossings, etc.).\ne.\t Enhanced accessible pedestrian spaces and amenities are \nencouraged along circulation routes, such as view points, \nplazas, arcades, gallerias, courtyards, outdoor cafes, \nwidened public sidewalks (more than 6 ft. wide outside \nthe public right of way), benches, shelters, street furniture, \npublic art, kiosks, and street vending. \nf.\t\nCovered walks are encouraged between primary building \nentries and adjacent public sidewalks, and on other on-site \nwalkways.\nDesign Guidelines: \nAll Development\nG1.\t Sites shall provide an integrated \npedestrian circulation system \nwhich provides dedicated space \nfor pedestrian movements on site. \nPedestrian circulation routes shall:\na.\t Provide convenient, direct, and \naccessible pedestrian routes \nto  pedestrian destinations on \nor adjacent to the site such as \nstreets, primary internal drives, \npublic pathways, transit facilities, \nbuilding entries, open spaces, \nparking areas, etc.; and\nb.\t Promote safe, attractive, and \nusable pedestrian circulation \nfacilities which support visibility to \nand through the site.\nFig. A.3: Pedestrian oriented circulation route.\nFig. A.3.S1.a: Pedestrian circulation route provides \ndirect connection between buildings.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 39,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 39\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards\nAll Development, Continued\nS2.\t All walkways comprising the pedestrian circulation system \nshall be hard surfaced and constructed of scored or saw-cut \nconcrete, or of decorative paving such as colored and stamped \nconcrete, brick, stone, or concrete pavers. Walkways shall \nbe constructed at a consistent height except where crossing \nvehicular routes and be at least 5 ft. in width. \nS3.\t Parking Area Walkways: \na.\t Within the parking area, pedestrian circulation routes shall \nbe separated from vehicular traffic, except where crossing \ndrive lanes, by a raised curb, bollards, landscaping, or \nother features approved by the Manager or Design \nCommission.\nb.\t Crosswalks shall be provided where parking area walkways \nintersect primary internal drives or internal public streets. \nIf streets or primary internal drives include parking lanes \nat a crosswalk, bump outs shall be present, and extend the \ndepth of parking lanes.\nc.\t When adjacent to or crossing vehicular traffic routes \n(except individual residential unit driveways), walkways \nshall be a different paving material and contrast visually \nwith adjoining drive surfaces.\nd.\t When abutting parking spaces, walkways shall be at least 7 \nft. wide unless wheel stops are provided. \ne.\t Parking area walkways shall be created perpendicular to \nthe drive aisles when the following conditions occur:\ni.\t\nParking areas contain more than one hundred spaces; \nand\nii.\t Commercial spaces or other uses on site exist in \nlocations parallel to the parking drive aisle. \nf.\t\nParking area walkways shall be landscaped along a \nmajority of their length, exclusive of areas where the \npath crosses drive lanes, in the form of planted islands \nor planting strips. Landscaped islands which incorporate \nparking area walkways shall count toward the required \nparking area landscaped islands. Trees in parking area \nwalkways shall be selected from the City’s Recommended \nParking Lot Tree list.\nDesign Guidelines: \nAll Development, Continued\nG2.\t Walkway Construction: The 4.1250(A)\n(3)(S2) standard shall be met.\nG3.\t Pedestrian circulation systems shall \ninclude routes through parking \nareas which ensure safe, convenient, \nand pleasant passage. Parking area \nwalkways shall:\na.\t Incorporate design elements \nwhich prevent vehicles from \nencroaching on walkways and \nwhich protect pedestrians.\nb.\t Where walkways cross drive aisles, \nthey shall be clearly marked with \nvisually contrasting paving and \nutilize strategies which minimize \ncrossing distances.\nc.\t Where pedestrian circulation \nroutes, such as mid-block paths, \nintersect major streets, features \nshall be present that give \nprominence to these locations and \nenhance pedestrian visibility.\n3.\t Pedestrian Circulation, Continued\nFig. A.3.S3.a: Pedestrian walk through parking area.\nFig. A.3.S3.b: 5-ft. wide parking walkway with scored concrete and landscaping.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 40,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 40\n(06/22)\n3.\t Pedestrian Circulation, Continued\nDesign Standards\nAll Development, Continued\nS4.\t Addressing shall meet the requirements of the Oregon Fire \nCode (OFC), Gresham Revised Code (GRC), and the Gresham \nFire and Emergency Services (GFES) Building Identification and \nAddressing Guide. In addition, the following are required for \nall residential uses:\na.\t Multifamily building addresses and individual unit address \nshall be illuminated during the hours of darkness with a \nminimum of 1.0 foot-candle. \nb.\t For residential developments of twelve or more units, an \nilluminated map of the complex showing the location of \nthe visitor and the unit designations within the complex \nshall be positioned at each driveway and prominent \npedestrian access point. The illumination shall be a \nminimum of 1.0 foot-candle. The directory sign(s) shall \nhave a 3 ft. to 5.5 ft. height, a 7 to 32 sq. ft. area, and shall \nbe located at least 20 ft. back from the property line at the \nstreet access point.\nc.\t The numbering of parking spaces shall not directly \ncorrespond to the unit numbers, for security purposes.\nDesign Guidelines: \nAll Development, Continued\nG4.\t Addressing System. The 4.1250(A)(3)\n(S4) standard shall be met.\nFig. A.3.S4: Illumination provided for multifamily building address.\nFig. A.3.S1.b: Pedestrian circulation route provides \ndirect connection between buildings.\nFig. A.3.S1.c: Pedestrian circulation route provides \nenhanced pedestrian amenities including seating, \ndecorative pavers, and water feature.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 41,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 41\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nIntent:\t To minimize the negative visual and functional impacts that \nparking and required service functions, such as deliveries and \ntrash removal, have on primary streets, adjacent properties, \nand surrounding areas. \nKey Civic Neighborhood Design Principles:\n\t\n\t\nB.\t Support a Mixed-use Community\n\t\n\t\nC.\t Provide Pedestrian and Transit Orientation\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nG.\t Utilize Sustainable Development Practices\n\t\n\t\nH.\t Promote High Quality Design\n\t\n\t\nI.\t\nDesign at a Human Scale\n4.\t Parking, Loading, and Service Areas\nDesign Guidelines: \nAll Development\nG1.\t Surface parking areas and lots, \nloading, service, and vehicular \ncirculation areas shall be located at \nthe interior or rear of the site and \naway from adjacent public spaces.\na.\t Site parking, loading service, and \nvehicular circulation areas shall \nbe located so as to allow desired \nuses and activities to face the \nstreet and to support pedestrian-\noriented streets. Service items \nsuch as loading docks and garbage \ndumpsters shall be buffered from \npedestrian areas. Enclosing and \nintegrating these items into the \nbuilding is strongly encouraged.\nb.\t Parking shall be minimized from \nthe primary frontage.\nG2.\t The impact of vehicular access \npoints shall be minimized by locating \nvehicular entries on secondary or rear \nfrontages when present.\nDesign Standards: \nAll Development\nS1.\t Off-Street parking, loading, service, and vehicular circulation \nareas are prohibited between the building and the primary \nfrontage except for individual driveways for Townhouse and \nTownhouse style units. \na.\t Parking, vehicular circulation, loading, and service areas \nshall be behind the maximum setback or behind a line \ndrawn parallel to the street at the point where the building \nis closest to the street, whichever is closest to the street. \nIn no circumstance shall they be closer than the minimum \nbuilding setback. For sites with multiple frontages, \nparking may be allowed up to the minimum setback on \nsecondary or rear frontages regardless of building location \nas approved by the Manager or Design Commission. \nStandards for minimum building frontage shall be \nconsidered when making this determination. \nb.\t Required off-street parking shall be located to the rear, \ninterior, side, on top of, or beneath the structure.\nS2.\t Vehicular site access is prohibited from the primary frontage if \nanother frontage is available, except for individual driveways \nfor townhouse units.\na.\t Individual driveways for townhouse units and townhouse \nstyle units shall not be located on streets classified as an \nUrban Boulevard (Arterials) or Civic Drive.\nFig. A.4.S1: Parking is located behind the buildings and \naccessed from the lower classified street.\nFig. A.4.S1: Parking for a townhouse style structure \nis located off an internal driveway at the rear the \nstructure.\nFig. A.4.S2: Parking area is located behind multifamily buildings and accessed from \na secondary frontage.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 42,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 42\n(06/22)\nDesign Standards: \nAll Development, Continued\nS3.\t Parking along new public streets (on-street parking) created \nas part of the development may count toward the minimum \nparking requirement at the discretion of the Manager or \nDesign Commission.\nS4.\t Parking lots shall not be located adjacent to street \nintersections. Parking structures may be located at street \nintersections provided active uses occupy the ground floor \nat the street corner. The depth of the active space shall be at \nleast 30 ft. and its total length per side shall be at least 50 ft.\nS5.\t Structured parking facilities shall be designed to accommodate \ncommercial or residential uses on the ground floor level, be \nconcealed within the site, or shall be located under or above \nthe ground floor of buildings. Where structured parking is \nprovided on the ground floor, residential or retail uses shall be \nprovided along the street front with parking facilities placed \nbehind the uses and away from streets. Structured parking on \nupper floors along streets may be allowed if the facade meets \nthe building design standards set forth in Section 4.1250(B). \nGround level structured parking exposed to the street shall be \nprohibited except for the following:\na.\t Required driveways; or \nb.\t Where the design features add visual interest to the \npedestrian; views into garages are minimized; and the \nfacade meets the Section 4.1250(B) requirements for \nbuilding design.\nS6.\t Where greater than one hundred surface parking spaces are \nprovided on site, parking shall be divided into areas of 100 or \nless spaces by one of the following methods:\na.\t A series of Pedestrian Pathways meeting the standards of \n4.1250(A)(1)(S4) connecting through the parking areas to \nsurrounding uses; and/or\nb.\t A system of internal public streets or primary internal \ndrives.\nDesign Guidelines: \nAll Development, Continued\nG3.\t The 4.1250(A)(4)(S3) standard shall be \nmet.\nG4.\t Surface parking areas shall not \nbe located adjacent to street \nintersections. Structured parking \nfacilities with active ground floor uses \nat corners may be located in these \nareas. \nG5.\t Structured parking shall meet the \nfollowing guidelines:\na.\t Below grade and structured \nparking facilities are especially \nencouraged.\nb.\t Parking facilities shall be located \nand oriented to the rear or interior \nof the property to minimize \nnegative visual impacts. Parking \ngarages shall incorporate active \nuses at the ground level along \npublic streets, especially at \ncorners.\nc.\t Structured parking layouts shall \nprovide pedestrian circulation and \nconnections with building uses. \nG6.\t The 4.1250(A)(4)(S6) standard shall be \nmet.\n4.\t Parking, Loading, and Service Areas, Continued\nFig. A.4.S4.a: Parking structure with active first floor \nuses at the corner.\nFig. A.4.S4.b: Active street-level use serves as a liner space for a parking structure.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 43,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 43\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards: \nAll Development, Continued\nS7.\t When dedicated loading facilities are required, loading areas \nshall be located at the rear of the building or as approved by \nthe Manager or Design Commission. \na.\t If loading areas cannot be located at the rear of the \nbuilding, they may be placed along the building’s side and \nrecessed from the front facade a distance which minimizes \nvisual, acoustic, and lighting impacts and prevents vehicles \nfrom extending onto adjacent walkways. Required loading \narea dimensions can be found in Section 9.0840. \ni.\t\nDedicated loading areas shall be screened parallel to \nthe building wall with liner spaces or walls integrated \ninto the building and at minimum, be no less than \nthe height of the first floor facade. This area may \ncount towards the frontage requirement if it meets \nthe building design standards set forth in Section \n4.1250(B). The liner spaces or walls shall fully conceal \nservice vehicles except at the entry in order to allow \nfor safe vehicular movement while exiting.\nb.\t Liner spaces, screening walls, and access doors shall \nmatch the building architecture and include articulation, \nmaterials, and detailing similar to the principal building. \nc.\t Loading areas shall be visually screened from public spaces \nsuch as streets, primary internal drives, light rail stations, \ntransit ways, public open spaces, and pedestrian pathways. \ni.\t\nWhen loading areas are not integrated into the \nbuilding, screening shall include evergreen landscaping \nof a height and spacing at time of planting that will \nscreen the area and/or opaque fencing/walls that \nscreen the area.\nd.\t When located next to residential uses, service vehicles \nshall not be left idling in excess of 10 minutes between the \nhours of 10 p.m. and 6 a.m. Signage shall be posted in a \nvisible location within the loading area to inform drivers of \nthis requirement.\nDesign Guidelines: \nAll Development, Continued\nG7.\t Service areas shall be located away \nfrom public view to the greatest \ndegree possible and shall minimize \nvisual, acoustic, and lighting impacts \non surrounding areas.\na.\t Service and loading areas shall \nnot be clearly visible from public \nspaces. Use liner spaces or \narchitectural elements to screen \nservice areas on the side of a \nbuilding, or behind a building \nwhen visible from a street or \nprimary internal drive. \nb.\t Service area screening shall be \ndesigned to be compatible with \nthe primary building.\nc.\t The operations within service \nareas shall respect adjoining \nproperty owners and not create \nundue negative impacts to \nadjacent sites. \nd.\t Section 4.1250(A)(4)(S7)(d) shall \nbe met.\n4.\t Parking, Loading, and Service Areas, Continued\nFig. A.4.S7.a: Loading area is integrated into the rear \nof the building.\nFig. A.4.S7.b: Loading area at the rear of the building, visually screened by a wall \nmatching the building architecture and by landscaping at the property line.\nFig. A.4.S6.a: Large parking areas broken up by a \nlandscaped pedestrian path.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 44,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 44\n(06/22)\nDesign Standards: \nAll Development, Continued\nS8.\t In addition to requirements stated in Section 7.0212 Solid \nWaste and Recycling Collection Area, collection areas shall be \nentirely screened and enclosed by an opaque wall of at least 6 \nft. in height. \na.\t Screening walls and access doors or gates shall be \ndesigned using materials and detailing which are similar to \nthe main building. \nb.\t Detached enclosures located along a street or primary \ninternal drive shall provide a minimum 5-ft. deep \nlandscaped setback including evergreen screening shrubs \nof a minimum height at the time of planting equal to the \nenclosure height. \nc.\t This requirement applies to townhouses and townhouse \nstyle multifamily units only if common garbage collection \nand recycling facilities are provided for the site.\nS9.\t No exterior waste collection and recycling area shall be located \nwithin 25 ft. of property lines abutting LDR-5, LDR-7, TLDR or \nTR designated property.\nMultifamily\nS10.\tBike parking shall be in accordance with Table 9.0851. Long \nterm bike parking shall be accommodated within dedicated \nstorage areas in individual dwelling units, under covered \nentries or breezeways, or within designated common storage \nareas in multifamily structures. Bike storage is to be in addition \nto the required individual storage facilities. \nMultifamily and Townhouse\nS11.\tIndividual Storage facilities shall be provided for articles such \nas barbecues, outdoor furniture, etc. The storage facility shall \nbe a minimum 6 ft. high and 24 sq. ft. in area. The facility shall \nbe completely enclosed and capable of being locked, and shall \neither be connected to each unit, within a garage that belongs \nwith a unit, or easily accessible (such as in a central facility). If \nlocated within a garage, the storage space must be separate \nfrom and in addition to the area required for vehicle parking \nso as to not impede vehicle parking. (Elderly Housing and \nResidential Facilities need not comply with this requirement.)\nDesign Guidelines: \nAll Development, Continued\nG8.\t Collection area enclosures shall be \nattractively designed in a manner \nthat complements surrounding \nbuildings and completely screens the \ncontainers. \nG9.\t Exterior waste collection and recycling \narea shall not be located next to \nproperty lines abutting an LDR-5, LDR-\n7, TLDR, or TR designated property.\nMultifamily\nG10.\tThe proposed development will \nincorporate facilities for people to \nride their bikes. Bike parking shall be \nprovided for each unit and located \nin conveniently accessible, secure \nlocations.\nMultifamily and Townhouse\nG11.\tStorage. The 4.1250(A)(4)(S11) \nstandard shall be met.\n4.\t Parking, Loading, and Service Areas, Continued\nFig. A.4.S8: Collection area screening enclosure using \nhigh quality materials similar to the primary structure.\nFig. A.4.S10: Short term bike parking areas provided per Table 9.0851.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 45,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 45\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\n4.\t Parking, Loading, and Service Areas, Continued\nDesign Standards: \nAdditional Standards for Multifamily and Townhouse\nS12.\tParking:\na.\t Complexes containing twelve or more units shall submit \na Neighborhood Parking Analysis that identifies potential \non-street parking conflicts on adjacent streets and \nrecommends possible mitigation measures. The analysis \nshall include an assessment of the supply and demand for \nadjacent on-street parking and the estimated on-street \nparking demand created by the proposed development. \nMitigation measures may include, but are not limited to, \nparking duration limitations, time of day limitations, or \nsupplemental off-street parking.\nb.\t Garages for multifamily shall only be used for the parking \nor storing of vehicles of residents.\nc.\t All attached garages facing a street or primary internal \ndrive shall be located at least 2 ft. behind portions of the \nattached ground floor facade containing living space.\nd.\t Detached garages or carports shall reflect the architectural \nstyle and/or building materials that are used for the \nprimary building(s).\n\nAdditional Standards for Townhouse and Townhouse Style\nS13.\tStreet-facing garage openings associated with townhouse \nconfigurations shall have a maximum width of 50 percent of \nthe overall unit width.\nS14.\tDriveways and Unit Access: \na.\t The maximum width for individual single garage driveways \nlocated at the front of a dwelling unit is 10 ft. wide \n(excluding the driveway approach width).\nb.\t The maximum width for a shared driveway that serves \ntwo units or a double car (side-by-side) garage is 16 ft. \n(excluding the driveway approach width).\nDesign Guidelines: \nAdditional Guidelines for Multifamily and \nTownhouse\nG12.\tParking. Parking, loading service, and \nvehicular circulation areas shall be \nintegrated into the site design in a \nmanner that does not detract from \nthe design of the building, the street \nfrontage, or the site.\na.\t The entry and living portions of \nthe facade shall be emphasized, \nwith the garage and automobile \naccess portions of the facade \nminimized and recessed from first \nfloor occupied living spaces. No \n“snout” garages are permitted.\nAdditional Guidelines for Townhouse and \nTownhouse Style\nG13.\tThe impact of street facing garages on \nthe pedestrian environment shall be \nminimized.\nG14.\tBuilding facades, entrances, and \nlandscaping that create a positive \npedestrian environment shall be \nmaximized along the street. The \nimpact, width, and visual presence of \ndriveways, parking, and garages on \nthe pedestrian environment shall be \nminimized. \nFig. A.4.S13: Garage opening widths are less than 50 \npercent of the facade width of the unit they serve.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 46,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 46\n(06/22)\n5.\t Open Spaces\nIntent: To create an interconnected network of pedestrian spaces that \nsupports the larger street and open space network. Open \nspaces shall be developed as a focal point of development, \nencouraging pedestrian activity and social interaction in highly \nvisible locations, enhance a sense of neighborhood identity, \nand conserve and protect mature trees, water, topography,  \nviews, and wildlife habitat.\nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nF.\t Integrate Public Amenities and Green Spaces\n\t\n\t\nG.\t Utilize Sustainable Development Practices\n\t\n\t\nI.\t\nDesign at a Human Scale\nDesign Guidelines\nAll Development\nG1.\t Sites abutting or facing a light rail \nstation or public walkway accessing \na station shall provide attractive, \nfunctional open spaces linking the \nsite with the transit stop or public \nwalkway(s) to the stop. The open \nspaces shall be designed with \nstrategies and features that encourage \npublic activity within the space.\nDesign Standards\nAll Development\nS1.\t All sites abutting or facing a light rail station, or public walkway \naccessing a light rail station, shall provide an on-site public \ncourtyard, plaza, or square that is directly linked and oriented \nto the station or public walkway accessing the station. \na.\t The courtyard, plaza, or square shall be a minimum 200 \nsq. ft. and shall contain high quality pedestrian amenities \nincluding, at a minimum, seating, landscaped area(s) \nwith trees, pedestrian scaled lighting fixtures, and either \ndecorative paving or a public art feature. \nFig. A.5: Public open space integrated into site design.\nFig. A.5.S1.a: Public square leading to adjacent light \nrail station.\nFig. A.5.S1.b: Public square incorporating mature site trees leads to an adjacent light \nrail station.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 47,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 47\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG2.\t Public open spaces shall:\na.\t Be accessible during the hours \npedestrians are typically present; \nb.\t Be sited in accordance with the \nlocation and scale of adjacent \nstreets, buildings, and uses and \ntake into account predominant \nsolar and weather patterns and \nviews; for instance, on-site plazas \nshall not unduly interrupt the \nretail continuity of streets;\nc.\t Include directly accessible building \nentrances in close proximity to the \nspace;\nd.\t Public spaces can be located \nbetween a building and the \nsidewalk when direct connections \nbetween the building and the \nsidewalk are maintained;\ne.\t The dimensions of outdoor spaces \nshall be sufficient to encourage \nand support usage and activity. \nThey shall be proportioned and \ndesigned to be comfortable \nfor human activity and social \ninteraction – standing, sitting, \ntalking; \nf.\t\nPublic open spaces, except for \ninstitutional uses, shall not be \nsized greater than expected \npedestrian activity would support;\ng.\t Publicly accessible open spaces \nshall be located at or near street \ngrade to promote physical and \nvisual connection to the street; \nand\nh.\t Public spaces shall be flanked by \nuses that activate the space and \ncomplement street activity with \nelements such as shops, outdoor \ncafes, and vendors within the \nspace.\nDesign Standards\nAll Development, Continued\nS2.\t All public open spaces shall:\na.\t Be publicly accessible during normal business hours;\nb.\t Be placed near high pedestrian activity areas, with \nwestern or southern exposure where possible. Spaces \nare encouraged to be located to take advantage of \nsurrounding views;\nc.\t Provide a building entrance located within 40 ft. of the \nopen space;\nd.\t Provide direct pedestrian access to the abutting building if \nlocated between a building and a sidewalk;\ne.\t Have a minimum width and depth of 20 ft. unless \notherwise approved by the Manager or Design \nCommission due to site constraints such as site size, site \nshape, or topography;\nf.\t\nExcept for institutional uses, individual street-facing public \nopen spaces shall not exceed 2,000 sq. ft.;\ng.\t Public spaces shall be accessible at grade adjacent to the \nsidewalk to promote physical and visual connection to \nthe street. Portions of public spaces such as plazas may \nbe above or below grade to accommodate a variety of \noutdoor gathering spaces; and\nh.\t Except for civic uses, public spaces located between a \nbuilding and a sidewalk shall be abutted on at least two \nsides by retail shops, restaurants, primary residential or \noffice entrances, or services with their windows and doors \nfronting on the space.\n5.\t Open Spaces, Continued\nFig. A.5.S2.a: Public open space located at an active street corner, with pedestrian \nconnections through the space to adjacent building entries.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 48,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 48\n(06/22)\nDesign Standards\nAll Development, Continued\nS3.\t All public open spaces shall incorporate, at a minimum, the \nfollowing:\na.\t At least 30 percent of the area shall be planted with trees, \nshrubs, groundcover, and perennial landscape plantings;\nb.\t At least 30 percent of the area shall be hardscaped with \ndecorative paving such as stone pavers, brick pavers, \ndecorative concrete pavers, or other pavement treatments \nas approved by the Manager or Design Commission;\nc.\t At least one bench or seating unit for each 200 sq. ft. of \narea, (seating may be grouped into benches or ledges);\nd.\t Pedestrian scaled lighting fixtures no taller than 18 ft.;\ne.\t One visible element with sustainability attributes such as \nrain gardens, green walls, commercial grade solar powered \nlights or equipment, pervious paving, or other elements as \ndetermined by the Manager or Design Commission; and\nf.\t\nOne prominent artistic design element such as creative \npaving patterns, ornamental art features, unique lighting \nelements, etc. or other elements as approved by the \nManager or the Design Commission.\nDesign Guidelines\nAll Development, Continued\nG3.\t Public open spaces shall be designed \nwith strategies and features that \nencourage activity within the space. \na.\t Include a variety of public spaces, \nboth hardscaped and landscaped, \nsuch as on-site plazas, interior \ncourtyards, patios, terraces, and \ngardens.\nb.\t Public spaces shall include focal \npoints such as art sculpture, water \nfeatures, pavilions, seating areas, \nspecimen plants, unique paving, or \nunusual lighting. \nc.\t Design spaces with safety in mind: \non-site plazas shall promote \nvisibility from the street and \nprovide pedestrian scaled lighting \nto enhance nighttime security.\nd.\t Public spaces shall incorporate \nfeatures that advance sustainable \nprinciples, such as use of gray \nwater, solar collection for \npowering pumps or lighting, \nrain gardens, pervious paving, \ncontainers for recycling, and \nbenches made from recycled \nmaterials. \ne.\t Link adjoining outdoor spaces with \ncomfortable paths and walks to \ncreate a network of spaces.\nf.\t\nOpen spaces shall take advantage \nof and preserve any natural \nfeatures on the site and be \ndesigned to accentuate view \ncorridors.\n5.\t Open Spaces, Continued\nFig. A.5.S3.a: Art feature collects rainwater for use in \nopen space landscaping.\nFig. A.5.S2.b: Public open space incorporating features such as seating, decorative \npaving, landscaping at a variety of scales, and a central fountain.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 49,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 49\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nCommercial, Industrial, and Institutional\nG4.\t Well-defined open spaces are critical \nto the public realm and shall be \nprovided in association with large \ndevelopments. The total amount of \nopen spaces shall relate to the size of \nthe overall development.\nG5.\t Greatly enhanced streetscapes may \ncount as open spaces if they contain \namenities that encourage active use \nand significantly improve the character \nof the street.\nDesign Standards\nCommercial, Industrial, and Institutional\nS4.\t Sites larger than 20,000 sq. ft. shall provide a public open \nspace of a size no less than 4 percent of all ground floor \ncommercial space on site, or 1,000 sq. ft., whichever is less. \nS5.\t Sidewalks and amenity zones on public streets and primary \ninternal drives that receive enhanced design and intensive \nstreetscaping may be counted toward the public open space \nrequirement under the following conditions: \na.\t Only areas within 10 ft. of the front or side of a building \nshall count toward the open space area requirement; \nb.\t All designs within the public right-of-way must meet the \nPublic Works Standards or receive a Design Modification \nfrom the Manager;\nc.\t Enhanced streetscape shall be present for the full block \nlength on one side abutting the street or primary internal \ndrive or for 150 ft. abutting both sides of a public street \nor primary internal drive. Enhanced streetscape does not \nhave to meet the minimum pedestrian-oriented open \nspace dimensional requirements;\nd.\t Buildings in this area shall contain transparent glazing for \n60 percent of the ground floor facade area; and\ne.\t Enhanced streetscapes shall include a minimum of the \nfollowing requirements to qualify: \ni.\t\nProvide decorative paving for the required length. \nDecorative paving includes stone pavers, brick pavers, \ndecorative concrete pavers, or other pavement \ntreatments as approved by the Manager or Design \nCommission;\nii.\t Provide trees of 3-in. minimum caliper and other \nlandscape plantings located in the amenity zone. Trees \nshall be spaced an average of no greater than 30 ft. \napart;\niii.\t Decorative benches or other durable, permanent \nseating features shall be placed within the amenity \nzone with an average placement of two seats per 50 \nlinear feet of sidewalk; and\niv.\t Include one public art piece per enhanced streetscape \nfrontage. Public art may be combined with the \ndecorative paving or seating requirements at the \ndiscretion of the Manager or Design Commission. \n5.\t Open Spaces, Continued\nFig. A.5.S5.a: Enhanced sidewalk amenity zone with \npaving and seating.\n \nFig. A.5.S5.b: Examples of amenities provided in \nenhanced sidewalk designs.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 50,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 50\n(06/22)\nDesign Guidelines\nMultifamily\nS6.\t Outdoor Private Space. Each dwelling unit shall have attached \ndirectly accessible outdoor private space totaling no less \nthan 64 sq. ft. in area. (Elderly housing developments that \nare assisted living developments need not comply with this \nrequirement. Independent retirement housing shall comply \nwith this requirement.)\na.\t Each unit’s private open space must be able to fit a 5-ft. \nby 6-ft. rectangle inside of it (Balconies that do not meet \nthe dimensional requirements, such as Juliet balconies, \nare allowed but do not count toward the minimum private \nopen space standard).\nb.\t Each private open space must be screened or otherwise \ndesigned to provide privacy from adjacent units.\nc.\t Required outdoor private space may be located at the \nprimary entrance for ground level units. Where this is the \ncase, the outdoor private space shall not be screened. \nd.\t All or a portion of the required square footage of outdoor \nprivate spaces may be added into the required shared \nopen spaces as long as the total outdoor areas provided \nmeet the combined minimum size requirements.\nS7.\t Shared Open Space shall be provided for developments \ncontaining four or more units.\n\t\nFor sites under 20,000 sq. ft. in gross site area, a minimum of 4 \npercent of the gross site area but not less than 500 sq. ft. shall \nbe shared open space. \n\t\nFor sites 20,000 sq. ft. and above in gross site area, a minimum \nof 4 percent of the gross site area but not less than 1,000 sq. \nft. shall be shared open space. \na.\t A shared open space may be any of the following: \nrecreational facilities such as tennis, racquetball, and \nbasketball courts; recreation building (not including office \nspace); swimming pools and spas; gathering spaces such \nas courtyards, roof decks, gazebos, picnic, and barbecue \nareas; gardens; preserved natural areas; lawns; dual use \nareas (such as a basketball court that doubles as a loading \nspace); children’s play areas; and other recreational \nfacilities as approved by the Manager or Design \nCommission. \nb.\t The minimum dimensions for any shared open space shall \nbe 20 ft. in length and in width. \nc.\t The shared open space may not be within any buffer \nor yard setback area unless the open space includes \npreserved natural areas.\nDesign Guidelines\nMultifamily \nG6.\t Adequate private open space shall \nbe provided for the residents of \nmultifamily residential units to provide \nfor outdoor recreation, entertainment, \nscenic amenity, or exterior space for \npeople to gather.\na.\t Each private open space shall be \nof sufficient size and dimensions \nto provide usable, private, or semi-\nprivate outdoor space.\nG7.\t Adequate, usable shared open space \nshall be provided for multifamily \ndevelopments which creates a place \nfor residents to gather for recreation, \nentertainment, or enjoyment of a high \nquality outdoor space. A mechanism \nshall be established that provides for \nthe continued maintenance of the \nshared space.\na.\t Shared open space shall be of \nsufficient size and dimensions \nto provide usable space which \nencourages social interaction \namong users.\nb.\t Shared open space may be active \nor passive spaces.\n5.\t Open Spaces, Continued\nFig. A.5.S7.a: Roof deck serves as a shared open \nspace.\nFig. A.5.S6: Balconies provide private open spaces.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 51,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 51\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nMultifamily, Continued\nG8.\t Children’s play areas shall be designed \nto promote safety, creative play, and \nexercise and shall be adequate for the \nnumber of units in the development.\na.\t Play areas shall be conveniently \nlocated where they are accessible \nand visible from numerous units, \nand to avoid negative impacts on \nneighboring properties.\nb.\t The design of play areas shall \npromote safety of outdoor \ncommon areas by ensuring \nthey are clearly visible from a \nsufficient number of adjoining \nunits to provide opportunities for \nsurveillance. \nG9.\t The 4.1250(A)(5)(S9) standard shall be \nmet.\nDesign Standards\nMultifamily, Continued\nS8.\t Children’s Play Area. A minimum of 50 percent of the \nminimum required shared open space shall be a children’s play \narea. (Elderly Housing developments and Residential Facilities \nneed not comply with the children’s play area requirement \nbut shall provide the specified shared open space in Section \n4.1250(A)(5)(S7)). \na.\t For sites with a gross site area of 20,000 sq. ft. and greater, \nthe play area shall be a minimum size of 500 sq. ft. with \nminimum dimensions of 20 ft. in length and in width. \nFor sites with a gross site area of under 20,000 sq. ft., the \nchildren’s play area shall be a minimum of 250 sq. ft. in \nsize with minimum dimensions of 12 ft. in length and in \nwidth.\nb.\t The children’s play area shall have a minimum of three \ntypes of play equipment such as slides, swings, towers, \njungle gyms, and other natural play elements as approved \nby the Manager or Design Commission. A Landscape \nArchitect or a playground recreation expert shall design \nthe children’s play area, including selection of the play \nequipment to ensure that the equipment is compatible, \nfun, and promotes some form of exercise or movement.\nc.\t The children’s play area shall be centrally located where it \nis visible from 50 percent of the abutting units that front \nthe space. Children’s play areas shall be outside of the \nrequired yard setbacks and buffer areas.\nd.\t The children’s play area(s) shall be enclosed by any or a \ncombination of any of the following: a 2.5-ft. to 3-ft. high \nwall, planter, decorative fence; or by 18-in. high benches \nor seats; or by other means acceptable to the Manager or \nDesign Commission.\nS9.\t The Manager or Design Commission may require that \ndeed restrictions be recorded to ensure that where project \namenities such as swimming pools, community centers, and \nshared open spaces are on separate parcels within the same \ndevelopment, all residents of the development will have on-\ngoing access to those amenities and facilities.\n5.\t Open Spaces, Continued\nFig. A.5.S8: Centrally located children’s play area.\nFig. A.5.S7.c (right): Patio shared open space.\nFig. A.5.S7.b: Passive shared open space incorporates \nwater feature.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 52,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 52\n(06/22)\nDesign Standards\nMultifamily, Continued\nS10.\tAll common areas and streets shall be visible from 50 percent \nof the units that face it. Common areas include but are not \nlimited to shared open spaces; laundry rooms; recreation, \npool, and similar common facilities; children’s play areas; \nwalkways; and parking areas. A unit meets this criterion \nwhen at least one window of a frequently used room such as \na kitchen, living room and dining room, but not bedroom or \nbathroom, faces the common area. \nTownhouse\nS11.\tOutdoor Private Space: Each unit shall include its own private \noutdoor space so as to maintain a feeling of livability and to \nnot encourage crowding.\na.\t Each townhouse unit shall have an attached private open \nspace area located at the rear of the unit of at least 120 \nsq. ft. in size. The area shall be enclosed, screened, or \notherwise designed to provide privacy with elements such \nas 6 ft. high sight-obscuring fencing, building offsets, and/\nor vegetative screening. The combined total area of a deck \nor balcony and patio/rear yard area may be used to obtain \nthe required private area square footage.\ni.\t\nWhere it is not possible to locate the private open \nspace entirely at the rear of the unit, a private open \nspace may be located on the front facade in the form \nof an upper story balcony and the square footage will \ncount toward the 120 sq. ft. requirement. \nb.\t No dimension of a private open space area shall be less \nthan 6 ft.\nc.\t If a private open space (in a front, rear or side yard) is \nadjacent to common or public open space, parking, or \na property line at the perimeter of the development, \nprovide a visual separation, exclusive of pedestrian \nconnections, consisting of at minimum a 3-ft. high fence, \nwall, or continuous landscaping capable of growing to \na 3-ft. height between the private open space and the \nadjacent element.\nS12.\tShared Open Space: Townhouse developments of 20 or \nmore units (including elderly housing) shall comply with the \nfollowing:\na.\t Provide one or more common open spaces with \na minimum combined total area of 800 sq. ft. For \ndevelopments of more than 20 units, add an additional \n200 sq.ft. of open space for every additional 10 units. For \nphased developments, open space requirements shall be \nmet per phase.\nb.\t No common open space area is to be less than 400 sq. ft. \nin area nor have dimensions less than 12 ft. in length and \nin width.\n\t\nContinued on following page\nDesign Guidelines\nMultifamily, Continued\nG10.\tThe design of developments shall \npromote safety of common areas by \nensuring they are clearly visible from a \nsufficient number of adjoining units to \nprovide opportunities for surveillance.\nTownhouse\nG11.\tAdequate private open space shall be \nprovided at each unit to provide for \noutdoor recreation, entertainment, \nscenic amenity, or exterior space for \npeople to gather.\na.\t Each private open space shall be \nof sufficient size and dimensions \nto provide usable, private, or semi-\nprivate outdoor space. \n\n\n\nG12.\tAdequate, usable shared open space \nshall be provided for developments \nthat provide a place for residents to \ngather for recreation, entertainment, \nor enjoyment of a high quality \noutdoor space. A mechanism shall \nbe established that provides for the \ncontinued maintenance of the shared \nspace.\na.\t Shared open space shall be of \nsufficient size and dimensions \nto provide usable space which \nencourages social interaction \namong users. \n5.\t Open Spaces, Continued\nFig. A.5.S11: Rear patio serves as private open space.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 53,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 53\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nTownhouse, Continued\nG13.\tChildren’s play areas shall be designed \nto promote safety, creative play and \nexercise and shall be adequate for the \nnumber of units in the development. \nThe design of play areas shall promote \nsafety of outdoor common areas by \nensuring they are clearly visible from a \nsufficient number of adjoining units to \nprovide opportunities for surveillance.\na.\t Play areas shall be conveniently \nlocated where they are accessible \nfrom numerous units, and to avoid \nnegative impacts on neighboring \nproperties. \nDesign Standards\nTownhouse, Continued\nS12. Continued\nc.\t Up to 40 percent of the common open space area may \nbe hard surfaced (preferably pervious), improved and \ndedicated for a specific use (barbecue areas, tennis court, \nrecreation building, community garden, playground, \npool, etc.), subject to approval by the Manager or Design \nCommission.\nd.\t Required open space area landscaping shall include lawn, \ngroundcover, shrubs and trees. Landscaping shall meet \napplicable requirements in Section 4.1250(A)(6).\ne.\t Homeowners associations, site management offices, or \nother acceptable means shall be established for purposes \nof maintaining all common areas. An ongoing financial \nmechanism and oversight functions to provide for \nmaintenance shall be established prior to occupancy of \nany unit.\nS13.\tChildren’s Play Area. Children’s play areas shall be provided for \ndevelopments of 20 or more units except if the development is \nElderly Housing or a Residential Facility. Play areas shall:\na.\t A minimum of 40 percent of the minimum required shared \nopen space shall be a children’s play area. \ni.\t\nFor developments with 30 or fewer units, the \nchildren’s play area shall have minimum dimensions of \n12 ft. in length and in width.\nii.\t For developments with greater than 30 units, the \nchildren’s play area shall have minimum dimensions of \n20 ft. in length and in width.\nb.\t The children’s play area shall be centrally located and \nvisible from a minimum of 2 dwelling units or 50 percent \nof the units abutting or fronting the space, whichever is \ngreater. \nc.\t Children’s play areas shall be outside of the required yard \nsetbacks and buffer areas.\nd.\t The children’s play area shall have a minimum of three \ntypes of play equipment such as slides, swings, towers, \njungle gyms and other natural play elements as approved \nby the Manager or Design Commission. A Landscape \nArchitect or a playground recreation expert shall design \nthe children’s play area, including selection of the play \nequipment to ensure that the equipment is compatible, \nfun and promotes some form of exercise or movement.\ne.\t The children’s play area(s) shall be enclosed by any or a \ncombination of any of the following: a 2.5-ft. to 3-ft. high \nwall, planter, decorative fence; or by 18-in. high benches \nor seats; or by other means acceptable to the Manager or \nDesign Commission.\n5.\t Open Spaces, Continued\nFig. A.5.S13: Children’s play area is centrally located \nand visible from a large number of surrounding units.\nFig. A.5.S12: Central lawn with garden beds and patio \nserves as shared open space.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 54,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 54\n(06/22)\n6.\t Landscaping\nIntent:\t To integrate landscaping into open spaces, parking areas, \nand general site design to contribute to an attractive and \nsustainable development that enhances the overall character \nof the area and the natural environment by reducing water \nuse, minimizing pollution and maximizing the project’s \npositive effects on the built and natural environment. \nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nF.\t Integrate Public Amenities and Green Spaces\n\t\n\t\nG.\t Utilize Sustainable Development Practices\n\t\n\t\nI.\t\nDesign at a Human Scale\nDesign Guidelines\n\t\nAll Development\nG1.\t Licensed Design Professional. The \nlandscape plan shall be created by a \nlicensed design professional such as \na Landscape Architect, Architect, or \nCivil Engineer. The landscape plan shall \nexhibit the following characteristics:\na.\t The overall design of the site \nand the design of the proposed \nlandscape materials shall achieve \nunique, attractive, and significant \nlandscaping on the site as a whole;\nb.\t The proper type, spacing, height, \nplacement, and location of plant \nmaterials shall be provided to \nensure that the intent of this \nordinance is met;\nc.\t The choice and selection of plant \nmaterials shall insure that root \nsystems will not interfere with \npublic utilities and so that fruit \nand other debris, except leaves, \nwill not constitute a nuisance \nwithin public rights-of-way or to \nabutting property owners;\nd.\t The choice and selection of plant \nmaterials shall insure that the type \nof plantings selected will be of a \ntype that will survive and thrive in \nthe area in which they are to be \nlocated; and\ne.\t The proper relationship between \ndeciduous and evergreen \nplant materials shall exist so \nas to ensure that the desired \nlandscaping and buffering effects \nwill be accomplished.\nDesign Standards\nAll Development\nS1.\t A professional licensed Landscape Architect shall complete and \nstamp the landscape plan for the development.\nFig. A.6.S6: Drought resistant landscaping used to reduce irrigation water use.\nFig. A.6: Landscaping used to frame courtyard entry.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 55,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 55\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards\nAll Development, Continued\nS2.\t All areas of the lot not occupied by structures or paved areas \nshall be landscaped in an attractive and functional manner. \nS3.\t All landscaped areas shall be irrigated with an in-ground \nirrigation system, unless a licensed landscape architect submits \nwritten verification that the proposed planting materials do \nnot require irrigation. \nS4.\t All landscaping shall be planted at sizes no less than the \nfollowing (measurements shall be taken based on the \nAmerican Standard for Nursery Stock ANSI standards):\na.\t Deciduous canopy trees shall be a minimum of 2.5 in. \ncaliper size and shall be balled and burlapped;\nb.\t Deciduous ornamental trees shall be a minimum of 2.0 in. \ncaliper size and shall be balled and burlapped;\nc.\t Evergreen trees shall be a minimum of 6 ft. in height and \nshall be balled and burlapped;\nd.\t Evergreen and deciduous shrubs, with the exception of \ndwarf shrubs such as boxwood, must be a minimum of 24 \nin. high from finished grade and a minimum of 1 gallon \nsize;\ne.\t Ferns shall be a minimum of 16 in. high from finished \ngrade and 1 gallon size;\nf.\t\nPerennials shall be a minimum of 1 gallon size; and\ng.\t Ground covers shall be well rooted in either flats or a \nminimum of 1 gallon pots.\nS5.\t Landscaping shall provide visual interest by including plantings \nwith:\na.\t Variety in color and seasonal color; and\nb.\t A wide variety in scale, such as including a mix of canopy \ntrees, ornamental trees, shrubs, perennial grasses, \ngroundcovers, and annuals.\nS6.\t A minimum of 20 percent of landscape plantings shall be \ndrought-resistant species.\nS7.\t New development shall retain healthy, regulated trees of 8 in. \nor greater, or replace them at a ratio of three new trees for \nevery one healthy, existing regulated tree removed. Regulated \ntrees must be healthy as determined by a consulting arborist, \na qualified arborist, or a registered consulting arborist.\nDesign Guidelines\nAll Development, Continued\nG2.\t Sufficient landscape shall be provided \nto contribute to an attractive, green, \nand sustainable development.\nG3.\t The 4.1250(A)(6)(S3) standard shall be \nmet.\nG4.\t Plant sizes shall provide a more \nmature appearance at installation. \nThe 4.1250(A)(6)(S4) standard shall be \nmet.\nG5.\t The 4.1250(A)(6)(S5) standard shall be \nmet.\nG6.\t Drought resistant landscaping shall \nbe incorporated into the landscape \ndesign in a manner that contributes \nto a reduction in the irrigation water \nneeded.\nG7.\t New development shall preserve \nmature trees and other environmental \nfeatures of the site. The 4.1250(A)(6)\n(S7) standard shall be met.\n6.\t Landscaping, Continued\nFig. A.6.S4: Shrub sizes providing a more mature \nappearance at time of planting.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 56,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 56\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG8.\t The landscape plan shall provide \nsufficient vegetation, including trees \nthroughout the interior of the site, to \ncreate an attractive site. Plants need \nto be secure upon installation to avoid \ntoppling and damage from strong \nwinds.\nG9.\t Hardscapes shall be shaded as a \nmeans of reducing energy costs (heat \nisland effect), improving stormwater \nmanagement, and improving the \noverall aesthetic quality of the built \nenvironment.\nG10.\tNatural colored mulch shall be \nprovided as a supplemental element \nof the overall landscape planting \ndesign to help insulate the plant \nmaterials and retain moisture.\nG11.\tRecycled materials shall be used in all \nhardscapes.\nDesign Standards\nAll Development, Continued\nS8.\t Site trees are required at a rate of one tree per 3,000 sq. ft. \nof gross site area. Yard and parking lot tree requirements may \ncount toward the site tree requirement.\na.\t Site trees must be capable of a mature height and width \nof 25 ft. Ornamental, dwarf, columnar, and other similar \nspecies may be permitted where larger sized trees are \nnot appropriate as determined by the Manager or Design \nCommission.\nb.\t Existing regulated major trees may be counted as two \nrequired site trees. Existing trees to be counted toward \nthis requirement must be confirmed to be healthy as \ndetermined by a consulting arborist, a qualified arborist, \nor a registered consulting arborist.\nc.\t New site trees shall be distributed throughout the project \nrather than clumping them in one location.\nd.\t New trees shall be supported (by use of stakes, wire, or \nsimilar material) for at least one year to prevent damage \nby strong winds.\nS9.\t After 5 years, a minimum of 30 percent of hardscaped areas \non site shall be shaded. Determination shall be based upon \nexpected growth of the selected trees and calculated at noon \non the summer solstice. Hardscape shading from buildings \nmay be counted toward the total shading requirement.\nS10.\tArtificially colored mulches are prohibited. Natural colored \nmulches such as shredded hardwood bark, oyster shells, \nstones, and bark chip mulches are allowed as filler until \nrequired groundcovers and shrub materials mature and \nspread. Mulches are not permitted as a substitute for living \nplant materials.\nS11.\tProvide a minimum of 20 percent recycled content pavement \nor pavement base, such as concrete grindings for base \nmaterials or blast furnace slag additives or asphalt with glass, \nfor all hardscape elements such as private drives, sidewalks, \npaths, parking areas and courtyards.\n6.\t Landscaping, Continued\nFig A.6.S9: Hardscape shading provided by maturing trees.\nFig A.6.S8: Existing regulated major trees may count \ntowards required site trees.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 57,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 57\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG12.\tLandscape practices and strategies \nthat reduce wasteful water practices \nand enhance site sustainability shall \nbe included in all developments in a \ncreative way. Drainage improvements \nshould be designed as natural \nlandscape features to the greatest \nextent practical.\nG13.\tSite furnishings or some of the visible \nsite elements shall be constructed \nwith sustainable materials.\nDesign Standards\nAll Development, Continued\nS12.\tSustainable site design and water conservation and treatment \nshall be promoted through a minimum of two of the following:\na.\t The irrigation system shall minimize water usage by \nincorporating at least one (1) of the following:\ni.\t\nA rain sensor to prevent watering during a rain event;\nii.\t Rotor irrigation heads; or\niii.\t A drip irrigation system.\nb.\t On-site rain gardens and stormwater facilities shall \nbe incorporated and designed in accordance with \nGresham Green Development Practices for Stormwater \nManagement.\nc.\t Art elements, fountains, or other features that use \nrainwater to activate public spaces.\nd.\t A system that collects rainwater from a minimum of 50 \npercent of the total roof area for reuse (i.e. site irrigation \nor grey water re-use).\ne.\t Permeable paving over at least 40 percent of all paved \nsurfaces.\nf.\t\nPreserve all Habitat Conservation Area (HCA) on-site, \nminimum one quarter (1/4) acre.\ng.\t At least 20 percent of trees, 20 percent of shrubs, and 20 \npercent of groundcover plants shall be food-producing \nperennial species, such as named varietals of cherries, \napples, hazelnuts, blueberries, strawberries, etc. \nParking lot and street trees shall be selected from the \nRecommended Parking Lot and Street Tree lists.\nh.\t Other Low Impact Development (LID) features that capture \nand filter runoff into the ground as approved by the \nManager or Design Commission.\nS13.\tSite furnishings such as play structures, fences, gazebos, trash \nreceptacles, benches, and tables shall be constructed with \n20 percent sustainably harvested materials, such as Forestry \nStewardship Council (FSC)-certified wood and recycled content \nmaterials, excluding plastics. The intent of this standard can \nalso be achieved through the use of locally sourced materials, \noriginating within 500 miles of the site.\n6.\t Landscaping, Continued\nFig A.6.S12.g: Many species of creeping raspberries \n(such as the Rubus pentalobus) create dense \ngroundcover, are drought resistant and shade tolerant, \nand can handle light to medium foot traffic. \nFig A.6.S12.a: On-site rain garden manages \nstormwater.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 58,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 58\n(05/18)\nDesign Standards\nAll Development, Continued\nS14.\tParking Area Landscaping: All Areas\na.\t The minimum percentage of parking area landscaping \nshall be 15 percent of the total hardscape parking area, \nincluding driveways and aisles.\ni.\t\nLandscaped areas counting toward this requirement \nshall include parking area perimeter buffers, \nlandscaped islands or rows, major landscape divisions, \nlandscaping on internal public streets or primary \ninternal drives, and all other landscaped areas that are \nlocated within 10 ft. of parking modules or stalls.\nii.\t A minimum of seventy percent (70%) of all parking \nlandscaped areas shall be covered with trees, shrubs, \nand continuous ground cover (lawn, low evergreen \nshrubs or evergreen ground cover). Landscaped areas \nwhich include stormwater infiltration areas shall utilize \nappropriate plant materials.\nb.\t A minimum of one parking lot tree shall be planted for \nevery six parking stalls in the parking area. Required \ntrees in the parking area shall be selected from the City’s \nRecommended Parking Lot Tree list.\nc.\t All parking area landscaping shall be designed to ensure \nvehicles do not make contact with plant materials, utilizing \noverhang distances no less than 2 ft. when abutting shrubs \nor 3 ft. when abutting trees. Wheel stops may be used in \nplace of overhang distances.\nd.\t Parking area entries shall include a landscaped strip \nwith parking lot trees at spacing no greater than 30 ft. \nOrnamental, dwarf, columnar, and other similar species \nmay be permitted where larger sized trees are not \nappropriate as determined by the Manager or Design \nCommission. Amenity zone plantings on primary internal \ndrives shall count toward this requirement, if present. \ne.\t Evergreen ground cover shall cover planting areas not \ncovered by tree trunks or shrubs or utilized for stormwater \ninfiltration.\nDesign Guidelines\nAll Development, Continued\nG14.\tParking Area Landscaping: All Areas\na.\t Parking areas shall include \nlandscaping of sufficient quantity \nand size in order to minimize \nthe visual impact of the parking \narea, provide opportunities for \nstormwater management, and \nreduce the heat island effect of \nthe area.\nb.\t Canopy Tree Quantity and Size. \nThe standard of Section 4.1250(A)\n(6)(S14)(b) shall be met.\nc.\t Plant materials shall be protected \nfrom damage by vehicles.\nd.\t Additional landscaping, including \ntrees, shall be provided at the \nparking area entries, enhancing \nthe appearance of highly visible \nareas.\ne.\t Landscaping materials used should \nbe sufficient to cover planting \nareas year-round.\n6.\t Landscaping, Continued\nFig. A.6.S14.a: Parking lot landscaping area minimizes \nvisual impact of parking from walkway.\nFig. A.6.S14.b: Parking lot entry landscaping includes pedestrian amenities at the \nstreet.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 59,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 59\n4.1250 Design Guidelines and Standards\nA. Site Design\n(01/19)\nDesign Guidelines\nAll Development, Continued\nG15.\tParking Area Perimeter Screening: \nParking areas shall be buffered from \nstreets, primary internal drives, \nand public trails and paths with \nlandscaping that provides definition to \npedestrian areas and screens parking.\na.\t The dimension of the parking lot \nlandscape buffer shall be adequate \nto screen the parking and mitigate \nits visual impact from the street, \nprimary internal drive, or public \ntrail.\nb.\t Perimeter screening shall be \nlayered to provide visual interest, \ndefinition of pedestrian areas, and \nscreening at various heights.\nc.\t Small breaks in the screening shall \nbe provided to allow pedestrian \naccess between the parking area \nand the sidewalk.\nd.\t Clear Vision. Section 4.1250(A)(6)\n(S15)(d) shall be met.\ne.\t Pedestrian connections shall be \nprovided between the parking \narea and adjacent streets, primary \ninternal drives, and public paths.\nDesign Standards\nAll Development, Continued\nS15.\tParking Area Landscaping: Perimeter Screening. \na.\t When located adjacent to a public street, primary internal \ndrive, or public trail or path, the parking area shall be \nbuffered by a landscaped edge no less than 10 ft. in width \nconsisting of trees, shrubs, decorative fencing or walls, \nand ground level plantings in a layered configuration (Fig. \nA.6.S15.b and c). When located adjacent to a primary \ninternal drive or internal public street created as part of \nthe development, the landscaped edge may be reduced to \n6 ft., if space limitations prohibit a wider parking buffer as \ndetermined by the Manager or Design Commission.\nb.\t The landscaped edge shall consist of ground level planting \nbeds adjacent to the sidewalk, trees planted at roughly \n30 ft. spacing, and a continuous shrub or site-obscuring \ndecorative fence or garden wall. Walls and fences shall be \nbuilt to a height of 36 in. and shrubs shall be maintained at \nthis height to allow surveillance of the parking area. \nc.\t Provide breaks in perimeter shrubs, fence, or wall at a \nminimum of every 30 ft. to allow for visual access. Breaks \nshall not exceed 3 ft. in width except where pedestrian \naccess is provided. \nd.\t Perimeter parking landscaping shall allow clear vision into \nthe parking area between the heights of 3 and 6 ft. to \nallow for surveillance. \ne.\t Where landscaped islands abut the parking perimeter \nscreening, a break in the shrubs, fence or wall shall \noccur and provisions for pedestrian connections shall \nbe provided, at the discretion of the Manager or Design \nCommission.\n6.\t Landscaping, Continued\nFig. A.6.S15.b: Parking lot landscaping \nscreen with continuous shrubs.\nFig. A.6.S15.c: Parking lot landscaping \nscreen with decorative fence and low \nlandscaping.\nFig. A.6.S15.a: Parking lot landscaping screen with \ndecorative fence and low landscaping.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 60,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 60\n(06/22)\nDesign Standards\nAll Development, Continued\nS16.\tParking Area Landscaping: Internal\na.\t Internal parking landscaping, including landscape rows and \nislands, shall divide the parking area into clusters of stalls \nnot to exceed fifty spaces.\nb.\t Developments shall utilize a series of landscaped islands \nand/or landscaped rows between parking modules.\ni.\t\nLandscaped rows shall be present between parking \nmodules and have a width not less than 6 ft. Trees \nshall be planted on rows at spacing no greater than 30 \nft. Row-end islands shall be required with this option; \nor,\nii.\t Internal landscaped islands shall be present within the \nparking area at the end of parking rows and locations \nalong the length of the rows with an average spacing \nno greater than one landscaped island every twelve \nspaces. Additional islands may be required to meet the \nparking area landscape standards.\na.\t Landscaped islands shall be planted with a \nminimum of one tree and may be designed to \nfunction as stormwater infiltration areas. Trees \nshall have a minimum clear trunk height of 9 ft. at \nmaturity. \nb.\t Internal landscaped islands shall have a width \nof no less than 9 ft. and have a minimum length \nequal to that of adjacent parking stalls less 1 ft.\nc.\t Minor landscaped islands may be placed between \nrequired landscaped islands to increase canopy \ncoverage and landscaping within the parking area. \nEach minor landscaped island shall include one \nplanted tree and be no less than 6 ft. on each side, \nand may be rotated to integrate with compact \nparking stalls.\nDesign Guidelines\nAll Development, Continued\nG16.\tParking Area Landscaping: Internal\na.\t Clusters of Stalls: Section \n4.1250(A)(6)(S16)(a) shall be met.\nb.\t Within parking areas, landscaped \nrows or islands shall be present in \nparking areas at sizes which foster \nhealthy tree growth and create \nopportunities for stormwater \ninfiltration. Spacing of landscaped \nfeatures shall be sufficient to \nvisually divide the space and \nshade pavement. Landscaped \nislands that terminate a row of \nparking shall provide definition to \nthe parking area.\ni.\t\nLandscaped islands and rows \nshall contain appropriate \nground-level planting \nmaterials.\nii.\t Landscaped Island \nDimensions. Sections \n4.1250(A)(6)(S16)(b)(ii)(b) and \n(c) shall be met.\n6.\t Landscaping, Continued\nFig. A.6.S16.b: Internal parking lot landscaping incorporating green development \npractices.\nFig. A.6.S16.a: Wide landscape island planted with \ntrees, shrubs, groundcovers, and grasses.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 61,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 61\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG17.\tLandscape Maintenance: The \n4.1250(A)(6)(S17) standard shall be \nmet.\nDesign Standards\nAll Development, Continued\nS17.\tLandscape Maintenance. Compliance with the following \ncriteria is required:\na.\t Inspections. A City representative will perform a final \nlandscape inspection to ensure that the landscaping \ndemonstrates equivalent compliance with the approved \nlandscape plan upon completion of the project and before \nissuance of a Temporary or Final Certificate of Occupancy, \nfollowing a request from the developer. The inspection \ntime period is from March 1 to November 15. If an \ninspection is requested between November 16 and the \nlast day of February and the landscaping is not complete, \nor if the applicant requests a Temporary Certificate of \nOccupancy to occupy one or more buildings on site prior \nto the landscaping being completed, a financial guarantee \nshall be provided. This will be based on 110 percent of \nthe estimated cost of plant materials and labor for the \ntotal landscape plan as indicated in a landscape cost \nestimate. Beginning March 1, the Applicant has 180 days \nto complete the items or the City will cash in the amount \nbeing held and finish the landscape job.\nb.\t Establishment Period. The establishment period for the \nplant material guarantee will begin at the Final Certificate \nof Occupancy inspection approval and extend to two years \nfrom that date. All plantings shall be properly planted as \nto be in a healthy, growing condition at commencement of \nthe establishment period. At the end of the establishment \nperiod, any plantings that are 20 percent dead or greater \nshall be replaced.\n\t\nContinued on following page\n6.\t Landscaping, Continued\nFig. A.6.S17.b: Landscape is healthy and well maintained.\nFig. A.6.S17.a: Landscaping in street-front planters  is \nhealthy and well maintained.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 62,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 62\n(06/22)\nDesign Standards\nAll Development, Continued\nS17. Continued\nc.\t Maintenance:\ni.\t\nMaintenance of required plantings by the owner shall \nbe carried out so as to present a healthy, neat, and \norderly appearance, free from refuse and debris.\nii.\t To insure proper maintenance, and as a condition \nof Final Site Plan approval, the property owner shall \nenter into and record with the City a Landscape \nMaintenance Agreement, or include such provisions \nas part of the developer’s agreement or deed, each \nof which shall be approved by the City Attorney. \nSuch instrument shall identify the minimum plan \nof maintenance, the person or entity responsible \nfor maintenance, and shall provide the procedure, \nauthority and finance for City cure of breaches by the \nresponsible entity. Such instrument shall also include:\na.\t Provisions that all unhealthy and dead material \nshall be replaced within one year, or the next \nappropriate planting period, whichever occurs \nfirst;\nb.\t All landscaped areas shall be provided with an \nautomatic and operating irrigation system;\nc.\t Tree stakes, guy wires, and tree wrap are to be \nremoved after one winter season; and\nd.\t Plantings shall be guaranteed for two years after \nthe Final Certificate of Occupancy inspection \napproval.\niii.\t Responsibility and Certificates of Occupancy. The \nowner of the property, subject to the requirements \nof this Section, shall be responsible for installing \nand maintaining landscaping per the approved final \nlandscape plan as specified in this Section.\nCommercial, Industrial, and Institutional\nS18.\tA minimum of 15 percent of the gross site area shall be \nlandscaped.\na.\t Up to 15 percent of the required landscape area can be \npaved walks, pedestrian plazas, etc.\nDesign Guidelines\nCommercial, Industrial, and Institutional\nG18.\tMinimum Landscape Area. Sufficient \nlandscape shall be provided to \ncontribute to an attractive, green, and \nsustainable development.\n6.\t Landscaping, Continued\nFig. A.6.S20: Street-facing front yard is highly \nlandscaped.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 63,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 63\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Standards\nMultifamily and Townhouse\nS19.\tA minimum of 20 percent of the gross site area shall be \nlandscaped. For townhouse, a minimum of 20 percent of the \ngross site area for each lot shall be landscaped.\na.\t Up to 5 percent of the required landscape area can be \npaved walks, pedestrian plazas, patios, etc.\nS20.\tIn front of all ground floor units, a minimum of 60 percent of \nthe street-facing front yard shall be landscaped.\nS21.\tAll yard setbacks shall be landscaped and shall have at least 5 \ndeciduous shade trees per 100 lineal feet. \na.\t Yard trees shall be capable of at least 25 ft. in height and \nspread at maturity and be not less than 10 ft. in height \nand 2.5 in. in caliper size at the time of planting. Where \nsetbacks and yard areas are less than 10 ft. wide columnar \nspecies with a minimum mature height of 25 ft. may be \nused. \nb.\t New evergreen trees may substitute for the required \ndeciduous shade trees on a one-for-one basis, provided \nthe trees are capable of at least 25 ft. in height and are at \nleast 8 ft. in height at the time of planting. \nc.\t Existing regulated major trees may be counted on a two \ntrees provided for one tree required basis. Existing trees \nto be counted toward this requirement must be confirmed \nby either a Consulting Arborist, Qualified Arborist, or a \nRegistered Consulting Arborist to be healthy trees. \nS22.\tOne deciduous canopy tree shall be placed roughly every 35 \nlineal feet along interior drives. In case of overhead utility \nlines, lower growing sub-canopy trees can be substituted \nfor deciduous canopy trees. Trees shall be selected from the \nRecommended Street Tree list.\nTownhouse and Townhouse Style\nS23.\tLandscaping shall be utilized in the space between driveways \nto separate dwelling units to reduce impervious surfaces. \nDesign Guidelines \nMultifamily and Townhouse\nG19.\tMinimum Landscape Area. Sufficient \nlandscape shall be provided to \ncontribute to an attractive, green, and \nsustainable development.\nG20.\tGround Floor Units. The street-facing \nfront yard shall be predominantly \nlandscaped.\nG21.\tSetback Landscape Trees. The \nlandscape plan shall provide sufficient \nvegetation including trees in the \nsetback areas to create an attractive \nsite and to buffer residential uses.\nG22.\tInterior Drive Trees. The landscape \nplan shall provide trees along interior \ndrives in order to reduce heat gain and \nprovide an attractive drive and walk \nexperience.\nTownhouse and Townhouse Style\nG23.\tLandscaping or other treatments \nbetween driveways shall be utilized to \nbreak up continuous pavement and \nprovide rainwater infiltration.\n6.\t Landscaping, Continued\nFig. A.6.S19 (right): Up to 5 percent of the required \nlandscape area may be paved walks or plazas.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 64,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nA. Site Design\n[4.1200] - 64\n(06/22)\n7.\t Site Lighting\nIntent: To create a safe and attractive environment by incorporating \nlighting as an attractive visual site design element.\nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nB.\t Support a Mixed-use Community\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nH.\t Promote High Quality Design\n\t\n\t\nI.\t\nDesign at a Human Scale\nDesign Guidelines:\nAll Development\nG1.\t The site shall be designed to achieve \nuniform illumination levels with a \nminimum glare to adjacent properties \nin order to create a comfortable and \nsafe environment in harmony with the \ncharacter of the surrounding area.\na.\t Lighting fixtures shall provide \nappropriate illumination levels \nfor all areas of the site, creating \ninviting spaces, and enhancing the \nsafety of the site during the hours \nof darkness.\nb.\t Lighting fixtures shall not create \nnegative impacts on surrounding \nproperties or unnecessary glare \nwithin the site. \nDesign Standards\nAll Development\nS1.\t The following areas shall be illuminated during the hours \nof darkness: primary internal drives, parking areas, loading \nand unloading areas, open spaces, pedestrian walkways, and \nbuilding entries. \na.\t The illumination levels listed in Table 4.1250.A.7 shall act \nas minimum standards for all exterior lighting. \nb.\t Maximum average lighting will be governed by the six-\nto-one ratio (6:1) of maximum average to minimum \nillumination (per Table 4.1250.A.7) of the surface being lit. \nc.\t Maximum illumination at a property line adjacent to \na residential use shall not exceed 0.5 foot-candles. \nMaximum illumination at a property line adjacent to a \nnon-residential use shall not exceed 1.0 foot-candle. \nd.\t Average foot-candles shall be the average amount of \nlight at 3-ft. height above a surface as determined using \na photometric plan with one 1 ft. grid spot foot-candle \nreadings. The Manager or Design Commission may modify \nthese levels if such modifications are deemed necessary \nand appropriate for the use and surrounding area.\ne.\t No direct light source shall be visible at the property line.\nTable 4.1250.A.7: Site Illumination Values \nArea of Illumination\nIllumination Level (Foot-Candles)1\nPrimary Internal Drives\n1.0 minimum with an average of 3.5\nParking Areas\n0.5 minimum    \nLoading and Unloading Areas 0.5 minimum    \nOpen Spaces\n0.5 minimum with an average of 1.5\nWalkways\n0.5 minimum with an average of 1.5\nBuilding Entrances - Fre­\nquent Use\n1.0 minimum with an average of 3.5\nBuilding Entrances - Infre­\nquent Use\n1.0 minimum with an average of 2.0\nTable Notes:\n1See 4.1250(A)(7)(S1)(d)\nFig. A.7.a: Various types of lighting provide for \nnighttime illumination of the streetscape.\nFig. A.7.b: Pedestrian scaled bollard lighting is used to \nilluminate a shared open space.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 65,
      "text": "Civic Neighborhood \nPlan District Design Manual\nCity of Gresham Development Code\n[4.1200] - 65\n4.1250 Design Guidelines and Standards\nA. Site Design\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG2.\t Lighting fixtures shall not create \nunnecessary upward directed \nillumination which contributes to sky-\nglow.\nG3.\t Light fixtures shall reflect a pedestrian \nscale and be appropriately scaled for \ntheir use.\na.\t Fixtures shall be composed of \ndurable materials.\nDesign Standards\nAll Development, Continued\nS2.\t Developments shall use full cut-off lighting fixtures to avoid \noff-site lighting, night sky pollution, and shining lights into \nresidential units. \na.\t Fixtures shall have a cut-off angle of 90 degrees as \nmeasured perpendicular to the ground.\nb.\t The Manager or Design Commission may choose to \nwaive or alter cut-off requirements of this section when \nappropriate decorative fixtures are proposed (e.g. use of \ndecorative up-lighting to illuminate the underside of a \ncanopy or columns on a facade, where a canopy or roof \nprojection restricts the projection of the light into the \nnight sky, or bollards). \nS3.\t Light fixtures shall not exceed 25 ft. in height.\na.\t Weather- and vandalism-resistant covers shall protect \nlighting devices.\n7.\t Site Lighting, Continued\nFig. A.7.S2.a: Cut-off pole light used to illuminate an \ninternal pedestrian path and shared open space.\nFig. A.7.c: Various types of lighting provide for nighttime illumination of an outdoor \ndining area and streetscape.\nFig. A.7.S2.b: Pedestrian scaled shielded light fixture.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 66,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 66\n(06/22)\nDesign Guidelines\nAll Development Except Townhouse\nG1.\t Buildings shall be designed with \ndistinct volumes that create visual \ninterest, emphasize wall depth, and \nreflect a human scale within the built \nenvironment.\na.\t Buildings shall utilize massing \nstrategies which create depth \nand add interest to the facade. \nChanges in depth shall relate to \nbuilding design and be sufficient \nto provide surface relief, depth, \nshadows, and visual distinction \nbetween wall planes.\nb.\t Changes in building depth shall \nreinforce and create a consistent \nstreet wall that reflects the \npedestrian scale.\nDesign Standards\nAll Development Except Townhouse\nS1.\t Individual wall planes on street facing facades shall not exceed \n1,500 sq. ft. of wall area before a massing articulation of at \nleast 1 ft. in depth for a minimum of 6 ft. in length is provided. \na.\t Mass changes shall be integral to the building design such \nas those attributed to distinct building volumes, structure, \nfloor heights, or other facade and/or floor plan changes.\nb.\t Building masses shall frame and define streets and public \nspaces, establishing more prominence at these locations.\n1.\t Building Massing and Articulation\nFig. B.1: Building massing broken down to reflect a \nhuman scale.\nIntent: \tTo enhance and enliven wall planes with design strategies and \nbuilding proportions that add visual interest and reduce the \nvisual scale of buildings.\nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nB.\t Support a Mixed-use Community\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nH.\t Promote High Quality Design\n\t\n\t\nI.\t\nDesign at a Human Scale\nExisting Development: Renovations that modify the exterior building \nfacades and require a permit shall follow the appropriate \nStandards and Guidelines of this section at the discretion of \nthe Manager or Design Commission. Renovations which do \nnot change the existing exterior building facade are exempt \nfrom these standards.\nFig. B.1.S1.a: Articulated wall planes break down \nbuilding massing to reflect a human scale.\nFig. B.1.S1.b: Articulated wall planes break down building massing and frame the \nstreet.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 67,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 67\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\nDesign Standards\nAll Development Except Townhouse, Continued\nS2.\t Buildings greater than 4 stories in height shall provide an \nupper-floor articulation strategy or strategies on facades \nvisible from streets, primary internal drives, or pedestrian \npathways:\na.\t Buildings 5 to 6 stories tall shall provide at least one of the \nfollowing:\ni.\t\nCompletely recess the top one or two floors a \nminimum of 6 ft.\nii.\t Set back at least 50 percent of the top one or two \nfloors a minimum of 10 ft.\niii.\t Provide a minimum facade transparency of 50 percent \nor greater per floor on the top one or two floors.\niv.\t Establish a prominent roof line or significant variation \nin roof lines visible from the pedestrian level.\nv.\t No single wall plane shall be greater than 4 stories in \nheight before a horizontal step back or cantilever of at \nleast 2 ft. is provided.\nvi.\t Other strategy as determined by the Manager or \nDesign Commission.\nb.\t Buildings 7 stories and taller shall provide at least two of \nthe following:\ni.\t\nCompletely recess the top two floors a minimum of 10 \nft.\nii.\t Set back at least 50 percent of the top two floors for a \nminimum of 15 ft.\niii.\t Provide a change of materials above the pedestrian \nlevel at the top of the second or third floor.\niv.\t Provide a minimum transparency level on the top two \nfloors of 50 percent of the facade area for each floor.\nv.\t Provide projecting or receded facade treatments that \nestablish a horizontal datum at a consistent height \nlocated above the top of the second floor and below \nthe bottom of the upper two floors. The datum shall \nhave a minimum depth of 2 ft. across a minimum of 65 \npercent of the facade width.\nvi.\t No single wall plane shall be greater than 4 stories in \nheight before a horizontal step back or cantilever of at \nleast 2 ft. is provided.\nvii.\t Other strategy as determined by the Manager or \nDesign Commission.\nDesign Guidelines\nAll Development Except Townhouse, \nContinued\nG2.\t Buildings shall maintain a sense of \nhuman scale through the use of design \nstrategies that reduce the perceived \nmass of the upper levels. The greater \nthe building height, the greater \nnumber and/or intensity of design \nstrategies shall be used to minimize \nthe buildings scale.\n1.\t Building Massing and Articulation, Continued\nFig. B.1.S2.a: Individual wall plane height does not \nexceed 4 stories before horizontal articulation is \nprovided.\nFig. B.1.S2.b: High levels of transparency on the top \nfloor facade help minimize perceived building height.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 68,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 68\n(06/22)\nDesign Guidelines\nCommercial, Industrial, and Institutional\nG3.\t Commercial and institutional spaces \nshall have adequate first-floor heights \nto convey the existence of commercial \nor institutional space on the ground \nfloor and provide a comfortable, retail, \nservice, or working environment with \nopportunities for light to enter the \nspace from the street and sidewalk.\nG4.\t Buildings shall create a rhythm of \ndesign elements that help establish \ncontinuity in the facade. Articulating \nelements shall provide surface relief, \ndepth, and shadows to the facade by \nbeing recessed and/or projected.\nG5.\t Where used, colonnades shall be \nintegrated into the overall design \nof the building, featuring similar or \ncomplementary materials, articulation, \nand spacing of structural elements. \nWalkways beneath arcades shall be \nof sufficient width to accommodate \nanticipated pedestrian traffic, and of \nsufficient height to allow daylighting of \nthe walkway and facades behind it. \nDesign Standards\nCommercial, Industrial, and Institutional\nS3.\t Commercial and institutional ground-floor heights shall be \na minimum of 12 ft. from the top of the floor to the lowest \nstructural element of the ceiling. One-story buildings (or \nportions of buildings) shall have a front facade elevation of at \nleast 15 ft., including roof forms, for at least 60 percent of the \nfacade length.\nS4.\t Building walls shall be articulated with design features that \nadd visual interest and prevent the appearance of blank walls. \nFacades visible from streets, primary internal drives, public \nspaces, and parking areas shall utilize at least one of the \nfollowing strategies:\na.\t A pattern of wall recesses and/or projections that has a \nrelief of at least 12 in. (such as recessed structural bays \nor recessed window openings between columns). Wall \nrecessions and projections shall be at intervals of not \ngreater than 30 ft. on facades with customer entries and \nthose facing the street, and at intervals not greater than \n100 ft. on remaining facades; or \nb.\t Changes in wall plane with a depth of at least 24 in. which \nrespond to the building module. These changes in wall \nplane shall occur at intervals of not less than 25 ft. and not \nmore than 100 ft.\nS5.\t When used, colonnades shall have a minimum depth of 10 \nft. from the back of the curb to the building face. Colonnade \nceilings shall be at least 15 ft. tall to allow sufficient light into \nthe space under the colonnade. Buildings with colonnades \nmay exceed the maximum building setback to achieve the \nminimum colonnade depth as approved by the Manager or \nDesign Commission. The square footage under the colonnade \nmay count toward the building square footage in calculating \nwhether the project meets the minimum floor area ratio \nstandard.\n1.\t Building Massing and Articulation, Continued\nFig. B.1.S5: Colonnade with sufficient height to allow \nfor light to enter the space.\nFig. B.1.S4: Building walls articulated to provide visual interest.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 69,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 69\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\nDesign Standards\nMultifamily \nS6.\t Structures shall not have an overall horizontal distance \nexceeding 160 linear feet, measured from end wall to end wall, \nprior to a significant massing articulation. Articulations can \ninclude features such as a change in building form, a street \nfacing ground level courtyard or second floor terrace, and \nmassing changes at least 10 ft. in depth. \nMultifamily and Townhouse\nS7.\t Structures shall not include long, monotonous, uninterrupted \nwalls. Walls shall incorporate structural exterior wall offsets, \nprojections, and/or recesses as a means of reducing the scale \nand improving the appearance of the building. Exterior wall \noffsets shall reflect the living unit modules when individual \nunit entries face the street. A minimum of 1 ft. horizontal \nvariation shall be used at intervals of 50 ft. or less along the \nstructure’s primary facade on the ground floor. \nS8.\t Facades visible from streets and primary internal drives shall \nbe divided into wall planes that reflect living unit modules. \nWall planes over 750 sq. ft. shall be divided into distinct \nplanes. This can be achieved by:\na.\t Incorporating elements such as porches or decks into the \nwall plane; \nb.\t Recessing or projecting a portion of the building a \nminimum of 2 ft. over 6 ft. in width; or\nc.\t Another massing strategy as approved by the Manager or \nDesign Commission.\nS9.\t Blank, windowless walls are prohibited when facing a public \nstreet or primary internal drive unless required by the Building \nCode. Blank walls are discouraged in all other situations. \nWhere the construction of a blank wall is required and it \nexceeds 750 sq. ft., it shall be articulated.\nDesign Guidelines\nMultifamily\nG6.\t Building(s) that front the public realm \nshall avoid long, uninterrupted walls. \nMultifamily and Townhouse\nG7.\t Building shall be modulated to prevent \nlarge, uninterrupted monotonous \nwalls. Articulation reflecting a \nresidential scale should be provided \nalong the ground floor to visually \nbreak up the length of building walls \nfacing the street.\nG8.\t Changes in wall planes, layering, \nhorizontal datums, vertical datums, \nbuilding materials, color, or \nfenestration shall be incorporated to \ncreate simple and visually interesting \nbuildings. \nG9.\t The 4.1250(B)(1)(S9) standard shall be \nmet.\n1.\t Building Massing and Articulation, Continued\nFig. B.1.S7: Wall offsets reflecting living unit modules.\nFig. B.1.S6: Significant massing change over 10 ft. in depth provided to break up \nmassing on long building facade.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 70,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 70\n(06/22)\n1.\t Building Massing and Articulation, Continued\nDesign Guidelines\n\nAdditional Guidelines for Townhouse \nG10.\tBuilding lengths shall be broken up to \nlimit the apparent mass of townhouse \ndevelopment and enhance pedestrian \nconnections through the site.\n\n\nAdditional Standards for Townhouse and \nTownhouse Style Development\nG11.\tOffset dwelling units to provide a \nsense of pedestrian scale and building \narticulation.\nG12.\tBuilding massing and details shall \nreflect individual unit modules.\nG13.\tCorner buildings shall respond to the \ncorner location with architectural \nfeatures and/or open spaces that \nemphasize and address the corner.\nDesign Standards\nAdditional Standards for Townhouse \nS10.\tNo building exterior wall dimension or row of contiguous \ndwellings (in one structure) shall exceed 100 ft. in continuous \nbuilding length. An exception to this are courtyards (“U” \nshaped) developments where no unbroken (i.e. continuous) \nsection of the “U” shall exceed 100 ft. (Note: courtyard \ndevelopments may also include multiple buildings that create \na courtyard effect as long as individual building lengths do not \nexceed 100 ft.\nAdditional Standards for Townhouse and Townhouse Style \nDevelopment\nS11.\tOffset every two dwelling units from the next dwelling unit \nby at least 4 ft. in exterior wall offset for buildings 2 stories \nor taller and over 50 ft. in length, or, at least 2 ft. in offset for \nbuildings 1 story in height or less than 50 ft. in length.\nS12.\tHorizontal facades longer than 30 ft. shall be reduced into \nsmaller volumes as individual units to achieve a residential \nscale and a unified building appearance. A minimum of one of \nthe following methods shall be used:\na.\t Varied setbacks and/or heights. \nb.\t Variation in the building form by using bays, shifts in \nmassing, or distinct roof shapes.\nc.\t Diversity of window size, shape or patterns that relate to \nthe interior function.\nd.\t Emphasis of building entries through a projecting or \nrecessed form.\nS13.\tBuildings at corners shall include a unique massing feature \nat the corner such as a tower, corner bay or gable, or a \ncombination of architectural elements that visually enhance \nthe building corner. As an alternative, a functional (i.e. usable) \nand decorative pedestrian or landscaping feature of not less \nthan 100 sq. ft. in ground area may be provided.\nFig. B.1.S11: Massing offsets between dwelling units.\nFig. B.1.S2: Variation in building height help reduce the volume of a facade longer \nthan 30 ft. in length.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 71,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 71\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\n2.\t Roofs and Parapets\nIntent: To create a visually interesting condition at the top of the \nbuilding that reduces the building’s perceived scale and \nenhances its quality and character. \nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nG.\t Utilize Sustainable Development Practices\n\t\n\t\nH.\t Promote High Quality Design\n\t\n\t\nI.\t\nDesign at a Human Scale\nDesign Standards\nAll Development\nS1.\t Roofs shall include a change in form, such as a change in \nheight, pitch, orientation, or other changes in form at an \naverage spacing of no less than 60 ft. Changes in form shall \ncorrespond with building massing and articulation as well as \nchanges in uses or residential unit modules where applicable.\nS2.\t All flat roofs (slopes 2:12 or less) shall:\na.\t Employ design elements to visually “cap” the building such \nas trim, variation in brick coursing, a projecting cornice, \nprojecting parapet, roof overhang, or other feature as \napproved by the Manager or Design Commission. \nb.\t Cornices shall have a maximum projection of 2 ft.\nc.\t Parapets shall be a minimum of 2 ft. in height and a \nmaximum of 8 ft. in height.\nd.\t False storefront or false facade parapets are not permitted.\ne.\t In order to establish depth at the roof line, when parapets \nare used to increase the height of specific building wall \nsections, the parapet shall extend into the depth of the \nbuilding no less than twice the distance of the increase in \nheight, as measured from the point of intersection with \nthe lower parapet or roof if no parapet is present.\nf.\t\nUtilize a “white roof” with a Solar Reflectance Index \n(SRI) of 78 or greater, exclusive of space dedicated to \nmechanical systems, vegetated roof surfaces, solar panels, \nsky lights, or other green roof treatments.\nDesign Guidelines\nAll Development\nG1.\t Express roofs in a visually interesting \nmanner that complements the \ncomposition of the building and \nthe surrounding area and visually \nbreaks down the scale of the roof and \nbuilding.\nG2.\t For buildings with low-sloped roofs:\na.\t Establish a prominent roof line \nor facade design feature which \nvisually “caps” the building.\nb.\t Cornices shall not significantly \noverhang the building.\nc.\t Parapets shall be of sufficient \nheight to visually distinguish the \ntop of the building and to conceal \nany roof-top equipment.\nd.\t Parapets shall not be excessively \ntall and dominate the facade \nor create an obviously false \nappearance. Parapet extensions \nmay be used to highlight focal \npoints of the building.\ne.\t Parapets shall not appear as flat \nand obviously false extensions of \nbuilding wall sections, but rather \nappear as distinct building masses \nand extend into the depth of the \nbuilding.\nf.\t\nUse design strategies to minimize \nheat islands and reduce energy \nusage associated with solar gain \nattributed to the roof surface.\nFig. B.2: Flat roof with facade caped by projecting \ncornice element.\nFig B.2.S2.a (right): Green roof treatment limits solar \nreflectance on a flat roof surface.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 72,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 72\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG3.\t Features shall be present on visibly \nsloped roof surfaces to reduce the \nvisual scale of these surfaces and \nprovide interest along their length.\nDesign Standards\nAll Development, Continued\nS3.\t Sloping roofs (slopes greater than 2:12) shall include at least \ntwo of the following design elements:\na.\t Slope of at least 4:12\nb.\t Two or more slope pitches, with one of at least 4:12\nc.\t Overhanging eaves extending at least 1 ft. beyond the \nsupporting wall with prominent fascias.\nd.\t Other roof design element as determined by the Manager \nor Design Commission.\n2.\t Roofs and Parapets, Continued\nFig. B.2.S2.b: Section diagram illustrating standard \n4.1250(B)(2)(S2).\nMechanical equipment \nscreened by parapet wall\nParapet between 2 and \nParapet between 2 and \n8 ft. in height\n8 ft. in height\nHeight of supporting wall\nHeight of supporting wall\nTwice increase \nin height\nIncrease \nIncrease \nin height\nin height\nPoint of \nIntersection\nFig. B.2.S1.a: Sloping roof with multiple slope pitches.\nFig. B.2.S2.c: Perspective diagram illustrating standard \n4.1250(B)(2)(S2).\nFig. B.2.S2.d: Flat roof with parapet caped with cornice details.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 73,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 73\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\n3.\t Entries\nIntent: To ensure building entries establish prominence in the \nfacade, add character and interest along the street, and are \nan attractive component of the buildings while promoting \npedestrian comfort and safety.\nKey Civic Neighborhood Design Principles:\n\t\n\t\nB.\t Support a Mixed-use Community\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nH.\t Promote High Quality Design\n\t\n\t\nI.\t\nDesign at a Human Scale\nExisting Development: New entries on existing buildings and existing \nbuilding entries that are renovated and require a permit \nshall comply with the appropriate guidelines and standards \nspecified in this section.\nFig. B.3: Corner entry provides weather protection and \nenhanced transparency.\nDesign Guidelines\nAll Development\nG1.\t Entries shall provide pedestrians \nprotection from weather.\nG2.\t Entry door materials shall be attractive \nand of high quality.\nG3.\t For mixed-use buildings, provide at \nleast one commonly-used active entry \non the primary street designed to \nallow direct, easy access between the \nbuilding and the street.\nG4.\t Buildings shall utilize attractive, \nhigh quality, and durable materials \nsurrounding the entry. \nCommercial, Industrial, and Institutional\nG5.\t Entries shall be oriented to and face \nthe street and be regularly spaced to \nactivate the length of the frontage.\na.\t Buildings with long frontages \nor multiple street-facing tenant \nspaces shall provide additional \non-street entries to ensure \nreasonable pedestrian access and \nimprove the appearance of the \nbuilding and the public realm.\nb.\t Primary and shared entries shall \nhave greater prominence than \nindividual entries. \nc.\t Place the main building entrance \nat a street corner where feasible. \nDesign Standards\nAll Development\nS1.\t All entries shall provide weather protection in the form of a \ncanopy, awning, overhang, or other feature to a depth of at \nleast 4 ft.\nS2.\t Building entry doors shall be of high quality materials such \nas commercial-grade solid wood, decorative glass, or other \nmaterials as approved by the Manager or Design Commission.\nS3.\t All buildings shall provide a primary entry at the sidewalk level \non its primary frontage. For mixed-use buildings, at least one \ncommercial, industrial, or institutional use shall provide an \nentrance on the primary frontage. A corner door, such as one \nat a 45-degree angle to the primary street, qualifies as being \nan entrance “on the primary frontage.” \nS4.\t Ground floor facades within 30 ft. from the center of a primary \nor shared entry doorway shall utilize a minimum of 65% \nprimary materials as specified in Table 4.1250.B.8. \n\t\nGround floor facades within 10 ft. from the center of an \nindividual storefront or unit doorway shall use a minimum of \n65% primary materials as specified in Table 4.1250.B.8. \nCommercial, Industrial, and Institutional\nS5.\t Entries shall be well-marked, articulated and oriented to and \nfacing the street.\na.\t Building entrances shall be located to activate the \nstreetfront and shall not be located at intervals of more \nthan 75 ft. along the primary street.\nb.\t Primary entrances shall be differentiated from, and more \nprominent than, smaller storefront or individual entries. \nc.\t On corner lots, buildings on the corner shall place an entry \nwithin 10 ft. of the building corner.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 74,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 74\n(06/22)\nDesign Guidelines\nCommercial, Industrial, and Institutional, \nContinued\nG6.\t All entries shall be visually prominent \nfrom the street and shall include \na variety of design features and \nstrategies which highlight these areas \nof the facade. Primary entries shall \nbe more prominent than individual or \nstorefront entries.\nDesign Standards\nCommercial, Industrial, and Institutional, Continued\nS6.\t Entrances to the building shall have a prominent presence in \nthe building facade.\n\t\nPrimary entrances shall incorporate a minimum of three of the \nfollowing features; \n\t\nIndividual or storefront entries shall incorporate a minimum of \ntwo of the following features:\na.\t Corner location\nb.\t Recessed doorway, at least 18 in. from surrounding facade\nc.\t Overhang/canopy with a distinct form and larger size than \nother overhangs on the facade\nd.\t Transom windows, a minimum of 18 in. tall, above the \ndoor and above the width of the entrance.\ne.\t Glass windows flanking the doorway, a minimum of 1 ft. \nwide and the height of the doorway.\nf.\t\nOrnamental light fixtures, flanking both sides of the door\ng.\t Oversized entry door(s) a minimum height of 8 ft.\nh.\t Stone, masonry, or tile paving in entry, a minimum of 6 sq. \nft.\ni.\t\nPlanters with year-round ornamental landscaping framing \nthe entry\nj.\t\nIntegrated seating along at least one edge of the entry \narea\nk.\t For building masses 2 stories or less at the entry, a change \nin roof form, such as but not limited to a projecting, \ncurved or sloped roof; \nl.\t\nProminent change in material, color, texture, pattern, \nmassing, or articulation surrounding the entry;\nm.\t An entry courtyard of a minimum dimension of 100 sq. \nft. where the minimum dimensions for either length or \nwidth is 10 ft. The courtyard shall provide year-round \nsite furnishings such as benches, tables and sitting areas; \nprominent landscape features such as integrated planters, \nwater features, trellis or arbors, and pedestrian scaled \nlighting fixtures. \n3.\t Entries, Continued\nFig. B.3.S6.a: Corner entry provides awning for \nweather protection and enhanced paving.\nFig. B.3.S6.b: Primary commercial entry provides a \nchange in building form and enhanced transparency.\nFig. B.3.S6.c: Commercial entry provides a change in \nbuilding form and enhanced transparency.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 75,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 75\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\nDesign Standards\nCommercial, Industrial, and Institutional, Continued\nS7.\t Each building shall provide at least one entry on each street \nand primary internal drive it fronts except as follows:\na.\t If the building has three frontages, the building shall have \na minimum of two frontages with operational entries.\nb.\t If the building has four or more frontages, the building \nshall have a minimum of three frontages with operational \nentries.\nc.\t Corner entries facing two frontages shall count as an entry \non each frontage.\nMultifamily and Townhouse\nS8.\t All ground floor units which front a street or primary internal \ndrive shall have a primary entrance directly from the street.\na.\t Entries shall not be elevated more than 6 ft. above the \ngrade of an adjacent street or primary internal drive. \nb.\t Corner units shall orient their entry to the higher classified \nstreet type. If the streets have equal classifications, the \nentry may face either frontage. \nc.\t The entry shall have a direct connection from the sidewalk \nto the front door. The connection shall be a minimum \nof 5 ft. wide. Abutting connections may be combined to \nmaximize landscape area.\nDesign Guidelines\nCommercial, Industrial, and Institutional, \nContinued\nG7.\t When a building faces multiple streets \nor primary internal drives, entries shall \nbe provided on multiple frontages \nto enhance the accessibility and \nwalkability of the development.\nMultifamily and Townhouse\nG8.\t Units at the street should have an \ninviting presence on, and convenient \naccess to the street. Walkways shall \nconnect individual units with the \nsidewalk. Secondary entrances facing \nthe street right-of-way shall present \nthe same finished appearance as a \nprimary entry.\n3.\t Entries, Continued\nFig. B.3.S9.b: Shared residential entry includes \nweather protection and entry courtyard with seating.\nFig. B.3.S9.a: Shared residential entry is recessed with \nan entry courtyard framed by landscape features.\nFig. B.3.S8: Ground-floor units providing individual entries accessed directly from the \nstreet.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 76,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 76\n(06/22)\nDesign Standards\nMultifamily and Townhouse, Continued\nS9.\t All entries shall be made visually prominent and receive \narchitectural emphasis. \n\t\nExterior individual unit entries shall be highlighted by \nincorporating a minimum of two of the following elements: \n\t\nShared entrances, such as those for apartment style buildings \nwith interior unit entries, shall be highlighted by incorporating \nthree or more of the following elements:\na.\t Corner location\nb.\t Recessed entry (minimum of 12 in. from the surrounding \nwall plane)\nc.\t Projecting entries, including porches, canopies, and \narticulated lintels above the doorway\nd.\t Pilasters, columns, or similar features supporting and/or \nframing the entrance\ne.\t Ornamental glazing framing the entry\nf.\t\nElevated entries with stairways that are compatible with \nthe architecture\ng.\t An entry courtyard a minimum of 40 sq. ft. The courtyard \nshall provide year-round site furnishings such as seating, \nlandscape features, and pedestrian scaled lighting fixtures\nh.\t Prominent landscape treatments (ground cover, shrubs, \nand trees) that connect the public realm to the private \nrealm, highlight the entry, and emphasize seasonal color \nand interest\ni.\t\nProminent landscape feature, such as a trellis, arbor, water \nfeature, or special walkway paving\nj.\t\nYear-round site furnishings, including benches, tables, and \nsitting areas\nS10.\tThe area of the railings on exterior stairs, balconies, and \nlandings shall be a minimum of 50 percent transparent. \nAdditional Standards for Townhouse and Townhouse Style\nS11.\tFor each entry, provide a covered porch or portico with a floor \narea of at least 40 sq. ft.\nDesign Guidelines\nMultifamily and Townhouse, Continued\nG9.\t All entries shall be highlighted and \nvisible from the street and shall \ninclude a variety of design features \nand strategies which highlight these \nareas of the facade. Shared entries \nshall have greater prominence than \nindividual unit entries.\nG10.\tSufficient visual access to the site and \nadjacent pedestrian circulation routes \nshall be provided through balcony \nand stair railings to ensure safety and \nsurveillance of those areas.\nAdditional Guidelines for Townhouse\nG11.\tMake entries more prominent with \narchitectural features and outdoor \nspace at the front door to add to \nthe layers of elements between the \nsidewalk and the front door.\n3.\t Entries, Continued\nFig. B.3.S9.c: Recessed individual unit entries are \nseparated from the street with landscape planters and \nsteps up to the door.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 77,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 77\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\n4.\t Facade Composition and Ground-Level Details\nIntent:\t To reinforce a pedestrian scaled streetscape by encouraging \nthe greatest amount of visual interest along the ground level \nof buildings. \nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nB.\t Support a Mixed-use Community\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nG.\t Utilize Sustainable Development Practices\n\t\n\t\nH.\t Promote High Quality Design\n\t\n\t\nI.\t\nDesign at a Human Scale\nExisting Development: Renovations that modify exterior building \nfacades and require a permit shall follow the appropriate \nguidelines and standards of this section at the discretion of \nthe Manager or Design Commission.\nDesign Guidelines\nAll Development\nG1.\t The 4.1250(B)(4)(S1) standard shall be \nmet.\nG2.\t Mechanical equipment and individual \nthrough-wall units shall not detract \nfrom building architecture or facade \ncomposition and shall be designed to \nminimize their visibility. Equipment \nshall not project beyond the adjacent \nfinished wall plane and shall be \nscreened and integrated into the \nbuilding’s overall architectural design, \nfacade composition, and detailing. \nDesign Standards\nAll Development\nS1.\t Mechanical, electrical, and communication equipment and \ncomponents shall be screened so they are not visible at \nground level from the public realm or internal public or private \nareas.\na.\t Equipment shall be screened in a manner that is \ncompatible with the architectural character of the \nbuilding. \nb.\t Appropriate screening for rooftop equipment includes \nparapet walls or architecturally compatible fabricated \nenclosures such as panels and walls. The Manager or \nDesign Commission may require a review of rooftop \nequipment screening by requesting sight line studies. \nc.\t Ground level equipment (including utilities such as \ntransformers, heating and cooling, electric meters, etc.) \nshall not be located within 5 ft. of the front entrances \nand shall be screened with evergreen landscaping of a \nheight and spacing at time of planting that will screen the \nequipment, or with opaque fencing or walls that screen \nthe equipment.\nS2.\t Packaged Terminal Air Conditioners (PTACs), Package Terminal \nHeat Pumps, and similar systems with individual through-wall \nheating/cooling that are visible, including from internal public \nor private areas, are not permitted. \nFig. B.4: Building design reflects pedestrian scale. \nFig. B.4.G2: Through-wall mechanical units are flush \nwith the facade and integrated into the facade design \nto minimize their visibility.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 78,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 78\n(06/22)\nDesign Standards\nAll Development, Continued\nS3.\t Building facades shall transition from one building face to \nan adjacent building face through the use of compatible \nmaterials, glazing and scale elements such as windows, belt \ncourses, awnings and decks. Architectural elements such as \nposts, beams, and planting walls shall be scaled to reflect their \nfunction. Functional features such as vents and downspouts \nshall be visually minimized and integrated into the facade \ndesign. Tacked-on faux architectural elements are prohibited. \nS4.\t If a blank wall greater than 40 ft. long is unavoidable, a \nminimum of one of the following shall be incorporated \nthroughout the length of the blank wall:\na.\t A trellis or trellises that cover 40 percent of the blank wall \nwith vines planted that will grow vertically of sufficient \ndensity and height so that they provide significant \ncoverage of the blank wall. The plantings shall be at least \n4 ft. tall or cover at least 50 percent of each trellis at the \ntime of planting.\nb.\t Decorative tile work that covers an area at least 40 percent \nof the blank wall, and located to be viewed from the \npedestrian level.\nc.\t Artwork reviewed and approved by the Manager or Design \nCommission that covers an area at least 40 percent of the \nblank wall, and located to be viewed from the pedestrian \nlevel.\nd.\t Landscape screening incorporating sub-canopy trees (trees \nthat will be 25 ft. or shorter at maturity) every 15 ft. along \nthe wall, with a hedge between trees of evergreen shrubs \nlocated every 3 ft. on center and a minimum of 3 ft. in \nheight at time of planting.\ne.\t Other strategy to create visual interest as approved by the \nManager or Design Commission.\nS5.\t Exterior corridors and stairs visible from the street are not \npermitted, except for the main entry stair leading to the \nbuilding entrance. \nDesign Guidelines\nAll Development, Continued\nG3.\t The design of adjacent building \nfacades shall be compatible. \nArchitectural features such as posts, \nbeams, etc. shall be appropriately \nscaled for their use. Features such \nas downspouts shall be visually \nminimized and incorporated into the \nfacade design. Tacked-on architectural \nelements which appear fake shall not \nbe used.\nG4.\t Use elements such as vegetation, \nartwork, trellis structures, \narchitectural detailing, reveals and/or \ncontrasting materials to provide visual \ninterest on what otherwise would be \nblank walls. These shall be used in a \nmanner consistent with the building’s \ndesign and other facade composition \nelements.\nG5.\t Exterior corridors and stairs, except \nthose accessing ground floor entries, \nshall be visually minimized from the \nstreet and shall not detract from the \noverall building design.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S6: Garage door matches the window patterns \nof the corner building facade.\nFig. B.4.S4: Artistic treatments to create visual interest on areas of blank wall.\nFig. B.4.S3: Vent covers utilize similar materials and \ncolors as the surrounding facade area to minimize their \nappearance. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 79,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 79\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\nDesign Standards\nAll Development, Continued\nS6.\t If used, roll-up and garage doors shall match the main building \nin terms of color, materials, and trim or serve as an artistic \nelement compatible with the building design. \nS7.\t Energy conservation in building development shall be \npromoted through sustainable building techniques and design \nstrategies as follows.\n\t\nDevelopments with less than 30,000 sq. ft. of floor area shall \ncomply with a minimum of one of the following requirements: \n\t\nDevelopments with 30,000 sq. ft. of floor area or greater shall \ncomply with a minimum of two of the following requirements:\na.\t A vegetated (green) roof surface comprising a minimum of \n30 percent of the roof area\nb.\t Orient the long axis of the building east and west, with \nunobstructed solar access to the south wall and roof. The  \nlonger facade shall be within 25 degrees of facing south, \nand facing within 15 degrees of south is recommended for \nbest performance.\nc.\t Solar energy panels comprising an area equivalent to a \nminimum of 20 percent of the roof area or generating a \nminimum of 10 percent of the typical energy usage for the \nbuilding (The typical energy model for the building shall \nbe determined by referencing the LEED™ standards). The \nlocation and configuration of solar energy panels shall \nbe approved by the Manager or the Design Commission \nonly as permitted in Article 4 and Section 10.0900. Solar \npanels shall be integrated into the building design or shall \nbe screened from view at street level with materials that \nare consistent with the building design and yet do not \ninterfere with the purpose of the solar panels.\nd.\t A system that collects rainwater for reuse from a minimum \nof 50 percent of the total roof area on site (e.g., site \nirrigation or gray water reuse)\ne.\t Skylights or other day lighting system which illuminates 75 \npercent of the building floor area, with skylights occupying \na minimum of 3 percent of the roof area with spacing \nbetween skylights not greater than one and four tenths \n(1.4) times the ceiling height\nf.\t\nProvide an on-site alternative fuel refueling station (such \nas an electric, bio-diesel, or natural gas refueling station, \netc). An electric fueling station must be within sight of a \nfunctional building entry and shall be signed and marked/\nstriped to identify parking preference for alternative fuel \nvehicles\ng.\t Source sustainable and local building materials from within \n500 miles of the development site for no less than 20 \npercent of the total construction materials\nh.\t Another sustainable building design element as approved \nby the Manager or Design Commission.\nDesign Guidelines\nAll Development, Continued\nG6.\t The 4.1250(B)(4)(S6) standard shall be \nmet. \nG7.\t Developments shall meaningfully \nincorporate design strategies that \nreduce water and energy usage \nattributed to site and building \ndevelopment, building use, and the \ntransportation of building users \nwhile not detracting from good \nsite and building design. Healthy \nand sustainable communities \nshall be created that incorporate \n“best practices” such as LEED™ for \nNeighborhood Development to \nconserve natural resources, reduce \ncarbon emissions, and promote \ninteraction between residents.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S7.b: Building with long axis oriented east and \nwest with unobstructed solar access to the south wall.\nFig. B.4.S7.a: Vegetated roof surface.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 80,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 80\n(06/22)\nDesign Standards\nCommercial, Industrial, and Institutional\nS8.\t Except for single story structures, building facades shall include \ndesign elements which establish a base and top. Base and top \ntreatments shall be cohesive across facades and integrated \nwith the architectural character of the building. \na.\t The base and top treatments shall be located on a majority \nof the length of each building facade and shall wrap all \nvisible building corners. \nb.\t The building base shall be a minimum height no less \nthan 5 percent of the facade height and shall not exceed \n20 percent of the facade height. Multi-story buildings \nmay have a building base height equal to the wall area \nattributed to the ground floor. \nc.\t Building bases shall consist of a distinct, clearly visible \nchange in the building facade, and include one of the \nfollowing:\ni.\t\nA prominent change in material or material treatment; \nii.\t A change in depth no less than 12 in.; or\niii.\t A landscape area at the base of the building with \nevergreen plant material at least 5 percent of the \nfacade height may count toward a portion of the \nbuilding base requirement.\nd.\t The top of the building shall be considered either the \nupper story or the top of the facade and shall have a \ndistinct visual design from the base and middle of the \nbuilding by material treatment, color, texture, or change in \nmaterials or roof or building form. \nDesign Guidelines\nCommercial, Industrial, and Institutional\nG8.\t Except for single story structures, \nbuildings shall feature an \narchitecturally distinct base and top. \nBase and top treatments should \nestablish depth and interest in the \nfacade, and be integrated into the \nbuilding design. \na.\t Base treatments should be visually \ndistinct, address and enhance \nthe meeting of the building and \nground, and be proportional to the \nsize of the building. \nb.\t Building top treatments shall be \nvisually distinct from the base \nand designed and scaled to be \ncompatible with the architectural \ncharacter of the building.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S8.a: Building base established through a \nchange in materials and top established through a \nprojecting roof line.\nFig. B.4.S8.b: Building base established through a change in materials and depth \nand building top established through a prominent cornice line.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 81,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 81\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\nDesign Standards\nCommercial, Industrial, and Institutional, Continued\nS9.\t Ground-floor facades facing streets or primary internal drives \nshall provide additional ground level details that further \nenliven the pedestrian realm and create attractive building \nfronts. A minimum of two of the following design features \nshall be incorporated at the ground level: \na.\t Transom windows above storefront windows and doors.\nb.\t Pedestrian scaled lighting fixtures or wall-mounted \nprojecting lighting fixtures such as wall sconces at regular \nspacing no greater than 30 ft.\nc.\t Awnings, canopies, or solar shades/reflectors placed \nover windows, doors, or outdoor spaces with a minimum \nprojection of 4 ft. in an amount and configuration \napproved by the Manager or Design Commission that \nis compatible with the architecture of the building, \nadds facade depth, and contributes to the pedestrian \nenvironment.\nd.\t Regularly spaced planter boxes, a minimum of 6 sq. ft. not \nlocated in an accessible pedestrian walk.\ne.\t Other feature approved by the Manager or Design \nCommission.\nDesign Guidelines\nCommercial, Industrial, and Institutional, \nContinued\nG9.\t Street-facing facades shall have \nadditional design elements at the \nstreet level to add interest, enhance \nthe building appearance, establish \ngreater depth in the facade, and \nenliven the pedestrian realm. These \nfeatures shall compliment those used \nto satisfy the other standards and \nguidelines.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S9.c: Ground level facade incorporating pedestrian scaled detailing.\nFig. B.4.S9.a: Ground level facade incorporating \npedestrian scaled detailing including awnings and wall-\nmounted lighting fixtures.\nFig. B.4.S9.b: Ground level facade incorporating \npedestrian scaled detailing including awnings and \ntransom windows above storefront windows and doors.\ncanopy\ncanopy\nseasonal \nseasonal \nplanters\nplanters\nstorefront \nstorefront \nwindow\nwindow\nbulkhead\nbulkhead\npedestrian \npedestrian \nscaled \nscaled \nlights\nlights\nprojecting sill\nprojecting sill\nrecessed entry\nrecessed entry\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 82,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 82\n(06/22)\nDesign Standards\nCommercial, Industrial, and Institutional, Continued\nS10.\tAll facades shall establish a rhythm by repeating design \nelements at regular spacing along the facade length for the \nheight of the ground floor or the height of building base, \nwhichever is taller. All facades shall contain at least one of the \nfollowing design features:\na.\t Columns or pilasters with plinths at regular intervals no \ngreater than 30 ft. apart. \nb.\t Major vertical mullions of at least 6 in. in width, and larger \nthan other mullions in the same window opening, on all-\nglass facades. \nc.\t Vertical reveals no less than 6 in. spaced a minimum of \nevery 30 ft.\nd.\t Belt courses above ground floor level and along a \nminimum of 80 percent of the facade.\ne.\t Lintels or arches over the windows and doors.\nf.\t\nCanopy projections above ground floor windows a \nminimum depth of 4 ft. \ng.\t Other design element as approved by the Manager or \nDesign Commission.\nS11.\tOn facades facing streets or primary internal drives, ground \nfloor uses shall be predominantly at an elevation no more than \n2 ft. above or below the sidewalk elevation.\nMultifamily and Townhouse\nS12.\tExcept for single story structures, buildings facades shall \ninclude design elements which establish a base and top. Base \nand top treatments shall be cohesive across facades and \nintegrated with the architectural character of the building. \na.\t The base and top treatments shall be located on a majority \nof the length of each building facade, and shall wrap all \nvisible building corners. \nb.\t The base height shall be from grade to a minimum of the \ntop of the first floor and a maximum of the top of the \nsecond floor. \nc.\t The top of the base shall consist of a distinct, clearly visible \nphysical transition between the base and the upper floors, \nand include one of the following:\ni.\t\nA prominent change in material or material treatment; \nor \nii.\t A change in depth no less than 8 in.\nd.\t The top of the building shall be considered either the \nupper story or the top of the facade and shall have a \ndistinct visual design from the base and middle of the \nbuilding by material treatment, color, texture, or change in \nmaterials or roof or building form. \nDesign Guidelines\nCommercial, Industrial, and Institutional, \nContinued\nG10.\tBuildings shall create a rhythm of \nrepeating elements that help establish \ncontinuity and pedestrian scale in the \nfacade.\nG11.\tBuildings shall be designed to allow \ndirect, easy access between public \nand commonly used areas and the \nbuilding’s interior.\nMultifamily and Townhouse\nG12.\tExcept for single story structures, \nbuildings shall feature an \narchitecturally distinct base and top. \nBase and top treatments should \nestablish depth and interest in the \nfacade, and be integrated into the \nfacade designs. \na.\t Base treatments should be visually \ndistinct, address and enhance \nthe meeting of the building and \nground, and be proportional to the \nsize of the building. \nb.\t Building top treatments shall be \nvisually distinct from the base \nand designed and scaled to be \ncompatible with the architectural \ncharacter of the building.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S10: Facade rhythm established through a \nseries of vertical reveals between building masses.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 83,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 83\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\nDesign Guidelines\nMultifamily and Townhouse, Continued\nG13.\tProvide a transitional design feature(s) \nbetween public spaces and ground \nfloor residential spaces to distinguish \nbetween the public and private \nrealms.\nDesign Standards\nMultifamily and Townhouse, Continued\nS13.\tMultifamily units on the ground floor shall provide a transition \nbetween public space and private space by incorporating a \nminimum of one of the following transition elements:\na.\t Elevate the first floor a minimum of 3 ft. above grade. \nEntries may be at grade;\nb.\t Set back the building an additional 5 ft. beyond the \nminimum setback or recess the first floor an additional 5 \nft. beyond the second-floor facade;\nc.\t Provide a front porch on the street-facing entry for \neach unit that is a minimum of 48 sq. ft. with minimum \ndimensions to fit a 5-ft. by 6-ft. rectangle inside the porch \narea;\nd.\t Provide a front landscaped courtyard of at least 60 sq. ft. \nseparated by a hedge or decorative fence a minimum 30 \nin. tall and maximum of 4 ft. tall;\ne.\t Provide raised planter(s) between 18 in. and 30 in. in \nheight and 4 ft. in depth as measured from the point of \nthe planter nearest the front property line, and including \na minimum 3 ft. wide planting area. The planter(s) shall \noccupy at least 50 percent of the frontage of each unit and \nbe planted with deciduous landscaping or perennial edible \nlandscaping; or\nf.\t\nOther strategy as determined by the Manager or Design \nCommission.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S13.a: Ground floor residential entries \ntransition from the street through an increased setback \nand raised first-floor elevation.\nFig. B.4.S13.b: Ground floor residential entries transition from the street with a \nlandscape planter and recessed door.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 84,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 84\n(06/22)\nDesign Standards\nAdditional Standards for Townhouse and Townhouse Style\nS14.\tFacade treatments (such as exterior finish patterns, story lines/\nfloor banding, trim, corner boards, and related items) shall be \ncontinued around all sides of the building.\nS15.\tProvide a minimum of four of the following architectural \nelements in the building design:\na.\t Dormers\nb.\t Gables\nc.\t Alternating cornice heights or roof forms \nd.\t Cantilevered building masses\ne.\t Recessed entries\nf.\t\nCupolas or towers\ng.\t Pillars or columns a minimum depth of 8 in.\nh.\t Additional offsets in building face or roof (minimum 16-in.)\ni.\t\nBay windows\nj.\t\nIntegrated landscape planters on upper levels of all \nfacades facing streets and primary internal drives. \nk.\t Decorative and/or alternating patterns on the exterior \nfinish (e.g. scales/shingles, trim boards, ornamentation or \nsimilar features)\nl.\t\nDecorative cornice or pediment\nm.\t Use at least two different exterior finishes and patterns \nincluding such types as masonry, stone, stucco, wood, \nfinished metal panels, and tile\nn.\t Where masonry is used for exterior finish, apply decorative \nbonds or patterns\no.\t Natural lighting features including non-window elements \nand other design features that channel natural light from \nexterior walls or roof to the building interior (such as by \nthe use of skylights, solar tubes, atriums, light shelves, and \nrelated features).\nDesign Guidelines\nAdditional Standards for Townhouse and \nTownhouse Style\nG14.\tFacade details shall be provided on all \nsides of a building that are not shared \nwith another building.\nG15.\tProvide variation in building form and \ndetailing responding to individual \nunits to convey a sense of residential \nscale. Provide a variety of compatible \narchitectural elements to provide \npedestrian scaled articulation to the \nresidential units and avoid flat facades.\n4.\t Facade Composition and Ground-Level Details, Continued\nFig. B.4.S14: Townhouse style building facade \ntreatments wrapping the building corner and continuing \nacross multiple building facades.\nFig. B.4.S15.b: Townhouses with facade offsets, alternating finish patterns, \nprojecting balconies, and recessed entries.\nFig. B.4.S15.a: Townhouses with gable roofs, facade \noffsets, cantilevered building masses, and multiple \nfacade materials.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 85,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 85\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\n5.\t Transparency\nIntent:\t To create visual interest on building facades by providing views \ninto active spaces, establishing visual connections between \nactivities inside and out, and allowing for day lighting and \npassive climate control of interior spaces.\nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nB.\t Support a Mixed-use Community\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nG.\t Utilize Sustainable Development Practices\n\t\n\t\nH.\t Promote High Quality Design\n\t\n\t\nI.\t\nDesign at a Human Scale\nExisting Buildings: Existing buildings shall follow the appropriate \ntransparency guidelines and standards when changes to \nthe building facade are reviewed for a permit. Existing \nbuildings with levels of transparency less than the amount \nspecified shall not lessen the amount of transparency during \nrenovations if the exterior building facade is altered.\nFig. B.5: High levels of transparency are provided at \nthe street and upper levels on the building facades.\nDesign Guidelines:\nAll Development\nG1.\t Where transparency is required, \nwindows shall allow high levels of \nvisibility through window glazing into \nthe buildings.\na.\t Features used to satisfy \ntransparency requirements shall \nremain transparent and add visual \ninterest to the facade.\nb.\t Window shall be maintained free \nof items which significantly limit \nthe visual connection between \ninterior and exterior spaces.\nc.\t Design site features to ensure \nnatural surveillance from the \nbuilding to adjacent commonly \nused outdoor spaces.\nG2.\t The 4.1250(B)(5)(S2) standard shall be \nmet. \nG3.\t Where blank walls are not required \nby the building code, transparency \nshould be provided along interior \nside lot lines to create articulation on \nthe facade and daylighting of interior \nspaces.\nG4.\t The 4.1250(B)(1)(S4) standard shall be \nmet.\nDesign Standards:\nAll Development\nS1.\t To meet the clear, transparent glass/glazing requirement, \nwindows shall have a Visible Transmittance (VT) value of 60 \npercent or greater. \na.\t Films or other substances applied to the window to reduce \nthe Visible Transmittance value below 60 percent are \nprohibited.\nb.\t Required windows within the ground floor transparency \nzone shall be maintained free of shelving, signage \n(including painted window signage) or other items that \nreduces visibility by more than 50 percent between the \ninterior and exterior spaces.\nc.\t Landscaping and other features between the facade and \nfrequently used outdoor spaces such as parking and open \nspaces shall be designed so as not to obstruct views from \ninterior spaces.\nS2.\t Windows used to meet visibility requirements shall not be \nblocked by landscaping. \nS3.\t When required by the building code, portions of the facade \narea on an interior side lot-line (zero-lot line) may be excluded \nfrom overall transparency calculations on that facade. Massing \narticulations, setbacks, and/or building step backs which allow \nfor greater areas of transparency are encouraged.\nS4.\t Building entries that access parking areas and other outdoor \nspaces shall be designed with transparent glass that allows \nvisibility for users to look out prior to exiting the building.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 86,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 86\n(06/22)\nDesign Guidelines:\nCommercial, Industrial, and Institutional\nG5.\t Window recesses shall be sufficient to \nestablish a sense of depth and shadow \non facades, and provide facade \narticulation and relief. \nG6.\t Facades visible from streets and \nprimary internal drives shall provide \nhigh levels of clear glazing to ensure \narticulation on the facade, daylighting \nof interior spaces, and visibility to \nthe street. The greatest levels of \ntransparency shall be at the street \nlevel and at entries.\nG7.\t Facades not visible from a street or \nprimary internal drive shall provide \nsufficient transparency to ensure \ndaylighting of interior spaces and \nvisual interest on the facade, but may \nprovide lower levels of transparency \nthan street-facing facades. The highest \nlevel of transparency shall be at the \nground level and at entries.\nG8.\t Buildings shall be designed to \nconserve energy by optimizing solar \norientation and maximizing passive \nsolar access in winter months while \nminimizing solar heat gain in summer \nmonths. \nDesign Standards:\nCommercial, Industrial, and Institutional\nS5.\t Windows shall be recessed a minimum of 4 in. as measured \nfrom the exterior most window pane and the adjacent finish \nbuilding plane.\nS6.\t For each facade visible from a street or primary internal drive:\na.\t A minimum of 60 percent of the ground floor facade area \nshall be clear, transparent glazing.\nb.\t Upper levels of street facing facades shall be composed \nof clear glass for 30 percent of the wall area above the \nground floor, excluding roof shapes and parapets.\nS7.\t For each facade not visible from a street or primary internal \ndrive:\na.\t A minimum of 40 percent ground floor facade area shall \nbe clear, transparent glazing. \nb.\t 25 percent of the total facade area shall be clear, \ntransparent glazing.\nc.\t Facades with customer entries shall have ground floor \ntransparency of a minimum 40 percent of the ground \nfloor wall area within 30 ft. horizontally of the center of \nthe doorway. The length of this transparency zone may \nbe reduced to the end of the tenant space which utilizes \nthe entry if the transparency zone extends beyond that \ntenant’s space.\nS8.\t For facades facing within 25 degrees of south, a minimum \nof 30 percent of the total facade wall area shall be clear, \ntransparent glazing.\n5.\t Transparency, Continued\nFig. B.5.S5: Recessed windows provide a sense of \ndepth and shadowing on the facade.\nFig. B.5.S7: Commercial spaces providing high levels of transparency facing \nadjacent streets.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 87,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 87\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\nDesign Standards:\nCommercial, Industrial, and Institutional, Continued\nS9.\t At the discretion of the Manager or Design Commission, \ndisplay windows that do not provide views into the building \nmay count towards up to 25 percent of the required ground \nfloor transparency if the display extends a minimum of 4 ft. \ninto the building and contains three-dimensional (3D) objects, \nsuch as product displays. Window boxes added to the exterior \nof the building are not permitted. \nS10.\tIf structured parking is present, openings without glass but \nutilizing an artistic screening system or other decorative \nfeature in those areas may be used to meet the transparency \nrequirement for the portions of that facade occupied by the \nparking structure at the discretion of the Manager or Design \nCommission.\na.\t The design of parking structures and their screening \nsystems shall be compatible with the architectural \ncharacter of the primary building. Design similarities \nmay include features such as color, material, pattern, \nproportions, articulations, etc.\nS11.\tAll windows shall be high quality, durable, and energy efficient \nwith insulating double or triple panes. In each commonly \noccupied space provide operable windows on each exterior \nwall sufficient to allow for natural ventilation. \nS12.\tWindow openings are preferred to exhibit a vertical \nproportion. Window openings shall not exhibit a horizontal \nproportion greater (more horizontal) than two-to-one.\nDesign Guidelines:\nCommercial, Industrial, and Institutional, \nContinued\nG9.\t When buildings require specific \nareas to not be transparent, a limited \namount of displays that are integrated \ninto the building may substitute for \ntransparent glazing. Projected display \nareas which do not provide views into \nthe building are not permitted. \nG10.\tExterior facade openings on parking \nstructures that do not contain glass \nmay count toward the transparency \nrequirement if they contain artistic, \nvisually attractive screening materials \nwhich enhance the facade design.\nG11.\tWindows shall be durable and \ninsulated and provide sufficient \noperability to allow for natural \nventilation of interior spaces.\nG12.\tWindows shall reinforce a vertical \nproportion on the facade and not \ncontribute to a dominant horizontal \ngeometry in the building.\n5.\t Transparency, Continued\nFig. B.5.S10: Structured parking opening utilizing \nartistic screening.\nFig. B.5.S12.b: Windows are vertically proportioned.\nFig. B.5.S12.b: Window proportions are preferred to be \nvertical. Horizontal proportions are allowable up to 2:1.\n2\n1\n3\n1\nPreferred\nProhibited\nAllowable\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 88,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 88\n(06/22)\nDesign Standards:\nMultifamily and Townhouse\nG13.\tWindow recesses shall be sufficient \nto support facade articulation and \nprovide surface relief, depth, and \nshadow on facades. \nG14.\tFacades visible from a street or \nprimary internal drive shall provide \nhigh levels of clear glazing to ensure \narticulation on the facade, daylighting \nof interior spaces, and visibility into \nthe street. The greatest levels of \ntransparency shall be at the street \nlevel.\nG15.\tFacades not visible from a street or \nprimary internal drive shall provide \nsufficient transparency to ensure \ndaylighting of interior spaces and \nvisual interest on the facade, but may \nprovide lower levels of transparency \nthan street-facing facades.\nG16.\tGround-level common areas of \nmultifamily buildings shall have \nhigh levels of transparency, visual \nconnectivity, and direct access to the \nstreet.\nDesign Standards:\nMultifamily and Townhouse\nS13.\tWindows shall be recessed a minimum of 2 in. as measured \nfrom the exterior most window pane and the adjacent finish \nbuilding plane.\nS14.\tFor each facade visible from a street or primary internal drive: \na.\t A minimum of 25 percent of the ground floor facade area \nand 25 percent of the total facade area shall be clear, \ntransparent glazing.\nS15.\tFor each facade not visible from a street or primary internal \ndrive, a minimum of 20 percent of the total facade area shall \nbe clear, transparent glazing. \nS16.\tGround floor spaces attributed to common areas, such as \nlobbies, shared community rooms or centers, fitness rooms, \netc., shall be composed of clear glass for a minimum of 35 \npercent of the ground floor wall area attributable to the \nspace(s). Where these spaces abut a street, primary internal \ndrive, or public pathway, they shall include a door opening \ndirectly onto the public space(s).\n5.\t Transparency, Continued\nFig. B.5.S14: Multifamily building providing high levels of transparency facing \nadjacent streets.\nFig. B.5.S13: Recessed windows provide a sense of \ndepth and shadowing on the residential facade.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 89,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 89\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\nDesign Guidelines:\nMultifamily and Townhouse, Continued\nG17.\tFacades adjacent to pedestrian \npathways shall provide high levels of \nvisibility onto the pathway to help \nensure the safety of these spaces.\nG18.\tSouth-facing facades shall provide high \nlevels of transparency to allow for day-\nlighting and passive heating.\nG19.\tBuildings shall be designed to \nconserve energy by optimizing solar \norientation and maximizing passive \nsolar access in winter months while \nminimizing solar heat gain in summer \nmonths.\nG20.\tAll windows shall be high quality, \ndurable, and energy efficient and allow \nfor sufficient operability to ensure \npassive ventilation and air circulation \nfor commonly occupied rooms.\nAdditional Guidelines for Townhouse and \nTownhouse Style\nG21.\tProvide sufficient visibility along all \nwalkways between buildings and \nfrom adjacent and facing units onto \npedestrian walkways to allow for \nwalkway safety and surveillance. \nG22.\tThe 4.1250(B)(5)(S22) standard shall \nbe met. \nDesign Standards:\nMultifamily and Townhouse, Continued\nS17.\tPedestrian pathways shall be visible from 50 percent of the \nfirst and second floor units abutting the pathway. A unit meets \nthis criterion when at least one window of a frequently used \nroom, such as a kitchen, living room and dining room, but not \nbedroom or bathroom, faces the pathway.\nS18.\tFor facades facing within 25 degrees of south, a minimum \nof 25 percent of the total facade wall area shall be clear, \ntransparent glazing. \nS19.\tProvide exterior, architectural sunshades for windows on the \nsouth and west building facades to effectively limit summer \nsun and to allow for winter sun penetration. Sunshades shall \nbe permanent design features integrated into, and compatible \nwith the design of the building facades.\nS20.\tAll windows shall be high quality, durable, and energy efficient \nwith insulating double or triple panes. In each residential unit \nor common area, provide a minimum of one operable window \nin each commonly occupied room (kitchen, living room, dining \nroom, bedroom, etc.) which includes an exterior wall.\nAdditional Standards for Townhouse and Townhouse Style\nS21.\tAll on-site pedestrian walkways shall be visible from at least \none unit by including a window facing the path in a frequently \nused room such as a living room, dining room, kitchen or \nbedroom (but, for example, not a window to a garage, \nbathroom or storage area).\na.\t Walkways shall be designed to maintain clear lines of site \nbetween buildings and avoid small, concealed areas.\nS22.\tVisible Dwelling Front. A minimum of 75 percent of the total \nfrontage of a street or primary internal drive frontage that \nincludes unit entries shall be visible from: \na.\t A front door\nb.\t A street-facing ground floor window in a frequently used \nroom\nc.\t A street-facing second story minimum 4-ft. by 4 ft. window \nin a frequently used room, placed no higher than 3 ft. 6 in. \nfrom the floor to the bottom of the window sill\nd.\t If a primary unit entry does not front a street or primary \ninternal drive, the entry shall be clearly visible from the \ninternal driveway or path it is accessed from\n5.\t Transparency, Continued\nFig. B.5.S19: Architectural sunshades are provided on \nthe south building facade.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 90,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 90\n(06/22)\n6.\t Sign Design \nIntent:\t To encourage interesting, creative, and high quality sign \nelements in the public realm and ensure that signage is part \nof an integrated design approach within developments that \ncontributes to the urban character of the neighborhood.\nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nH.\t Promote High Quality Design\n\t\n\t\nI.\t\nDesign at a Human Scale\nDesign Guidelines\nAll Development\nG1.\t Wall signs shall be proportional to the \nbuilding facade, be integrated into \nthe design of the building, and shall \nidentify the use(s) within the building \nor tenant space to which it is attached. \nCreative signs with personality that \nare an expression of the business \nand enhance the streetscape are \nencouraged. Wall signs shall be placed \nwith consideration for other signs on \nthe same facade to avoid a cluttered \nappearance.\nDesign Standards\nAll Development\nS1.\t Wall Signs: \na.\t Area: Wall area is calculated by taking the width of the \nbuilding or tenant space multiplied by the height of the \nbuilding facade or tenant space (width x height), up to \na maximum height of 25 ft. (as measured from finished \ngrade).\ni.\t\nSingle Tenant Buildings: The maximum allowed area \nof a wall sign shall be 8 percent of the wall area upon \nwhich the sign is located. \nii.\t Multi-Tenant Buildings: The maximum allowed area \nof a wall sign shall be 8 percent of the wall area of the \ntenant space upon which the sign is located.\niii.\t The maximum allowed area of a wall sign shall be \nreduced when the building or tenant space facade also \nincludes projecting signs and/or awning and canopy \nsigns, per Standards 4.1250(B)(6)(S2) and (S4).\nb.\t Types: Fascia, mansard wall, marquee, and painted wall \nsigns are permitted.\nc.\t Number of Signs: Limited by total allowed wall sign area, \nnot by number of signs.\nd.\t Location:\ni.\t\nFascia signs for ground-floor commercial and industrial \nuses shall fit into a sign band directly above the \nground-level facade to help reinforce horizontal lines \nalong the street.\nii.\t Fascia signs shall not extend beyond the outer edges \nof the building front.\niii.\t For multi-tenant buildings, the wall sign shall only be \nlocated on the exterior of the tenant space to which \nthe sign corresponds. On-Site Directory Signs are \npermitted per the standards in A6.100 and A6.101.\niv.\t No portion of a wall sign shall be located above 25 ft. \nin height, as measured from finished grade.\nFig. B.6: Projecting signs at corner building entry.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 91,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 91\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\n6.\t Sign Design, Continued\nDesign Standards\nAll Development, Continued \nS2.\t Projecting Signs (including Under Marquee Signs):\na.\t Area: The maximum size of an individual projecting sign \n(one face) shall be 8 sq. ft. The maximum area for all \nfaces shall be 16 sq. ft. Where both projecting and wall \nsigns are used, the sign area for all faces of the projecting \nsign(s) shall be deducted from the allowed wall sign area \n(calculated per 4.1250(B)(6)(S1)(a)) for the wall to which \nthe sign is attached.\nb.\t Height: A projecting sign shall not extend above the roof \nline at the wall the sign is attached to. In no case shall any \nportion of a projecting sign exceed a height of 25 ft. above \ngrade. Projecting signs shall have a minimum clearance of \n8 ft. between the bottom of the sign and finished grade.\nc.\t Number of Signs: One projecting sign is permitted per \nbuilding facade. For multi-tenant buildings, one projecting \nsign is permitted for each tenant space. Tenant spaces at \na building corner may have one projecting sign on each \nfacade.\nd.\t Location: The sign shall not extend from the building \nfacade for a distance greater than 6 ft., or a distance equal \nto 2/3 the width of the abutting sidewalk, whichever is \nless. The sign shall only be located on the exterior of the \ntenant space to which the sign corresponds.\nS3.\t Monument Signs: \na.\t Area: \ni.\t\nThe maximum size of an individual monument sign \n(one face) is 32 sq. ft. All sign faces combined may not \nexceed 64 sq. ft.\nii.\t When an additional monument sign is permitted per \n4.1250(B)(6)(S3)(c), the combined area of all faces of \nthe second monument sign shall not exceed 32 sq. ft.\nb.\t Height: A monument sign shall not exceed 8 ft. in height \nabove finished grade. When located within 30 ft. of an \nintersection of two streets or a street and a primary \ninternal drive (measured from the property lines), the \nmonument sign shall not exceed 4 ft. in height.\nc.\t Number of Signs: One monument sign is allowed per site. \nFor sites with multiple street frontages, one additional \nmonument sign is allowed to be located on a secondary \nfrontage if it is 300 ft. or longer. \nd.\t Location: Monument signs shall not be located within a \nrequired clear vision triangle, within a public open space, \nor within a pedestrian pathway. When an additional \nmonument sign is allowed it shall not be located closer \nthan 200 ft. to the first monument sign.\nDesign Guidelines\nAll Development, Continued\nG2.\t Projecting signs shall be oriented to \nthe pedestrian and promote safety \nand walkability in their location, size \nand clearance above the ground. \nCreative signs with personality that \nare an expression of the business \nand enhance the streetscape are \nencouraged.\nG3.\t Monument signs shall be integrated \ninto the site design and shall \ncomplement the design of the \nprimary structure(s) on site. The size \nand location of the monument sign \nshall not interfere with sight lines \nat intersections where vehicles and \npedestrians may cross. Creative signs \nwith personality that are an expression \nof the business and enhance the \nstreetscape are encouraged.  \nFig. B.6.S2: Under Marquee signs hanging from a \ncanopy maintain an 8-ft. clearance above the sidewalk.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 92,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 92\n(06/22)\nDesign Standards\nAll Development, Continued \nS4.\t Awning and Canopy Signs:\na.\t Area: The sign area for awning and canopy signs shall be \ndeducted from, and shall not exceed, the allowed wall \nsign area on the wall to which it is attached. Where both \nawning or canopy signs and wall signs are used, the sign \narea for all faces of the awning or canopy sign(s) shall \nbe deducted from the allowed wall sign area (calculated \nper 4.1250(B)(6)(S1)(a)) for the wall to which the sign is \nattached.\nb.\t Height: Signs on awnings or canopy structures shall \nmaintain a clearance of 8 ft. from finished grade. No part \nof the structure shall extend above the roof line.\nc.\t Number of Signs: Awning and canopy signs are limited by \narea, not by number.\nd.\t Location: A sign shall not project beyond the edges of \nthe canopy or awning face upon which it is attached. The \nsign(s) shall only be located on the exterior of the tenant \nspace to which the sign corresponds.   \nS5.\t Window Signs: The maximum area of window signage shall not \nexceed 20 percent of the window.\nS6.\t Illumination: Sign illumination shall be designed to avoid \noff-site lighting, night sky pollution, and light spill-over into \nresidential units.\na.\t Internal illumination of signs is not permitted. \nb.\t External illumination using upward facing lighting that is \nnot shielded is not permitted. \nc.\t Neon signage is allowed. \nS7.\t Prohibited Signs:  In addition to those signs identified as \nprohibited in Appendix 6.000 – Sign Regulations, the following \ntypes of signs are not permitted in Civic Neighborhood, unless \npermitted through a temporary use permit: Free-Standing \nsigns supported by one or more structural supports (i.e., \n“pole signs”), roof signs, moving parts signs, rotating signs, or \nballoon signs.\n6.\t Sign Design, Continued\nDesign Guidelines\nAll Development, Continued\nG4.\t Awnings and canopy signs shall be \noriented to the pedestrian, providing \nadequate clearance above ground \nso as not to impede pedestrian \nmovement. Awning and canopy \nsignage shall be creative and durable \nand shall complement the design of \nthe structure it is attached to.\nG5.\t Window signs shall be limited to \nmaximize visibility into active spaces. \nCreative signs with personality that \nare an expression of the business \nand enhance the streetscape are \nencouraged.\nG6.\t Signs that feature lighting shall be \ncarefully illuminated to provide a \nhigh quality appearance that is well- \nintegrated into the sign design and \nbuilding architecture and character. It \nshall not create negative impacts on \nsurrounding areas or result in sky-\nglow.\nG7.\t The 4.1250(B)(6)(S7) standard shall be \nmet.\nFig. B.6.S4: Canopy sign which does not project \nbeyond the face of the canopy upon which it is \nattached.\nFig. B.6.S5: Appropriately sized window sign.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 93,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 93\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\n7.\t Gateways\nIntent:\t To create a strong architectural statement to enhance way-\nfinding, create visual interest and activity in the public realm, \nand enhance street corners to signify one’s arrival into the \ndistrict or an important intersection.\nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nB.\t Support a Mixed-use Community\n\t\n\t\nC.\t Provide Pedestrian and Transit Orientation\n\t\n\t\nD.\t Create Active Streetscapes\n\t\n\t\nF.\t Integrate Public Amenities and Green Spaces\n\t\n\t\nH.\t Promote High Quality Design\nTable 4.1250.B.7: Civic Neighborhood Gateways\nMajor Gateways include:\nMinor Gateways include:\n•\t\nBurnside and Eastman, and\n•\t\nDivision and Eastman.\n•\t\nWallula and Burnside,\n•\t\nCivic and Burnside,\n•\t\nCivic and Division, and\n•\t\nWallula and Division.\nDesign Guidelines\nSee Table 4.1250.B.7\nAll Development\nG1.\t Locate a prominent entry in close \nproximity to a gateway corner. \nG2.\t Gateways shall visually frame or \ndirectly link to nearby areas of \ninterest.\nG3.\t Gateways shall take advantage of \nopportunities to showcase sustainable \nfeatures such as green walls, use of \nsalvaged or recycled materials, and \nunique stormwater treatments.\nDesign Standards:\nSee Table 4.1250.B.7\nAll Development \nS1.\t Locate the building’s primary entry within 10 ft. of the corner \nof the building at a major or minor gateway. \nS2.\t Gateways shall frame or directly connect to other areas of \ninterest, including, but not limited to, trails, open spaces, \nparks, view points, etc.\nS3.\t Gateways shall provide one visible element with sustainability \nattributes such as rain gardens, green walls, commercial \ngrade solar powered lights or equipment, pervious paving, \nor other elements as determined by the Manager or Design \nCommission. \nFig. B.7: Gateway corner with hinged building profile \nand public open space element.\nFig. B.7.S4.b: Gateway with enhanced building transparency and higher bays at \ncorner.\nFig. B.7.S4.a: Gateway corner with curved building \nprofile and expressive canopies.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 94,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 94\n(06/22)\nDesign Guidelines\nAll Development, Continued\nG4.\t Development at all gateways shall:\na.\t Create a strong architectural \nstatement at gateway locations to \nhelp create a strong identity; and\nb.\t Use highly crafted materials for \nlighting, paving, bollards, and \nother streetscape elements or \ncivic art pieces to accentuate \nthe appearance of public spaces, \nentrances, and building form at all \ngateways; and\nc.\t Major gateways shall include \nenhanced treatments and greater \nprominence than minor gateways.\n \nG5.\t Development at major gateways shall \nprovide significant public space with \nhigh quality pedestrian amenities.\na.\t Gateway public spaces shall \ninclude pedestrian amenities as \nrequired per 4.1250(A)(5)(S3) for \npublic open spaces.\nDesign Standards\nAll Development, Continued\nS4.\t Developments at minor gateways shall incorporate at least \nthree features at the gateway corner from the following list:\n\t\nDevelopment at major gateways shall incorporate a minimum \nof four features at the gateway corner from the following list:\na.\t Major entrance: double doors, large overhang, recessed \nentry\nb.\t Tower forms: minimum of one-third additional height to \nground-level floor\nc.\t Oversized windows: at least one-third larger pane than the \nrest of the ground level-facade windows\nd.\t Expressive canopies: colors, materials, and/or patterns \ndistinctive from the rest of the building\ne.\t Higher bays: minimum 18 ft.\nf.\t\nPlaza: minimum 300 sq. ft. \ng.\t High quality pedestrian amenities including, at a minimum, \nseating, landscaped area(s) with trees, pedestrian scaled \nlighting fixtures, and either decorative paving or a public \nart feature\nh.\t One of the features from Diagram 4.1250.B.7.S4 Gateway \nBuilding Corner Profiles or an alternative approved by the \nManager or Design Commission\nS5.\t Major Gateways. Developments at major gateway locations \nshall provide a minimum 200 sq. ft. public space at the corner. \na.\t Gateway public spaces shall include pedestrian amenities  \nas required per 4.1250(A)(5)(S3) for public open spaces.\nb.\t Gateway public spaces may be used to meet the public \nopen space requirement of 4.1250(A)(5)(S4) if the \napplicable public open space standards for the space are \nmet.\n7.\t Gateways, Continued\nDiagram 4.1250.B.7.S4: Gateway Building Corner Profiles\nCurved\nBeveled\nMitred\nHinged\nProjected\nRecessed\nFig. B.7.S4.c: Gateway corner with tower element.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 95,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 95\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\nDesign Guidelines:\nSee Table 4.1250.B.8\nAll Development \nG1.\t Materials:\na.\t The predominant building \nmaterial(s) shall be high quality, \ndurable, and attractive.\nb.\t The predominant building \nmaterial(s) may be complimented \nwith other secondary materials \nwhich may not be appropriate on \nlarge areas of the facade.\nc.\t Accent materials, which would \ngenerally not be acceptable on \nlarge areas of the facade, may be \nused in limited areas of the facade \nto highlight architectural features.\nG2.\t The 4.1250(B)(8)(S2) standard shall be \nmet.\n8.\t Materials\nIntent:\t To promote the use of high quality, durable, and attractive \nmaterials that exhibit a sense of permanence and contribute \nto the aesthetic quality of the development and to the urban \ndesign fabric of the community.\nKey Civic Neighborhood Design Principles:\n\t\n\t\nA.\t Reflect Neighborhood Identity\n\t\n\t\nG.\t Utilize Sustainable Development Practices\n\t\n\t\nH.\t Promote High Quality Design\nExisting Development: If renovations include facade modifications, \nmodified sections shall comply with this section. If \napplication of the standards would create an incongruous \nappearance of existing and new materials, the Manager or \nDesign Commission may waive this requirement as long as \nmaterials identified as prohibited in Table 4.1250.B.8 are not \nused.\nDesign Standards\nSee Table 4.1250.B.8\nAll Development \nS1.\t Materials:\na.\t Buildings shall utilize primary materials for no less than 65 \npercent of each building facade areas.\nb.\t Secondary materials are prohibited as primary cladding on \nbuilding facades and shall not be allowed on more than 35 \npercent of each building facade area.\nc.\t Accent materials are permitted on no greater than 5 \npercent of each facade as trims or accents (e.g. flashing, \nprojecting features, ornamentation, etc.).\nS2.\t Materials identified as prohibited in Table 4.1250.B.8 shall not \nbe used.\nFig. B.8: Buildings shall use high quality, durable \nmaterials.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 96,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n4.1250 Design Guidelines and Standards\nB. Building Design\n[4.1200] - 96\n(06/22)\nTable 4.1250.B.8: Primary, Secondary, Accent and Prohibited \nMaterials\nP:  Primary Material\nS:  Secondary Material\nA: Accent Material\nN: Prohibited Material or\n     Prohibited Fencing Type\nMaterial\nCommercial, Indus­\ntrial, Institutional,  \nor Mixed-Use\nMultifamily and \nTownhouse \nBrick (full dimensional)\nP\nP\nStone/masonry1\nP\nP\nStucco2\nP\nP\nGlass (transparent, spandrel)\nP\nP\nFinished wood, wood veneers, and wood siding\nP\nP\nFactory or naturally finished flat, profiled, \nfluted, or ribbed metal3 panels\nP\nP\nFiber reinforced cement siding and panels\nS\nP\nConcrete blocks with integral color (ground, \npolished, or glazed finishes)\nS\nS\nConcrete (poured in place or precast)\nS\nS\nCeramic tile\nS\nS\nStanding seam metal3\nS\nS\nOther material as approved by the Manager or \nDesign Commission\nP/S\nP/S\nGlass block\nA\nP\nConcrete blocks with integral color (split face \nfinish)\nA\nA\nCorrugated metal\nA\nA\nVegetated wall panels or trellises\nA\nA\nVinyl siding\nN\nN\nT-111 Plywood\nN\nN\nExterior Insulation Finishing System (EIFS)\nN\nN\nPlastic or vinyl fencing\nN\nN\nChain link fencing\nN\nN\nTable 4.1250.B.8 Notes: \n 1 Stone shall be natural, not manufactured or panelized, and shall have \nsufficient depth to clearly project beyond adjacent wall planes, such as \nwith the use of full bed depth stone.\n2 See Section 3.0103 definition for more information on Stucco application \nrequirements.\n3 Metals shall be of a size, thickness and detailing that will remain free of \nvisual defects and visual distortion such as oil canning, ski sloping, and \nshadowing.\n8.\t Materials, Continued\nFig. B.8.S1.b: Brick and glass are used as primary \nmaterials.\nFig. B.8.S1.a: Finished wood, glass, and fiber \nreinforced cement siding panels are used as primary \nmaterials on this multifamily building.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 97,
      "text": "City of Gresham Development Code\nCivic Neighborhood \nPlan District Design Manual\n[4.1200] - 97\n4.1250 Design Guidelines and Standards\nB. Building Design\n(06/22)\nDesign Standards\nAll Development, Continued\nS3.\t Fencing materials shall be durable, maintainable and \nattractive. Fencing materials identified as prohibited in Table \n4.1250.B.8 shall not be used. \nS4.\t The Development Permit Applicant or Appointed \nRepresentative shall provide documentation specifying one of \nthe following:\na.\t A minimum of 20 percent of building materials contain, \nin aggregate, a minimum weighted average of 20 percent \npost consumer recycled content materials such as \naluminum, glass, or recycled paper;\nb.\t A minimum of 20 percent of building materials are \nmanufactured regionally within a radius of 500 miles of \nthe site;\nc.\t A minimum of 5 percent of the building materials consist \nof rapidly renewable materials which include materials \nthat can be planted and harvested within 10 years; or\nd.\t A minimum of 20 percent of wood based materials are \ncertified in accordance with the Forest Stewardship \nCouncil (FSC) and have been used in construction.\nFig. B.8.S1.c: Finished wood, finished metal, and glass are used as primary \nmaterials.\nDesign Guidelines\nAll Development, Continued\nG3.\t The 4.1250(B)(8)(S3) standard shall be \nmet.\nG4.\t Sustainable building materials, such \nas those which reduce the impacts \nresulting from the extraction of new \nmaterials, shall be used for a portion \nof the project.\n8.\t Materials, Continued\nFig. B.8.S3.a: Fencing materials shall be durable, \nmaintainable, and attractive.\nFig. B.8.S3.b: Fencing materials shall be durable, \nmaintainable, and attractive.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.280483",
  "extractor_version": "1.0.0"
}