{
  "metadata": {
    "filename": "dc-section-5.0300.pdf_id7846",
    "extracted_at": "2025-05-22T06:15:22.967524",
    "num_pages": 10,
    "title": "DC Section 5.0300",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220615153948-07'00'",
    "modification_date": "D:20220615154008-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[5.03]-1 \nCity of Gresham Development Code \n \n(6/22) \n \nSECTION 5.0300 \nHISTORIC AND CULTURAL LANDMARKS  \nOVERLAY DISTRICT \n5.0310 General \n5.0311 \nPurpose \n5.0312 \nCoordination with Other Regulations \n5.0313 \nApplicability \n5.0314 \nPermitted Uses \n5.0320 Identification and Designation \n5.0321 \nRequirements for the Historic Resources Inventory \n5.0322 \nDesignation of Historic or Cultural Landmarks \n5.0323 \nChange in Status or for Removal of Historic or Cultural Landmark Designation \n5.0324 \nHistoric and Cultural Landmarks List \n5.0330 Development Requirements \n5.0331 \nNon-Conforming Landmark Structures and Signs \n5.0332 \nReconstruction of Class 1 Landmarks \n5.0333 \nRelocation or Exterior Alterations of Landmarks \n5.0334  \nDemolition of Landmark Buildings \n5.0335 \nDemolition or Relocation of National Register Resources \n5.0336 \nActions Affecting Landmark Objects \n5.0340 Archaeological Resources and Sites North of Interstate 84 \n5.0341 \nPurpose \n5.0342 \nSites North of Interstate 84 \n5.0343 \nProtection of Archaeological Resources \n5.0310 General \n5.0311 Purpose  \nThe purpose of the Historic and Cultural Landmarks Overlay District is to identify resources which have been \ndesignated as landmarks on the Historic and Cultural Landmarks List, adopted as an appendix to the Community \nDevelopment Plan. Parcels on which a landmark is located shall be designated HL on the Community \nDevelopment Special Purpose District Map. It is also the purpose of this district to regulate certain actions \naffecting these landmarks with the intent of substantially protecting and preserving those characteristics which \nmake the landmark a visible link to the heritage of the community and enhance the quality of life for all \nresidents of Gresham.  It is also the purpose of this section to have a process for adding and removing a \nlandmark to/from the Historic and Cultural Landmarks List. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[5.03]-2 \nCity of Gresham Development Code \n \n(6/22) \n \n5.0312 Coordination with Other Regulations \nA. \nThe requirements of this overlay apply in addition to other applicable National Register of \nHistoric Places requirements. \nB. \nExcept as provided below, where the provisions of this overlay conflict with comparable \nprovisions of the Gresham Community Development Code, the standards of this overlay will \ngovern. \n5.0313 Applicability \nA.  Except as exempted below the regulations of this chapter apply to properties listed in Table \n5.0324 and sites north of Interstate 84. \nB.  \nThe following activities are exempt from the regulations of this overlay: \n1. Land divisions (including middle housing land divisions) involving sites containing \nlandmarks determined by the Manager to not impact the distinguishing characteristics of a \nhistoric landmark (as described in either the designation application or National Register \nnomination). \n2. The conversion of landmarks into middle housing when no exterior changes will be made to \nthe building and when determined by the Manager that there is no impact to the \ndistinguishing characteristics (other than use) of a historic landmark (as described in either \nthe designation application or National Register nomination). \n3. Alterations to sites (including construction, demolition, and tree removal) containing \nlandmarks when said alterations are determined by the Manager to not impact the \ndistinguishing characteristics of a historic landmark (as described in either the designation \napplication or National Register nomination). \n5.0314  Permitted Uses  \nA. \nUses permitted in the HL Overlay District shall be those listed as permitted in the underlying district \ndesignated on the Community Development Plan Map for the site. \n5.0320  Identification and Designation \n5.0321 Requirements for Historic Resources Inventory \nThe Historic Resources Inventory Report (1987) lists, describes and determined the historical significance of \n238 sites, buildings and objects within the city. A number of these resources were found to be historically \nsignificant. These were placed on the Historic and Cultural Landmarks List and protected with the Historic and \nCultural Landmarks Overlay District. The following requirements apply to inventories of historic resources: \nA. \nBefore the City commences future inventory studies/updates, it shall provide a public notice describing \nthe inventory and its purposes and invite public participation, especially from property owners in the \narea affected by the inventory. The notice shall be published in the local newspaper at least 10 days \nbefore an inventory update begins. \nB. \nInventory documents, including survey sheets, shall be maintained, periodically updated as needed, and \naccessible to the public for viewing.  \nC. \nInventory documents and processes shall be compatible with the practices of the State Historic \nPreservation Office for maintaining the Oregon Inventory of Historic Sites. \nD. \nRecords concerning archaeological sites shall not be made available to the public, except to the extent \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[5.03]-3 \nCity of Gresham Development Code \n \n(6/22) \n \nnecessary to comply with State open records laws. \nE. \nProperties listed in the inventory are not subject to the standards of the Historic and Cultural Landmarks \nDistrict unless they are also listed on the Historic and Cultural Landmarks List. \n5.0322 Designation of Historic and Cultural Landmarks  \nA. \nCriteria for Designation. The Historic Resources Subcommittee may recommend to the Council the \ndesignation of resources as historic or cultural landmarks. Resources designated as landmarks shall be \nincluded in the Historic and Cultural Landmarks List, adopted as an appendix to the Gresham \nCommunity Development Code, and shall be indicated on the Community Development Plan Map with \nan HL overlay district designation. A resource may be designated a historic or cultural landmark upon \nfinding that at least one of the following criteria is satisfied: \n1. \nThe resource possesses significance in the history of Gresham, Multnomah County, the State of \nOregon, or the nation as evidenced by: \na. Association with the lives of persons holding a significant place in the history of the \ncommunity; or \nb. Association with significant past events, trends, or values that may be either cultural, \neconomic, social, or political. \n2. \nThe resource possesses architectural significance as evidenced by: \na. Embodiment of the distinctive characteristics of a type, period, or method of construction; or \nb. Development of the resource early in the sequence of local history; or \nc. Rarity of the resource type in the area; or \nd. Retention of the integrity of the original design of the resource. \n3. \nThe resource is representative of the work of a designer, architect, or master builder who \ninfluenced the development and appearance of Gresham, the State of Oregon, or the nation. \n4. \nA resource has yielded, or may be likely to yield, information important in prehistory or history. \nB. \nProcedure for Designation. Designation of a site, structure, or object as a historic or cultural landmark \nmay be proposed by the owner, by the Historic Resources Subcommittee, by the Planning Commission, \nor by the Council. A proposal for landmark designation shall first be considered by the Subcommittee. \nThe Subcommittee shall recommend approval, approval with modifications, or denial of the proposed \nlandmarks designation, and shall make its recommendation based on findings made in response to the \ncriteria of Section 5.0322(A). The recommendation and all findings shall be transmitted to the City \nCouncil and the proposal shall be processed under the Type IV procedure. \n1. \nIn acting to approve or approve with modifications a proposed landmarks designation, findings \nshall be made as to the location and quality of the resource and any conflicting uses that might \naffect the resource. Based on such consideration, the Council shall act to include the resource on \nthe Historic and Cultural Landmarks List as a Class 1 or a Class 2 landmark. \n2. \nWhen designation of a Class 1 or Class 2 landmark occurs by action of the Council, the parcel on \nwhich the landmark is located shall be indicated on the Community Development Plan Map as \nbeing in the HL district. However, for purposes of applying provisions of Section 5.0321, 5.0322, \nand 5.0323 of the Community Development Code, only the specific site, structure or object \ndesignated on the List shall be considered to be the landmark, and other structures, uses and \nimprovements on the parcel shall not be subject to those provisions.  \n3.  \nThe City shall notify property owners at three-year intervals by first class mail of the existence of \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[5.03]-4 \nCity of Gresham Development Code \n \n(6/22) \n \na Class 1 or Class 2 landmark on their property. The notice shall include a copy of the Section \n5.0300 landmark regulations. \n4. \nIf during the procedure for adding a property to the Historic and Cultural Landmarks List, the \nproperty owner submits oral or written testimony in the record objecting to its addition, it shall not \nbe added to the List. \na. No permit for the demolition or modification of a property removed from consideration for \ndesignation under this section shall be issued during the 120-day period following the date of \nthe property owner’s refusal to consent. \n5. \nProperties that have been placed on the National Register of Historic Places: \na. Shall be designated with the Historic and Cultural Landmarks Overlay District; and \nb. Are automatically eligible to be added to the Historic and Cultural Landmarks List. With the \nproperty owner’s consent, this may be done by the Manager under a Type I procedure. \nFindings pursuant to the criteria of Section 5.0322(A) are not necessary. \n5.0323  Change in Status or Removal of Historic or Cultural Landmark Designation  \nA. \nCriteria for Removal of Historic or Cultural Landmark Designation \n1. \nThe City shall remove a property from the Historic and Cultural Landmarks List if the designation \nwas imposed on the property by the City, and the owner at the time of designation has retained \nownership since the time of the designation, and requests that the local government remove the \nproperty from the resource list, and: \na. Can demonstrate that the owner objected to the designation on the public record, or \nb. Was not provided an opportunity to object to the designation. \n2. \nExcept as provided in Section 5.0323(A)(1) above, the City may only remove a resource from \nthe Historic and Cultural Landmarks List if: \n \na. The resource has lost the qualities for which it was originally recognized; or \nb. Additional information shows that the resource no longer satisfies the criteria for \nrecognition as a historic resource or did not satisfy the criteria for recognition as a historic \nresource at the time of listing; or \nc. The local building official declares that the resource poses a clear and immediate hazard to \npublic safety and must be demolished to abate the unsafe condition. \nB. \nProcedure for Change in Status or Removal of Historic or Cultural Landmark Designation \n1. \nIf the property owner has retained ownership since the time of designation and wishes to \nremove a landmark designation per 5.0323(A)(1), the application will be processed under the \nType I procedure, findings under Section 5.0322(A) are not required. \n2. \nRemoval, entirely or in part, of landmark designation from a landmark resource per \n5.0323(A)(2)(a) or (b) or, with consent of the owner, a change in the status of a landmark as a \nClass 1 or Class 2 landmark may be proposed by the owner of the landmark, by the Historic \nResources Subcommittee, by the Planning Commission, or by the Council. The proposal will be \nprovided to the Historic Resources Subcommittee which may recommend to the Manager \napproval, approval with modifications, or denial of the proposed removal of landmark \ndesignation or change in status, and shall make its recommendation based on findings made in \nresponse to the criteria of Section 5.0322(A). The proposal shall be processed under the Type II \nprocedure. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[5.03]-5 \nCity of Gresham Development Code \n \n(6/22) \n \n3. \nRemoval, entirely or in part, of landmark designation from a landmark resource per \n5.0323(A)(2)(c) may be proposed by the owner of the landmark, by the Manager, by the \nHistoric Resources Subcommittee, by the Planning Commission, or by the Council. The \nManager may remove the designation under the Type I procedure. \n4. \nWhen landmark designation is removed from a resource, or a landmark’s status is changed as a \nClass 1 or Class 2 landmark, the Community Development Plan Map and the Historic and \nCultural Landmarks List shall be revised accordingly. \n5. \nIf a property owner has submitted an application for a change in Status or Removal of Historic \nor Cultural Landmark Designation per Section 5.0323(A)(1) or 5.0323(A)(2)(a)-(b), an \napplication for demolition of the structure or to alter the exterior of the structure cannot be \nsubmitted until the delisting application is resolved. \n5.0324  Historic and Cultural Landmark List  \nTable 5.0324 lists those historic resources that have been found to be significant and which are protected with \nthe Historic and Cultural Landmarks Overlay District. \n \nTable 5.0324 HISTORIC AND CULTURAL LANDMARKS LIST \nClass 1 Landmarks \nAddress \nName \nPoints \nUse \nNational \nRegister \n17111 NE Sandy \nZimmerman House \n100 \nInstitutional \nYes \n410 N. Main \nCarnegie Library \n95 \nInstitutional \nYes \n1304 E. Powell \nWilliam Gedamke House \n90 \nCommercial \nYes  \n722 NE 162nd  \nThe Louise Home \n90 \nInstitutional \nYes \n1420 SE Roberts \nAnderson House \n85 \nResidential \nYes \n3680 SW Towle \nHeiney House \n85 \nResidential \n \n765 SW Walters Road \nOlson, Charles & Fae House \n \nResidential \nYes \n938 SE Roberts \nBernard Witter Residence \n85 \nResidential \n \n330 W. Powell \nW. Gresham Grade School \n80 \nInstitutional \n \n140 SE Roberts \nRev. Thompson Residence \n80 \nResidential \n \n1325 W. Powell \nJ. R. Elkhorn Ranch \n75 \nResidential \n \n43 NW Ava \nW. K. Hamilton Residence \n70 \nResidential \n \n307 NE Kelly \nFreeman Property \n75 \nResidential \n \n1229 W. Powell \nDr. Hughes Residence \n65 \nResidential \nYes \n1265 SE Roberts \nJudge Stapleton House \n80 \nResidential \n \n3655 SE Powell \nPeterson Residence  \n80 \nResidential \n \n611 NW Wallula \nFred Honey House \n75 \nResidential \n \n31 NW 11th \nLunceford Residence \n80 \nResidential \n \n53 NW 12th \nWalker Residence \n80 \nResidential \n \n54 NW 12th \nAldrich/Bliss House \n80 \nResidential \n \n1801 NE 201st \nLowitt Estate \n70 \nResidential \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[5.03]-6 \nCity of Gresham Development Code \n \n(6/22) \n \n2202 SW Pleasant View Giese House, Workshop & Cellar \n50 \nResidential \n \n720 NW Division \nVanDoninck House \n \nResidential \n \n42 NW Wilson Ave. \nMoen House \n \nResidential \n \n2075 SE Palmblad \nOtt House \n \nResidential \nYes \n1322 SE 282nd \nHamlin-Johnson House \n \nResidential \nYes \n525 NW Overlook Ave. Paul E. and Miriam R. Emerick \nHouse \n \nResidential \n \n477 NW Overlook Ave. Amundsen House \n \nResidential \nYes \nClass 2 Landmarks \nAddress \nName \nPoints \nUse \nNational \nRegister \n103 W. Powell \nUS Post Office \n85 \nInstitutional \n \n122 N. Main \nDuane C. Ely Building \n75 \nCommercial \n \n58 W. Powell \nGresham Masonic Lodge #152 \n75 \nInstitutional \n \n19720 SE Stark \n11-Mile marker \n75 \nObject \n \n23500 SE Stark \n13-Mile Marker \n75 \nObject \n \n25700 SE Stark \n14-Mile Marker \n75 \nObject \n \n1-84 & NE 169th \nPioneer Grave \n75 \nObject \n \n18706 E. Burnside \nSatellite Restaurant Sign \n70 \nObject \n \n101-117 N. Main \nCongdon Building \n60 \nCommercial \n \nSource:  Gresham Historic and Cultural Resources Inventory (1990), 93-32-CPA, and Gresham \nComprehensive Plan Map \n \n5.0330 Development Regulations \n5.0331  Non-Conforming Landmark Structures and Signs  \nA. \nDimensional standards relating to site development, including minimum lot size, minimum yard \nsetbacks, and maximum building height shall be as specified for the underlying Plan Map District \ndesignation. However, landmark structures which are non-conforming as to setbacks or building height, \nand for which reconstruction of damaged or deteriorated portions is proposed, may be reconstructed to \nmatch dimensions existing prior to the damage or deterioration. \nB. \nNon-conforming landmark signs, or non-conforming signs that are attached to a landmark structure, \nmay be retained and shall not be subject to provisions of Section A6.080 concerning removal or \nalteration of non-conforming signs. \n5.0332  Reconstruction of Class 1 Landmarks   \nA. \nReconstruction of a Class 1 landmark which has been accidentally damaged or destroyed may be \npermitted by the Manager without review by the Historic Resources Subcommittee or the Hearings \nOfficer when plans submitted by the owner clearly indicate that the structure will be reconstructed to \nmatch its appearance prior to the accident. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[5.03]-7 \nCity of Gresham Development Code \n \n(6/22) \n \n5.0333  Relocation of Exterior Alterations of Landmarks  \nA. \nAn application for relocation of a Class 1 Landmark or for work that would affect the exterior \nappearance of a Class 1 landmark shall be reviewed by the Historic Resources Subcommittee and by the \nHearings Officer. The Historic Resources Subcommittee shall act to recommend approval, approval \nwith modifications, or denial of the proposed action, and shall make its recommendation based on \nfindings made in response to the criteria of Sections 5.0321 or 5.0322 or 5.0323 of the Community \nDevelopment Code. The recommendation and all findings shall be transmitted to the Hearings Officer \nand the proposal shall be processed under the Type III procedure. \n \nA proposed alteration shall be approved or approved with modifications only upon finding conformance \nwith the following standards: \n1. \nThe historic character of a property shall be retained and preserved. The relocation of distinctive \nmaterials or alteration of features, spaces, and spatial relationships shall be avoided. \n2. \nA property shall be recognized as a physical record of its time, place and use. Changes that create \na false sense of historical development, such as adding, conjectural features or elements from \nother historic properties, shall not be undertaken. \n3. \nChanges to a property that have acquired historic significance in their own right shall be retained \nand preserved. \n4. \nDistinctive materials, features, finishes, and construction techniques or examples of craftsmanship \nthat characterize a property shall be preserved. \n5. \nDeteriorated historic features shall be repaired rather than replaced. Where the severity of \ndeterioration requires replacement of a distinctive feature, the new feature shall match the old in \ndesign, color, texture, and where possible, materials. Replacement of missing features shall be \nsubstantiated by documentary and physical evidence. \n6. \nNew additions, exterior alterations, or related new construction shall not destroy historic \nmaterials, features, and spatial relationships that characterize the property. The new work shall be \ndifferentiated from the old and shall be compatible with the historic materials, features, size, scale \nand proportion, and massing to protect the integrity of the property and its environment. \n7. \nNew additions and adjacent or related new construction shall be undertaken in such a manner that, \nif removed in the future, the essential form and integrity of the historic property and its \nenvironment would be unimpaired. \n8. \nChemical and physical treatments, if appropriate, shall be undertaken using the gentlest means \npossible. Treatments that cause damage to historic materials shall not be used. \n9. \nA property shall be used as it was historically or be given a new use that requires minimal change \nto its distinctive materials, features, spaces, and spatial relationships. \n10. \nArchaeological resources shall be protected and preserved in place. If such resources must be \ndisturbed, mitigation measures shall be undertaken. \n5.0334 Demolition of Landmark Buildings  \nA. \nAn application for demolition affecting a Class 1 or a Class 2 landmark shall be reviewed by the \nHistoric Resources Subcommittee and by the Hearings Officer. The Historic Resources Subcommittee \nshall act to recommend approval, approval with modifications, denial, or delay the proposed demolition \nfor a period of up to 180 days from the time of the Subcommittee’s initial consideration of the proposal. \nThe review may consider the following factors: condition, historic integrity, age, historic significance, \nvalue to the community, economic consequences, design or construction rarity, and consistency with \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[5.03]-8 \nCity of Gresham Development Code \n \n(6/22) \n \nand consideration of other policy objectives in the comprehensive plan. The recommendation and all \nfindings shall be transmitted to the Hearings Officer and the proposal shall be processed under the Type \nIII procedure. \n \nIn delaying issuance of a demolition permit, it must be found that such delay would result in a genuine \neffort which would have a reasonable chance of success to preserve the building, and that: \n1. \n The resource is of such architectural, historic, or scenic interest that its demolition would be \ndetrimental to the public interest; or \n2. \nThe resource is of such interest or significance that it is or could be included in the National \nRegister of Historic Places; or \n3. \nThe resource has such unusual design, texture, or material characteristics that it could not be \nreproduced, or could be reproduced only with great difficulty or expense; or \n4. \nRetention of the resource would aid substantially in the preservation of another landmark resource \nof in preservation of the character of the adjacent area. \nB. \nNon-contributing accessory structures, which have not acquired historic significance, are not required to \nfollow the 5.0334(A) review procedures.  \nC. \nWhen action is taken to approve a proposed demolition as proposed or as modified under Section \n5.0334(A), a demolition permit shall be withheld pending expiration of the appeal period specified in \nSection 11.1100. \n1. \nUpon completion of the demolition, the resource shall be removed (entirely or in part) from the \nHistoric and Cultural Landmark List. \n5.0335  Demolition or Relocation of National Register Resources  \nA. \nAn application for demolition or relocation of a National Register Resource (which is not also a Class 1 \nLandmark) shall be reviewed by the Historic Resources Subcommittee and by the Hearings Officer. The \nSubcommittee shall act to recommend approval, approval with modifications, denial, or delay of the \nproposed demolition or relocation for a period of up to 180 days from the time of the Subcommittee’s \ninitial consideration of the proposal. The review shall consider the following factors: condition, historic \nintegrity, age, historic significance, value to the community, economic consequences, design or \nconstruction rarity, and consistency with and consideration or other policy objectives in the \ncomprehensive plan. The recommendation and all findings shall be transmitted to the Hearings Officer \nand the proposal shall be processed under the Type III procedure.  \n1. \nNon-contributing accessory structures, which have not acquired historic significance, are not \nrequired to follow the 5.0335(A) review procedures. \n2. \nIn delaying issuance of a demolition permit, findings shall be made in response to the criteria of \nSection 5.0334(A)(1)-(4). \n3. \nWhen action is taken to approve a proposed demolition, a demolition permit shall be withheld \npending expiration of the appeal period specified in Section 11.1100. \n5.0336 Actions Affecting Landmark Objects  \nProposed alterations affecting a non-building landmark, such as a monument, mile-post, or other object, shall be \nsubmitted to the Historic Resources Subcommittee and the Hearings Officer for review and approval prior to \nsuch alteration, pursuant to Sections 5.0333 and 5.0334. In addition to alterations and actions requiring a \nbuilding permit, provisions of this section shall apply to proposals to remove, relocate, or otherwise alter the \noutward appearance of the object. A decision on a proposed alteration or other action affecting a landmark \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n[5.03]-9 \nCity of Gresham Development Code \n \n(6/22) \n \nobject shall be based on the following criteria: \nA. \nWhenever possible, the object shall remain on the same parcel where it was located at the time of its \ndesignation as a landmark. Relocation to another parcel may be permitted when reliable evidence is \nsubmitted indicating that the object’s original location was on a parcel other than its current location. \nB.  \nAlterations or other actions which maintain or increase the visibility of the object shall be encouraged. \n5.0340 Archaeological Resources and Sites North of Interstate 84 \n5.0341  Purpose \nArchaeological resources must be protected and preserved in place subject to the requirements of federal, state, \nand local regulations, including the guidelines administered by the Oregon State Historic Preservation Office \n(SHPO) and ORS 358.905-358.962. \nA person may not excavate, injure, destroy, or alter an archaeological site or object, or remove an archaeological \nobject located on public or private lands unless that activity is authorized by a permit issued under ORS \n390.235; a violation of this is subject to a misdemeanor. Sites containing Native American human remains, \nsacred objects, and Objects of Cultural Patrimony are protected under ORS 97.740; a violation of this subject is \na felony. \n5.0342  Sites North of Interstate 84 \nIn addition to specific landmark resource objects and sites identified in the Inventory of Historic and Cultural \nLandmarks, all property within the City lying north of Interstate Highway No. 84 shall be designated as a \nHistoric and Cultural Landmarks Overlay District due to the likelihood of discovering archaeological sites and \nobjects in this area. Within this area, the Section 5.0343 provisions shall apply to development activities when \narchaeological sites or objects are discovered. \n5.0343  Protection of Archaeological Resources \nThe following provisions shall apply to all development activities city-wide when archaeological sites or objects \nare discovered: \nA. \nWhen an archaeological site or object is discovered during the course of any development activity, \ndevelopment activity on the site shall be immediately suspended, and the property owner or his agent, \nemployees, or contractors on the site shall notify the Manager. \nB. \nFollowing receipt of notice of discovery of an archaeological site or object, the Manager shall order all \ndevelopment activity on the site to be halted until the site can be assessed. \nC. \nThe property owner shall retain the services of a qualified archaeologist to investigate the site, and \nprepare a report assessing the nature and significance of the site and any objects discovered. Pending \ncompletion of this investigation and report, all development activity on the site shall be suspended. The \narchaeologist will complete a report of their investigation and assessment, which shall include the \nfollowing items: \n1. \nA description of the nature and significance of artifacts or other evidence of prehistoric activities \ndiscovered on the site, approximate boundaries of the archaeological site, and an analysis of the \nquality and quantity of the site and objects discovered. \n2. \nRecommendation as to site eligibility and whether the pending development activity should \nproceed as proposed, proceed with limitations or modifications, or continue to be suspended \npending further study and/or mitigation.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": " \n[5.03]-10 \nCity of Gresham Development Code \n \n(6/22) \n \nD. \nThe archaeologist’s report and recommendations shall be submitted to the State Historic Preservation \nOffice (SHPO) for concurrence before ground disturbing activities may be allowed to proceed. \nE.  \nWithin five days after discovery of an archaeological site or object, the property owner shall furnish \nwritten notice, describing the location of the site and the nature of the items discovered, to the following \nparties: \n1. \nDepartment of Land Conservation and Development; \n2. \nState Historic Preservation Office; \n3. \nCommission on Indian Services; \n4. \nOregon State Police (if discovery includes human remains); \n5. \nThe Confederated Tribes of Grand Ronde; \n6. \nThe Confederated Tribes of Siletz Indians; \n7. \nThe Confederated Tribes of the Warm Springs Indian Reservation; and \n8. \nThe Confederated Tribes and Bands of the Yakama Nation. \nA copy of the mailed notice and address list, and a signed and notarized affidavit for the mailed notice \nshall be submitted to the Manager to demonstrate compliance with this section. \nF. \nIf the Manager finds, based on evidence presented in the archaeologist’s report, that the archaeological \nsite lacks significance (not eligible), and SHPO concurs with the Manager’s determination, the Manager \nshall permit the suspended development activity to resume in conformance with the development \npermits issued by the City, and subject to conformance with applicable state statues regarding \narchaeological sites and objects. \nG. \nIf the Manager determines, based on evidence presented in the archaeologist’s report, that the \narchaeological site is significant  and that some degree of protection is warranted, and SHPO concurs \nwith the Manager’s determination, the Manager, after consultation with SHPO, shall make findings as to \nmeasures which may be required such that adverse impacts to archaeological sites are avoided, \nminimized, or if not possible, mitigated. Such measures may include any of the following alternatives: \n1. \nRedesigning the proposed development so it would avoid the archaeological site; \n2. \nLeaving the archaeological site in its natural condition; \n3. \nBurial or other non-destructive covering of the archaeological site; or \n4. \nWhere effects to the archaeological site cannot be avoided, mitigation measures based on \nconsultation with SHPO and in compliance with applicable State regulations, including any \nadditional permitting necessary. \nAn amended development permit may be required prior to the resumption of development activity on \nthis site. \nH. \nAn application for an amended development permit which may be required under Section 5.0340 shall \nbe submitted and processed under the same procedure as for the development activity which was in \nprogress at the time of discovery of the archaeological site or object. \nI.  \nNo provisions of this section shall relieve an applicant or landowner of any relevant State or Federal \nstatute or responsibility. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.968200",
  "extractor_version": "1.0.0"
}