{
  "metadata": {
    "filename": "dc-section-7.0000.pdf_id7855",
    "extracted_at": "2025-05-22T06:15:25.208017",
    "num_pages": 9,
    "title": "DC Section 7.0000",
    "author": "Andrew Parish",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.58",
    "creation_date": "D:20230105100433-08'00'",
    "modification_date": "D:20230105100450-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "Section 7.0000 Purpose and Authority (6/2022) \nPage 7.00-1 \nARTICLE 7 DESIGN REVIEW \nSection 7.0000 \nPurpose and Authority  \nTABLE OF CONTENTS \n7.0001 Purpose \n7.0002 General \n7.0003 Applications \n7.0004 Phased Design Review \n7.0005 Models in the Downtown Plan Area \n7.0001 PURPOSE \nDesign Review examines most residential, commercial, industrial and institutional developments and \ndevelopments in Design Districts for compliance with the design criteria of the Community Development \nCode. \n7.0002 GENERAL \nA. The scope of Design Review reviews the proposed use, the exterior of the buildings, structures, and \nother development and the site on which the buildings, structures, and other development is located. \nB. All Design Review requests shall comply with all applicable standards in the Community Development \nCode.  Development which only affects a portion of a site shall conform with the applicable standards \nfor that portion of the site where development is proposed.  Where Nonconforming development exists \non part of a site (not being re-developed) compliance with the Standards applicable to Non-Conforming \nDevelopments in Section 8.0200 is required unless otherwise noted. \nC. In mixed-use projects, the standards and criteria for each component use as described in Section \n7.0100, Section 7.0200, Section 7.0300, Section 7.0400, and Section 7.0500 shall apply to the review of \neach component of the mixed-use proposal. \nD. Uses exempt from Design Review include: \n1. Single detached dwellings, duplexes, triplexes, quadplexes, townhouses, and cottage clusters in the \nLDR-GB, LDR-7, LDR-5, TR, TLDR, MDR-12, MDR-24, OFR, DRL-1, DRL-2, VLDR-SW, LDR-SW, THR-SW, \nLDR-PV, MDR-PV, and HDR-PV districts, as well as the areas of CMF along the NE Glisan and NE \n162nd Avenue corridors. \n2. Duplexes, triplexes, and quadplexes in the CMU district and the areas of CMF not along the NE \nGlisan and NE 162nd Avenue corridors.  \n3. Accessory dwellings \n4. Minor basic utilities \n5. Portable classrooms \n6. Co-located antennas for a wireless communications facility \n7. Renewable energy systems except that the following standards discussing mechanical equipment \nplacement and screening apply: \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (01/2023) \nPage 7.02-2 \na. 4.1151(A)(1)(C)(13) and (25) \nb. 4.1151(A)(1)(D)(13) and (25) \nc. 4.1151(B)(2)(C)(1) and (2) \nd. 4.1151(B)(2)(D)(1) and (2) \ne. 4.1250(B)(4)(G2) \nf. 4.1250(B)(4)(S1) and (G1) \ng. 4.1250(B)(4)(S7) and (G7) \nh. 4.1250(B)(7)(S3) and (G3) \ni. \n4.1428(G)(11) \nj. \n4.1528(G)(9) \nk. 4.1568(B)(15) \nl. \n7.0103(B)(4)(G1) and (S1) \nm. 7.0103(B)(4)(G3) and (S3) \nn. 7.0103(B)(4)(G4) and (S4)(c)  \no. 7.0103(B)(4)(G10) and (S10) \np. 7.0310(Q) \nq. 7.0432(M)(2), (3), and (4) \nr. 7.0503(B)(4)(G1) and (G2) \ns. 7.0503(B)(4)(S1) and (S2) \nt. 7.0503(A)(6)(G2) and 7.0503(A)(6)(S2) \nu. 7.0503(B)(4)(G3) and 7.0503(B)(4)(S3)(b) \n8. Structures under 200 square feet not visible from a public place. \n9. Conversions of hotels and motels to emergency shelters or affordable housing under Section \n10.0420. \nE. Exemption from Design Review does not exempt a development from meeting other relevant standards \nwithin the Community Development Code including but not limited to: district standards, transit \nstandards, non-conforming development standards, and public facilities standards. \nF. In Design Districts where standards and guidelines have been established, two tracks are available for \ndesign review. Under the clear and objective track, applications are evaluated using design standards.  \nUnder the discretionary track, applications are evaluated using design guidelines. \n7.0003 APPLICATIONS \nAn application for Design Review is subject to the highest possible level of review, given the thresholds for \ndifferent reviews described below.  Design Review A is the lowest level Design Review; Design Review E is \nthe highest level.  For uses not listed in Table 7.0003, the Manager shall determine which level of Design \nReview is appropriate. \nWhen there is a conflict in the noted Design Review permit types, the more restrictive shall apply. \nFor exemptions and exceptions see Section 7.0002, Section 8.0220 Changes to Nonconforming Uses and \nDevelopment, the applicability statements in individual design review district sections, and Section 11.0200 \nInitiation and Classification of Applications. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (01/2023) \nPage 7.02-3 \nTable 7.0003 Design Review Categories \nA. DESIGN REVIEW A (DR-A) \n1.  Process \nType I, reviewed with the building permit as applicable. \n2.  Conditions \na. Developments in Design Districts use only clear and objective standards  \n3.  Types1 \nThe Design Review may include the following development types: \na.  All Districts: \ni. Changes in primary use when the proposed use is not listed as Limited or \nSpecial Use Review \nii. Interior tenant improvements \niii. Additions or alterations to canopies, awnings, or other mounted structures \nto an existing facade or roof \niv. Addition, elimination, or change in window or door locations \nv. New floor area, or floor area additions, of no more than 1,000 sq. ft. \nvi. New outdoor areas, or outdoor area additions, of no more than 1,000 sq. \nft. \nvii. New structures without floor area, or additions to structures without floor \narea, of no more than 1,000 sq. ft. in size and not visible from a public \nplace \nviii. Accessory Dwellings meeting the standards of Section 10.0100 and located \nwithin the existing primary home  \nix. New parking lots and parking lot additions that do not include the use of \nthe provisions in 9.0853(D – G) or 9.0854 \nb.  Design Districts:  \ni. New floor area, or floor area additions, of no more than 1,000 sq. ft., and \nadding less than 50 ft. of building frontage on a street. \nii. Accessory structures of no more than 1,000 sq. ft., and adding less than 50 \nft. of building frontage on a street. \niii. Changes to facades of one-story buildings no more than 160 ft. in width \niv. Facade changes of any scale proposing only a change in materials, where \nthe proposed materials meet the clear and objective standards and do not \ninclude the use of metal siding \nv. Structures under 200 sq. ft. visible from a public place.  \nc.  DCC, DMU, DTM, DRL-1, DRL-2, CNRM:  \ni. Accessory Dwellings of no more than 750 sq. ft. \nd.  Downtown Districts:  \ni. Duplexes \nB.  DESIGN REVIEW B (DR-B) \n1.  Process \nType I application. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (01/2023) \nPage 7.02-4 \n2.  Conditions \na. Thresholds of DR-A exceeded  \nb. Not located in a Design District \nc. No new development on a vacant site \nd. The primary use is not proposed to change \ne. Existing parking, landscaping, and buffering requirements met \nf. Existing public facilities adequate \ng. No new residential units proposed \n3.  Types1 \nThe Design Review may include the following development types: \na. Industrial Use: \ni. Floor area additions over 1,000 sq. ft. and not exceeding 25,000 sq. ft. or \n25 percent of the existing floor area on the entire site, whichever is less. \nii. Outdoor area additions over 1,000 sq. ft. and not exceeding 25,000 sq. ft. \nor 25 percent of the existing outdoor area of the entire site, whichever is \nless. \nb. Non-Industrial Use: \ni. Floor area additions over 1,000 sq. ft. and not exceeding 10,000 sq. ft. or \n25 percent of the existing floor area of the entire site, whichever is less. \nii. Outdoor area additions over 1,000 sq. ft. and not exceeding 10,000 sq. ft. \nor 25 percent of the existing outdoor area of the entire site, whichever is \nless. \nC.  DESIGN REVIEW C (DR-C) \n1.  Process \nType II application.   \nPre-application meetings required only for development described in \n7.0003(C)(3)(b) and (c) below. \nNo Neighborhood Meeting required. \n2.  Conditions \na. Thresholds of DR-A and/or DR-B exceeded  \nb. In non-design districts no new floor area or outdoor use area is proposed \nc. Development in Design Districts use no more than three discretionary \nguidelines \n3.  Types1  \nThe Design Review may include the following development types: \na.  All Districts: \ni. A change in primary use when the proposed use is listed as Limited  \nii. Change to public facility requirements \niii. Changes to buffers including alternate buffers \niv. New driveway access \nv. Change in landscaping requirements \nvi. New parking lots and parking lot additions using the provisions in 9.0853(D \n– G) or 9.0854 \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (01/2023) \nPage 7.02-5 \nb.  Design Districts: \ni. Structures under 200 sq. ft. visible from a public place \nii. Addition of no more than 50 ft. of building frontage along a street \niii. Exterior facade changes \niv. New structures or additions with a total of no more than 2,000 sq. ft. of \nfloor area \nvii. New structures or additions without floor area of no more than 2,000 sq. \nft. in area.  \nviii. New outdoor areas or additions to outdoor areas exceeding those allowed \nin DR-A and DR-B \nc.  Downtown Districts:  \ni. Duplexes exceeding the thresholds of DR-A \nD. DESIGN REVIEW D (DR-D) \n1.  Process \nType II application.  \nPre-application Meeting required.  \nNeighborhood Meeting required unless otherwise noted. \n2.  Conditions \na. Thresholds of DR-A through DR-C exceeded  \nb. DR-E threshold not met \nc. Developments in Design Districts use no more than three discretionary \nguidelines  \n3.  Types1  \nThe Design Review may include the following development types: \na. All Districts: \ni. Multifamily residential; \nii. Townhouse; \niii. Manufactured dwelling parks; \niv. Commercial; \nv. Mixed Use; \nvi. Institutional Use; or \nvii. Parking garages. \nb. Industrial Districts:  \ni. \nUses not requiring a Neighborhood Meeting: \n1. Industrial Office \n2. Information Services \n3. Manufacturing \n4. Trade Schools \n5. Transportation/Distribution \n6. Warehousing/Storage \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (01/2023) \nPage 7.02-6 \nii. \nUses requiring a Neighborhood Meeting: \n1. Construction \n2. Exclusive Heavy Industrial \n3. Miscellaneous Industrial \n4. Waste Management \n5. Wholesale Trade \nc. Design Districts:  \ni. \nDevelopments exceeding the thresholds of DR-C and not subject to a DR-\nE. \nE.  DESIGN REVIEW E (DR-E) \n1.  Process \nType III application with Design Commission hearing.   \nPre-application and Neighborhood Meeting required. \n2.  Conditions \na. Design Districts only \nb. Thresholds of DR-A through DR-D exceeded \n3.  Types1 \nThe Design Review may include one of the following development types: \na.  Design Districts: \ni. Any other development, regardless of size, using more than three \ndiscretionary guidelines. \nTable Notes \n1. If another application is submitted for additional area of the same type less than 12 months \nafter any previous application submittals, the total area increase for all applications within that \n12-month period must be added together to determine the appropriate level of review. \n7.0004 PHASED DESIGN REVIEW \nA. Purpose:  The purpose of a Phased Design Review is to review and approve a specific design proposal for \na site that is achieved over a longer time horizon than what is typical without having to go through a \nnew design review for future phases.   \nB. Time Scope:  The Manager may authorize a time schedule for developing the various phases in periods \nof time in excess of two years, but in no case shall the total time period for all stages exceed seven \nyears.  Each stage shall conform to the applicable requirements of the Code.  \nC. When Modifications are Required:  Modifications may be required to portions of a Phased Design \nReview developed after the passage of one year to comply with change(s) in the Community \nDevelopment Code. Modifications are not required for components of the site approved and developed \nunder previous approvals. \nD. How Modifications are Reviewed:  A modification to a Phased Design Review to meet new Code \nstandards shall be reviewed through the highest applicable Design Review procedure specified in \nSection 7.0000. However, modifications are not subject to a pre-application conference or an early \nneighborhood meeting. Modifications must meet standards in the Development Code, unless meeting \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (01/2023) \nPage 7.02-7 \nstandards requires the removal of improvements approved and developed made under previous \napprovals. \nE. If a phased development or subdivision is proposed or developed for townhouses in the RTC, SC, CMF \n(except those areas along the NE Glisan and NE 162nd Avenue corridors), or CMU districts, each phase \nshall comply with all applicable Design Review requirements. \n7.0005 MODELS IN THE DOWNTOWN PLAN AREA \nA. For proposals that were approved through the design review process in the area shown on Figure \n7.0005, a three-dimensional, basswood (or similar material as approved by the Manager) model of the \napproved proposal is required for new developments or for existing buildings where expansion will \nincrease the building footprint by more than 50 percent. \nB. The three-dimensional model of the proposal as approved must be submitted to be placed in the City’s \nDowntown model prior to the issuance of a building permit. \nC. The scale of the model must be 1 inch equals 50 feet. \nD. The model requirements will be waived if the application does not involve a change in the bulk of \nbuildings on a site for which the City possesses an accurate model. \n(Figure 7.0005 follows) \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0200 General Design Standards (01/2023) \nPage 7.02-8 \nFigure 7.0005 \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": "Section 7.0100 Corridor Design District (6/2022) \nPage 7.01-1 \nSection 7.0100 \nCorridor Design District \n \nSection 7.0100 Corridor Design District is contained in a separate document \nentitled Section 7.0100 \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.208403",
  "extractor_version": "1.0.0"
}