{
  "metadata": {
    "filename": "dc-section-11.0300.pdf_id7889",
    "extracted_at": "2025-05-22T06:15:25.228185",
    "num_pages": 2,
    "title": "DC Section 11.0300",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.39",
    "creation_date": "D:20241015162300-07'00'",
    "modification_date": "D:20241018132459-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[11.03]-1 \nCity of Gresham Development Code \n \n(07/24) \nSECTION 11.0300 \nTYPE I MINISTERIAL PROCEDURES \n11.0300  Type I Ministerial Procedures \n11.0301  General Description \n11.0302  Type I Procedures \n \n11.0300 \nType I Ministerial Procedures \n11.0301  General Description \nType I applications involve permitted uses or development governed by clear and objective approval criteria or \ncriteria that require the exercise of professional judgment only about technical issues.  The Type I procedure \nprovides for a ministerial review of an application by the Manager and does not include public notice.  \nThe following are Type I applications:  \n• \nThose identified in this Code as Type I applications;  \n• \nThose identified in Table 11.0204 as Type I applications; or \n• \nThose identified by the Manager as Type I applications, based on the guidelines for classification of \napplications by procedure in Section 11.0203.  \n11.0302  Type I Procedures \nA. \nPre-Application Conference.  A pre-application conference is not required for Type I applications.  \nB. \nNeighborhood Meeting.  A neighborhood meeting is not required for Type I applications.  \nC. \nType I Application Requirements  \n1. \nType I applications shall be made on forms provided by the Manager and shall include all of the \ninformation required by Section 11.0900.   \n2. \nType I applications shall:  \na. \nInclude the information requested on the application form; \nb. \nInclude the information requested in a submittal checklist, if any;  \nc. \nAddress the relevant criteria in sufficient detail for review and action; and  \nd. \nBe accompanied by the required fee.   \n3. \nType I applications are subject to completeness review procedures set forth in Section 11.0903.  \nD. \nType I Public Notice.  A public notice is not required for Type I applications.  \nE. \nType I Decision Authority.   \n1. \nThe decision authority for all Type I applications shall be the Manager.  \n2. \nThe Manager shall approve, approve with conditions, or deny an application subject to a Type I \nprocedure within approximately 45 days after the application was determined to be complete.   \nF. \nType I Notice of Decision.  Written notice of the decision for Type I applications shall be mailed to the \napplicant and property owner of record and shall include the following information: \n1. \nA brief summary of proposal and the application which is the subject of the decision;  \n2. \nA description of the site reasonably sufficient to inform the reader of its location, including site \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[11.03]-2 \nCity of Gresham Development Code \n \n(07/24) \naddress, if available, map and tax lot number, and site zoning;  \n3. \nA statement of the facts upon which the Manager relied to determine whether the application \nsatisfied or failed to satisfy each applicable approval criterion;  \n4. \nThe decision to approve or deny the application, and, if approved, any conditions of approval \nnecessary to ensure compliance with the applicable criteria; and \n5. \nA statement that the decision is final, unless a Notice of Appeal is filed within twelve (12) \ncalendar days of the notice of decision, or, in the case of weekends and holidays, by the end of \nthe next business day.  The notice shall state in boldface type the date and time by which an \nappeal must be filed.  The statement shall describe the requirements for filing an appeal of the \ndecision.  \nG. \nAppeal of a Type I Decision \n1. \nThe applicant may appeal a Type I decision by filing a Notice of Appeal within twelve (12) \ncalendar days of the date the Notice of Decision was mailed, or, in the case of weekends and \nholidays, by the end of the next business day. Appeal authorities are identified in Table 11.0204. \n2. \nAppeal requirements and procedures are outlined in Section 11.1100. \n3. \nThe written decision of the appeal authority with regard to any appeal of a Type I ministerial \ndecision is the final local decision.  \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.228328",
  "extractor_version": "1.0.0"
}