{
  "metadata": {
    "filename": "dc-section-11.0400.pdf_id7890",
    "extracted_at": "2025-05-22T06:15:25.451392",
    "num_pages": 4,
    "title": "DC Section 11.0400",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.39",
    "creation_date": "D:20241015162625-07'00'",
    "modification_date": "D:20241018132609-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[11.04]-1 \nCity of Gresham Development Code \n \n(07/24) \nSECTION 11.0400 \nTYPE II ADMINISTRATIVE PROCEDURES \n11.0400  Type II Administrative Procedures \n11.0401  General Description \n11.0402  Type II Procedures \n \n11.0400 \nType II Administrative Procedures \n11.0401  General Description \nType II applications involve uses or development for which review criteria are reasonably objective, requiring \nonly limited discretion.  Impacts on nearby properties may be associated with these uses which may necessitate \nimposition of specific conditions of approval to minimize those impacts or ensure compliance with this code.  \nThe Type II procedure provides for an administrative review of an application by the Manager or Design \nCommission and the process includes notice to nearby property owners to allow for public comments prior to \nthe decision.  The process does not include a public hearing unless the decision is appealed.  \nThe following are Type II applications:  \n• \nThose identified in this code as Type II applications;  \n• \nThose identified in Table 11.0204 as Type II applications; or  \n• \nThose identified by the Manager as Type II applications, based on the guidelines for classification of \napplications by procedure in Section 11.0203.  \n11.0402  Type II Procedures   \nA. \nPre-Application Conference and Optional Design Commission Consult \n1. \nTable 11.0204 identifies all Type II applications that require a pre-application conference.  \n2. \nPre-application conference procedures are included in Section 11.0700. \n3. \nThe Optional Design Consult procedures for those projects within a Design District are described \nin Section 11.0700. \nB. \nNeighborhood Meeting \n1. \nA neighborhood meeting is required for those Type II applications which require a pre-\napplication conference, as indicated in Table 11.0204, except as otherwise noted, including \nindustrial uses identified in Section 7.0003 and DR-C reviews as noted in Section 7.0003.  \n2. \nNeighborhood meeting procedures are included in Section 11.0800. \nC. \nType II Application Requirements \n1. \nType II applications shall be made on forms provided by the Manager and shall include all of the \ninformation required by Section 11.0900. \n2. \nType II applications shall:  \na. \nInclude the information requested on the application form; \nb. \nInclude the information requested in a submittal checklist, if any;  \nc. \nAddress the relevant criteria in sufficient detail for review and action; and  \nd. \nBe accompanied by the required fee.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[11.04]-2 \nCity of Gresham Development Code \n \n(07/24) \nD. \nType II Public Notice  \n1. \nExcept as provided for in Subsection (2) below, within approximately ten (10) calendar days \nafter the application has been determined to be complete, written notice of the Type II application \nshall be mailed to:  \na. \nThe applicant and/or authorized representative; and \nb. \nThe owner(s) of record of the subject property; and \nc. \nAny City-recognized neighborhood association whose boundaries include or are within \n300 feet of the subject property; and the Presidents and Land Use Chairs of all City-\nrecognized neighborhood associations when the development is proposed in the GBSV \nDistrict; and \nd. \nOwners of record within three hundred (300) feet of the perimeter of the subject \nproperty and owners of record within five hundred (500) feet of the perimeter of the \nsubject property when the development is proposed in the GBSV District; and \ne. \nAffected city departments and any governmental agency which is entitled to notice \nunder an intergovernmental agreement with the City which includes provision for such \nnotice or is otherwise entitled to such notice. Such departments and agencies may \nrequest up to a 15-day extension to their comment period if the application involves \nunusual circumstances.  The department or agency is assumed to have no comments if \nno comments are received within the specified time period. \n2. \nNotice of industrial uses that are reviewed under Section 7.0003 shall be provided as follows: \na. \nWithin two business days of receiving an application, the City will mail notice of an \napplication submittal to the President and Land Use Chair of any city-recognized \nneighborhood associations whose boundaries include or are within 300 feet of a site \nwith a proposed industrial review. This notice shall include a copy of the Development \nPermit Application cover sheet and plans. \nb. \nWithin two business days of an application being submitted, notice of application shall \nbe posted on the site. The Manager shall determine the number and locations of signs \nand issue posting instructions. There shall be at least one sign per frontage posted in a \nconspicuous place visible from the street. The sign shall include the case file number, \ntelephone number where city staff can be contacted for more information about the \napplication, and a webpage (if available) to review a proposed project description and \nsite plan. The sign shall be posted for 30 calendar days or until the 14-day public \ncomment period poster is placed on the property as per Section 11.0402(D)(5), \nwhichever comes first. \nc. \nWithin three business days of determining the application to be complete, notice will be \nmailed to the parties described in Subsection (1) above.  \n3. \nThe purpose of the public notice is to provide nearby property owners and other interested parties \nwith an opportunity to submit written comments concerning the application prior to issuance of \nthe Type II Administrative Decision.  The goal of this notice is to invite relevant parties of \ninterest to participate in the process.   \n4. \nThe written notice of the pending Type II application shall:  \na. \nProvide fourteen (14) calendar days from the date of notice for submission of written \ncomments prior to issuance of a decision on the Type II application; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[11.04]-3 \nCity of Gresham Development Code \n \n(07/24) \nb. \nState that issues which may provide the basis for an appeal to the Land Use Board of \nAppeals shall be raised in writing prior to the expiration of the comment period.  Issues \nshall be raised with sufficient specificity to enable the Manager to respond to the issue; \nc. \nList, by commonly used code citation, the applicable criteria for the decision;  \nd. \nThe case file number; \ne. \nSet forth the street address or other easily understood geographical reference to the \nsubject property;  \nf. \nState the place, date, and time that comments are due; \ng. \nState that all evidence relied upon by the applicant is available for review, and that \ncopies can be obtained at cost; \nh. \nInclude the name and phone number of the city representative to contact for additional \ninformation;   \ni. \nBriefly summarize the decision making process for the Type II application being \nconsidered; and \nj. \nInclude the following notice: “Notice to mortgagee, lienholder, vendor or seller:  The \nGresham Development Code requires that if you receive this notice it shall be promptly \nforwarded to the purchaser.”   \n5. \nWithin 10 calendar days after the application has been determined to be complete, notice of the \napplication shall be posted on the site by the applicant, except for industrial uses described in \nSection 7.0003, in which notice shall be posted within three business days.  The Manager shall \nprovide at least one (1) sign and the instructions for posting.  The sign shall be posted in a \nconspicuous place visible from the street.  For properties that abut more than one improved street, \nseparate signs shall be posted facing each improved street.  The sign shall include the case file \nnumber and the telephone number where city staff can be contacted for more information about \nthe application.  An affidavit of posting shall be submitted by the applicant and made part of the \nadministrative record.  \nE. \nType II Decision Authority  \n1. \nThe decision authority for Type II applications shall be the Manager.  In the case of Design \nDistricts, the Design Commission may operate as the decision authority under the clear and \nobjective standards once in place. \n2. \nThe decision authority shall review all written comments received prior to or on the comment \nclosing date and the applicant’s response to the comments, if any. The decision authority may \nalso consider responses to questions by staff which clarify or amplify information but which do \nnot change the original request.  Written comments received after the comment period and prior \nto issuance of a decision shall not be considered by the decision authority.  \n3. \nThe decision authority shall approve, approve with conditions, or deny an application subject to a \nType II procedure after the close of the public comment period and within 60 calendar days after \nthe application was determined to be complete.  For industrial reviews as described in Section \n7.0003, this decision shall be made within 30 calendar days after the application was determined \nto be complete. \nF. \nType II Notice of Decision \n1. \nUpon signing the decision for a Type II application, a Notice of Decision shall be sent by mail to:  \na. \nThe applicant and/or authorized representative;  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[11.04]-4 \nCity of Gresham Development Code \n \n(07/24) \nb. \nThe owner(s) of record of the subject property; \nc. \nAny group or individual who submitted written comments during the comment period;  \nd. \nAny governmental agency which is entitled to notice under an intergovernmental \nagreement with the City which includes provision for such notice or is otherwise \nentitled to such notice; and \ne. \nAny group or individual who requested notice of the decision.  \n2. \nThe written decision shall include:  \na. \nThe case file number; \nb.  \nThe nature of the application in sufficient detail to apprise persons entitled to notice of \nthe applicant’s proposal and of the decision;   \nc. \nA description of the site reasonably sufficient to inform the reader of its location, \nincluding site address, if available, map and tax lot number, and site zoning;  \nd. \nA statement of the facts upon which the decision authority relied to determine whether \nthe application satisfied or failed to satisfy each applicable approval criterion;  \ne. \nThe decision to approve or deny the application, and, if approved, any conditions of \napproval necessary to ensure compliance with the applicable criteria;  \nf. \nThe date the decision shall become final, unless appealed within twelve (12) calendar \ndays of the notice of decision, or, in the case of weekends and holidays, by the end of \nthe next business day.  The notice of decision shall state in boldface type the date and \ntime by which an appeal must be filed.  The statement shall describe the requirements \nfor filing an appeal of the decision; and \ng. \nA statement that the complete case file, including findings, conclusions and conditions \nof approval, if any, is available for review.  The notice shall list when and where the \ncase file is available and the name and telephone number of the City representative to \ncontact about reviewing the case file.  \nG. \nAppeal of a Type II Decision \n1. \nThe Type II administrative decision may be appealed by the applicant and any person providing \nwritten comments during the 14-day comment period by filing a notice of appeal within twelve \n(12) calendar days of the date the notice of decision was mailed, or, in the case of weekends and \nholidays, by the end of the next business day.  Appeal authorities are identified in Table 11.0204.   \n2. \nAppeal requirements and procedures are outlined in Section 11.1100.  \n3. \nThe decision of the appeal authority with regard to any appeal of a Type II administrative \ndecision is the final decision of the City.  Any further appeal shall be to the Land Use Board of \nAppeals (LUBA).   \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.451595",
  "extractor_version": "1.0.0"
}