{
  "metadata": {
    "filename": "dc-section-10.1700.pdf_id14988",
    "extracted_at": "2025-05-22T06:15:23.036309",
    "num_pages": 4,
    "title": "DC Section 10.1700",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.58",
    "creation_date": "D:20230111111616-08'00'",
    "modification_date": "D:20230111111636-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.17]-1 \nCity of Gresham Development Code \n \n(01/23) \nSECTION 10.1700 \nAFFORDABLE HOUSING DEVELOPMENT \nTABLE OF CONTENTS  \nGeneral \n10.1701  Purpose \n10.1702  Applicability \n10.1703  Coordination with Other Regulations \nStandards \n10.1711  Review Criteria and Standards \nProcess \n10.1721  Procedures \nGENERAL \n10.1701 PURPOSE \nThe purpose of this section is to expand options for the development of income restricted housing. It describes \nqualifying affordability terms and specifies the applicable standards and procedures. This section also \nauthorizes density and height bonuses in land use districts that permit residential use(s) (ORS 197.308). \n10.1702 APPLICABILITY \nThis section shall apply to all affordable housing development throughout the City unless exempted in Section \n10.1703. \n10.1703 COORDINATION WITH OTHER REGULATIONS \nA. This section does not apply to property in the Floodplain Overlay District, Highly Sloped Subareas, and the \nNatural Resource Overlay. \nB. Section 10.1100 Shoreline Height Standards does not apply to affordable housing development under this \nsection. \nSTANDARDS \n10.1711 REVIEW CRITERIA AND STANDARDS \nA. Each unit on the property shall be made available to own or rent to families with incomes of 80% or less of \nthe area median income, or the average of all units on the property shall be made available to families \nwith incomes of 60% or less of the area median income. Area median income shall be determined by the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.17]-2 \nCity of Gresham Development Code \n \n(01/23) \nOregon Housing Stability Council based on information from the United States Department of Housing and \nUrban Development (ORS 458.610). \nB. The affordability shall be enforceable by an affordable housing covenant (ORS 456.270 to 456.295), for a \nduration of no less than 30 years.  \nC. Affordable housing may take the form of any residential use, including but not limited to townhouses, \nmultifamily, and cottage clusters. When a residential use is only permitted in land use districts under the \naffordable housing provisions, such as multifamily in GI, the application shall be subject to: \n1. The development standards for the land use district in which the property is located. \n2. Section 7.0000 Design Review, unless exempted in Section 7.0002(D).  \n3. The design standards in Table 10.1711(A).  \nTABLE 10.1711(A): Review Standards for Residential Uses Allowed Only as Affordable Housing \nProposed Residential Use \nLocation \nApplicable Design Standard \nManufactured Dwelling Park \nIn all locations \n7.0410 Manufactured Dwelling Park \nDesign Standards  \nSingle Detached Dwelling \nIn all locations \n7.0420 Design Standards for Single \nDetached Dwellings, Duplexes, \nTriplexes, and Quadplexes \nDuplexes, Triplex, and \nQuadplex  \nIn the Downtown Plan District \nand the Rockwood Design \nDistrict \n7.0100 Corridor Design District Design \nGuidelines and Standards \nDuplexes, Triplex, and \nQuadplex  \nIn all locations, except the \nDowntown Plan District and the \nRockwood Design District \n7.0420 Design Standards for Single \nDetached Dwellings, Duplexes, \nTriplexes, and Quadplexes \nCottage Cluster \nIn all locations \n7.0440 Cottage Cluster Design \nStandards \nTownhouse  \nIn a Design District \nThe design standards applicable to \ntownhouses in that design district \n \nTownhouse  \nNot in a Design District \n7.0432 Corridor District Townhouse \nDesign Standards \n \nMultifamily  \nIn a Design District \nThe design standards applicable to \nmultifamily in that design district \n \nMultifamily  \nNot in a Design District \n7.0100 Corridor Design District Design \nGuidelines and Standards \n \n4. Where the code does not define standards for a residential use in a land use district, the Manager shall \ndetermine which standards are appropriate. \nD. Affordable housing shall be permitted on public parks and open spaces. \nE. Residential uses not permitted in the LDR-5, LDR-7, TR, TLDR, MDR-12, MDR-24, LDR-PV, VLDR-SW and \nLDR- SW districts shall be permitted as affordable housing when the housing is owned by a public body \n(ORS 174.109) or a nonprofit corporation that is owned by a religious corporation. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[10.17]-3 \nCity of Gresham Development Code \n \n(01/23) \nF. Affordable housing in the IND-SW land use districts shall be permitted on property owned by a public body \nand adjacent to property where residential uses or school uses are permitted. \nG. Affordable housing in the GI district shall be permitted: \n1. On property owned by a public body and adjacent to property where residential uses or school uses \nare permitted, or \n2. When an applicant demonstrates that the title for the parcel(s) where the facility is to be developed \nwas held by the governing body for the applicant as of April 2, 2009. \nH. Affordable housing in the LDR-5, LDR-7, TLDR, TR, MDR-12, MDR-24, OFR, RTC, SC, SC-RJ, CMU, CMF, CC, \nMC, DCC, DMU, DTM, DEM, DRL-1, DRL-2, DCL, CNTH, CNTM, CNRM, LDR-PV, MDR-PV, HDR-PV, TC-PV, NC-\nPV, MUE- PV, VLDR- SW, LDR-SW, THR- SW, VC-SW districts is permitted a density and height bonus based \non the maximum density of the property and the residential use, as applicable, (Table 10.1711(B)). \nTable 10.1711(B): Affordable Housing Density and Height Bonus \nProperty Maximum Density \nDensity Bonus \nHeight Bonus \n16 units per acre or fewer \n200% \n12 feet \n16.1 to 45 units per acre \n150% \n24 feet \n45.1 units per acre or more \n125% \n                     36 feet \nThe following exceptions and modifications to the development standards apply: \n1. When determining the maximum net density of a property, the proposed residential use shall be \nconsidered in residential districts. Affordable housing on properties in the LDR-5, LDR-7, TR, TLDR, \nMDR-12, MDR-24, OFR, LDR-PV, MDR-PV, HDR-PV, VLDR-SW, LDR-SW, and THR-SW districts shall use \nthe maximum net density under “All other uses” on the applicable development standards table to \ndetermine the maximum net density.  \n2. Minimum net density does not apply. \n3. Affordable housing applications on properties subject to Section 7.0420(F) Rear Lot Provisions or \nSection 9.0610 Height Transition Standards, may add the applicable height bonus in Table 10.1711(B) \nto the maximum building height described in Section 7.0420(F) or Section 9.0610. \nPROCESS \n10.1721 PROCEDURES \nA. An application, including an application for a residential use only allowed in a land use district as affordable \nhousing, shall be subject to the procedure type specified in Table 11.0204. An application for affordable \nhousing development is not a unique application type. \nB. The applicant shall submit a statement with the development permit application describing how the \napplication shall meet the applicable income restrictions, terms, and ownership standards in Section \n10.1711. The statement shall be signed by the housing and property owner(s).  \nC. Prior to building permit issuance, the applicant shall submit an affordable housing covenant recorded by \nthe County recorder, which demonstrates: \n1. \nEach unit on the property shall be made available to own or rent to families with incomes of 80% or \nless of the area median income or the average of all units on the property shall be made available to families \nwith incomes of 60% or less of the area median income. Area median income shall be determined by the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[10.17]-4 \nCity of Gresham Development Code \n \n(01/23) \nOregon Housing Stability Council based on information from the United States Department of Housing and \nUrban Development (ORS 458.610). \n2. \nThe affordability shall be enforceable by an affordable housing covenant (ORS 456.270 to 456.295), for \na duration of no less than 30 years. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.036517",
  "extractor_version": "1.0.0"
}