{
  "metadata": {
    "filename": "dc-section-10.0100.pdf_id7874",
    "extracted_at": "2025-05-22T06:15:25.542362",
    "num_pages": 4,
    "title": "DC Section 10.0100",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615195350-07'00'",
    "modification_date": "D:20220615195410-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.01]-1 \nCity of Gresham Development Code \n \n(06/22) \n \nARTICLE 10 \nSUPPLEMENTARY DEVELOPMENT REGULATIONS \nSECTION 10.0100  ACCESSORY DWELLINGS \nGeneral \n10.0101  Purpose and Applicability  \nStandards \n10.0110  Standards  \nProcess \n10.0120  Review Procedures for an Accessory Dwelling \nGeneral \n10.0101  Purpose and Applicability \nThe purpose of this section is to allow for establishment of an accessory dwelling unit in conjunction with a \nsingle detached dwelling or townhouse.  An accessory dwelling may be permitted as a means of providing more \nhousing opportunities.   \nA. \nA proposed Accessory Dwelling need not comply with Appendix 5.000 of the Community \nDevelopment Code, except as required to serve the site of the proposed accessory dwelling. \nB. \nA proposed Accessory Dwelling is not subject to the standards of Section 10.0200 and its square \nfootage is not included as part of the size limitations of accessory residential structures. \nC. \nAccessory Dwelling units do not count toward density requirements in LDR-5, LDR-7, TR, TLDR, \nLDR-PV, VLDR-SW and LDR-SW. Accessory Dwelling units count toward minimum density but not \nmaximum density requirements in all other districts. \nStandards \n10.0110  Standards \nThe Manager shall approve an application for not more than one accessory dwelling per existing primary single \ndetached dwelling or townhouse if the applicant shows compliance with the following criteria and standards: \nA. \nAccessory Dwellings shall be located on the same lot as an existing single detached dwelling or \ntownhouse.   \nB. \nAccessory Dwellings may be freestanding, located either within or added to a single detached dwelling \nor townhouse; over or attached to a garage; or over or attached to a garage or single detached dwelling \nor townhouse which is under construction. The Accessory Dwelling shall be occupied no sooner than \nthe primary dwelling. \nC. \nAccessory Dwellings shall be consistent with the applicable setback, height and lot coverage standards \nof the land use district; in the case of non-conforming single detached dwelling or townhouse, the LDR-\n7 setbacks and height requirements shall apply to the proposed Accessory Dwelling. \nD. \nThe Accessory Dwelling shall be closer in distance to the primary on-site single detached dwelling than \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.01]-2 \nCity of Gresham Development Code \n \n(06/22) \n \nto any single detached dwellings on abutting lots. \nE. \nThere shall be a minimum 6’ separation between Accessory Dwellings and all other structures on the \nsite. \nF. \nFreestanding Accessory Dwellings shall not exceed the height of the existing primary dwelling and may \nnot be located in front of the primary dwelling. In the case of corner lots, the Accessory Dwelling shall \nbe no closer to the side street than the primary dwelling. \nBuilding Standards   \nG. \nAn Accessory Dwelling attached to a single detached dwelling shall not result in any new door entrance \non an exterior wall facing a front yard property line. \nH. \nMaximum Floor Area: \n1. \nAttached: \na. An Accessory Dwelling shall have a maximum floor area of 900 square feet if attached to or \nincluded within a primary dwelling or built over a garage. \nb. When attached to the side or back of a freestanding garage, the combined total square footage \nof the garage and Accessory Dwelling shall not exceed 750 square feet or 50% of the size of \nthe total square footage of the occupiable space of the primary dwelling, whichever is less. \n2. \nFreestanding: \na. Free-standing Accessory Dwelling units shall have a maximum floor area of 750 square feet \nand shall not exceed 50% of the size of the total square footage of the occupiable space of the \nprimary home, whichever is less. \nb. Freestanding Accessory Dwellings in the DCC, DMU, DTM, DRL-1, DRL-2 and CNRM \ndistricts are limited to no more than 750 square feet. \n \nI. \nThe exterior of the proposed Accessory Dwelling unit shall meet the following standards. \n1. \nExterior finish materials shall: \na. Be the same as or visually match in type, size and placement, the exterior finish material of \nthe on-site primary dwelling, or \nb. Be comprised of wood, composite boards, cement fiber, or factory finished metals in a shingle \nor horizontal clapboard pattern. \n2. \nRoof pitch shall: \na. Be the same as the predominant roof pitch of the on-site primary home, or \nb. Be at least 6/12. \n3. \nWindow and door trim shall: \na. Be of the same type, size, and location as that used on the on-site primary home, or \nb. Be at least 3-1/2 inches wide \n4. \nWindows shall: \na. Match those on the street facing façade of the on-site primary home in orientation, or  \nb. Be square, vertical or horizontal in orientation. \n5. \nEaves shall: \na. Have the same projection distance as the on-site primary home, or \nb. Project at least one foot from the building walls. \nJ. \nAll Accessory Dwellings shall conform with the Oregon Residential Specialty Code. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[10.01]-3 \nCity of Gresham Development Code \n \n(06/22) \n \nUse Standards \n \nK. \nAccessory Dwellings are not allowed for short-term rentals (Section 8.0113 of the Development Code). \nProcess \n10.0120  Review Procedures for an Accessory Dwelling \nA. \nAn application for an accessory dwelling shall be reviewed by the Manager under the Type I procedure \nwhen: \n1. \nThe Accessory Dwelling is proposed to be located within an existing single detached dwelling, or \n2. \nThe Accessory Dwelling is located in the DCC, DMU, DTM, DRL-1, DRL-2 and CNRM \nDistricts. \nB. \nIn all other circumstances, the Type II Process will be applied. \nC. \nAccessory Dwellings are subject to the standards in Section 10.0120. If these criteria cannot be met, the \napplication will also be subject to the Variance criteria outlined in Section 11.1500. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.542691",
  "extractor_version": "1.0.0"
}