{
  "metadata": {
    "filename": "dc-section-11.0100.pdf_id7887",
    "extracted_at": "2025-05-22T06:15:23.756117",
    "num_pages": 6,
    "title": "DC Section 11.0100",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.39",
    "creation_date": "D:20241015162138-07'00'",
    "modification_date": "D:20241018132331-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "[11.01]-1 \nCity of Gresham Development Code \n \n(07/24) \nARTICLE 11 PROCEDURES \nSECTION 11.0100 \nDEVELOPMENT PERMIT REQUIREMENTS \n11.0100  Development Permit Requirements \n11.0101  Development Permit Required \n11.0102  Exclusions from Development Permit \n11.0103  Issuance and Effective Date of Development Permit \n11.0104  Development Permit Conditions of Approval and Modifications of Approvals \n11.0105  Expiration of Development Permit \n11.0106  Extension of Development Permit \n11.0107  Application for Staff Interpretation  \n11.0108  Modifications to Approved DR-E Applications  \n \n11.0100 \nDevelopment Permit Requirements \n11.0101  Development Permit Required \nA. \nExcept as excluded by Section 11.0102, no person may engage in or cause a development to occur, as \ndefined in Section 3.0103, without first obtaining a Development Permit through the procedures set \nforth in this code.   \nB. \nA building permit shall constitute a Development Permit, and all use of the property and construction \ndone under a valid building permit shall comply with all requirements of this code.  \nC. \nThe Manager shall not issue a Development Permit that does not meet the minimum requirements of \nthis code.  The Manager shall not issue a Development Permit if the subject land was divided or \notherwise developed in violation of this code, regardless of whether the permit applicant or its \npredecessor created the violation, unless the violation can be rectified as part of the development.  \n11.0102  Exclusions from Development Permit \nThe following activities do not require a Development Permit except as noted.  \nA. \nLandscaping not involving a structure.  Landscaping does not include the paving of a parking lot.  \nLandscaping in the Floodplain Overlay District and Natural Resource Overlay may require a \ndevelopment permit, as described in Section 5.0100 and Section 5.0700. \nB. \nAn internal change to a building or other structure that does not substantially affect the use of the \nbuilding or structure or a sign that does not require design review approval;  \nC. \nAn emergency measure necessary for the immediate safety of persons or protection of property.  In such \ncircumstances, the property owner must notify the City of the activity within 5 calendar days.  An \napplication or pre-application request (as appropriate) for a Development Permit shall be filed within 30 \ncalendar days if the action otherwise would require a Development Permit but for the emergency. Any \nrequired application must be obtained within 1 year of the action.  \nD. \nThe following activities do not require a Development Permit, except in the Floodplain Overlay District \nand Natural Resource Overlay. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "[11.01]-2 \nCity of Gresham Development Code \n \n(07/24) \n1. \nErection of a tent or similar portable structure for non-commercial use not exceeding 10 days.   \n2. \nExpansion or continuation of an existing farming operation.   \n3. \nThe conversion of a hotel or motel to an emergency shelter or to affordable housing under \nSection 10.0420. \n4. \nAn alteration that does not substantially affect the use or appearance of land or a structure.   \n5. \nA helicopter landing facility when established for the support of an emergency in progress or \nwhen established for the occasional demonstration and/or training of emergency service \noperations.   \n6. \nA modular unit or trailer used as a construction office on a job site during construction activities \nthat is removed before final occupancy is approved for the project.  \n7. \nCommercial structures of under 200 square feet not visible from a public place.  \nE. \nThe following activities do not require a Development Permit, except in the Floodplain Overlay District, \nHillside and Geologic Risk Overlay, and Natural Resource Overlay: \n1. \nThe establishment, construction, maintenance, or termination of minor basic utilities and the \nfollowing authorized public facilities:  public streets, public sidewalks, sanitary sewers, storm \nsewers, water lines, electrical power and gas lines, communication and data lines, and telephone \nand television cable lines; and public paths and trails which are identified in the Gresham \nCommunity Development Plan as a transportation facility, constructed by a public agency, and \nare within a public right-of-way or a public access easement.   \n2. \nConstruction, maintenance, or demolition of an accessory structure that does not require a \nbuilding permit.   \n3. \nExcavation or filling of land not exceeding 50 cubic yards within any 1 year period and the \nfollowing activities:  \na. \nExcavations below finish grade for basements and footings of a building, retaining walls \nb. \nCemetery graves \nc. \nExcavations for wells, tunnels, or utilities  \nd. \nExploratory excavations under the direction of a soils engineer or engineering geologist \ne. \nAn excavation which is less than 2 feet in depth or which does not create a cut slope \ngreater than 5 feet in height and steeper than 2 horizontal to 1 vertical \nf. \nA fill less than 1 foot in depth, and placed on natural terrain with a slope flatter than 5 \nhorizontal to 1 vertical; or less than 3 feet in depth, not to exceed 50 cubic yards on any \none lot and does not obstruct a drainage course \ng. \nGrading for a parcel that conforms to an approved grading plan \nF. \nWireless Communication Facilities located in the public rights-of-way under the jurisdiction or control \nof the City of Gresham.   \nG. \nThe following activities do not require a Planning Development Permit but will require a Building \nPermit: \n1. \nConstruction of Single Detached Dwellings and Middle Housing in the LDR-GB, LDR-7, LDR-\n5, TR, TLDR, MDR-12 (lots of record only), OFR (lots of record only), LDR-PV, MDR-PV, \nVLDR-SW, LDR-SW, CMF (only those portions along the NE Glisan and NE 162nd Avenue \ncorridors), DRL-1 and DRL-2 districts. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "[11.01]-3 \nCity of Gresham Development Code \n \n(07/24) \n2. \nRoof-top solar energy systems where the system meets the following:   \na. \nIs installed on the roof of a residential, commercial/mixed-use or industrial structure; \nand \nb. \nDoes not exceed the peak height of the portion of the roof on which it is installed; and \nc. \nDoes not increase the footprint of the residential, commercial/mixed-use or industrial \nstructure; and  \nd. \nIs installed parallel to the slope of the roof; and \ne. \nIs not listed in the exceptions of Section 11.0102.H. \n3. The conversion of a hotel or motel to an emergency shelter or to affordable housing under Section \n10.0420. \nH. \nThere are conditions under which certain roof-top solar energy systems may require both a Building \nPermit and a Planning Development Permit. Exceptions to the roof-top solar energy system exclusions \nof Section 11.0102.G.2 include any solar energy system which is: \n1. \nLocated on a federally or locally designated historic building or landmark; or   \n2. \nLocated in a federally or locally designated historic district; or   \n3. \nLocated on a conservation landmark designated by the city or county because of the historic, \ncultural, archeological or similar merit of the landmark; or \n4. \nLocated within the boundaries of a locally established conservation district; or \n5. \nInstalled on a frame structure and is not generally parallel to the roof or is more than 18” off the \nroof of the building on which it is installed. \n11.0103  Issuance and Effective Date of Development Permit \nA. \nA development permit becomes effective on the day after the appeal period expires or, if appealed, final \nand effective upon a decision by the final appeal body. \nB. \nEvery Development Permit shall be specific as to the approval granted or development authorized.  It \nshall be subject to the standards and conditions set forth in this code, excepting only those variances or \nexceptions authorized by the decision authority, together with any conditions imposed by the decision \nauthority.  \n11.0104  Development Permit Conditions of Approval and Modifications of \nApprovals \nA. \nImposition of Conditions.  The decision authority may impose conditions on any development permit.  \nSuch conditions shall be designed to ensure the Development Code requirements are met, protect the \npublic from potential adverse impacts of the proposed use or development or to fulfill an identified need \nfor public services within the impact area of the proposed development.   \n \nIn addition to conditions imposed above, a condition is valid and enforceable when the applicant: \n1. \nRequested the condition; \n2. \nConsented to the condition in writing or on the record; or  \n3. \nAllowed the decision to become final.  \nB. \nAssurance of Compliance with Conditions.  A bond, cash deposit or other security acceptable to the \ndecision authority may be required from the applicant in an amount sufficient to ensure compliance with \na condition of approval. Such security shall be posted prior to the issuance of the appropriate \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "[11.01]-4 \nCity of Gresham Development Code \n \n(07/24) \nconstruction permit.  \nC. \nModification of Approvals and Conditions.  Except for modifications to approved DR-E applications \nwhich are described in Section 11.0108, modification of conditions of approval may be sought on \nappeal or as a new development permit.  The level of review for the modification shall be the same as \nthe review level for the applicable component of the application unless noted otherwise in the Code.  \nModification of conditions of approval shall only be granted if the decision authority determines that: \n1. \nThe condition(s) could not be implemented for reasons beyond reasonable control of the permit \nholder and the modification will not require a significant modification of the original decision; or \n2. \nThe circumstances have changed to the extent that the condition(s) is no longer needed or \nwarranted; or \n3. \nThe different condition(s) would better accomplish the purpose of the original condition. \n11.0105  Expiration of Development Permit  \nA. \nUnless a different expiration date is specifically provided in the Development Code, a Development \nPermit shall expire automatically one (1) year from the effective date unless one of the following occurs \nfirst: \n1. \nFor design review permits except for phased design reviews as provided in Section 7.0004 of the \nDevelopment Code, a structural or grading permit for each proposed structure has been submitted \nto the City and is active or in review. \n2. \nFor tentative land division plans, except for phased plans as provided in Section 6.0211 of the \nDevelopment Code, a final plat or map application has been submitted to the City. \n3. \nFor final land division plats or final survey maps, a final plat or final survey map is signed by the \nManager pursuant to Section 6.0403(C) of the Development Code within one year of the \nsubmittal of the final land division plat or final survey map. \n4. \nFor final land division plats or final survey maps signed by the Manager, final land division plats \nor final survey maps must be recorded within one year of signature. \n5. \nFor all development permits, an application for an extension is filed and granted pursuant to \nSection 11.0106.  \nB. \nUpon final approval by the city of a Development Permit, if the permit is appealed beyond the local \nlevel, the one-year permit period shall be tolled until a decision by a review authority with final \njurisdiction is made that is not appealed.  \n11.0106  Extension of Development Permit \nA. \nExcept as noted in Section 11.0106(B), if an extension is desired, the holder of the Development Permit \nmust file an application for an extension prior to the expiration of the Development Permit.  Unless \napproved, an extension request does not extend the expiration date.  Extension requests shall be \nprocessed as a Type I action.  An extension may be granted for one (1) year from the original date of \nexpiration unless noted otherwise in the Development Code.   \nExtensions shall be granted only upon findings that:  \n1. \nCommencement of development could not practically occur for reasons beyond control of the \npermit holder; \n2. \nThe request for extension is not sought for purposes of avoiding any responsibility imposed by \nthis code or the Development Permit; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": "[11.01]-5 \nCity of Gresham Development Code \n \n(07/24) \n3. \nThere has been no change in the Development Code since approval of the Development Permit \nthat would require significant modification of the Development Permit or conditions of approval; \nand \n4. \nThere has been no change of the Plan Map designation of the property since approval of the \ndevelopment permit that would prevent approval under the plan map designation in effect at the \ntime of the extension request. \nB. \nA holder of a Development Permit for a tentative land division plan may file an application for an \nextension of the permit prior to its expiration. Unless approved, an extension request does not extend the \nexpiration date. Extension requests shall be processed as a Type I procedure. Extensions may be granted \nfor one (1) year periods. Phased subdivisions, as described in Section 6.0211, shall follow Section \n11.0106(A).  \nExtensions shall be granted only upon findings that:  \n1. \nThe request for extension is not sought for purposes of avoiding any responsibility imposed by \nthis code or the Development Permit; \n2. \nThere has been no change in the Development Code since approval of the Development Permit \nthat would require significant modification of the Development Permit or conditions of approval; \n3. \nThere has been no change that would alter the need for public facilities; and \n4. \nThere has been no change of the Plan Map designation of the property since approval of the \nDevelopment Permit that would prevent approval under the Plan Map designation in effect at the \ntime of the extension request. \n11.0107  Application for Staff Interpretation  \nAn application for staff interpretation shall follow the Type II procedure per Section 11.0400, including the \nopportunity for appeal.  A staff interpretation is not binding upon the Hearings Officer, Design Commission, \nPlanning Commission or City Council.  Only the City Council has the ultimate authority to interpret the \nGresham Community Development Code.  \nA. \nApplication. In addition to any other requirements established by the Manager for the application, the \nfollowing shall be provided by the applicant: \n1. \nThe applicant shall identify the specific section(s) of the Gresham Community Development \nCode for which the applicant is seeking Interpretation. \n2. \nThe applicant may submit an assumed set of hypothetical facts that can be used to inform the \napplication. Any interpretation decision that utilizes an assumed set of hypothetical facts will not \ndetermine the truth or falsity of such facts and such facts shall not be subject to any substantial \nevidence in the record determination. Factual determinations will not be made in an Application \nfor Staff Interpretation. Such factual determinations are left to any later proceedings where a \nspecific application is made for a development permit or application. \nB. \nCriteria for Staff Interpretation. The criteria for staff interpretation are: \n1. \nThe Interpretation is consistent with the context of the applicable Gresham Community \nDevelopment Plan, including, particularly, the land use district in which the use is proposed, if \napplicable. \n2. \nThe Interpretation is consistent with the text of the applicable Gresham Community Development \nCode provisions. In interpreting the section or sections, the Gresham Community Development \nCode Section 3.0100 shall apply. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "[11.01]-6 \nCity of Gresham Development Code \n \n(07/24) \n3. \nThe Interpretation is consistent with the legislative intent of the section and for the words or \nphrases at issue. The intent is based on the legislative record for the ordinance that adopted or \namended the section or sections at issue as well as any related sections. \n4. \nThe Interpretation will not vary or modify any clear and unambiguous language of the section or \nsections at issue in the Gresham Community Development Code. \n5. \nThe Interpretation is consistent with the stated purpose of the land use district or other purpose or \nintent statement or general provision applicable to the section or sections at issue, if available. \n11.0108  Modifications to Approved DR-E Applications \nProposed modifications to approved DR-E applications will be reviewed as follows:   \nA. \nModifications not necessitating changes to Design Standards, Design Guidelines, conditions of approval \nor specific discretionary guidelines discussed as part of the DR-E approval may be modified by staff as \npart of the Building Permit review. \nB. \nModifications necessitating changes to Design Standards, Design Guidelines, conditions of approval or \nspecific discretionary standards discussed as part of the DR-E review will be reviewed and decided \nupon by the Design Commission with the exception of those applications reviewed by City Council as \ndescribed in 11.1106(F), which shall be reviewed and decided upon by City Council. Written notice of \nthe Design Commission meeting will be provided to all parties of record 20 days prior to the meeting at \nwhich the Design Commission will consider these changes.  \n \n \n \n \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.756420",
  "extractor_version": "1.0.0"
}