{
  "metadata": {
    "filename": "dc-section-12.0000.pdf_id7898",
    "extracted_at": "2025-05-22T06:15:21.425571",
    "num_pages": 4,
    "title": "DC Section 12.0000",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 20 for Word",
    "producer": "Adobe PDF Library 20.13.106",
    "creation_date": "D:20210125131911-08'00'",
    "modification_date": "D:20210125135735-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "[12.00]-1 \nCity of Gresham Development Code \n(8/10) \nARTICLE 12 MAP AMENDMENTS \nSECTION 12.0000 PLAN MAP AMENDMENTS AND \nAMENDMENTS TO MAP BOUNDARIES \nGeneral \n12.0001  Community Development Plan Map Amendments  \n12.0002  Minor Amendments to the Gresham Urban Services Area Map Boundaries  \nOverlay Districts \n12.0010  Overlay District Adjustments   \n12.0011  Overlay District Boundary Revisions  \nGeneral \n12.0001  Community Development Plan Map Amendments  \nThis section describes the procedures and criteria that apply to any application to amend the land use \ndesignations identified on the Community Development Plan Map. \nA.\nType III Plan Map Amendments - One Parcel or Small Group of Parcels.\n1.\nProperty owners or the City may initiate a plan map amendment for one parcel or a small\ngroup of parcels under the Type III procedure.  Unlike other Type III procedures, the\ndecision of the Planning Commission on a Type III Plan Map Amendment shall be in the\nform of a recommendation to the Council.  The Council shall hold another public hearing and\nmake a final decision.\n2.\nIf an application for a plan map amendment is denied, the property owner may not submit a\nrequest for the same plan map designation on the same parcel or small group of parcels\nwithin 12 months from the date the previous application was found to be complete.\n3.\nAmendment Criteria.  The applicant must demonstrate compliance with the following\ncriteria:\na.\nThe proposed designation is consistent with the applicable goals, policies, and\nimplementation strategies of the Community Development Plan.  The applicant\nmust demonstrate that the proposed designation complies with the appropriate land\nuse district or sub-district characteristics identified in the Community\nDevelopment Code.\nb.\nThe proposed designation will not negatively impact existing or planned public\nfacilities and services.\nc.\nThe applicant shall demonstrate compliance with one of the following criteria:\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "[12.00]-2 \nCity of Gresham Development Code \n(8/10) \ni.\nA mistake was made in the current designation.  The applicant must identify\na specific error made during the adoption process of the Community\nDevelopment Code that, if it had been brought to the attention of the council,\nwould have influenced the council's decision of the appropriate designation;\nor\nii.\nThe site is suitable for the proposed designation and there is a lack of\nappropriately designated alternative sites within the vicinity.  The size of the\nvicinity will be determined on a case-by-case basis since the impacts of a\nproposed land use designation and its potential uses vary.  The factors to be\nused in determining suitability are parcel size and location.\nd.\nThe proposed designation is consistent with the Metro Urban Growth Management\nFunctional Plan.\nB.\nType III Plan Map Amendments – Conditioned Plan Amendment\n1.\nAn applicant may initiate a Conditioned Plan Map Amendment.  A Conditioned Plan Map\nAmendment links the map amendment to a specific development proposal or specific use.\nUnlike other Type III procedures, the decision of the Planning commission on a Type III\nConditioned Plan Map Amendment shall be in the form of a recommendation to the City\nCouncil.  The City Council shall hold another public hearing and make a final decision.\n2.\nA Conditioned Plan Map Amendment may take one of two forms:\na.\nA plan map amendment submitted at the same time as an application for a specific\nland use, such as a Design Review or Land Division.  The decision on the plan\nmap amendment shall be conditioned to the specific development proposal.  If the\nconcurrent application is a Design Review subject to established design principles,\ndesign guidelines, and design standards of a Design District, then the Design\nReview component shall be reviewed by the Design Commission.  The Design\nCommission shall provide a recommendation on the Design Review element for\nthe City Council decision.  This is in addition to the general process outlined above\nin Section 12.0001(B)(1).\nb.\nA plan map amendment with some details regarding a specific future land use.\nThe decision on the plan map amendment shall be conditioned to the specific\nfuture land use.  This review for conditions is an additional Type III review for the\nplan map amendment.  The following information shall be provided to calculate\nimpacts for the specific use:\ni.\nFor all uses, information regarding the compatibility of the anticipated use\nwith the surrounding area.  This shall include a conceptual site plan,\nanticipated building heights, and conceptual drawings of the use.\nii.\nFor residential uses, the proposed density and the number of units;\niii.\nFor non-residential uses, the square footage of buildings and type of use,\nsuch as restaurant or office.\niv.\nThe Manager may specify additional information necessary to review a\nConditioned Plan Map Amendment.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "[12.00]-3 \nCity of Gresham Development Code \n(01/21) \n3.\nIf an application for a Conditioned Plan Map Amendment is denied, the property owner may\nnot submit a request for the same plan map designation on the same parcel or small group of\nparcels within 12 months from the date the previous application was found to be complete.\n4.\nAmendment Criteria.  The applicant must demonstrate compliance with the following\ncriteria:\na.\nThe proposed designation is consistent with the applicable goals, policies, and\nimplementation strategies of the Community Development Plan.  The applicant\nmust demonstrate that the proposed designation complies with the appropriate land\nuse district or sub-district characteristics identified in the Community\nDevelopment Code.\nb.\nThe proposed designation will not negatively impact existing or planned public\nfacilities or services.  If there is a negative impact on existing or planned public\nfacilities or services, then mitigation of the impact shall be addressed through\nconditions upon the plan map amendment.\nc.\nThe applicant shall demonstrate compliance with one of the following criteria:\ni.\nA mistake was made in the current designation.  The applicant must identify\na specific error made during the adoption process of the Community\nDevelopment Code that, if it had been brought to the attention of the\nCouncil, would have influenced the Council’s decision of the appropriate\ndesignation; or\nii.\nThe site is suitable for the proposed designation and there is a lack of\nappropriately designated alternative sites within the vicinity.  The size of the\nvicinity will be determined on a case-by-case basis since the impacts of a\nproposed land use designation and its potential uses vary.  The factors to be\nused in determining suitability are parcel size and location.\nd.\nThe proposed designation is consistent with the Metro Urban Growth Management\nFunctional Plan.\n5.\nExpiration of Conditioned Plan Map Amendment.  The approval of a Conditioned Plan Map\nAmendment shall expire five years from the date the approval was final if no development\napplication has been approved.  The approval shall also expire if the approved development\napplication subsequently expires.\nC.\nType IV Plan Map Amendments - Large Area of the City and Multiple Ownerships\n1.\nThe City may initiate plan map amendments affecting large areas and multiple ownerships\nunder the Type IV procedure.  These map changes include those that have widespread and\nsignificant impact beyond the immediate area of change.\n2.\nAmendment Criteria.  The City must demonstrate:\na.\nThe proposed designation is consistent with the applicable goals, policies, and\nimplementation strategies of the Community Development Plan.\nb.\nThat the proposed designations comply with the appropriate land use district or\nsub-district characteristics identified in the Community Development Code.\nc.\nThe proposed designation is consistent with the Metro Urban Growth Management\nFunctional Plan.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "[12.00]-4 \nCity of Gresham Development Code \n(01/21) \n12.0002  Minor Amendments to the Gresham Urban Services Area Map \nBoundaries \nA.\nThe Gresham Urban Services Area Map Boundaries may be changed for the purposes of minor\nboundary adjustments within the Urban Growth Boundary when the Gresham, Portland, and\nMultnomah County Planning Directors agree in writing that the following conditions exist for each\namendment.\n1.\nAdjustments are limited to contiguous property within approximately 400 feet of the Urban\nService Boundary.\n2.\nThe adjustment will improve the efficiency of urban services.\n3.\nThe adjustment may include property that has been recently partitioned or subdivided.\n4.\nAdjustments may occur when an emergency threatens public health, safety, and welfare.\nB.\nIn those areas of Multnomah County where the Metropolitan Urban Growth Boundary and\nGresham Urban Service Area Boundary are synonymous, amendments to the Urban Growth\nBoundary may be cause for similar amendments to the Gresham Urban Service Area Boundary, but\nonly when the Gresham and Multnomah County Planning Directors agree in writing.\nOverlay Districts \n12.0010  Overlay District Adjustments \nThe boundaries of the Floodplain Overlay District or Hillside and Geologic Risk Overlay and Natural \nResource Overlay may be adjusted by the Manager under the Type I procedure when new information has \nbeen obtained establishing that the boundary should be changed to fulfill the purpose for the special \npurpose district. \n12.0011  Overlay District Boundary Revisions \nA special purpose district boundary may be revised as provided in this section or as part of a legislative \naction.  The Hearings Officer shall review a revision of a overlay district boundary.  A property owner's \npetition shall be filed with the Manager on a form provided by the Manager.  The Hearings Officer shall \nreview the proposal under a Type III procedure, with posted notice and mailed notice to owners of property \nwithin 300 feet of the area proposed for change.  The Hearings Officer shall approve a district boundary \nrevision if it complies with the applicable provisions of the Community Development Code. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:21.425796",
  "extractor_version": "1.0.0"
}