{
  "metadata": {
    "filename": "dc-section-11.0900.pdf_id7895",
    "extracted_at": "2025-05-22T06:15:22.649593",
    "num_pages": 2,
    "title": "DC Section 11.0900",
    "author": "Katie",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615201631-07'00'",
    "modification_date": "D:20220615201652-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[11.09]-1 \nCity of Gresham Development Code \n \n(10/18) \nSECTION 11.0900 \nAPPLICATION SUBMITTAL AND  \nCOMPLETENESS REVIEW  \n11.0900  Application Submittal and Completeness Review \n11.0901  Application Forms and Checklists \n11.0902  Application Submittal \n11.0903  Completeness Review \n11.0904  Resubmittal of Application following Denial \n \n11.0900 \nApplication Submittal and Completeness Review \n11.0901  Application Forms and Checklists \nA. \nThe Manager shall supply land use application forms pursuant to the standards contained in the \napplicable state law, comprehensive plan, and implementing ordinance provisions.  \nB. \nThe Manager shall supply checklists or information sheets for applications, which shall detail the \nspecific information which must be contained in the application, including format and number of copies.   \n11.0902  Application Submittal  \nA. \nApplications for development permits shall be submitted upon forms established by the Manager.  \nApplications will not be accepted in partial submittals.  All of the following items must be submitted to \ninitiate the completeness review: \n1. \nApplication form, including required notarized signature(s) that demonstrate consent of all \nowners of the affected property; \n2. \nDeed, title report or other proof of ownership; \n3. \nCompleted checklist provided in 11.0901, including all required materials; \n4. \nEvidence of compliance with neighborhood meeting procedures, if required by Section 11.0800 \nfor the particular type of application;  \n5. \nPlans required for the particular type of application as noted by staff on the completed application \nchecklist;  \n6. \nSpecial reports or plans required to demonstrate that the specific proposal and its site constraints \ncomply with applicable codes.  These are noted on the application checklist; \n7. \nApplication narrative to address applicable code approval criteria and standards as noted by staff \non the completed application checklist; and  \n8. \nPayment for the appropriate land use application fee(s) and deposit(s), based on the fee schedule \nin effect on the date of application submittal.  \n11.0903  Completeness Review  \nA. \nThe Manager shall review the application submittal and advise the applicant in writing whether the \napplication is complete or incomplete within thirty (30) calendar days after the city receives the \napplication submittal, except for industrial reviews as described in Section 7.0003(D)(6)(a), which shall \nhave such a determination made within 14 calendar days after the City receives the application \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[11.09]-2 \nCity of Gresham Development Code \n \n(10/18) \nsubmittal.   \nB. \nIncompleteness shall be based solely on failure to pay required fees, failure of the applicant’s narrative \nto address the relevant criteria or development standards, or failure to supply the required information \nlisted in the checklist and shall not be based on differences of opinion as to quality or accuracy.  \nDetermination that an application is complete indicates only that the application contains the \ninformation necessary for a qualitative review of compliance with the Development Code standards.  \nC. \nIf the application was complete when first submitted or the applicant submits the additional information \nwithin 180 days of the date the application was first submitted, approval or denial of the application \nshall be based upon the standards and criteria that were in effect at the time the application was first \nsubmitted.  \nD. \nIf an application is incomplete, the completeness notice shall list what information is missing and allow \nthe applicant to submit the missing information.  The completeness notice shall include a form, designed \nto be returned to the Manager by the applicant, indicating whether or not the applicant intends to amend \nor supplement the application.  \nE. \nThe application will be deemed complete for purposes of this section upon receipt by the city of:  \n1. \nAll of the missing information;  \n2. \nSome of the missing information and written notice from the applicant that no other information \nwill be provided; or  \n3. \nWritten notice from the applicant that none of the missing information will be provided. \nF. \nThe application will be deemed void if the application has been on file with the city for more than 180 \ncalendar days and the applicant has not met the obligations of subsection E above.  \nG. \nPursuant to ORS 227.178, the city will reach a final decision on an application within 120 calendar days \nfrom the date that the application is determined to be or deemed complete unless the applicant agrees to \nextend the 120 calendar day time line pursuant to subsection H below or unless State law provides \notherwise.  \n \nFor Qualifying Applications as defined in Section 3.0103, unless waived by the applicant, the City will \nreach a final decision within 100 calendar days from the date that the application is deemed complete. \nH. \nThe 120 calendar day time line may be extended at the written request of the applicant.  The total of all \nextensions may not exceed 245 calendar days.  \n11.0904  Resubmittal of Application Following Denial \nAn application which has been denied or an application which was denied and which on appeal or review has \nnot been reversed by a higher authority, including the Land Use Board of Appeals, the Land Conservation and \nDevelopment Commission or the courts, will be rejected for the same or a substantially similar proposal or for \nthe same or substantially similar action for a period of at least 12 months from the date the final city action is \nmade denying the application unless there is substantial change in the facts, a change in the Development Code, \nor a change in city policy which would change the outcome.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.649892",
  "extractor_version": "1.0.0"
}