{
  "metadata": {
    "filename": "dc-section-7.0500.pdf_id7859",
    "extracted_at": "2025-05-22T06:15:21.495514",
    "num_pages": 72,
    "title": "Rockwood Design District 06-16-2022 (1).indd",
    "author": "amanda.lunsford",
    "producer": "Microsoft: Print To PDF",
    "creation_date": "D:20220615224831-07'00'",
    "modification_date": "D:20220615224938-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "S\u009b\u0091ã®ÊÄ 7.0500 \nRÊ\u0091»óÊÊ\u0097 D\u009bÝ®¦Ä D®ÝãÙ®\u0091ã\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ \u0083Ä\u0097 Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nD\u009b\u0091\u009bÃ\u0090\u009bÙ 1, 2011\nC®ãù Ê¥ GÙ\u009bÝ«\u0083Ã\nCity of Gresham Development Code\n[7.05] - 1\n(06/22)\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "City of Gresham Development Code\n[7.05] - 2\n(06/22)\nA. Applicability: \nThis section shall apply to all commercial, mixed-use, multifamily, townhouse, \nand industrial development within the Rockwood Design District. Townhouses \nshall also follow the applicable standards in Section 7.0432 Corridor District \nTownhouse Design Standards. This section also applies to the following \ninstitutional uses: Civic Uses, Community Services, Medical, Religious Institutions \nand Schools.\nSection 7.0503 does not apply to single detached dwellings; duplexes; triplexes; \nquadplexes; cottage clusters; residential homes; park-and-ride facilities; \ncemeteries and mausoleums; parks, open space and trails; and uses in the \n“Other” category, including basic utilities, heliports, wireless communications \nfacilities and temporary uses, and similar uses/structures as determined by the \nManager or Design Commission. Section 7.0503 also does not apply to public \nfacilities (as described in Appendix 5: Public Facilities). \nDuplexes, Triplexes, and Quadplexes in the Rockwood Design District shall follow \nthe Section 7.0100 Corridor Design District Design Guidelines and Standards.\nHeadings in this section apply to (except as exempted above):\nAll Development: All developments except townhouses and the industrial uses \npermitted in the Station Center-Ruby Junction land use district.\nCommercial and Institutional: All developments that are commercial or \ninstitutional uses, including commercial or institutional uses as components \nof mixed-use structures. However, Parks, Open Spaces and Trails are not \nincluded. \nResidential Development:\nMultifamily Residential: Multifamily, Elderly Housing, and Residential \nFacilities, unless otherwise specified.\nTownhouse: Townhouses.\nExisting Development: Guidelines and standards in Section 7.0503(A) shall apply \nas determined by the Manager or Design Commission when the standards \ncan reasonably apply to existing development. For example, landscaping \nguidelines and standards may apply when new landscaping is being added. \nGuidelines and standards in Section 7.0503(B) apply to buildings that were \nconstructed prior to Dec. 1, 2011, as indicated by the standards under the \n“Existing Development” heading in those sections. For Sections 7.0503(A) \nand (B), site and building modifications needed to comply with Section \n8.0200 shall comply with applicable guidelines and standards.\nMixed-Use Development: For mixed-use developments, guidelines and standards \nunder the Commercial and Institutional heading apply to those parts of the \nbuilding designed for those uses, and the guidelines and standards under \nMultifamily and Townhouse headings apply to those parts of the building \ndesigned for those uses. The “All Development” standards apply to the entire \nbuilding.\nStandards and Guidelines with no heading apply to all development.\n7.0501 IÄãÙÊ\u0097ç\u0091ã®ÊÄ\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "City of Gresham Development Code\n[7.05] - 3\n(06/22)\nB. Purpose: \nThe City has prioritized high-quality design for new development and for \nredevelopment throughout the city. It is also recognized that Gresham is \ncomprised of many districts and neighborhoods – each one unique with \ndistinct physical, social, and economic conditions and special assets to build \nupon to attract quality investment. Therefore, certain districts have their own \ndesign standards and guidelines to address design concerns that have cultural, \narchitectural, or even market significance to that area. \nAs part of the 2011 Council Work Plan, the Rockwood Design Standards and \nGuidelines augment existing Code regulations which apply to the area. These \nDesign Guidelines and Standards provide Rockwood with the regulations that \nidentify good site and building design thereby facilitating the development of \nhigh-quality, attractive, innovative, sustainable and livable developments that \nfoster a true sense of community. \nC. Design Review Process: \nNew Rockwood developments, additions and remodels are subject to design \nreview as defined in Section 7.0500 for the determination of consistency with \nthe Criteria, Guidelines and/or Standards contained in this Code. Projects subject \nto design review are either reviewed by the Design Commission or reviewed by \nthe Manager. Either the Design Commission or the Manager shall make findings \nand decisions concerning conformance with the Design Standards or Guidelines \nbased on which review process is selected. Refer to Article 11 Procedures for \nreview process details.\nD. How to Use this Code: \n1. Design Review: Two Track Process\nThe City has set up two tracks for the Design Review process. Applicants have \nthe choice of complying with either opƟ on:\na. Discretionary Process. The discretionary process is intended to permit in-\nnovative and creative development proposals that might not comply with \nall or some of the Standards in Section 7.0500 to be reviewed and permit-\nted if the projects meet the Design Guidelines, Intent Statement and Prin-\nciples. The aim is to encourage applicants to propose exciting, innovative \ndesigns while still ensuring the City’s design goals and objectives are met. \nThe Design Commission may waive a Guideline or Guidelines to achieve \nthe flexibility necessary to support a particularly creative proposal. Ap-\nproval requires that the applicant demonstrate to the Design Commission \nthat the waiver from the Guideline(s) would result in a development that \nbetter meets the applicable Design Principles and the Intent Statement \npreceding the Guidelines. \nb. Clear and Objective Process. The Clear and Objective Process includes \nmeasurable Standards to meet the desired urban form. In the Clear and \nObjective Process the applicant must meet all relevant Design Standards. \nDeviation from any of the Standards or referenced Standards in Article 7 \nwill place the application in the Discretionary Process.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "City of Gresham Development Code\n[7.05] - 4\n(06/22)\n2. Rockwood Design Guidelines and Standards Layout: \nThe Rockwood design regulaƟ ons apply to two primary areas, the Rockwood \nTriangle Area and the Outside Triangle Area, to recognize the unique charac-\nterisƟ cs of the two areas. See Figure 7.0501(B). \nRockwood Triangle Area. The Rockwood Triangle Area is defined as the \nTriangle Area bounded by Stark Street on the south, Burnside on the \nnorth, 181st on the west and 190th on the east. This area is located in the \ncenter of Rockwood and is to be the cultural and social hub of Rockwood. \nThe Triangle Area is a true community of residences and smaller scale \nservices in a walkable, pedestrian-oriented environment with integrated \nopen spaces.\nOutside Triangle Area. The Outside Triangle Area includes all areas outside \nthe Rockwood Triangle Area but still within the Rockwood Design District. \nWithin each of those two areas there are two categories of Guidelines and \nStandards:\na. Site Design: Site Design Guidelines and Standards address the organiza-\nƟ on and arrangement of a development’s components. They focus on the \nlocaƟ on and orientaƟ on of buildings, parking, service areas, landscaping \nand site features such as open space. Good site planning is of criƟ cal im-\nportance to the design of commercial, mixed-use, civic, industrial and res-\nidenƟ al development. Excellent site design can improve the aestheƟ cs of \na community, minimize a project’s impacts on its neighbors, improve the \nquality of the streetscape, relate to or establish desirable development \npaƩ erns, promote sustainability and improve neighborhood connecƟ vity. \nb. Building Design: Building Design Guidelines and Standards address the \nmassing and exterior architectural elements of buildings – components \nthat deﬁ ne the scale, quality and character of a building, such as roofs, \nentries, windows, materials and details. Excellent building designs en-\nhance the quality of life for residents and promote sustainability by \nimproving the appearance of the city, by promoƟ ng the conservaƟ on of \nnatural resources, by establishing a sense of community, and by improv-\ning the long-term economic value of the properƟ es.\nFigure 7.0501(B)\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": "City of Gresham Development Code\n[7.05] - 5\n(06/22)\nGuidelines and standards labeled with “INSIDE THE TRIANGLE” apply inside \nthe triangle shown in Figure 7.0501(B). Guidelines and standards labeled with \n“OUTSIDE THE TRIANGLE” apply in the design district but only outside the \ntriangle in Figure 7.0501(B). Guidelines and standards with neither of those \nlabels apply both inside and outside the triangle.\n3. Compliance with other Code sections including but not limited to Articles 4, \n5, 7, 9 and 11. \n4. Images:\nMost images, including photographs and illustraƟ ons, are not part of the De-\nvelopment Code and do not act as Guidelines or Standards. These images are \nprovided to assist readers in envisioning the intent and potenƟ al outcomes of \nthe Guidelines and Standards. Images that are not part of the Development \nCode are labeled as ﬁ gures and are included in the Code to beƩ er illustrate \nthe theory behind the Guidelines and Standards. Images that are part of the \nDevelopment Code will be labeled with Development Code secƟ on numbers. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": "City of Gresham Development Code\n[7.05] - 6\n(11/20)\n7.0502 RÊ\u0091»óÊÊ\u0097 D\u009bÝ®¦Ä PÙ®Ä\u0091®Ö½\u009bÝ\nSite Design Principles\nA. Physical Environment: Create a physical environment that fosters a positive image of \nRockwood and embraces its unique character thereby allowing businesses to thrive and \nprosper.\nB. Sustainability: Implement measures that promote the efficient use of land and resources \nby conserving and protecting trees, water and topography; reducing pesticide use; \nmaximizing surface water infiltration; promoting energy conservation; promoting \nresident health; and other sustainability measures.\nC. Safe Design: Design buildings, streets and public places that are safe and inviting for \nresidents and visitors.\nD. Transportation Modes: Encourage multimodal design to support transportation choices \nand access opportunities.\nE. Open Space: Develop open spaces where they are needed most and improve access to \nexisting and future parks and public spaces.\nF. Landscaping: Incorporate landscape elements such as trees, shrubs, and groundcover \ninto a sustainable landscaping plan that provides an attractive green setting for \nRockwood while reinforcing the architecture and softening the building scale. \nG. Compatibility: Respect stable neighborhoods.\nBuilding Design Principles\nH. Architectural Quality: Create aesthetically pleasing, durable architecture for \ndevelopments that contributes to the sense of place.\nI. \nSustainable Architectural Design: Promote sustainable architectural design that \npromotes energy efficiency, conservation of resources and other sustainability measures.\nJ. \nRehabilitation: Accommodate rehabilitation of existing structures and sites where the \nstructures and sites will contribute in a positive manner to the desired urban form of \nRockwood.\nK. Housing Variety: Improve the variety of housing types for current and future Rockwood \nresidents.\nL. High-Quality Materials: Utilize building materials that are of the highest quality and \npermanence, and that build a sense of place for Rockwood.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": "City of Gresham Development Code\n[7.05] - 7\n(06/22)\n1. IÄã\u009b¦Ù\u0083ã\u009b\u0097 S®ã\u009b D\u009bÝ®¦Ä\nIntent: To design sites in a manner that creates connections to \nsurrounding properties and areas, reducing the distance \nrequired to access the site while encouraging walking and \nalternate modes of transportation. Block structures shall \nbe used to break down the scale of the site, creating an \nenvironment which is comfortable for people and allows for \nimproved infill development and redevelopment potential. \nInternal vehicular circulation shall accommodate pedestrian \nand vehicular access needs while providing amenities to \nimprove the appearance of the development.\nApplicable Rockwood Design Principles from Section 7.0502:\nA. Physical Environment\nB. Sustainability\nD. Transportation Modes\nE. Open Space\nF.  Landscaping\nG. Compatibility\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1. The Standard of Section 7.0503(A)(1)\n(S1) describing the Future Street Plan \nis required without exception.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development\nS1. All new developments shall be designed in a manner that is \nconsistent with and responds to the City’s approved Future \nStreet Plan. Future Street Plans may be required at the \ndiscretion of the Manager and shall be prepared and approved \nas required by Section 9.0700.\nFig. A.1.G1.a: Block structures create pedestrian-\nscaled and oriented developments.\nFig. A.1: A pedestrian path connecting a development \nto surrounding areas.\nFig. A.1.S1: Future Street Concept for Rockwood.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": "City of Gresham Development Code\n[7.05] - 8\n(06/22)\n1. IÄã\u009b¦Ù\u0083ã\u009b\u0097 S®ã\u009b D\u009bÝ®¦Ä, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG2. Pedestrian, bicycle and vehicular \naccess to adjoining properties and \nsurrounding residential neighborhoods \nshall occur in appropriate locations to \nfacilitate access and movement in the \ndistrict.\nG3. The Standard of Section 7.0503(A)(1)\n(S3) describing public street design is \nrequired without exception.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS2. Connections to surrounding properties and neighborhoods \nshall be established and include streets as determined by \nthe Manager and/or pedestrian paths at an average spacing \nno greater than one every 400 feet or as determined by the \nManager.\nS3. Public streets shall be designed to Public Works Standards \nwhen streets are required by the Manager. \nFig. A.1.G1.b: Large developments shall utilize a \nnetwork of streets (or drives with a street character) to \nimprove accessibility and connectivity.\nFig. A.1.G4.a: An internal roadway which serves \nvehicles and pedestrians while supporting adjacent \nmixed-use development.\nFig. A.1.G4.b: An internal roadway that is integrated into a larger surrounding street \nsystem.\nFig. A.1.G4.c: Pedestrian conflicts are minimized by limiting driveways and providing \nvisually distinct crosswalks.\nFig. A.1.S4: Pedestrian and vehicular routes are \norganized to connect to existing circulation patterns.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": "City of Gresham Development Code\n[7.05] - 9\n(06/22)\n1. IÄã\u009b¦Ù\u0083ã\u009b\u0097 S®ã\u009b D\u009bÝ®¦Ä, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS4. Primary internal drives shall be consistent with the section \nshown in Figure A.1.S5. The addition of a center landscaped \nmedian may be permitted at the discretion of the Manager. \nPrimary internal drives shall consist of a 24-foot, two-way drive \nlane; a sidewalk with a minimum 6-foot amenity zone and a \nminimum 6-foot clear walk zone shall be provided on each side \nof the drive.\na. The specific drive lanes may be required to be a minimum \nwidth of 26 feet to accommodate emergency vehicles as \ndetermined by the Manager.\nb. Primary internal drives may include angled or parallel \nparking in locations approved by the Manager.\nc. Where primary internal drives are not adjacent to \nbuildings, the amenity zone and sidewalk may each be \nreduced to 5 feet in width.\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG4. Internal drives and walkways within \nlarger developments shall function \nas pedestrian-friendly streets and \nestablish a human scale block pattern. \nShared pedestrian/vehicle (woonerf) \nstreets may be utilized.\na. Internal drives shall provide \nfor the functional and visual \nintegration of buildings, services, \nvehicular access and parking, and \npedestrian circulation.\nb. Internal drives for non-residential \nand multifamily uses are \nencouraged to be coordinated \nwith other access drives.\nc. Driveway access shall be designed \nto minimize conflicts with \npedestrians, and efforts shall \nbe made to limit the number of \ndriveways per block.\nd. Sidewalks, pedestrian walkways, \nand drives shall connect to and \nalign with surrounding pedestrian \nand vehicular circulation patterns.\nFig A.1.G4.d: Public streets or private drives with a street character improve the \naccessibility and appearance of large developments.\nFig. A.1.S5: Section of Primary Internal Drive. Optional elements labeled as such.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": "City of Gresham Development Code\n[7.05] - 10\n(06/22)\n1. IÄã\u009b¦Ù\u0083ã\u009b\u0097 S®ã\u009b D\u009bÝ®¦Ä, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG5. When parking is present on internal \ndrives, the amenity zone shall be \nappropriately designed and efforts \nshall be taken to ensure pedestrian \nsafety when crossing the roadway.\nG6. Visually distinct crosswalks shall be \nprovided to enhance the appearance \nof the development.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS5. When primary internal drives include parking:\na. The amenity zone shall be landscaped and/or paved to \nmatch or accent the sidewalk using concrete, decorative \npaving or paving which allows stormwater infiltration as \napproved by the Manager.\nb. Bump outs in the street alignment shall be provided at \nintersections which extend to the depth of the parking \nlane to lessen crossing distances for the pedestrian. \nLandscaped areas that do not interfere with clear vision \nrequirements and stormwater infiltration areas may be \nincluded in the bump outs.\nc. Where no parking abuts the amenity zone, it may be \nplanted instead of paved.\nS6. Crosswalks shall be provided on primary internal drives and \nshall receive enhanced paving that creates a visual distinction \nbetween the crosswalk and the surrounding surfaces, such as \nscored concrete, brick, stone or concrete pavers or other high-\nquality material as approved by the Manager. Striping shall \nnot be the sole method of creating visual distinction for the \ncrosswalks.\nFig. A.1.S6: Plan of Primary Internal Drive showing \noptional angle parking.\nTrees at 30 \nfoot spacing\nEnhanced \nsoil \nconditions \nwithin 6 feet \nof trees\nBump \nouts at \npedestrian \ncrossings\nLighting \nfixtures \nat regular  \npacing\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": "City of Gresham Development Code\n[7.05] - 11\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG7. Trees shall be planted along internal \ndrives in a pattern consistent with \nthose on public streets.\nG8. In limited conditions, a landscaped \narea may be permitted to substitute \nfor an enhanced internal roadway \ncondition.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS7. INSIDE THE TRIANGLE: Shade (or canopy) trees on primary \ninternal drives shall be planted in the amenity zone at an \naverage spacing of 30 feet. All trees planted on the primary \ninternal drives shall be selected from the City of Gresham \nRecommended Street Trees list. For commercial, employment, \nlive/work and mixed-use developments, the trees shall be of a \nsize no smaller than 3-inch caliper.\n \nOUTSIDE THE TRIANGLE: Shade (or canopy) trees on primary \ninternal drives shall be planted in the amenity zone at an \naverage spacing of 30 feet. All trees planted on the primary \ninternal drives shall be selected from the City of Gresham \nRecommended Street Trees list. For all development, the trees \nshall be of a size no smaller than 2.5-inch caliper.\nS8. When used as a substitute for a primary drive aisle, major \nlandscape divisions shall consist of a 24-foot-wide landscaped \narea planted with trees, shrubs and ground cover.\na. This area may be designed to allow for stormwater \ninfiltration. \nb. A pedestrian walking path may be integrated into this \narea and, at the discretion of the Manager or Design \nCommission, may be required if it improves circulation \nwithin the site. \nc. If the walking path is between buildings, the building \nto building spacing shall be at least 10 feet in width to \nprovide ample space for attractive landscape plantings, \nnatural lighting and adequate open space between \nbuildings.\nd. Throughout the site, the walkway shall be a minimum 5 \nfeet in width, except as noted in Sections 7.0503(A)(1)(S8)\n(c) and 7.0503(A)(1)(S4) above.\nFig. A.1.S8: Major landscape division used as a \nsubstitute for a primary internal drive.\nFig. A.1.S7: Bump-outs and crosswalks with decorative \npaving are present on primary internal drives when \nparking is included.\n1. IÄã\u009b¦Ù\u0083ã\u009b\u0097 S®ã\u009b D\u009bÝ®¦Ä, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": "City of Gresham Development Code\n[7.05] - 12\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional Development\nG9. Connections shall be provided to \nadjacent abutting properties to \nprevent unnecessary traffic on public \nstreets.\nG10. Block sizes of commercial and mixed-\nuse development shall be limited to \npromote pedestrian connectivity, \naccessibility and to allow for the \ninfiltration of sunlight and air. Internal \nroadways and walkways within \nlarger developments shall function \nas “pedestrian streets,” with the \ndevelopment pattern establishing a \nhuman scale block pattern.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý \nCommercial and Institutional Development\nS9. INSIDE THE TRIANGLE: When public streets are not present to \nconnect to neighboring commercial properties, vehicular and \npedestrian connections shall be provided to existing or future \nparking areas on adjacent properties as required by Section \n9.0822(A)(8).\n \nOUTSIDE THE TRIANGLE: For development sites greater than \n400 feet in length, a mid-block pedestrian walkway shall be \nprovided for connections to surrounding streets and nearest \ntransit facilities.\nS10. INSIDE THE TRIANGLE: For an individual development, the \nmaximum block length shall be 250 feet by 250 feet from curb \nto curb. Departures shall be considered by the Manager based \non one or more items listed below:\na. Topography, right-of-way, existing construction or physical \nconditions, or other geographic conditions that impose \nan unusual hardship on the project applicant, and an \nequivalent alternative which can meet the Rockwood \nTown Center goals and policies, as applicable, is available; \nb. A departure provides the opportunity for a public open \nspace or other public amenity that would otherwise not be \npossible; \nc. The location of an institutional use that requires a larger \nblock size; or \nd. When a primary internal drive(s) or pedestrian route is \nused to meet cross circulation Standards as determined by \nthe Manager, the following applies: \ni. \nPedestrian pathways shall be constructed to \nsurrounding areas at an average spacing no greater \nthan one every 400 feet.\nii. Roadways shall be designed to look and function \nlike public streets with planting strips, street trees, \nsidewalks, and parallel parking where appropriate per \nthe Manager.\niii. Roadways or pedestrian routes shall be fully accessible \nto the public.\niv. For development sites over 1 acre, a mid-block \npedestrian connection shall be provided between \nthe adjacent primary street and secondary street to \nfacilitate pedestrian movement through the Triangle \nArea. \n \nContinued on following page\n \nFig. A.1.S10.a INSIDE THE TRIANGLE: Maximum \nblock size.\n250’\n250’\n1. IÄã\u009b¦Ù\u0083ã\u009b\u0097 S®ã\u009b D\u009bÝ®¦Ä, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": "City of Gresham Development Code\n[7.05] - 13\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nS10. Continued\n \nOUTSIDE THE TRIANGLE: For an individual development, the \nmaximum block length shall be 600 feet by 300 feet from curb \nto curb. Departures shall be considered by the Manager based \non one or more items listed below. \ne. Topography, right-of-way, existing construction or physical \nconditions, or other geographic conditions that impose \nan unusual hardship on the project applicant, and an \nequivalent alternative which can meet the Rockwood \nTown Center goals and policies as applicable is available; \nf. \nA departure provides the opportunity for a public open \nspace or other public amenity that would otherwise not be \npossible; \ng. The location of an institutional campus or other similar \ncommunity service use that requires a larger block size; or \nh. A primary internal drive(s) or pedestrian route may be \nused to meet cross circulation Standards as determined by \nthe Manager or Design Commission and as noted below. \ni. \nPedestrian pathways shall be present to surrounding \nareas at an average spacing of no greater than one \nevery 400 feet.\nii. Roadways shall be designed to look and function \nlike public streets with planting strips, street trees, \nsidewalks, and parallel parking where appropriate per \nthe Manager. \niii. Roadways or pedestrian routes shall be fully accessible \nto the public.\niv. For development sites over 1 acre, a mid-block \npedestrian connection shall be provided between \nthe adjacent primary street and secondary street to \nfacilitate pedestrian movement. \n \nFor an individual development that includes a residential \ncomponent such as live-work or mixed-use developments, the \nmaximum block length shall be 400 feet by 300 feet from curb \nto curb. Departures shall be considered by the Manager. \nFig. A.1.S10.d: Primary internal drives may be used to meet circulation standards \nwhen configured to look and function like public streets.\nFig. A.1.S10.b OUTSIDE THE TRIANGLE: Maximum \nblock size for commercial and employment \ndevelopment.\n300’\n600’\nMid-block pedestrian \nwalkway required on \nsites longer than 400’\n400’\n300’\nFig. A.1.S10.c OUTSIDE THE TRIANGLE: Maximum \nblock size: Mixed-use development.\n1. IÄã\u009b¦Ù\u0083ã\u009b\u0097 S®ã\u009b D\u009bÝ®¦Ä, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": "City of Gresham Development Code\n[7.05] - 14\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nResidential: Multifamily/Townhouse\nS11. INSIDE THE TRIANGLE: For an individual development, the \nmaximum block length shall be 250 feet by 250 feet from curb \nto curb. Departures shall be considered by the Manager based \non one or more of the conditions listed in Section 7.0503(A)(1)\n(S10) above. \n \nOUTSIDE THE TRIANGLE: For an individual development, the \nmaximum block length shall be 300 feet by 300 feet from curb \nto curb. Departures shall be considered by the Manager.\nS12. All other Standards from Section 7.0100 Corridor Design \nDistrict (excluding those under the heading Commercial, \nIndustrial, and Institutional) and Single Detached Dwelling and \nTownhouse Standards from Section 7.0200 and 7.0400 shall \napply.\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nResidential: Multifamily/Townhouse\nG11. Within multifamily developments, \nblock sizes shall be limited to promote \npedestrian connectivity, accessibility \nand to allow for the infiltration of \nsunlight and air.\nG12. Streets that are pedestrian-friendly \nshall be created where possible. \nTypical characteristics of people-\nfriendly streets include gracious wide \nsidewalks, street trees, on-street \nparking, and buffering between \npedestrian areas and travel lanes, for \nexample. \n300’\n300’\nFig. A.1.S11 OUTSIDE THE TRIANGLE: Maximum \nblock size: Multifamily development.\nFig. A.1.S10.e:  A mid-block pedestrian path improves the walkability of dense urban \nneighborhoods.\n1. IÄã\u009b¦Ù\u0083ã\u009b\u0097 S®ã\u009b D\u009bÝ®¦Ä, CÊÄã®Äç\u009b\u0097\nFig. A.1.G12: Streets that include street trees, wide \nsidewalks and other amenities encourage greater \npedestrian usage and are more attractive.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": "City of Gresham Development Code\n[7.05] - 15\n(06/22)\n2. Bç®½\u0097®Ä¦ FÙÊÄã\u0083¦\u009b \u0083Ä\u0097 P½\u0083\u0091\u009bÃ\u009bÄã \nIntent: To ensure buildings are oriented in a manner appropriate to \nthe use and to enhance pedestrian accessibility and place the \nmost visually interesting facade in public view. \nApplicable Rockwood Design Principles from Section 7.0502: \nA. Physical Environment\nC. Safe Design\nD. Transportation Modes\nE. Open Space\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1 and G2. Buildings shall be located to \npositively define public streets and \ncivic spaces, such as public plazas. \na. Parking, loading, service and \nvehicular circulation areas shall \nbe located so as to allow desired \nuses and activities to face the \nstreet and to support pedestrian-\noriented streets. \nb. The pedestrian shall have principal \naccess into the building from \nthe sidewalk. Clear pedestrian \nconnections shall be established \non-site; for example, direct \npedestrians from surface or \nstructure parking to buildings, \nstreets, and public spaces.\nc. As long as street and/or \nretail continuity is not unduly \ninterrupted, arcades or \ncolonnades, if utilized, shall be \nintegrated along the sidewalk \nedge.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development\nS1. INSIDE THE TRIANGLE: Along public street frontages, building \nsetbacks shall be dependent upon their street location as \nfollows:\na. Stark Street - between zero and 5 feet from the right-of-\nway (min. and max.);\nb. 181st Avenue - between zero and 5 feet from the right-of-\nway (min. and max.);\nc. Burnside Street - between 10 and 15 feet from the right-\nof-way (min. and max.);\nd. 185th Ave./187th Ave./Ash Street/Future 182nd and 183rd \nAvenues - between 10 and 15 feet from the right-of-way \n(min. and max.);\ne. Pine/Oak Streets - between 10 and 15 feet from the right-\nof-way (min. and max.);\n \nOUTSIDE THE TRIANGLE: For commercial and institutional \ndevelopment, the front building setbacks shall be a minimum \nof zero feet to a maximum of 10 feet in the Rockwood Town \nCenter (RTC) and a minimum of zero feet to a maximum of 20 \nfeet in the Station Center (SC) and the Station Center-Ruby \nJunction (SC-RJ) land use districts. Portions of the building \nsetback greater than 5 feet within this frontage requirement \nshall be heavily landscaped, meeting requirements set forth in \nSection 7.0503(A)(6).\nS2. Parking, loading service and vehicular circulation areas (except \nfor a side entry drive) shall be behind the maximum setback or \nbehind a line drawn parallel to the street at the point where \nthe building is closest to the street, whichever is closest to \nthe street. In no circumstance shall the parking and loading \nservice be closer than the minimum building setback. For sites \nwith multiple frontages, parking may be allowed up to the \nminimum setback regardless of building location as approved \nby the Manager or Design Commission. Standards for \nminimum building frontage along a street shall be considered \nwhen making this determination.\nFig. A.2: Buildings located at the street define the street \nedge and create a pedestrian-friendly development \npattern.\nFig A.2.S1 OUTSIDE THE TRIANGLE: Commercial \nbuildings shall be placed close to the street with \na landscaped area between the building and the \nsidewalk.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": "City of Gresham Development Code\n[7.05] - 16\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued \nG3. Sufficient length of buildings shall \nbe present to maintain a continuous \nbuilding street wall and in general \nlimit spatial gaps to those necessary \nto accommodate vehicular and \npedestrian access in order to define \nthe street edge. \nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued \nS3. Building Frontage: Building frontage shall be measured by \nthe length of the building present between the minimum \nand maximum setback. Space attributed to public streets, \ndriveways and primary internal drives and their associated \nrequired landscaping shall be subtracted from the total length \nof the frontage calculations. Commercial, institutional, and \nmixed-use development frontage on existing or new public \nstreets shall be dependent upon their street location and shall \nbe no less than the following values:\n \nINSIDE THE TRIANGLE:\na. Stark Street – 90 percent building frontage;\nb. 181st Avenue – 90 percent building frontage;\nc. Burnside Street – 75 percent building frontage; \nd. 185th Ave./187th Ave./Ash Street/Future 182nd and 183rd \nAvenues – 75 percent building frontage; and\ne. Pine/Oak Streets – 75 percent building frontage. \n \nOUTSIDE THE TRIANGLE: For commercial and institutional \ndevelopment, public street frontages shall be occupied \nby building facades for a minimum of 60 percent of the \nfrontage length. For residential development (multifamily and \ntownhouse), the residential front building setbacks shall be \na minimum of 5 feet to a maximum of 20 feet in RTC, SC and \nSC-RJ land use districts and public street frontages shall be \noccupied by building facades for a minimum of 50 percent of \nthe frontage length. \n2. Bç®½\u0097®Ä¦ FÙÊÄã\u0083¦\u009b \u0083Ä\u0097 P½\u0083\u0091\u009bÃ\u009bÄã, CÊÄã®Äç\u009b\u0097\nFig. A.2.S1.a and A.2.S3.a: Stark Street: Zero to 5-foot \nsetback and 90 percent building frontage.\nFig. A.2.S1.b and A.2.S3.b: 181st Avenue: Zero to \n5-foot setback and 90 percent building frontage.\nFig. A.2.S1.c and A.2.S3.c: Burnside Street: 10- to 15-\nfoot setback and 75 percent building frontage.\nFig. A.2.S1.e and A.2.S3.e: Pine and Oak Streets: 10- \nto 15-foot setback and 75 percent building frontage.\nFig. A.2.S1.d and A.2.S3.d: 185th Ave./187th Ave./Ash \nStreet/Future 182nd and 183rd Avenues: 10- to 15-foot \nsetback and 75 percent building frontage.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 17,
      "text": "City of Gresham Development Code\n[7.05] - 17\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS4. If a building resides on a corner with frontage on both streets, \nthe frontage requirement shall apply to the street with the \nhighest functional classification. One hundred percent of \nthe frontage at street intersections shall be occupied by \nbuildings or pedestrian-oriented open spaces for a minimum \ndistance of 60 feet, as measured along the minimum setback \nline, except as required to meet clear vision requirements \nfor developments with direct access to a major or standard \narterial street.\nS5. Pedestrian-oriented open spaces may count towards the \nfrontage requirement along a street frontage on existing public \nstreets up to 10 percent of the total requirement when:\na. Pedestrian-oriented open spaces between the right \nof way and the building facade as long as the building \nfacade is not more than 40 feet from the right of way. This \ndistance may be increased at the intersection of streets to \naccommodate clear vision triangles at the discretion of the \nManager. \nb. The space contains vertical elements that screen any \noff-street parking that would be visible from the street \nthrough the open space and define the street edge.\nc. Parking shall be generally located on the side, interior or \nrear of the site and shall not be present along the public \nstreet frontages. Parking is permitted to front 185th and \n187th Streets if a screening wall or hedge at a height of 30 \ninches is provided as a buffer.\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG4. Greater concentrations of buildings \nand building mass shall be present at \nthe intersection of streets to better \ndefine these areas. \na. Buildings that converge along \ndifferent street types shall provide \na graceful transition from taller \nbuildings to lower buildings.\nb. Buildings at corners may be set \nback to promote visibility into \npublic open spaces at these \nlocations.\nG5. Developments may pull back from the \nstreet edge to accommodate plazas, \noutdoor cafe areas, or gracious entry \nfore-courts, provided street continuity \nis not unduly interrupted along the \nmajority of the block.\n2. Bç®½\u0097®Ä¦ FÙÊÄã\u0083¦\u009b \u0083Ä\u0097 P½\u0083\u0091\u009bÃ\u009bÄã, CÊÄã®Äç\u009b\u0097\nFig. A.2.S3.f: Diagram showing a 90 percent building \nfrontage configuration with driveways excluded from \ncalculations.\nDriveways \nexcluded \nfrom \ncalculations\nFig. A.2.G4: A building that transitions height \nsuccessfully at the corner.\nFig A.2.S3 OUTSIDE THE TRIANGLE: Multifamily buildings shall be placed close \nto the street, but shallow setbacks are allowed to increase the level of privacy for \nindividual units.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 18,
      "text": "City of Gresham Development Code\n[7.05] - 18\n(06/22)\n2. Bç®½\u0097®Ä¦ FÙÊÄã\u0083¦\u009b \u0083Ä\u0097 P½\u0083\u0091\u009bÃ\u009bÄã, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG6. If an open space is present at an \nintersection, buildings shall be present \non internal open space edges that \ndefine and activate the space.\nException: Civic Uses \nG7. Civic buildings shall be placed to \nprovide continuous visual interest to \nthe pedestrian.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS6. If a pedestrian-oriented open space is present at an \nintersection of two public streets, its internal site edges shall \nbe lined by buildings for 80 percent of their length.\nException: Civic Uses\nS7. To provide greater flexibility and to emphasize the importance \nof civic uses, civic buildings do not have to meet the \nmaximum setback requirements so long as parking is not \nlocated between the building frontage and the primary street \nfrontage. However, alternative frontage treatments shall meet \nthe following objectives, as determined by the Manager or \nDesign Commission: \na. The building(s) shall emphasize civic use(s) and shall \ninclude visually prominent architecture visible from the \nadjoining public street of the highest traffic volume street \nclassification;\nb. The site design treatment shall contribute to the desired \npedestrian-oriented character of the Triangle Area by \nproviding public open space of a minimum of 600 square \nfeet in size; and \nc. There is a direct and inviting pedestrian connection \nbetween the building and the street.\nFig. A.2.S7: Civic buildings may have increased setbacks so long as no parking is \nlocated between the building and the street.\nFig. A.2.G5: A building which uses an increased \nsetback to accommodate an outdoor cafe.\nFig. A.2.S5: An open space located at an intersection \nwith its edges defined by buildings on internal site \nedges.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 19,
      "text": "City of Gresham Development Code\n[7.05] - 19\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nResidential Development: Multifamily and Townhouse\nS8. On-site surface parking areas, garages, and vehicular \ncirculation areas shall be located to the side or rear of the \nbuilding and shall not be present between the building and the \nstreet except for individual driveways for Plex and Townhouse \nstyle units. Any street-facing garages shall have a maximum \nwidth of 50 percent of the overall building width.\nS9. If a pedestrian-oriented open space is present at an \nintersection, its internal site edges shall be lined by buildings \nfor 60 percent of their length.\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nResidential: Multifamily/Townhouse\nG8. Buildings shall promote an active \nstreet environment that minimizes \npedestrian conflicts with drives and \nthe impact of street facing garages. \n \nG9. If an open space is present at an \nintersection, buildings shall be present \non internal site edges that define and \nactivate the space.\n2. Bç®½\u0097®Ä¦ FÙÊÄã\u0083¦\u009b \u0083Ä\u0097 P½\u0083\u0091\u009bÃ\u009bÄã, CÊÄã®Äç\u009b\u0097\nFig. A.2.S8: A series of duplex style units with parking \nlocated at the rear of the site and not visible from the \nstreet.\nFig. A.2.G8: Townhouses provide individual unit entries on the street, with parking \nlocated to the rear to minimize pedestrian conflicts and impacts from garages.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 20,
      "text": "City of Gresham Development Code\n[7.05] - 20\n(06/22)\n3. P\u009b\u0097\u009bÝãÙ®\u0083Ä C®Ù\u0091ç½\u0083ã®ÊÄ\nIntent: Create a network of pedestrian-oriented connections that \nsupports the larger street and open space network and \nencourages appropriately scaled and oriented development.\nApplicable Rockwood Design Principles from Section 7.0502: \nA. Physical Environment\nB. Sustainability\nC. Safe Design\nD. Transportation Modes\nG. Compatibility\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1. Section 9.0824 Pedestrian Circulation/\nWalkways and Sections 7.0103(A)(3) \napply. \nG2. Convenient, direct and accessible \npedestrian routes to and from public \nsidewalks and transit facilities shall be \nprovided.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development\nS1. The Standards found in Section 9.0824 Pedestrian Circulation, \nSection 7.0103(A)(3) and Section 7.0503(A)(1) apply.\nS2. Pedestrian Environment and Access to Transit Facilities \na. Development shall provide convenient, direct, and barrier-\nfree pedestrian circulation between buildings and adjacent \nlight rail stations, park and ride facilities, public sidewalks, \nand pedestrian routes. All buildings and sites shall orient \ntheir on-site pedestrian circulation to the closest adjacent \nlight rail station. Pedestrian activity centers within one-\nquarter mile walking distance should also be considered in \nthe layout of pedestrian circulation.\nb. On-site vehicular and pedestrian circulation design shall \nminimize vehicular/pedestrian conflicts (e.g. driveway \ncrossings).\nc. Enhanced accessible pedestrian spaces and amenities are \nencouraged, such as plazas, arcades, gallerias, courtyards, \noutdoor cafes, widened public sidewalks (more than 6 feet \nwide outside the public right of way), benches, shelters, \nstreet furniture, public art, kiosks, and street vending. \nCovered walks are also encouraged between primary \nbuilding entries and adjacent public sidewalks and on \nother on-site walkways.\nFig. A.3: A walkway which connects an open space to \nan abutting mixed-use building.\nFig. A.3.G4: A walkway provides additional connectivity \nwhere an automobile connection would not be feasible.\nFig. A.3.S4.a: A well-landscaped walkway creates a \npleasant pathway through a parking area.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 21,
      "text": "City of Gresham Development Code\n[7.05] - 21\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued \nG3. Well-defined pedestrian walkways \nfrom parking areas shall be provided \nto link to public sidewalks throughout \nthe site.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS3. For surface parking lots greater than 20 spaces, a safe, \nattractive pathway consistent with Section 7.0432(H)(1,2) shall \nbe provided between the parking areas and the building.\nFig. A.3.S3: A defined walkway links the parking area to the street and sidewalk.\nFig. A.3.G3: An attractive walkway is provided in a \nlarge parking area which connects the building entry to \nother walkways.\n3. P\u009b\u0097\u009bÝãÙ®\u0083Ä C®Ù\u0091ç½\u0083ã®ÊÄ, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 22,
      "text": "City of Gresham Development Code\n[7.05] - 22\n(06/22)\n3. P\u009b\u0097\u009bÝãÙ®\u0083Ä C®Ù\u0091ç½\u0083ã®ÊÄ, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG4. Pedestrian circulation routes shall \ncomply with the following guidelines:\na. Where pedestrian circulation \nroutes, such as mid-block paths, \nintersect major streets, features \nshall be present that give \nprominence to these locations.\ni. \nThese elements shall \ncontribute to pedestrian \ncirculation having a higher \npriority than vehicular \ncirculation in the design and \nlayout of development sites in \nthe Triangle.\nii. Pedestrian and/or bike \nconnections shall connect \nresidential areas, retail centers \nand open spaces. Pedestrian, \nbike and visual connections \nshall also be made wherever \nauto connections are not \nfeasible.\niii. Clear and safe pedestrian \nroutes shall be provided \nthrough parking areas to \nprovide pedestrian access \nbetween buildings with \nminimal conflicts with \nvehicles. Where walks cross \ndrive aisles, they shall be \nclearly marked with visually \ncontrasting paving. \nb. Pedestrian circulation routes, \nincluding sidewalks and mid-block \npaths, shall be present where \nnecessary to enhance connectivity.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued \nS4. Where publicly accessible open spaces meet Burnside, Stark or \n181st, they shall:\na. Incorporate a minimum of one of the following elements \nfrom the major or standard arterials and boulevards into \nthe larger Triangle neighborhood:\ni. \nAn entry gate feature;\nii. Columns;\niii. Special lighting which compliments the building \narchitecture (at least two lighting features to frame \nthe entry); or \niv. Art work approved by the Manager. \nFig. A.3.S4.b: A covered walkway adds prominence to \nthis walkway.\nFig. A.3.S4.c: A key intersection is bordered by a plaza with a fountain, walking paths \nand a building with a turret fronting the intersection in the background.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 23,
      "text": "City of Gresham Development Code\n[7.05] - 23\n(06/22)\n4. P\u0083Ù»®Ä¦, LÊ\u0083\u0097®Ä¦, \u0083Ä\u0097 S\u009bÙò®\u0091\u009b AÙ\u009b\u0083Ý\nIntent: To ensure buildings are placed in appropriate locations \nto define the street, create a comfortable pedestrian \nenvironment, minimize the visual impact of parking from \nprimary streets and to minimize the negative impacts that \nrequired service functions, such as deliveries and trash \nremoval, have on surrounding areas and adjacent properties.\nApplicable Rockwood Design Principles from Section 7.0502: \nA. Physical Environment\nC. Safe Design\nD. Transportation Modes\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1. Surface parking areas and lots, loading \nservice and vehicular circulation areas \nshall be located at the rear of the \nsite or on the interior of the site and \nremoved from the adjacent light rail \nstation, except as noted in Section \n7.0503(A)(4)(S1).\nG2. The design of surface parking areas, \nincluding a landscaped buffer, shall \ninclude the following:\na. Parking is accessed by common \ndriveways from secondary streets.\nb. Parking areas are designed as \nsmaller, connected lots rather than \nlarge lots.\nc. Layout shall accommodate \npedestrian circulation.\nd. The functional requirements of \nparking are balanced with the \nprovision of pedestrian amenities.\ne. Transition areas between \nparking and civic, commercial, or \nresidential uses are designed with \ntextured paving, landscaping and \nstreet furniture.\nf. \nChoice of plantings, buffer width, \ntype of screening, and location \nand frequency of tree planting \nare appropriate for a town center \nsetting.\ng. Drainage improvements are \ndesigned as natural landscape \nfeatures to the greatest extent \npractical.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý \nAll Development\nS1. Off-Street parking, loading service and vehicular circulation \narea is prohibited between the building and the street or \nprimary internal drive. Exceptions to this Standard include \ndevelopments which front on 185th and 187th Avenues, which \nmust provide a 30 inch decorative wall or hedge to buffer the \nparking area. Parking and maneuvering areas, except spaces \ndesignated for park and ride or kiss and ride use, should be \nlocated on portions of the site that are furthest in walking \ndistance from an adjacent rail station. \nS2. All off-street surface parking shall have a landscaped buffer in \ncompliance with Section 9.0823 Landscaping of Parking Lots \nbetween the back of the sidewalk and the parking area.\nFig. A.4.G1: A multifamily development with buildings lining the perimeter of the \nblock and parking located in an internal area.\nFig. A.4: Trees, shrubs, and a decorative fence buffer \nthe parking area from an adjacent walkway.\nParking\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 24,
      "text": "City of Gresham Development Code\n[7.05] - 24\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG3. Surface parking areas shall not \nbe located adjacent to street \nintersections. Structured parking \nfacilities with active ground floor uses \nmay locate in these areas.\nG4. Structured parking shall meet the \nfollowing guidelines:\na. Below grade and structured \nparking facilities are especially \nencouraged.\nb. Parking facilities shall be located \nand oriented to the rear or interior \nof the property to minimize \nnegative visual impacts. Parking \ngarages shall incorporate active \nuses at the ground level along \npublic streets, especially at \ncorners.\nc. Structured parking layouts shall \nprovide pedestrian circulation and \nconnections with building uses.\nG5. The number of vehicular access \npoints shall be minimized by locating \nvehicular entries on alleys and \nsecondary streets. Pedestrian safety \nmeasures shall be provided, such as \nsignage, textured surfaces at entries, \nand other design techniques.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS3. Parking lots shall not be located adjacent to street \nintersections. Parking structures may be located at street \nintersections provided commercial uses occupy the ground \nfloor at the street corner. The depth of the commercial space \nshall be at least 30 feet and its total length per side shall be at \nleast 50 feet.\nS4. Structured parking facilities shall be designed to accommodate \ncommercial or residential uses on the ground floor level, be \nconcealed within the site, or shall be located under or above \nthe ground floor of buildings. Where structured parking is \nprovided on the ground floor, residential or retail uses shall be \nprovided along the street front with parking facilities placed \nbehind the uses and away from streets. Structured parking \non upper floors along streets shall be allowed if the facade \nmeets articulation standards and transparency standards set \nforth in Sections 7.0503(B)(1), 7.0503(B)(4) and 7.0503(B)(5). \nGround level structured parking exposed to the street shall be \nprohibited except for the following:\na. Required driveways; and \nb. Where the design features add visual interest to the \npedestrian; and \nc. When unwanted views into garages are minimized; and \nd. When the requirements of Sections 7.0503(B)(1) and \n7.0503(B)(4) are met. \nS5. Where alleys are present, vehicular access shall be from the \nalley where practical.\n4. P\u0083Ù»®Ä¦, LÊ\u0083\u0097®Ä¦, \u0083Ä\u0097 S\u009bÙò®\u0091\u009b AÙ\u009b\u0083Ý, CÊÄã®Äç\u009b\u0097\nFig. A.4.G2: A landscaped area is used to divide a large parking area into series of \nsmaller lots.\nFig. A.4.G4: A parking structure with retail uses on the \nground floor.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 25,
      "text": "City of Gresham Development Code\n[7.05] - 25\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG6. Service areas shall be located away \nfrom public view to the greatest \ndegree possible and shall minimize \nvisual, acoustic and lighting impacts on \nsurrounding areas.\na. The use of liner spaces to screen \nservice areas on the side or \nbehind a building facing a street is \nencouraged.\nb. The operations within service \nareas shall respect adjoining \nproperty owners and not create \nundue negative impacts.\nc. Service and loading areas shall not \nbe highly visible from a light rail \nstation or transitway.\nd. Section 7.0503(A)(4)(S6)(d) shall \nbe met.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS6. When dedicated loading facilities are required, loading areas \nshall be located at the rear of the building or as approved by \nthe Manager or Design Commission. If loading areas cannot \nbe located at the rear of the building, they may be placed \nalong the building’s side and recessed from the front facade a \ndistance which minimizes visual impacts and prevents vehicles \nfrom extending onto adjacent walkways. Required loading area \ndimensions can be found in Section 9.0840.\na. Dedicated loading such as loading docks shall be screened \nparallel to the building wall with liner spaces or walls \nintegrated into the building and no less than 16 feet \nin height. This area may count towards the frontage \nrequirement if it meets the Standards within the Facade \nComposition and Building Articulation described in \nSections 7.0503(B)(1) and 7.0503(B)(4). The liner spaces \nor walls shall fully conceal service vehicles except at the \nentry in order to allow for safe vehicular movement while \nexiting.\nb. Liner spaces and screening walls shall include articulation, \nmaterials and detailing identical to the principal building.\nc. Service and loading areas shall be visually screened from a \nlight rail station or transit way.\nd. When located next to residential areas, service vehicles \nshall not be left idling in excess of 10 minutes between the \nhours of 10 p.m. and 6 a.m. Signage shall be posted in a \nvisible location within the loading area to inform drivers of \nthis requirement.\n4. P\u0083Ù»®Ä¦, LÊ\u0083\u0097®Ä¦, \u0083Ä\u0097 S\u009bÙò®\u0091\u009b AÙ\u009b\u0083Ý, CÊÄã®Äç\u009b\u0097\nFig. A.4.S6.c: Site design diagram showing a potential service area configuration.\nService area \nlocated away \nfrom public view. \nScreening wall \nintegrated into the \nbuilding.\nDouble row of \nconifer trees.\nSite buffering \nmasonry wall.\nFig. A.4.S6.a: A loading area that is incorporated into \nthe side of a building, but located away from the entry \nand other active areas.\nFig. A.4.S6.b: Screening wall of a loading area using \nsimilar materials and articulation as the primary \nstructure.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 26,
      "text": "City of Gresham Development Code\n[7.05] - 26\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG7. Service areas in public view, such \nas dumpster enclosures, shall be \nattractively designed in a manner that \ncomplements surrounding buildings.\nG8. Service area screening shall \nincorporate strategies which provide \nyear-round screening and buffering \nsuch as walls, intensive landscaping \nand berms. Screening shall be \npresent along the site perimeter and \nintensified at service areas to mitigate \nany potential visual or acoustic \nimpacts on surrounding properties.\nFig. A.4.G6: Service areas located away from public \nareas of the site.\nFig. A.4.G8: A service area is screened by walls with a \ncharacter similar to the adjacent building.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS7. In addition to requirements stated in Section 7.0212 Solid \nWaste and Recycling Collection Area, the collection areas \nshall be entirely screened and enclosed by a masonry wall of \nat least 6 feet in height that is designed using materials and \ndetailing which are identical to the main building.\nS8. Loading and Service Area Perimeter Site Screening.\na. In addition to buffering and screening requirements \nspecified in Section 9.0110, a 6- to 8-foot foot masonry \nwall, 2.5-inch caliper trees and shrubs capable of reaching \n5 feet within five years of planting are required. \nb. When dedicated loading facilities abut or face residential \nproperties, an additional five evergreen trees per 100 feet \nshall be planted along the perimeter buffer within line of \nsight of the opening of the dedicated loading facility in \norder to provide year-round screening. This requirement \nwill be waived if liner spaces are used in place of a \nscreening wall.\n4. P\u0083Ù»®Ä¦, LÊ\u0083\u0097®Ä¦, \u0083Ä\u0097 S\u009bÙò®\u0091\u009b AÙ\u009b\u0083Ý, CÊÄã®Äç\u009b\u0097\nFig A.4.S8: Conifer trees provide year-round screening to service and loading areas.\nFig. A.4.S7: A masonry enclosure screens dumpsters while complimenting the \ndesign of the building.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 27,
      "text": "City of Gresham Development Code\n[7.05] - 27\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional Development\nG9. Parking located at the street frontage \non the side of a building shall be \nminimized.\nResidential Development: Multifamily and \nTownhouse\nG10. Parking located at the street frontage \non the side of a building shall be \nminimized.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development\nS9. Required off-street parking shall be located to the rear, \ninterior, side, on top of or beneath the structure.\n \nINSIDE THE TRIANGLE: Parking located to the side of the \nbuilding shall be limited to 10 percent of the overall frontage. \n \nOUTSIDE THE TRIANGLE: Parking located to the side of the \nbuilding shall be limited to 40 percent of the overall frontage. \nResidential Development: Multifamily and Townhouse\nS10. INSIDE THE TRIANGLE: In addition to requirements specified in \nSection 7.0103(A)(4) Parking, Loading, and Service Areas for \nmultifamily and townhouse style developments and Section \n7.0432(F) Vehicular Circulation and Parking, required off-\nstreet parking shall be located to the rear, interior, side, on \ntop of or beneath the structure. Parking located to the side of \nthe building shall be limited to the area along the street not \nrequired for building frontage and landscaping. \n \nOUTSIDE THE TRIANGLE: In addition to requirements specified \nin Section 7.0103(A)(4) Parking, Loading, and Service Areas for \nmultifamily and townhouse style developments, required off-\nstreet parking shall be located to the rear, interior, side, on top \nof or beneath the structure. Parking located to the side of the \nbuilding shall be limited to 50 percent of the overall frontage.\n4. P\u0083Ù»®Ä¦, LÊ\u0083\u0097®Ä¦, \u0083Ä\u0097 S\u009bÙò®\u0091\u009b AÙ\u009b\u0083Ý, CÊÄã®Äç\u009b\u0097\nFig. A.4.S10 OUTSIDE THE TRIANGLE: An internal parking area is visible behind \ntownhouses which line the street.\nFig. A.4.S9 OUTSIDE THE TRIANGLE: A limited \namount of parking may be placed on the side of a \nbuilding at the street edge when screening is present.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 28,
      "text": "City of Gresham Development Code\n[7.05] - 28\n(06/22)\n5. OÖ\u009bÄ SÖ\u0083\u0091\u009bÝ\nIntent: To create a network of pedestrian spaces that supports the \nlarger street and open space network. Open spaces shall be \ndeveloped as a focal point of large development, encouraging \npedestrian activity in highly visible locations.\nApplicable Rockwood Design Principles from Section 7.0502: \nA. Physical Environment\nB. Sustainability\nD. Transportation Modes\nE. Open Space\nF. Landscaping\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1. Sites abutting or facing a light rail \nstation shall be linked for pedestrians \nas directly as possible with attractive \nopen space.\nCommercial and Institutional Development\nG2. Well-defined open spaces, such as on-\nsite plazas, interior courtyards, patios, \nterraces and gardens, are critical to \nthe Triangle’s public realm and are \nespecially encouraged in association \nwith large developments. The total \namount of open spaces shall relate to \nthe size of the overall development. \nG3. The dimensions of outdoor spaces \nshall be sufficient to encourage \nusage and activity. They shall be \nproportioned and designed to be \ncomfortable for human activity and \nsocial interaction – standing, sitting, \ntalking. \nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development\nS1. Sites abutting or facing a light rail station shall be linked \nas directly as possible by a continuous on-site landscaped \ncourtyard plaza or square that leads directly to the station \nor public walkways accessing the station. Areas for the \ncourtyards, plazas, or squares must contain seating and \nlandscaped areas with trees. \nCommercial and Institutional Development\nS2. For sites larger than 20,000 square feet, developments shall \ninclude pedestrian-oriented open space of a size no less than 4 \npercent of all ground floor commercial space on site, or 1,000 \nsquare feet, whichever is less. Publicly accessible open spaces \nmay count toward landscaped area requirements and may \ncount toward building frontage for the development site if the \npedestrian-oriented open space has a clear visual and physical \nconnection to the street.\nS3. Publicly accessible open spaces shall have a minimum width \nof 20 feet and a minimum depth of 20 feet unless otherwise \napproved by the Manager or Design Commission due to site \nconstraints such as site size, site shape or topography.\nFig. A.5: A pedestrian-oriented open space 20 feet in \nwidth.\nFig. A.5.S4.a: A pedestrian-oriented open space visible from the street and within 50 \nfeet of the building entry.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 29,
      "text": "City of Gresham Development Code\n[7.05] - 29\n(06/22)\n5. OÖ\u009bÄ SÖ\u0083\u0091\u009bÝ, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG4. Open spaces shall be sited in \naccordance with the location and \nscale of adjacent streets, buildings, \nand uses; for instance, on-site \nplazas shall not unduly interrupt \nthe retail continuity of streets in the \nTriangle. Publicly accessible open \nspaces intended for public use shall \nbe located at or near street grade \nto promote physical and visual \nconnection to the street.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS4. Publicly accessible open spaces shall be visible from a public \nstreet frontage or primary internal drive and a building \nentrance shall be located within 40 feet of a pedestrian-\noriented open space. \na. At the discretion of the Manager or Design Commission, \nopen space may be located on other areas of the site \nin order to preserve a natural feature of the site but \nmust remain visible from the adjacent buildings. Direct \npedestrian access to active open space areas of the site \nshall be provided if the spaces are not accessible via other \ncirculation routes.\nb. Spaces may be located above or below grade provided \nthey are publicly accessible during normal business hours.\nc. Publicly accessible open spaces located between a building \nand a sidewalk shall provide direct pedestrian access to \nthe abutting building.\nFig. A.5.G4: A public space adjacent to the street and at the same grade ensures \nphysical and visual connection to the street and accessibility of all users.\nFig. A.5.S4.b: Building entries are easily accessible from the street via walkways \nthrough the open space.\nFig. A.5.G5.a: A public space which captures rainwater \nfor irrigation of landscaping on site.\nFig. A.5.S5.a: Decorative paving improves the \nappearance of this open space.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 30,
      "text": "City of Gresham Development Code\n[7.05] - 30\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS5. Publicly accessible open spaces shall incorporate at a \nminimum the following:\na. At least 30 percent of the area shall be planted with trees, \nshrubs, groundcover and perennial landscape plantings \nand shall meet the landscape standards of Section \n7.0503(A)(6).\nb. At least 50 percent of the area shall be hardscaped with \ndecorative paving.\nc. There shall be at least one bench or seating unit for each \n200 square feet of area (seating may be grouped into \nbenches or ledges).\nd. Structural soil, silva cells or approved special soil \ntreatment that is at least 24 inches deep shall be used as \nsoil base for trees in plazas to prevent soil compaction and \nto encourage tree root growth.\ne. Pedestrian-scaled lighting fixtures no taller than 18 feet.\nf. \nOne element with sustainability attributes such as rain \ngardens, green roofs and walls, commercial grade solar \npowered lights or equipment, pervious paving, or other \nelements as determined by the Manager or Design \nCommission. \ng. One artistic design element such as decorative paving \npatterns, ornamental art features, creative lighting \nelements, etc. or other elements as approved by the \nManager or the Design Commission.\nFig. A.5.S5.b: A pedestrian space \nincorporates pervious paving and other \nstormwater management techniques.\n5. OÖ\u009bÄ SÖ\u0083\u0091\u009bÝ, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG5. Publicly accessible open spaces shall \nbe designed with strategies and \nfeatures that encourage activity within \nthe space.\na. Incorporate features that advance \nsustainable principles, such as \nuse of gray water, solar collection \nfor powering pumps or lighting, \nrain gardens, pervious paving, \ncontainers for recycling, and \nbenches made from recycled \nmaterials.\nb. Design spaces with safety in mind: \non-site plazas shall promote \nvisibility from the street and \nprovide lighting to enhance \nnighttime security.\nc. Encourage the presence of uses \nthat will activate outdoor space \nand complement street activity, \nsuch as locating retail, outdoor \ncafes, and vendors within a plaza \nor around its perimeter.\nd. Add a focal element, such as a \nsculpture, fountain, or other art \npiece to draw people into the \nspace.\ne. Link adjoining outdoor spaces with \ncomfortable paths and walks to \ncreate a network of spaces.\nFig. A.5.G5.c: An open space intended \nfor dining with tables and chairs \nencourages activity next to a cafe.\nFig. A.5.G5.b: A fountain is used as a focal point of a \npublic space and encourages activity.\nFig. A.5.S6.a: Sidewalks comprised \nof brick pavers greatly enhance the \ncharacter of the streetscape.\nFig. A.5.G6:  Enhanced sidewalks \ngreatly contribute to the appearance \nof large developments and may count \ntoward open space requirements.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 31,
      "text": "City of Gresham Development Code\n[7.05] - 31\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS6. Sidewalks and amenity zones on public streets and primary \ninternal drives that receive enhanced design and intensive \nstreetscaping may be counted toward the pedestrian-oriented \nopen space requirement under the following conditions: \na. All designs within the public right-of-way must meet the \nPublic Works Standards or receive a Design Modification.\nb. Enhanced streetscape shall be present for a consecutive \ndistance of 400 feet on one side abutting the street \nor primary internal drive or for 200 feet abutting \nboth sides of a public street or primary internal drive. \nEnhanced streetscape does not have to meet the \nminimum pedestrian-oriented open space dimensional \nrequirements. \nc. Buildings in this area shall contain transparent glazing for \n60 percent of the area between the heights of 2 feet and \n12 feet.\nd. Only areas directly in front of buildings and areas which \nmeet the Public Works Standards or receive a Design \nModification shall count toward this requirement.\ne. Enhanced streetscapes shall include a minimum of three \nof the following requirements to qualify: \ni. \nProvide sidewalks and amenity zones with decorative \npaving for the required length as stated above in this \nsection. Decorative paving includes stone pavers, brick \npavers, decorative concrete pavers, or other pavement \ntreatments as approved by the Manager or Design \nCommission.\nii. INSIDE THE TRIANGLE: Provide trees of 3-inch \nminimum caliper and other landscape plantings \nlocated in the amenity zone. Trees shall be spaced an \naverage of no greater than 30 feet apart. \nOUTSIDE THE TRIANGLE: Provide trees of 2.5-inch \nminimum caliper and other landscape plantings in \ndecorative raised planters located in the amenity zone. \nTrees shall be spaced an average of no greater than 30 \nfeet apart.\niii. Decorative benches or other durable, permanent \nseating features shall be placed within the amenity \nzone with an average placement of two seats per 50 \nlinear feet of sidewalk.\niv. Include one public art piece per 200 feet of sidewalk.\nv. Decorative pedestrian level lighting no taller than 18 \nfeet placed within the amenity zone and at consistent \nspacing.\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG6. Greatly enhanced streetscapes may \ncount as open spaces if they contain \namenities that significantly improve \nthe character of the street.\nFig. A.5.S6.b: Sidewalks that received additional \ndesign features may be counted as pedestrian-oriented \nopen spaces.\n5. OÖ\u009bÄ SÖ\u0083\u0091\u009bÝ, CÊÄã®Äç\u009b\u0097\nFig. A.5.S6.c: A streetscape which features decorative \npaving, trees in planters, benches and pedestrian-level \nlight fixtures compliments the abutting building with \nhigh levels of transparency and frequent entries.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 32,
      "text": "City of Gresham Development Code\n[7.05] - 32\n(06/22)\n5. OÖ\u009bÄ SÖ\u0083\u0091\u009bÝ, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ:\nResidential Development: Multifamily and \nTownhouse\nG7. Publicly accessible open space serving \nmultifamily development shall follow \nthe Guidelines specified in Section \n7.0103(A)(5) and the following \nGuidelines:\na. Provide at least one landscaped \ncommon open space in \nmultifamily building developments \nfor use by residents. The open \nspace shall be easily accessible \nto all residents and contain areas \nof hardscape pavement and \nlandscape plantings. This space \nmay count as part of the required \nlandscaped space.\nb. Open space shall be provided \nthrough ground level courtyards, \nresidential courtyards at upper \nlevels, or rooftop decks and \ngardens.\nc. Common open spaces \nshall provide amenities to \naccommodate a variety of ages \nand activities to enhance the \nlivability in the Triangle.\nd. Incorporate communal garden \nspaces that use rain water and \nallow residents to grow vegetables \nand flowers.\ne. Open spaces shall be easily visible \nand accessible from adjacent \nresidential units on the same site \nfor safety and accessibility. Provide \nan appropriate level of pedestrian \nlighting and avoid safety risks \nassociated with areas hidden from \nview.\nf. \nOpen spaces shall not be located \nnext to dumpster enclosures, \nloading/service areas or other \nincompatible uses.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nResidential Development: Multifamily and Townhouse \nS7. Multifamily Residential Open Space Standards, Section \n7.0103(A)(5), shall apply.\nFig. A.5.S7: A shared open space which is fronted by several multifamily buildings.\nFig. A.5.G7: A large shared open space serves as a small park for residents of this \nmultifamily development.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 33,
      "text": "City of Gresham Development Code\n[7.05] - 33\n(06/22)\n6. L\u0083Ä\u0097Ý\u0091\u0083Ö®Ä¦\nIntent: To integrate landscaping into open spaces, parking areas \nand general site design to contribute to an attractive and \nsustainable development that enhances the overall character \nof the area. To minimize negative environmental impacts from \ndevelopment by utilizing sustainable building techniques \nwhich reduce stormwater runoff, heat island effects and \npollution associated with energy usage and transportation.\nApplicable Rockwood Design Principles from Section 7.0502: \nA. Physical Environment\nB. Sustainability\nC. Safe Design\nE. Open Space\nF. Landscaping\nI. \nSustainable Architectural Design\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1. Licensed Design Professional. The \nlandscape plan shall be created by a \nlicensed design professional such as a \nLandscape Architect, Architect or Civil \nEngineer. The landscape plan shall \nexhibit the following characteristics:\na. The overall design of the site \nand the design of the proposed \nlandscape materials shall achieve \nunique, attractive and significant \nlandscaping on the site as a whole;\nb. The proper type, spacing, height, \nplacement and location of plant \nmaterials shall be provided to \nensure that the intent of this \nordinance is met;\nc. The choice and selection of plant \nmaterials shall insure that root \nsystems will not interfere with \npublic utilities and so that fruit \nand other debris, except leaves, \nwill not constitute a nuisance \nwithin public rights-of-way or to \nabutting property owners;\nd. The choice and selection of plant \nmaterials shall ensure that the \ntype of plantings selected will \nbe of a type that will survive and \nthrive in the area in which they are \nto be located; and\ne. The proper relationship between \ndeciduous and evergreen plant \nmaterials shall exist so as to \nensure that the desired buffering \neffect will be accomplished.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development\nS1. A professional licensed Landscape Architect shall complete and \nstamp the landscape plan for the development.\nFig. A.6: A variety of appropriate plant material creates \nattractive landscaped areas.\nFig. A.6.G1: Building base plantings create an attractive transition between the \nstructure and the ground.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 34,
      "text": "City of Gresham Development Code\n[7.05] - 34\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG2. New development shall preserve trees \nand other environmental features \nof the site. The standard in Section \n7.0503(A)(6)(S2) is required without \nexception.\nG3. Water conservation measures and \non-site treatment and infiltration of \nstormwater shall be incorporated in \nnew development. \na. Landscape practices and strategies \nthat reduce wasteful water \npractices shall be included in all \ndevelopments in a creative way.\nb. Consider using porous paving \nsystems to allow for stormwater \ninfiltration and reduce the urban \nheat island effect in the summer.\nc. High efficiency irrigation strategies \nshall be utilized to minimize \npotable water usage.\nd. Consider using green roof systems \nto collect and evapo-transpire \nrainwater, reducing runoff as well \nas heating and cooling loads.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS2. New development shall retain healthy, regulated trees at \n8 inches or greater or replace them at a ratio of three new \ntrees for every one healthy, existing regulated tree removed. \nRegulated trees must be healthy as determined by a consulting \narborist, a qualified arborist or a registered consulting arborist.\nS3. Water conservation and treatment shall be promoted through \na minimum of two of the following:\na. An irrigation system that minimizes water usage by \nincorporating at least one of the following:\ni. \nA rain sensor to prevent watering during a rain event;\nii. Water conserving rotor irrigation heads; or\niii. A drip irrigation system.\nb. On-site rain gardens and stormwater facilities that are \ndesigned in accordance with Gresham’s Stormwater \nManagement Manual;\nc. Art elements, fountains or other features that use \nrainwater to activate public spaces;\nd. A system that collects rainwater from a minimum of 50 \npercent of the total roof area for reuse (i.e. site irrigation \nor grey water re-use);\ne. Permeable paving over at least 40 percent of all paved \nsurfaces;\nf. \nOther Low Impact Development (LID) features that capture \nand filter runoff into the ground approved by the Manager \nor Design Commission.\nFig A.6.G3.a: A modular vegetated roof system \nreduces stormwater and insulates the roof surface.\n6. L\u0083Ä\u0097Ý\u0091\u0083Ö®Ä¦, CÊÄã®Äç\u009b\u0097\nFig. A.6.S1.b: A landscaped area which utilizes a variety of complimentary plant \nmaterial and defines the street and creates an edge to a pedestrian plaza..\nFig. A.6.S1.a:  A well-maintained landscape enhances \nthe visual appeal of developments.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 35,
      "text": "City of Gresham Development Code\n[7.05] - 35\n(06/22)\n6. L\u0083Ä\u0097Ý\u0091\u0083Ö®Ä¦, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional Development\nG4. Commercial and mixed-use \ndevelopment shall follow Landscape \nGuidelines specified in Section \n7.0103(A)(6)(G1) through (G5). The \nStandards of Section 7.0103(A)(6)\n(S11) regarding the maintenance \nagreement are required without \nexception. \nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development\nS4. Site Landscaping. \n \nINSIDE THE TRIANGLE: Section 7.0103(A)(6)(S1) through \n(S5) and (S11) Corridor Design Standards - Landscaping shall \napply to all new commercial developments, except as noted \nin Section 7.0503(A)(6) regarding the percentage of site \nlandscape to be provided and the tree caliper requirements. \n \nOUTSIDE THE TRIANGLE: Section 7.0103(A)(6)(S1) through \n(S5) and (S11) Corridor Design Standards - Landscaping shall \napply to all new commercial developments, except as noted \nin Section 7.0503(A)(6) regarding the percentage of site \nlandscaping to be provided. \nFig A.6.G3.b: An open space which incorporates stormwater infiltration facilities.\nFig A.6.S3.b: A public art piece collects rain water and \ndischarges it into a stormwater area.\nFig A.6.G3.c: This green roof provides an attractive, sustainable habitat for wildlife.\nFig A.6.S3.c: Permeable pavement allows water \nto infiltrate the soil thereby reducing stormwater \ndischarge.\nFig. A.6.S3.a:  A stormwater swale within a parking lot \nfilters and manages the pavement run-off.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 36,
      "text": "City of Gresham Development Code\n[7.05] - 36\n(06/22)\n6. L\u0083Ä\u0097Ý\u0091\u0083Ö®Ä¦, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG5. Site shall utilize a range of landscape \nmaterials, such as trees, evergreen \nshrubs, groundcovers and seasonal \nflowers, in sufficient quantity to \nprovide for color and enhanced visual \ninterest on site.\na. Separation of active and passive \nuses is encouraged through \nplacement of planters, street \nfurniture and landscaping. Planters \nor large pots with small shrubs and \nseasonal flowers can be used to \ncreate protected sub-areas within \nthe plaza with pedestrian seating.\nb. Creative use of plant materials \nsuch as climbing vines or trellises \nis also encouraged.\nc. Screen views of automobiles from \npublic view and adjacent sensitive \nland uses with dense planting.\nd. Use landscaping to minimize the \nexpansiveness of surface parking \nlots. Shade surface parking and \nreduce heat build-up with rows of \nmature canopy trees.\ne. Use of native plantings is \nencouraged where practical.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS5. Site Landscaping. A minimum of 15 percent of the gross site \narea shall be landscaped. \n \nINSIDE THE TRIANGLE: Up to 5 percent of the required \nlandscape area can be paved walks, pedestrian plazas, etc. \n \nOUTSIDE THE TRIANGLE: Up to 20 percent of the required \nlandscape area can be paved walks, pedestrian plazas, etc.\nFig. A.6.G5.b: Trees and other landscaping screen parking areas from an adjacent \nwalkway while shading pavement and reducing the associated heat island effect.\nFig. A.6.G5.c: Dense plantings are used to enhance the appearance of an entry to a \nparking area.\nFig. A.6.G5.a: Planters with trees are used to provide \nprivacy to residential development.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 37,
      "text": "City of Gresham Development Code\n[7.05] - 37\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nResidential Development: Multifamily and Townhouse\nS6. Site Landscaping. The standards of Section 7.0103(A)(6) shall \nbe met with the exception that a minimum of 15 percent of \nthe gross site area shall be landscaped. Up to 5 percent of \nthe required landscape area can be paved walks, pedestrian \nplazas, etc. \nS7. Section 9.0823 Landscaping of Parking Lots shall be met. The \nfollowing additional standards supplement this section.\na. Parking lot landscaping shall include one tree for every six \nparking stalls.\nb. Perimeter Screening. Surface parking lots shall be \nscreened to a height of 3 feet using at least one of the \nfollowing:\ni. \nA combination of evergreen and deciduous shrubs \nspaced no more than 3 feet apart planted in an area at \nleast 5 feet wide.\nii. Ornamental masonry wall clad with brick or tile.\niii. A combination of a masonry wall and ornamental \nfencing.\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nResidential Development: Multifamily and \nTownhouse\nG6. Multifamily development shall \nfollow guidelines specified in Section \n7.0103(A)(6). In addition, the use \nof turf lawn, as the urban core of \nthe district, shall be minimized \nexcept within open play areas within \nmultifamily developments.\nG7. Parking areas shall be effectively \nlandscaped to reduce the visual \nimpact on surrounding areas, improve \nthe appearance of the lots from within \ntheir perimeter and to minimize heat \nislands and high-temperature run-off.\n6. L\u0083Ä\u0097Ý\u0091\u0083Ö®Ä¦, CÊÄã®Äç\u009b\u0097\nFig. A.6.S7: An attractively landscaped parking area of a multifamily building includes \ntrees, shrubs and a sculpture. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 38,
      "text": "City of Gresham Development Code\n[7.05] - 38\n(06/22)\n7. S®ã\u009b L®¦«ã®Ä¦\nIntent: To create a safe and attractive environment by incorporating \nlighting and Crime Prevention Through Environmental Design \n(CPTED) principles while providing an attractive visual site \ndesign element.\nApplicable Rockwood Design Principles from Section 7.0502: \nA. Physical Environment\nC. Safe Design\nD. Transportation Modes\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1. Lighting fixtures shall provide \nappropriate illumination levels for \nall areas of the site, creating inviting \nspaces and enhancing the safety of the \nsite during evening hours. \na. Lighting fixtures shall not create \nnegative impacts on surrounding \nproperties or unnecessary glare \nwithin the site\nb. Landscaping shall be sufficiently \nlow as not to block lighting \nand therefore surveillance \nopportunities. \nc. Paths between buildings and \nparking areas shall be well lit, \nclear, and direct to ensure safe \npedestrian access.\n \nContinued on following page\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development\nS1. The site shall be designed to achieve uniform illumination \nlevels with a minimum glare to adjacent properties in order \nto create a comfortable environment that promotes safety.  \nThe following areas shall be illuminated during the hours of \ndarkness: primary internal drives, parking area, loading and \nunloading areas, pedestrian walkways, pedestrian-oriented \nopen spaces, and building entries. \na. The following illumination levels plus those stated in the \nTable 7.0503.A.7 shall act as minimum Standards for all \nexterior lighting. \nb. Maximum average lighting will be governed by the six-to-\none ratio of maximum average to minimum illumination of \nthe surface being lit as stated in Table 7.0503.A.7. \nc. Generally, maximum illumination at the property line shall \nnot exceed one-half foot-candle. However, where a site \nabuts a non-residential district, maximum illumination at \nthe property line shall not exceed 1 foot-candle. \n \nContinued on following page\nT\u0083\u0090½\u009b 7.0503.A.7: S®ã\u009b I½½çÃ®Ä\u0083ã®ÊÄ V\u0083½ç\u009bÝ \nArea of Illumination\nIllumination Level (Foot-Candles)1\nPrimary Internal Drives\n1.0 minimum with an average of 3.5\nParking Areas\n0.5 minimum    \nLoading and Unloading Areas 0.5 minimum    \nOpen Spaces\n0.5 minimum with an average of 1.5\nWalkways\n0.5 minimum with an average of 1.5\nBuilding Entrances - Fre-\nquent Use\n1.0 minimum with an average of 3.5\nBuilding Entrances - Infre-\nquent Use\n1.0 minimum with an average of 2.0\nTable Notes:\n1See 7.0503(A)(7)(S1)(d)\nFig. A.7.G1.b: Storefronts and wall sconces create \nappropriate illumination levels on a pedestrian \nwalkway.\nFig. A.7.G1.a:  Illumination levels shall be appropriate \nfor the area and not detract from surrounding areas.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 39,
      "text": "City of Gresham Development Code\n[7.05] - 39\n(06/22)\n7. S®ã\u009b L®¦«ã®Ä¦, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG1. Continued\nd. Blind corners shall be avoided by \ninstalling mirrors or by designing \ncurves, angles or windows in place \nof 90-degree corners.\ne. Building facades facing parking \nareas shall have entrances and \nenough activity and transparency \nto provide natural surveillance.\nG2. Lighting fixtures shall not create \nunnecessary upward directed \nillumination which contributes to sky-\nglow. \nG3. Light fixtures shall reflect a pedestrian \nscale and be appropriately scaled for \ntheir use.\na. Fixtures shall be composed of \ndurable materials.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS1. Continued\nd. Average foot-candles shall be the average amount of light \nat 3-foot height above a surface as determined using \na photometric plan with 1 foot grid spot foot-candle \nreadings. Minimum illumination shall be the minimum \nlight measured in foot-candles at the point of least \nillumination when measured at 3 feet above ground level.\ne. The Manager or Design Commission may modify these \nlevels if such modifications are deemed necessary and \nappropriate for the use and surrounding area. \nS2. Developments shall use full cut-off lighting fixtures to avoid \noff-site lighting, night sky pollution and shining lights into \nresidential units. \na. Fixtures shall have a cut-off angle of 90 degrees as \nmeasured perpendicular to the ground.\nb. No direct light source shall be visible at the property line \n(adjacent to residential) at 3 feet in height.\nc. Shielded lighting along primary internal drives shall be \nprovided and shall not exceed 25 feet in height, or a height \ndetermined by the Manager. \nd. The Manager or Design Commission may choose to \nwaive or alter cut-off requirements of this section when \nappropriate historic or decorative fixtures are proposed \n(e.g. use of decorative up-lighting to illuminate the \nunderside of a canopy or columns on a facade, where a \ncanopy or roof projection restricts the projection of the \nlight into the night sky or bollards). \nS3. Light fixtures shall not exceed 25 feet in height.\na. Weather- and vandalism-resistant covers shall protect \nlighting devices.\nFig. A.7.G1.c: Light fixtures on the ground prevent \nlandscaping elements from blocking light and creating \ndark spots.\nFig. A.7.G2: Light fixtures can highlight architectural \nfeatures but caution should be used to prevent sky-\nglow.\nFig. A.7.S1: Storefronts and exterior light fixtures create uniform illumination levels at \nthe building entry.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 40,
      "text": "City of Gresham Development Code\n[7.05] - 40\n(06/22)\n1. Bç®½\u0097®Ä¦ M\u0083ÝÝ®Ä¦ \u0083Ä\u0097 AÙã®\u0091ç½\u0083ã®ÊÄ\nIntent: To improve the appearance and reduce the visual scale of \nlarge buildings by interrupting long expanses of walls and \nto incorporate contextually sensitive design features and \nstrategies which add depth, details and interest to enliven \nwall planes and create attractive building facades.\nApplicable Rockwood Design Principles from Section 7.0502: \nG.  \nCompatibility\nH.  \nArchitectural Quality\nJ. \n \nRehabilitation\nL.  \nHigh-Quality Materials\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development \nG1. Buildings shall be designed with \nvolumes to maintain a compatible \nscale with their surroundings. Volumes \nshall reinforce a human scale within \nthe built environment so people \ndo not feel dwarfed by the building \nstructure. \nG2. The massing changes shall create an \nattractive building with enhanced \nvisual interest for the public.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development \nS1. The minimum building mass or volume change shall be at least \n25 percent of the total volume of the overall building.\nS2. The changes in mass shall be visible from the public street.\nFig. B.1.S1: Multiple volumes are required for larger \nfootprint buildings.\nFig B.1.G2: Massing changes create attractive facades \nand visual interest in the building.\nFig B.1.S2: Changes in building mass are visible from the street.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 41,
      "text": "City of Gresham Development Code\n[7.05] - 41\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG3. Tall buildings shall maintain a sense of \nhuman scale through the use of design \nstrategies that reduce perceived mass \nof the upper levels and establish a \ndistinct base, middle, and cap.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS3. Buildings greater than four stories in height shall provide \nan upper-floor articulation strategy or strategies on facades \nvisible from streets, plazas and shared open spaces:\na. Buildings five or six stories tall shall provide at least one of \nthe following:\ni. \nCompletely recess the top one or two floors a \nminimum of 6 feet.\nii. Set back at least 50 percent of the top one or two \nfloors for a minimum of 10 feet.\niii. Provide a change of materials visible from the \npedestrian level on the top on or two floors.\niv. Provide a minimum facade transparency of 70 percent \nor greater per floor on the top one or two floors.\nv. Provide canopies, balconies, a prominent cornice \nline or other similar projecting or receded facade \ntreatments that establish a horizontal datum below \nthe top one or two floors across a minimum of 50 \npercent of the facade width.\nvi. Establish a prominent roof line or significant variation \nin roof lines visible from the pedestrian level.\nvii. Other strategy as determined by the Manager or \nDesign Commission.\nb. Buildings seven stories and taller shall provide at least two \nof the following:\ni. \nCompletely recess the top two floors a minimum of 10 \nfeet.\nii. Set back at least 50 percent of the top two floors for a \nminimum of 15 feet.\niii. Provide a change of materials visible from the \npedestrian level on the top two floors.\niv. Provide a minimum transparency level on the top two \nfloors of 70 percent of the facade area for each floor.\nv. Provide canopies, balconies, prominent cornice \nlines, or other similar projecting or receded facade \ntreatments that establish a horizontal datum below \nthe top two floors across a minimum of 65 percent of \nthe facade width.\nvi. Establish a prominent roof line or significant variation \nin roof lines visible from the pedestrian level.\nvii. Other strategy as determined by the Manager or \nDesign Commission.\n1. Bç®½\u0097®Ä¦ M\u0083ÝÝ®Ä¦ \u0083Ä\u0097 AÙã®\u0091ç½\u0083ã®ÊÄ, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 42,
      "text": "City of Gresham Development Code\n[7.05] - 42\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued \nProminent Facades\nG4. Highly visible facade sections, \nincluding corners and facades fronting \npublic spaces, shall be designed as a \ndistinct, prominent element of the \nbuilding while complementing the \nremainder of the design.\nG5. Prominent facade sections shall have \nforms which are distinct from adjacent \nwall sections, responding to highly \nvisible areas of the site. \nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued \nProminent Facade Sections \nS4. Prominent facade sections shall include design elements that \nestablish prominence in the building, responding to unique \nsite configurations including street corners and the terminus \nof streets or primary internal drives. The orientation, massing \nand articulation of buildings shall place strong visual emphasis \non these areas.\nS5. Prominent facade sections shall include one of the following \nprofiles (in plan view) for at least one story of the building:\na. Curved or hinged corner or wall section;\nb. A form which is projected or recessed from both abutting \nfacades;\nc. Beveled or mitered corner; or\nd. Alternative configurations approved by the Manager or \nDesign Commission, such as cantilevered forms.\nFig B.1.S5.a: A tower form on a building fronting a \nmajor intersection adds prominence to the location.\nFig B.1.S6.a: A unique canopy adds interest to highly \nvisible areas.\n1. Bç®½\u0097®Ä¦ M\u0083ÝÝ®Ä¦ \u0083Ä\u0097 AÙã®\u0091ç½\u0083ã®ÊÄ, CÊÄã®Äç\u009b\u0097\nFig B.1.S5.b: Prominent Facade Sections Profiles\nCorner Configurations\n      Hinged \n   \n    Projected \n  \n       Recessed\n      Curved \n       \n      Beveled \n    \n       Mitered\nWall Configurations\n                Curved   \n           Projected \n  \n         Recessed\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 43,
      "text": "City of Gresham Development Code\n[7.05] - 43\n(06/22)\n1. Bç®½\u0097®Ä¦ M\u0083ÝÝ®Ä¦ \u0083Ä\u0097 AÙã®\u0091ç½\u0083ã®ÊÄ, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued \nProminent Facades, Continued\nG6. Prominent facade sections shall \ninclude design elements and details \nwhich add visual interest to these \nareas.\nG7. Materials on and surrounding \nprominent facade sections shall be \nattractive and of high-quality.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued \nProminent Facade Sections, Continued \nS6. Prominent facade sections shall include distinctive \narchitectural expressions in its facade, including at least two of \nthe following:\na. Operable entry within 10 feet of the building corner or \nwithin the terminating view;\nb. Tower forms with an increase in height no less than 10 \npercent of the adjacent wall height;\nc. Windows of an increased size, quantity or distinct \ncharacter that results in a higher level of transparency \nthan adjacent facade sections;\nd. Increased glazing and transparency, with the full height \nof the wall area composed of no less than 30 percent \ntransparent glass. For the purposes of measurement, \nthis area shall be no less than 20 feet in length on a wall \nsection at the terminus of a primary internal drive or \npublic street or 10 feet in length along each facade when \nlocated at a corner of a building;\ne. Marquee or expressive canopies with colors and materials \ndistinctive from the rest of the building;\nf. \nSpecial paving such as scoring or pavers; or\ng. Focal point such as a fountain or sculpture.\nh. Higher bays which may include multiple floor levels and \nare a minimum 14 feet or change in bay size which is \nreflected in the facade, not exceeding 30 feet;\ni. \nChange in building base and/or cornice treatments that \nresult in an increased level of detail from surrounding \nfacade sections;\nj. \nCupola; or\nk. Turret.\nS7. Primary Materials, as defined in Section 7.0503(B)(7), shall be \nused for no less than 80 percent of the street-facing facades. \nPrimary material usage on the remainder of the facade \nshall be measured independently and shall follow standards \nspecified in Section 7.0503(B)(7).\nFig B.1.S6.b: A building which terminates the view of a \nmajor street is enhanced by high-levels of details within \nthe facade.\nFig B.1.S6.c: Higher bays, which extend two-stories in \nheight, emphasize a highly-visible facade section.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 44,
      "text": "City of Gresham Development Code\n[7.05] - 44\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development\nS8. Buildings shall have a quantity of masses which correspond to \nthe footprint size:\na. Buildings with footprints up to and including 30,000 \nsquare feet may consist of one mass or building volume. \nb. Buildings with footprints greater than 30,000 square feet \nshall be comprised of at least two masses or building \nvolumes.\nS9. Masses shall be attributed to distinct building volumes, jogs \nin the facade, or other changes in the facade as approved by \nthe Manager. Changes in mass shall include a change in depth \ngreater than that used for articulating features as specified in \nSections 7.0503(B)(1) and 7.0503(B)(4).\nS10. Buildings which are required to have multiple masses shall \nplace the tallest mass within the setback area specified in \nSection 7.0503(B)(2).\nS11. When the building is on the corner of two streets, the tallest \nmass shall be within the setback area of the primary street or \nat the corner.\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional Development\nG8. The quantity of masses required \nshall be sufficient to add interest to \nbuildings of that scale.\nG9. Buildings shall not include long, \nmonotonous, uninterrupted walls and \nshall utilize design strategies which \ncreate depth and add interest to the \nfacade. Changes in masses shall be \nsufficient to provide visual distinction \nbetween wall planes.\nG10. Buildings shall utilize building masses \nto frame and define streets and public \nspaces, establishing more prominence \nat these locations.\nG11. Building masses shall emphasize \nhighly visible areas including street \nintersections.\n1. Bç®½\u0097®Ä¦ M\u0083ÝÝ®Ä¦ \u0083Ä\u0097 AÙã®\u0091ç½\u0083ã®ÊÄ, CÊÄã®Äç\u009b\u0097\nFig B.1.S11: The tallest mass of the building is placed \nalong the primary street on which the building is \nlocated.\nFig B.1.G9: Changes in massing create depth in the facade and are sufficient to \nprovide visual distinction between wall planes.\nFig B.1.S8: A building with a large footprint is divided \ninto multiple masses, each greater than 25% of the \nfootprint.\n1\n2\n3\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 45,
      "text": "City of Gresham Development Code\n[7.05] - 45\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG12. Commercial, institutional, and mixed-\nuse buildings shall not include long, \nmonotonous, uninterrupted walls and \nshall utilize design strategies which \ncreate depth and add interest to the \nfacade. Changes in depth shall be \nsufficient to provide visual distinction \nbetween wall planes.\na. INSIDE THE TRIANGLE: Articulating \nelements shall provide surface \nrelief, depth and shadows to the \nfacade by being recessed and/or \nprojected. \n  \nOUTSIDE THE TRIANGLE: \nArticulating elements shall provide \nsurface relief, depth and shadows \nto the facade by being recessed or \nprojected.\nb. Changes in building depth shall \nreinforce and create a consistent \nstreet wall.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS12. INSIDE THE TRIANGLE: Commercial, institutional, and mixed-\nuse buildings: Building walls shall be articulated with design \nfeatures which add visual interest and prevent the appearance \nof blank walls. Facades visible from streets, public spaces \nand parking areas shall utilize at least one of the following \nstrategies:\na. A repeating pattern of wall recesses and/or projections \nthat has a relief of at least 12 inches (such as recessed \nstructural bays or recessed window openings between \ncolumns). Wall recessions and projections shall be at \nintervals of not greater than 30 feet with customer entries \nand those facing the street and at intervals not greater \nthan 100 feet on remaining facades; or \nb. Changes in wall plane with a depth of at least 24 inches \nwhich respond to the building module. These changes in \nwall plane shall occur at intervals of not less than 25 feet \nand not more than 100 feet.\n \nOUTSIDE THE TRIANGLE: Commercial, institutional, and mixed-\nuse building walls shall be articulated with design features \nwhich add visual interest and prevent the appearance of blank \nwalls. Facades visible from streets, public spaces and parking \nareas shall utilize at least one of the following strategies:\nc. Changes in plane with a depth of at least 24 inches at \nintervals of not less than 30 feet and not more than 90 \nfeet. Changes in plane attributed to required changes in \nbuilding mass shall not count toward this requirement; or \nd. A repeating pattern of wall recesses and projections at \nintervals of not less than 30 feet and not more than 90 \nfeet. These recesses and projections shall have a relief no \nless than 16 inches.\nFig B.1.G10: Changes in building massing frame the \npublic space and highlight important locations, such as \nstreet intersections.\nbelt course\nFig B.1.S12.a: This building has a belt course running \nacross the building above the third story windows. \n1. Bç®½\u0097®Ä¦ M\u0083ÝÝ®Ä¦ \u0083Ä\u0097 AÙã®\u0091ç½\u0083ã®ÊÄ, CÊÄã®Äç\u009b\u0097\nFig B.1.S12.b: Major vertical mullions, \nin conjunction with a change in plane, \nvisually break up an all glass facade.\nFig. B.1.S12 OUTSIDE THE TRIANGLE: \nA repeating pattern of wall recesses at \nwindow openings articulates the building \nfacade.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 46,
      "text": "City of Gresham Development Code\n[7.05] - 46\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG13. Commercial and institutional spaces \nshall have adequate first-floor heights \nto convey the existence of commercial \nor institutional space on the ground \nfloor and provide a comfortable, \nleasable retail, service or working \nenvironment with opportunities for \nlight to enter the space from the street \nand sidewalk.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS13. Commercial and institutional ground-floor heights shall be a \nminimum of 12 feet from the top of the floor to the lowest \nstructural element of the ceiling. One-story buildings (or \nportions of buildings) shall have a front facade elevation of at \nleast 15 feet, including roof forms, for at last 60 percent of the \nfacade length.\nFig. B.1.G12.c: Recessed windows create depth in the facade.  \nFig B.1.G12.a INSIDE THE TRIANGLE: Horizontal \nelements, including a series of belt courses, the \ncornice and the bulkhead, establish rhythm in the \nstorefront.\nbulkhead\nbelt course\ncornice\n1. Bç®½\u0097®Ä¦ M\u0083ÝÝ®Ä¦ \u0083Ä\u0097 AÙã®\u0091ç½\u0083ã®ÊÄ, CÊÄã®Äç\u009b\u0097\nFig. B.1.G12.b OUTSIDE THE TRIANGLE: Changes in wall plane are used to create \nvisual interest and reduce the perceived scale of wall planes.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 47,
      "text": "City of Gresham Development Code\n[7.05] - 47\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nResidential Development \nG14. Multifamily buildings shall follow the \nGuidelines specified in Section 7.0103.\nExisting Development \nG15. Existing Buildings: Existing buildings \nshall follow the appropriate building \nfacade Guidelines when changes to \nthe building facade are reviewed for a \npermit. \nG16. Existing buildings shall follow the \nabove Guidelines when changes are \nmade to the building envelope. \nG17. New additions to historic buildings \nshall complement the original facade \nwithout competing with it. \nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nResidential Development \nS14. Multifamily buildings shall follow the Standards specified in \nSection 7.0103.\nExisting Development \nS15. Renovations which modify the exterior building facades \nand require a permit shall follow Sections 7.0503(B)(1) at \nthe discretion of the Manager. Renovations which do not \nchange the existing exterior building facade are exempt from \nthe Standards specified in Sections 7.0503(B)(1) Facade \nComposition and Building Articulation. \nS16. Renovations of existing buildings with footprints over 30,000 \nsquare feet that add 5,000 square feet of footprint or greater \nshall have no less than two masses at the discretion of the \nManager. Renovations which do not change the existing \nbuilding envelope are exempt from Standards specified in \nBuilding Massing.\nS17. New additions to buildings designated as historic on the City \nof Gresham’s Historic and Cultural Landmarks List shall be \ncomplementary and a separate distinct mass from the existing \nbuilding.\nFig B.1.S12: A building which is designed with pilasters and belt courses to enhance \nthe facades.\n1. Bç®½\u0097®Ä¦ M\u0083ÝÝ®Ä¦ \u0083Ä\u0097 AÙã®\u0091ç½\u0083ã®ÊÄ, CÊÄã®Äç\u009b\u0097\nFig B.1.G12: A mixed-use building which utilizes a \nvariety of design strategies to add depth and interest to \nthe facade.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 48,
      "text": "City of Gresham Development Code\n[7.05] - 48\n(06/22)\n2. RÊÊ¥Ý\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1. Buildings with low-sloped roofs shall \nuse design strategies to minimize \nheat islands and reduce energy usage \nassociated with solar gain attributed \nto the roof surface.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development\nS1. All low-sloped roof surfaces (pitches less than or equal to 2:12) \nshall utilize a “white roof” with a Solar Reflectance Index (SRI) \nof 78 or greater, exclusive of space dedicated to mechanical \nsystems, vegetated roof surfaces or solar panels. \nIntent: To \nminimize \nnegative \nenvironmental \nimpacts \nfrom \ndevelopment by utilizing sustainable building techniques \nwhich reduce stormwater runoff, heat island effects and \npollution associated with energy usage and transportation.\nApplicable Rockwood Design Principles from Section 7.0502: \nB. Sustainability\nI. \nSustainable Architectural Design\nFig. B.2.S1: A flat roof is painted white for a high SRI \nvalue.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 49,
      "text": "City of Gresham Development Code\n[7.05] - 49\n(06/22)\n3. EÄãÙ®\u009bÝ\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1. All buildings shall be oriented toward \nand accessed from the street. If a \nbuilding has frontage on more than \none street, it shall be oriented and \ndesigned to provide reasonable \npedestrian access along the most \nactive street frontages. Buildings shall \naddress transit facilities.\nG2. Buildings shall generally orient an \nentry to the intersection of public \nstreets if located on a corner. \nAddressing shall be posted as required \nin Section 7.0503(B)(3)(S2). \nG3. Pedestrian circulation routes shall \nconnect to building entries.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development\nS1. Each building shall provide at least one entry facing the \nprimary street on which the building is located. The primary \nstreet shall be the street of highest functional classification \nor Design Street as determined by the Manager or Design \nCommission. For sites abutting or facing a light rail station or \nabutting a street containing a transit way, at least one primary \nbuilding entry and facade shall face the station or transit way \nstreet.\nS2. If a building is located at the intersection of two streets \nclassified as a major or standard arterial, boulevard or Design \nStreet, an entry shall be located at the building corner or \nwithin 10 feet of the corner. The full address assigned by the \nManager shall be posted on or near the entrance not bearing \nthe assigned street address. Failure to post an address as \nassigned by the Manager shall constitute a violation of Code.\nS3. Pedestrian circulation routes shall connect to all public \nbuilding entries.\nIntent: To orient buildings appropriately to enhance pedestrian \naccessibility and place the most visually interesting facade \nin public view, and to ensure building entries establish \nprominence in the facade and are an attractive component \nof the buildings while promoting pedestrian comfort, safety, \nand orientation.\nApplicable Rockwood Design Principles from Section 7.0502: \nA. Physical Environment\nC. Safe Design\nD. Transportation Modes \nG. Compatibility\nH. Architectural Quality\nL. High-Quality Materials\nFig. B.3.G1: A building oriented toward the street with entries present on the \nsidewalk.\nFig. B.3.G2: A corner entry on a building located at the \nintersection of two streets.\nFig. B.3: A commercial building with an entry located at \nthe corner.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 50,
      "text": "City of Gresham Development Code\n[7.05] - 50\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS4. Building entries shall feature a design that demonstrates visual \nprominence and architectural emphasis. Primary building \nentrances shall be open to the public during all business hours.\nS5. Building entries shall include a visible change in building form \nfrom adjacent facade sections with a change in depth of at \nleast 12 inches. This could include recessed building entries, \nchanges in mass or smaller changes in wall plane.\nS6. Building entry features shall include two of the following \nfeatures in the entry design to highlight the entry:\na. Oversized entry door(s) of a minimum height of 8 feet;\nb. Change in material, color, texture, pattern or articulation \nat the entry;\nc. Projecting entry including porches, canopies and \narticulated lintels above the doorway;\nd. Change in roof form such as but not limited to a curved, \nstraight or sloped roof;\ne. Enhanced building ornamentation in the entry area, in \naddition to that required in other sections of the Code, \nincluding but not limited to:\ni. \nOrnamental glazing, such as sidelights, flanking the \ndoorway that is a minimum width of 1 foot and is the \nfull height of the doorway; \nii. Ornamental railings leading to the entry;\niii. Ornamental balustrades;\niv. Wall sconces on each side of the entry; and \nv. Flanking columns.\nf. \nDistinct and decorative stone, masonry or tile paving \npattern on the adjacent entry private sidewalk section. \nThe size and design of the paving pattern shall correspond \nto the geometry established in the entry feature;\ng. An entry courtyard of a minimum dimension of 500 square \nfeet where the minimum dimensions for either length or \nwidth is 20 feet. The courtyard shall provide year-round \nsite furnishings like benches, tables and sitting areas; \nprominent landscape features such as integrated planters, \ntrellis or arbors; or\nh. Water feature.\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG4. Building entries shall be designed \nas a distinct, prominent element of \nthe building which complements the \nremainder of the design.\nG5. Entries shall include a change in form \nof sufficient dimension to visually \ndistinguish the entry from the \nremainder of the building facade.\nG6. Entries shall include design features \nand strategies which highlight these \nareas of the facade.\nFig B.3.G4: Building entries shall be a prominent \nelement in the facade.\nFig B.3.G5: An entry courtyard is used to distinguish it \nfrom the rest of the facade.\nFig B.3.S6: A change of materials highlights the entries \nto this traditional storefront.\n3. EÄãÙ®\u009bÝ, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 51,
      "text": "City of Gresham Development Code\n[7.05] - 51\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS7. Buildings shall utilize attractive and high-quality materials \nsurrounding the entry.\na. Building entry doors shall be of high-quality materials \nsuch as commercial-grade solid wood, decorative glass, \nor other materials as approved by the Manager or Design \nCommission.\nb. Within 30 feet along the length of the facade from each \nside of the entry doors, the building shall utilize only \nprimary materials as specified in Section 7.0503(B)(7).\nS8. Buildings shall provide weather protection in the form of a \ncanopy, awning or other feature to a depth of at least 4 feet.\nCommercial and Institutional Development\nS9. Primary building entrances shall be open to the public during \nall business hours.\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG7. Materials on and surrounding the \nentry feature shall be attractive and of \nhigh-quality.\nG8. Entries shall provide pedestrians \nprotection from weather.\nCommercial and Institutional Development\nG9. Entries shall meet the requirements of \nSection 7.0503(B)(3)(S9).\nFig B.3.S5: A small projection, complimented by a taller parapet and unique \nwindows, gives prominence to the entry.\nFig B.3.S6: An entry courtyard with landscaped features adds prominence to the \nbuilding’s entry.\nFig B.3.G7: Areas surrounding the entry shall utilize \nhigh-quality materials such as brick.\nFig B.3.S8: A recessed entry and continuous roof \nprovides weather protection.\n3. EÄãÙ®\u009bÝ, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 52,
      "text": "City of Gresham Development Code\n[7.05] - 52\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG10. Buildings with long street frontages or \nmultiple street-facing tenant spaces \nshall provide additional entries to \nensure reasonable pedestrian access \nand improve the appearance of the \nbuilding and the public realm.\nG11. Buildings located at the rear of the site \nshall provide entries that correspond \nwith pedestrian circulation routes, \nsuch as the intersection of public \nstreets, primary internal drives and \nother pedestrian connections. \nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS10. Additional entries on a single building facade shall be required \nas follows:\na. When a building faces a public street or primary internal \ndrive and its length exceeds 300 feet, the building shall \nprovide at least two operable entries on that street-facing \nfacade.\nb. When a multi-tenant building facade exceeds 120 feet \nin length with multiple tenant spaces located at the \nstreet edge, a minimum of two entries shall be provided \non that facade. At the discretion of the Manager or \nDesign Commission, a covered breezeway through the \nbuilding may count as one entry for the purposes of this \nrequirement.\nS11. Buildings located at the rear of the site along public streets \nor primary internal drives shall provide entries as noted in \nSection 7.0503(B)(3)(S1)-(S3) and (S10) above. \nFig. B.3.G10: A mixed-use building with entries for each ground floor retail tenant \nand separate entrances for upper level uses.\nFig. B.3.S10.b: A multi-tenant building over 120 feet in length with multiple street-\nfacing entries.\nFig. B.3.S10.a: Site diagram illustrating potential entry \nconfiguration of multiple buildings on a site.\nMulti-tenant buildings at the \nstreet over 120 feet in length \nwith multiple entries\nStreet-facing facade over \n300 feet with multiple \nentries\nA building over 30,000 square feet with \nentries on multiple street facing facades\n3. EÄãÙ®\u009bÝ, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 53,
      "text": "City of Gresham Development Code\n[7.05] - 53\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG12. Mixed-use buildings shall have distinct \nentries for each component of the \nmixed use.\nAdditional Guidelines Applicable to \nBuildings Greater than 30,000 Square Feet\nG13. When a building faces multiple streets, \nentries shall be provided on multiple \nfrontages to enhance the accessibility \nand walkability of the development.\nResidential Development \nG14. Multifamily building entries shall \nincorporate transparent elements \nto allow residents to view in and out \nbefore opening doors.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS12. When part of a mixed-use development, residential and other \nnon-retail commercial uses shall have a distinct entry that is \nnot shared with a retail use. A shared lobby space may serve \nmultiple users of the same type. Required residential and \nnon-retail entries shall be on and face a public street and may \ncount toward the building entry requirement.\nAdditional Standards Applicable to Buildings Greater than 30,000 \nSquare Feet\nS13. Each building shall provide at least one entry on each street \nfrontage it faces except as follows:\na. If the building has three street frontages, the building shall \nhave a minimum of two frontages with operational entries.\nb. If the building has four or more street frontages, the \nbuilding shall have a minimum of three frontages with \noperational entries.\nc. Corner entries facing two street frontages shall count as an \nentry on each frontage.\nResidential Development \nS14. Multifamily buildings shall follow entry design Standards \nspecified in Section 7.0103. In addition, the following \nStandards shall apply:\na. Exterior corridors, exit ways and stairs visible from the \nstreet are not permitted, except for the main entry stair \nleading to the building entrance.\nb. Building entries, including those that access the parking \narea, shall be designed with transparent glass that allows \nusers to look out prior to exiting the building.\n3. EÄãÙ®\u009bÝ, CÊÄã®Äç\u009b\u0097\nFig B.3.S14: Clear entry doors allow residents of \nmultifamily buildings to look out before exiting.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 54,
      "text": "City of Gresham Development Code\n[7.05] - 54\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nResidential Development: Multifamily and \nTownhouse\nG15. Residential buildings shall be oriented \nto and accessible from the street. \nBuilding entries may either face the \nstreet or face a common area that is \nprominently located and visible from \nthe street.\nFig. B.3.S15.a: A courtyard residential building with \nmultiple ground floor entries.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nResidential Development: Multifamily and Townhouse\nS15. Residential buildings shall incorporate entries as follows:\na. For buildings without a courtyard: \ni. \nThe primary entry or entries for all ground-floor units \nabutting the street shall open directly onto the street \nright-of-way, not to the interior of the site or to a \nparking lot. Secondary entrances may face parking lots \nor other interior site areas. \nii. The primary entry for dwellings with frontage on both \na public street and an alley shall be oriented to the \nstreet, not to the alley.\nb. For buildings with a central courtyard space: The primary \nentry or entries for all ground-floor units abutting the \nstreet or courtyard shall open directly onto the street \nright-of-way or onto a central courtyard. Secondary \nentrances may face parking lots or other interior site \nareas. A second entrance facing the street right-of-way \nshall present the same finished appearance as the primary \nentry and shall not include rear fenced-in patios or sliding \nglass doors.\nFig. B.3.S15.b: Townhouses with each unit entry facing the street and connected to \nthe sidewalk.\n3. EÄãÙ®\u009bÝ, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 55,
      "text": "City of Gresham Development Code\n[7.05] - 55\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nResidential Development: Multifamily and \nTownhouse, Continued\nG16. Transitions. The development shall \npromote security by permitting \npassive surveillance while providing \na sense of privacy for the residents \nand a distinction between the public \nsidewalk realm and the private unit \nrealm. \na. Residential units located at the \nsidewalk level shall be connected \nto the sidewalk while providing \na degree of visual privacy for \nresidents. A separation between \nthe first floor and the street level \nwhere residential uses occupy \nthe first floor shall be provided \nto create layers (such as gardens, \nstoops, and porch railings) that \nmark the transition between \npublic and private spaces.\nb. Within the setback area, the \nsetback shall convey a residential \ncharacter, with planting or \nhardscape, and may not be used \nfor storage or service access. \nFences and railings shall not create \na visual barrier.\nExisting Development \nG17. Existing Buildings: Existing building \nentries that are renovated and \nrequire a permit shall comply with the \nappropriate Guidelines and Standards \nspecified in this section.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nResidential Development: Multifamily and Townhouse, Continued\nS16. Ground floor residential units shall incorporate a minimum of \none of the following transition elements:\na. Front porch that is 6 feet deep and 3 feet above grade;\nb. Stoop that is a minimum of 3 feet above grade and 4 feet \nwide;\nc. Front landscape courtyard; or\nd. A 30 inch decorative iron or metal garden fence or \ndecorative brick or stone wall.\nExisting Development \nS17. When existing building entries are renovated and require a \npermit, the buildings shall comply with all entry Standards. If \nthe building exterior is not changed and the entry feature does \nnot include a change in form, these entry Standards shall not \nbe required. \nFig. B.3.S16.b: Landscaping behind a decorative metal fence defines private space \nat the street edge.\nFig. B.3.S16.a: Townhouses which have elevated \nstoops as transition elements.\nFig. B.3.G16: Townhouses which include landscaping and an increase in grade from \nstreet level to ensure privacy.\n3. EÄãÙ®\u009bÝ, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 56,
      "text": "City of Gresham Development Code\n[7.05] - 56\n(06/22)\n4. F\u0083\u0091\u0083\u0097\u009b CÊÃÖÊÝ®ã®ÊÄ \u0083Ä\u0097 GÙÊçÄ\u0097 L\u009bò\u009b½ D\u009bã\u0083®½Ý\nIntent: To incorporate contextually sensitive design features and \nstrategies which add depth, details and interest to enhance \nand enliven wall planes, add visual interest, reduce the scale \nof long wall sections, and create attractive building facades.\nTo \nminimize \nnegative \nenvironmental \nimpacts \nfrom \ndevelopment by utilizing sustainable building techniques \nwhich reduce stormwater runoff, heat island effects and \npollution associated with energy usage and transportation.\nApplicable Rockwood Design Principles from Section 7.0502: \nA. Physical Environment\nB. Sustainability\nC. Safe Design\nF. Landscaping \nG. Compatibility\nH. Architectural Quality\nI. \nSustainable Architectural Design\nJ. \nRehabilitation\nL. High-Quality Materials\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development \nG1. Mechanical Screening: The Standard in \nSection 7.0503(B)(4)(S1) is required. \nUtilities shall be screened from the \npublic realm and the internal public or \nprivate areas.\nG2. Mechanical equipment and individual \nthrough wall units shall not detract \nfrom building architecture and facade \ncomposition and shall be designed to \nminimize their visibility. Equipment \nshall not project beyond the adjacent \nfinished wall plane and shall be \nscreened and integrated into the \nbuilding’s overall architectural design, \nfacade composition, and detailing.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development \nS1. Mechanical and communication equipment and components \nshall be screened so they are not visible from streets and \nother street level public spaces, including alleys. They \nshall be screened in a manner that is compatible with the \narchitectural character of the building. Appropriate screening \nfor rooftop equipment includes parapet walls or architecturally \ncompatible fabricated enclosures such as panels and walls. \nThe Manager may require a review of rooftop equipment \nscreening by requesting sight line studies. Utilities such as \ntransformers, heating and cooling, electric meters and other \nutility equipment shall not be located within 5 feet of the front \nentrances and shall be screened with evergreen landscape \nmaterials of a height and spacing at time of planting that will \nscreen with equipment or with fencing that is opaque and \nscreens the equipment.\nS2. Packaged Terminal Air Conditioners, Packaged Terminal Heat \nPumps and similar systems with through-wall heating/cooling  \nthat are visible, including from internal public or private areas, \nshall not be allowed.\nFig B.4.S3.a: Solar shades are used to minimize \nsummer heat gain while allowing passive heating in the \nwinter.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 57,
      "text": "City of Gresham Development Code\n[7.05] - 57\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG3. Developments shall utilize strategies \nthat reduce water and energy usage \nattributed to site and building \ndevelopment, building use and the \ntransportation of building users \nwhile not detracting from good \nsite and building design. Healthy \nand sustainable communities shall \nbe created that incorporate “best \npractices” such as LEED™ to conserve \nnatural resources and reduce energy \nusage and carbon emissions. \nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS3. Energy conservation in site and building development shall be \npromoted through sustainable building techniques and design \nstrategies specified in this section. \na. The minimum quantity of required sustainable building \ntechniques and design strategies shall be as follows:\ni. \nCommercial, employment, live/work, mixed-use, and \ncivic developments shall include a minimum of one \nsustainable building technique and design strategy.\nii. Commercial buildings over 30,000 square feet shall \ninclude a minimum of two sustainable building \ntechniques and design strategies.\nb. Sustainable building techniques and design strategies shall \ninclude any of the following:\ni. \nSolar energy panels installed on the roof or other \nlocation shall be approved by the Manager or Design \nCommission depending on the procedure type. Solar \nenergy panels shall be integrated into the building \ndesign or shall be designed to have minimal adverse \nvisual impacts on other surrounding areas (such as \nby screening from view at street level) and yet not \ninterfere with the purpose of the solar panels. The \nquantity of solar energy panels shall:\na. Generate 10 percent of the typical energy \nusage for the building in renewable energy at \na minimum. The typical energy model for the \nbuilding shall be determined by referencing the \nLEED™ standards; or\nb. Comprise an area equivalent to a minimum of 20 \npercent of the roof area.\nii. A vegetated roof surface comprising a minimum of 30 \npercent of the roof area.\niii. One of the following passive energy reduction design \nstrategies:\na. Include protected double door vestibule on the \nnorth and east sides of the structure or add an \neffective windbreak such as a wall;\nb. Orient the long axis of the building east and west, \nwith unobstructed solar access to the south wall \nand roof; or\nc. Locate the windows to take advantage of passive \nsolar collection and include architectural shades/\nreflectors (such as window overhangs) that \nreduce summer heat gain while increasing natural \nillumination and encouraging passive solar heating \nin the winter.\n \nContinued on next page\nFig B.4.S3.b: This Hydrotech TM roof-top garden \nprovides attractive functional open space while saving \nbuilding energy costs.\nFig B.4.S3.c: These green roof gardens help purify the \nurban air and lower urban air temperatures.\n4. F\u0083\u0091\u0083\u0097\u009b CÊÃÖÊÝ®ã®ÊÄ \u0083Ä\u0097 GÙÊçÄ\u0097 L\u009bò\u009b½ D\u009bã\u0083®½Ý, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 58,
      "text": "City of Gresham Development Code\n[7.05] - 58\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS3. Continued\nb. Continued\niv. Skylights or another daylighting system which \nilluminates 75 percent of the building floor area, \nwith skylights occupying a minimum of 3 percent of \nthe roof area with spacing between the skylights not \ngreater than 1.4 times the ceiling height.\nv. Provide alternative transportation infrastructure \nincluding:\na. An on-site alternative fuel refueling station (such \nas an electric, biodiesel, or natural gas fueling \nstation, etc.) An electric fueling station must be \nwithin sight of a functional building entry; and\nb. Bicycle facilities including employee showers and \nchanging areas.\nvi. Source sustainable and local building materials from \nwithin 500 miles of the development site for no less \nthan 20 percent of the total construction materials.\nvii. At least 20 percent of trees, 20 percent of shrubs, \nand 20 percent of groundcover plants shall be \nfood-producing perennial species, such as named \nvarietals of cherries, apples, hazelnuts, blueberries, \nstrawberries, etc. Parking lot and street trees shall \nbe selected from the Recommended Parking Lot and \nStreet Tree Lists.\nviii. Another sustainable element approved by the \nManager.\nFig B.4.S3.f: A large green roof reduces heat islands, minimizes stormwater and \nprovides residents with a roof-top amenity in this mixed-use development.\nFig B.4.S3.d: A skylight is the primary means of \nillumination in the center of this pedestrian mall.\nFig B.4.S3.e: An electric vehicle charging station \nlocated in a highly visible place encourages its use.\n4. F\u0083\u0091\u0083\u0097\u009b CÊÃÖÊÝ®ã®ÊÄ \u0083Ä\u0097 GÙÊçÄ\u0097 L\u009bò\u009b½ D\u009bã\u0083®½Ý, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 59,
      "text": "City of Gresham Development Code\n[7.05] - 59\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional Development\nG4. Commercial, institutional, and mixed-\nuse buildings shall create a rhythm of \nrepeating elements that help establish \ncontinuity in the facade.\nG5. Street-facing facades shall have \nadditional design elements at the \nstreet level to add interest, enhance \nthe building appearance, establish \ngreater depth in the facade and \nenliven the pedestrian realm. These \nfeatures shall complement those used \nto satisfy the Guidelines and Standards \nof Section 7.0503(B)(1) Building \nMassing and Articulation.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development\nS4. All facades shall establish a rhythm by repeating design \nelements at regular spacing along the length and/or height \nof the facade. All facades in the Triangle Area shall contain at \nleast one of the following design features: \na. Columns or pilasters with plinths at regular intervals no \ngreater than 30 feet apart. \nb. Major vertical mullions of at least 6 inches in width, and \nlarger than other mullions in the same window opening, \non all-glass facades.\nc. Vertical reveals no less than 6 inches.\nd. Belt courses above ground floor level and along the entire \nfacade.\ne. Lintels or arches over the windows and doors.\nS5. Commercial, institutional, and mixed-use building facades \nfacing public streets shall contain additional ground level \ndetails that further enliven the pedestrian realm and create \nattractive building fronts. \n \nINSIDE THE TRIANGLE: Building facades facing public streets in \nthe Triangle Area shall contain at least three of the following \ndesign features:\na. Medallions at regular intervals no greater than 30 feet.\nb. Transom windows above storefront windows and doors.\nc. Projecting sills, a minimum of 2 inches from the window \npane.\nd. Lintels or arches (including but not limited to flat, \nsegmented and round arches) over windows and doors. \ne. Ornamental brick or tile work, such as a herringbone \npattern, on a minimum of 5 percent of the ground level \nfacade.\nf. \nPedestrian-scaled lighting fixtures or wall-mounted \nprojecting lighting fixtures such as wall sconces at regular \nspacing no greater than 30 feet.\ng. Awnings, canopies or solar shades/reflectors placed \nover windows, doors or outdoor spaces with a minimum \nprojection of 4 feet.\nh. Projecting signs or banners oriented toward pedestrian \nwalks.\ni. \nOutdoor seating areas enclosed by a fence, wall or \nlandscaping at a height of 30 inches.\nj. \nPlanter boxes, a minimum of 6 square feet, and not in an \naccessible pedestrian walk.\nk. Other feature approved by the Manager or Design \nCommission.\n \nContinued on next page\nFig B.4.S4: In addition to changes in wall plane, \npointed and round arches over windows enhance the \nfacade.\nFig B.4.S5.a: An example of ornamental brickwork in a \nmixed-use building.\nFig. B.4.S5.b: An outdoor seating area adds interest \nand creates opportunities for pedestrian activity.\n4. F\u0083\u0091\u0083\u0097\u009b CÊÃÖÊÝ®ã®ÊÄ \u0083Ä\u0097 GÙÊçÄ\u0097 L\u009bò\u009b½ D\u009bã\u0083®½Ý, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 60,
      "text": "City of Gresham Development Code\n[7.05] - 60\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS5. Continued\n \nOUTSIDE THE TRIANGLE: Buildings facades facing public streets \nin the Outside Triangle Area shall contain at least two of the \nfollowing design features:\nl. \nMedallions at regular intervals no greater than 30 feet;\nm. Transom windows above storefront windows;\nn. Projecting sills, a minimum of 4 inches from the window \npane; \no. Lintels or arches (including but not limited to flat, \nsegmented and round arches) over windows and doors; \np. Ornamental brick or tile work, a minimum of 5 percent of \nthe ground level facade;\nq. A minimum of two pedestrian-scaled lighting fixtures or \nwall-mounted projecting lighting fixtures such as wall \nsconces at regular spacing no greater than 30 feet;\nr. \nAwnings, canopies or solar shades/reflectors placed \nover windows, doors or outdoor spaces with a minimum \nprojection of 4 feet;\ns. Projecting signs or banners oriented toward pedestrian \nways such as sidewalks not larger than 16 square feet;\nt. \nOutdoor seating areas enclosed by a fence, wall or \nlandscaping of a height of 30 inches;\nu. Planter boxes, a minimum of 6 square feet, not in a \npedestrian way; or\nv. Other feature approved by the Manager or Design \nCommission.\nFig B.4.G5: The ground level is enhanced by features \nincluding light fixtures, an awning over the door and \ntransom windows.\nFig B.4.S5.e: Transom windows, projecting signage and a seating area enhance the \nfacade’s ground level.\nFig B.4.S5.d: Large awnings shade windows and \nprovide weather protection on the ground level of a \ncommercial building.\nseating area \ntransom windows\nprojecting signage\nFig. B.4.S5.c: Projecting sills and wall-mounted lighting \nfixtures add detail to this commercial building’s facade.\n4. F\u0083\u0091\u0083\u0097\u009b CÊÃÖÊÝ®ã®ÊÄ \u0083Ä\u0097 GÙÊçÄ\u0097 L\u009bò\u009b½ D\u009bã\u0083®½Ý, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 61,
      "text": "City of Gresham Development Code\n[7.05] - 61\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG6. Storefront windows shall utilize a \nbulkhead or other design feature to \ntransition the building to the ground \nand establish depth and interest in the \nfacade.\nG7. Buildings shall feature an \narchitecturally distinct base to address \nand enhance the meeting of the \nbuilding and ground.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS6. Ground floor storefront windows shall be designed with \nbulkheads between 1 foot and 2 feet above ground level. \nS7. Building Base: Building facades shall include design elements \nwhich establish a building base. Building bases shall consist of \na visible change in the building facade, and include one of the \nfollowing:\na. A change in material;\nb. Texture;\nc. Pattern; \nd. Ornamentation; or \ne. A change in depth no less than 4 inches. The required \nchange in depth for bases may be reduced to 2 inches \nwhen they intersect other articulating features, such as \npilasters, in order to provide visual distinction.\nFig B.4.G7: A defined base transitions the building \nfacade to the ground and complements other features \non the building.\nFig B.4.S7: A building base which utilizes a change in \nmaterial. A full story base may be appropriate on taller \nmulti-story buildings.\nFig B.4.S8: Integrated planters may be used in place of a building base.\n4. F\u0083\u0091\u0083\u0097\u009b CÊÃÖÊÝ®ã®ÊÄ \u0083Ä\u0097 GÙÊçÄ\u0097 L\u009bò\u009b½ D\u009bã\u0083®½Ý, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 62,
      "text": "City of Gresham Development Code\n[7.05] - 62\n(06/22)\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS8. Building Base: The building base shall be a minimum height \nno less than 5 percent of the facade height and shall not \nexceed 20 percent of the facade height. At the discretion of \nthe Manager or Design Commission, multi-story buildings of \nthree levels or greater may have a building base equal to the \nwall area attributed to the ground floor. A landscape area at \nthe base of the building with plant material at least 5 percent \nof the facade height may count toward the building base \nrequirement.\nS9. On street-facing facades, ground floor commercial, \nemployment and live/work uses shall be at the sidewalk \nelevation. \nResidential Development \nS10. Multifamily buildings shall follow the Standards specified in \nSection 7.0103.\nS11. When multifamily space is present on the ground floor, one \nof the following features shall be present on street facing \nfacades:\na. Building base landscaping no less than 5 feet deep. \nb. On street frontages, a space-defining decorative fence, \nwall, hedge or retaining wall 30 inches in height located at \nthe property line or setback no more than 5 feet.\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG8. Building bases shall be proportional \nto the size of the building and shall be \nvisually pleasing.\nG9. Commercial, institutional, and mixed-\nuse buildings shall be designed to \nallow easy access between public \nareas and the building’s interior.\nResidential Development \nG10. Multifamily buildings shall follow the \nGuidelines specified in Section 7.0103.\nG11. Multifamily buildings shall contain \nfeatures and design strategies \nthat create defensible space and a \nseparation between public and private \nspaces.\nFig B.4.G11: Townhouses that are elevated above grade and have large front \nporches. This strategy reinforces ownership and encourages eyes on the street.\nFig B.4.S11: An elevated landscaped area and a \ndecorative wall create a division between public and \nprivate space.\n4. F\u0083\u0091\u0083\u0097\u009b CÊÃÖÊÝ®ã®ÊÄ \u0083Ä\u0097 GÙÊçÄ\u0097 L\u009bò\u009b½ D\u009bã\u0083®½Ý, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 63,
      "text": "City of Gresham Development Code\n[7.05] - 63\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nResidential Development, Continued\nG12. Provide a transitional design feature(s) \nbetween public spaces and residential \nspaces at the ground floor to \ndistinguish between public and private \nrealms.\nExisting Development \nG13. Existing Buildings: Existing buildings \nshall follow the appropriate building \nfacade and ground level details \nGuidelines when changes to the \nbuilding facade are reviewed for a \npermit.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nResidential Development, Continued\nS12. Multifamily space on the ground floor, excluding mixed-\nuse buildings with commercial ground floors, shall provide \na transition between public space and private space by \nincorporating a minimum of one of the following transition \nelements:\na. Elevate the first floor a minimum of 3 feet above grade. \nEntries may be at grade; or \nb. Set back the building an additional 5 feet beyond the \nminimum setback or recess the first floor an additional 5 \nfeet beyond the second-floor facade; or\nc. Provide a front porch that is a minimum of 48 square \nfeet with minimum dimensions to fit a 5-foot by 6-foot \nrectangle inside the porch area; or\nd. Provide a front landscaped courtyard of at least 60 square \nfeet separated by a minimum 30-inch-tall hedge or \ndecorative fence; or\ne. Provide raised planter(s) between 18 inches and 30 \ninches in height and 4 feet in depth as measured from the \npoint of the planter nearest the front property line. The \nplanter(s) shall occupy at least 50 percent of the frontage \nof each unit and be planted with perennial landscaping; or\nf. \nOther strategy as determined by the Manager or Design \nCommission.\nExisting Development \nS13. Renovations which modify the exterior building facades and \nrequire a permit shall follow this section at the discretion of \nthe Manager. Renovations which do not change the existing \nexterior building facade are exempt from Standards specified \nin this section.\n4. F\u0083\u0091\u0083\u0097\u009b CÊÃÖÊÝ®ã®ÊÄ \u0083Ä\u0097 GÙÊçÄ\u0097 L\u009bò\u009b½ D\u009bã\u0083®½Ý, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 64,
      "text": "City of Gresham Development Code\n[7.05] - 64\n(06/22)\n5. TÙ\u0083ÄÝÖ\u0083Ù\u009bÄ\u0091ù\nIntent:  To create visual interest on building facades by providing views \ninto active spaces and by allowing for passive surveillance \nof exterior areas while providing for daylighting of interior \nspaces.\nApplicable Rockwood Design Principles from Section 7.0502: \nA. Physical Environment\nB. Sustainability\nC. Safe Design \nH. Architectural Quality\nJ. \nRehabilitation\nL. High-Quality Materials\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1. Windows shall be designed to \nestablish a sense of depth and create \nshadows within the facade.\nCommercial and Institutional Development\nG2. INSIDE THE TRIANGLE: Buildings that \nface the most active streets with \nthe highest street classifications \nshall contain the highest levels of \ntransparency at the pedestrian level. \n \nOUTSIDE THE TRIANGLE: Commercial \nbuildings that face the most active \nstreets with the highest street \nclassifications shall contain higher \nlevels of transparency at the \npedestrian level.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development\nS1. Windows shall be recessed a minimum of 4 inches from the \nbuilding plane.\nCommercial and Institutional Development\nS2. INSIDE THE TRIANGLE: Street-facing facades of buildings that \nface Stark or 181st Street shall be composed of clear glass for \na minimum of 60 percent of the ground floor between the \nheights of 2 feet and 12 feet. \n \nOUTSIDE THE TRIANGLE: Street facing facades of commercial, \ninstitutional, and mixed-use buildings that face Stark or 181st \nStreet shall be composed of clear glass for 60 percent of the \nground floor between the heights of 2 feet and 12 feet.\nFig B.5.S1: Storefront windows recessed to establish depth.\nFig B.5.S2.a: High levels of transparency are required \nbetween the heights of 2 and 12 feet on street facing \nfacades.\nFig B.5.G1: Ground floor windows are recessed from \nthe building wall to create depth.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 65,
      "text": "City of Gresham Development Code\n[7.05] - 65\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG3. INSIDE THE TRIANGLE: Buildings that \nface less active streets shall contain \nhigh levels of transparency at the \npedestrian level on facades which face \nthe street. \n \nOUTSIDE THE TRIANGLE: Commercial, \ninstitutional, and mixed-use \nbuildings shall contain high levels of \ntransparency at the pedestrian level \non facades which face the street.\nG4. Non-street facing facades which have \nentries shall have sufficient levels of \ntransparency to ensure the safety of \nthese areas by allowing for natural \nsurveillance.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS3. INSIDE THE TRIANGLE: Street-facing facades other than the \nbuildings that face 181st or Stark Street shall be composed of \nclear glass for a minimum of 50 percent of the ground floor \nbetween the heights of 2 feet and 12 feet, except as noted \nbelow. \n \nOUTSIDE THE TRIANGLE: Street-facing facades of commercial, \ninstitutional, and mixed-use buildings, other than those that \nface 181st or Start Street, shall be composed of clear glass for \n50 percent of the ground floor between the heights of 2 feet \nand 12 feet.\nS4. INSIDE THE TRIANGLE: Non-street-facing facades that face \nparking areas or other frequently used outdoor spaces, as \ndetermined by the Manager, shall be composed of clear glass \nfor a minimum of 25 percent of the ground floor between the \nheights of 2 feet and 12 feet to allow for passive surveillance \nof these areas. Landscaping and other features between the \nfacade and these areas shall be designed so as not to obstruct \nviews from interior spaces. \n \nOUTSIDE THE TRIANGLE: Non-street-facing facades that face \na parking area or other frequently used outdoor space, as \ndetermined by the Manager, shall be composed of clear glass \nfor a minimum of 25 percent of the ground floor between the \nheights of 2 feet and 12 feet to allow for passive surveillance \nof these areas. Landscaping and other features between the \nfacade and these areas shall not obstruct views from interior \nspaces. \nFig B.5.S2.b: High levels of transparency are required \nbetween the heights of 2 and 12 feet on street-facing \nfacades.\nFig B.5.G4: Non-street facing facades shall include transparency to allow passive \nobservation of the parking area.\nFig B.5.G3 OUTSIDE THE TRIANGLE:  Facades \nfacing the primary street of the site shall have the \nhighest level of transparency.\n5. TÙ\u0083ÄÝÖ\u0083Ù\u009bÄ\u0091ù, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 66,
      "text": "City of Gresham Development Code\n[7.05] - 66\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG5. Upper building stories shall provide \nclear glass windows.\nG6. INSIDE THE TRIANGLE: Windows shall \nreinforce a vertical proportion on \nthe facade and not contribute to a \ndominant horizontal geometry in the \nbuilding. \n \nOUTSIDE THE TRIANGLE: Vertical \nwindow openings are preferred; \nhowever, window openings may \nexhibit a horizontal proportion.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS5. INSIDE THE TRIANGLE: Upper levels of street facing facades \nshall be composed of clear glass for 25 percent of the wall area \nabove the ground floor, excluding roof shapes and parapets. \n \nOUTSIDE THE TRIANGLE: Upper levels of street facing facades \nshall be composed of clear glass for 20 percent of the wall area \nabove the ground floor, excluding roof shapes and parapets.\nS6. Window openings are preferred to exhibit a vertical \nproportion. Window openings shall not exhibit a horizontal \nproportion greater (more horizontal) than two-to-one.\nFig B.5.G5.b: Upper levels as well as the ground floor shall include high levels of \ntransparency.\nFig B.5.G5.a OUTSIDE THE TRIANGLE: Upper levels as well as the ground floor \nshall include high levels of transparency.\nFig B.5.S6.b: Window proportions are preferred to be \nvertical. Horizontal proportions are allowable up to 2:1.\nFig B.5.S5 and B.5.S6.a: The upper level incorporates \nvertically-oriented windows to increase transparency \nand prevent a dominant horizontal geometry in the \nfacade.\nPreferred\nAllowable\nProhibited\n1\n1\n2\n3\n5. TÙ\u0083ÄÝÖ\u0083Ù\u009bÄ\u0091ù, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 67,
      "text": "City of Gresham Development Code\n[7.05] - 67\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nCommercial and Institutional \nDevelopment, Continued\nG7. INSIDE THE TRIANGLE: When \nbuildings require specific areas not \nto be transparent, a limited amount \nof displays that are integrated into \nthe building may substitute for \ntransparent glazing. \n \nOUTSIDE THE TRIANGLE: When \nbuildings require specific areas to \nnot be transparent, a limited amount \nof displays that are integrated into \nthe building may substitute for \ntransparent glazing. Objects which \nobstruct views between interior and \nexterior spaces shall be limited to \nensure visibility.\nG8. Glass shall not be mirrored or tinted to \nprevent views into spaces. Glass shall \nbe as clear as possible while meeting \napplicable energy codes.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nCommercial and Institutional Development, Continued\nS7. Visual Connectivity: The following Standards ensure true visual \nconnectivity between interior and exterior spaces:\na. INSIDE THE TRIANGLE: Ground floor windows shall \nprovide views into active spaces such as storefronts, \noffices, lobbies, etc. At the discretion of the Manager or \nDesign Commission, display windows that do not provide \nviews into the building may count towards the required \ntransparency if the display extends a minimum of 4 feet \ninto the building and contains three-dimensional (3D) \nobjects, such as product displays. Window boxes added to \nthe exterior of the building are not permitted. \n  \nOUTSIDE THE TRIANGLE: At the discretion of the Manager \nor Design Commission, display windows that do not \nprovide views into the building may count towards the \nrequired transparency if the display extends a minimum \nof 4 feet into the building and contains three-dimensional \n(3D) objects, such as product displays. Window boxes \nadded to the exterior of the building are not permitted.\nb. INSIDE THE TRIANGLE: Up to 25 percent of the required \nground floor transparent area may be attributed to display \nwindows as described in this section. \n  \nOUTSIDE THE TRIANGLE: Up to 50 percent of the required \nground floor transparent area may be attributed to display \nwindows as described in this section.\nS8. To meet the clear, transparent glass requirement, storefront \nwindows shall have a Visible Transmittance (VT) value of 60 \npercent or greater.\nFig B.5.S8: Only clear glass shall count toward the \ntransparency requirement.\nFig B.5.S7: A limited amount of displays which extend into the building may count \ntoward the transparency requirement.\n5. TÙ\u0083ÄÝÖ\u0083Ù\u009bÄ\u0091ù, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 68,
      "text": "City of Gresham Development Code\n[7.05] - 68\n(06/22)\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nResidential Development \nG9. When the common areas of \nmultifamily buildings do not require \nprivacy, they shall have high levels of \ntransparency.\na. Multifamily building entries shall \nprovide sufficient transparency at \nthe entry to enhance safety.\nExisting Development \nG10 and 11. Existing buildings under \nrenovation which require a permit \nshall maximize transparency if \nwindows are being replaced.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nResidential Development\nS9. Multifamily buildings shall follow transparency Standards \nspecified in Section 7.0103. In addition, the following \nStandards shall apply:\na. Ground floor spaces of multifamily buildings attributed to \ncommon areas, such as lobbies, shared community rooms, \nfitness rooms, etc., shall be composed of clear glass for \na minimum of 40 percent of the wall area between the \nheights of 2 feet and 10 feet. \nb. Building entries that access the parking area shall be \ndesigned with transparent glass that allows users to look \nout prior to exiting the building.\nc. Accessory, non-residential buildings, such as recreation \nor community centers, which abut a public street right-of-\nway, shall have at least 20 percent of the ground floor wall \narea facing the street in transparent windows, doorways, \nor display areas, including an entry opening directly onto \nthe abutting street.\nExisting Development \nS10. Existing buildings with levels of transparency less than the \namount specified shall not lessen the amount of transparency \nduring renovations which require a permit if the exterior \nbuilding facade is altered.\nS11. When changes are being made to the facade of existing \nbuildings, window openings which have been replaced with \nother materials (brick, block or other materials) and are visible \nfrom the street shall have transparent windows reinstalled in \nthese locations.\nFig B.5.S11: A renovated building in which windows \nwere reinstalled.\nFig B.5.S9: Lobbies and other common areas shall have increased levels of \ntransparency in multifamily buildings.\n5. TÙ\u0083ÄÝÖ\u0083Ù\u009bÄ\u0091ù, CÊÄã®Äç\u009b\u0097\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 69,
      "text": "City of Gresham Development Code\n[7.05] - 69\n(06/22)\n6. G\u0083ã\u009bó\u0083ùÝ\nIntent: To enhance important intersections and locations within \nRockwood through strategies such as creating a strong \narchitectural building statement, making changes to building \nform, and enhancing building details and landscape.\nApplicable Rockwood Design Principles from Section 7.0502: \nA. Physical Environment\nE. Open Space\nH. Architectural Quality\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development\nG1. Gateways shall mark prominent \nintersections which are highly visible \nwithin Rockwood as shown in Fig. \nB.6.G1.\na. 181st and Burnside\nb. 181st and Stark\nc. Burnside and Stark\nG2. Buildings surrounding these \nintersections shall be of a sufficient \nheight to emphasize the hierarchy of \nthese places. These buildings shall be \ngenerally taller than the surrounding \nbuildings.\nG3. To create pedestrian activity and \nadditional interest in these areas, \nbuilding entries shall be prominently \nlocated to emphasize the gateways.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development\nS1. The following intersections as shown in Fig. B.6.G1 shall be \nconsidered Gateways and shall follow the Design Standards on \nprivate property as specified in this section:\na. 181st and Burnside\nb. 181st and Stark\nc. Burnside and Stark\nS2. Building Scale: Building massing shall respond to the \nimportance of these areas. Building masses facing and \nabutting these intersections shall be taller than adjacent \nfacade sections and no less than three occupiable stories. \nAn occupiable story may include a mezzanine if the facade \ncontains elements such as windows that would indicate the \npresence of a second level. The three-story mass shall extend \nno less than 60 feet along each street frontage.\nS3. Building Entries: Buildings shall have an entry accessible from \nthe gateway. The building entry shall be no more than 10 feet \nfrom the building corner. \nFig B.6.G1: The location of Gateway intersections establish the Triangle Area within \nRockwood and establish prominence at these intersections.\nStark Street\nBurnside Street\n181st Street\nFig B.6.S2: Facade sections fronting the Gateway \nintersections shall be at least 3 occupiable stories.\nFig B.6.G3: Building entries shall be very close to \ngateway intersections to encourage pedestrian activity \nin these areas.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 70,
      "text": "City of Gresham Development Code\n[7.05] - 70\n(06/22)\n6. G\u0083ã\u009bó\u0083ùÝ, CÊÄã®Äç\u009b\u0097\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development, Continued\nG4. Building facades shall utilize high-\nquality materials to create attractive, \ndurable and timeless buildings.\nG5. Landscape plazas may be developed \nto add pedestrian spaces in areas \nthat would be difficult to otherwise \ndevelop. The plazas shall be designed \nto encourage pedestrian gathering and \nutilization.\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development, Continued\nS4. Primary Materials, as defined in Section 7.0503(B)(7), shall be \nused for no less than 80 percent of the street-facing facades. \nPrimary material usage on the remainder of the facade shall \nbe measured independently and shall follow the Standards \nspecified in Section 7.0503(B)(7).\nS5. Landscaped Plazas: Because of irregular parcels created by the \norientation of Burnside and Stark, landscaped plazas may be \ndeveloped in place of buildings and count toward the building \nfrontage requirement at the gateways. These plazas shall \ninclude the following features:\na. At least 20 percent of the area shall be hardscaped with \ndecorative paving;\nb. At least 30 percent of the area shall be landscaped with \ntrees, shrubs, groundcover and perennial landscape \nplantings;\nc. Pedestrian-scaled lighting fixtures shall be no taller than \n18 feet;\nd. An average of at least one bench or seating unit for each \n200 square feet of area shall be provided (seating may be \ngrouped into benches or ledges); \ne. One element with sustainability attributes (such as but not \nlimited to rain gardens, solar powered lights or equipment, \nor pervious pavement) shall be provided; and\nf. \nAn element that provides a focal point to the space shall \nbe provided, such as but not limited to:\ni. \nAn artistic design element such as a decorative paving \npattern, a pair of ornamental lighting elements, etc.;\nii. A clock tower;\niii. A water feature; \niv. An art installation as approved by the Design \nCommission; or\nv. Other features as approved by the Design Commission \nor Manager.\nFig B.6.G4.a: Stone and other high-quality materials \nare appropriate for highly visible gateway buildings.\nFig B.6.G4.b: Glass and other high-quality materials are appropriate for highly visible \ngateway buildings.\nFig B.6.S5: Landscaped plazas with pedestrian \namenities encourage activity at the Gateways.\nFig B.6.S4: High-quality materials, including brick, \nstone and glass, are used on facades facing important \nintersections.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 71,
      "text": "City of Gresham Development Code\n[7.05] - 71\n(06/22)\n7. M\u0083ã\u009bÙ®\u0083½Ý\nD\u009bÝ®¦Ä Sã\u0083Ä\u0097\u0083Ù\u0097Ý\nAll Development \nS1. Materials:\na. Buildings shall utilize primary materials for no less than 65 \npercent of each building facade area.\nb. Secondary materials are prohibited as primary cladding on \nbuilding facades and shall not be allowed on more than 35 \npercent of each building facade area.\nc. Accent materials are permitted on no greater than 5 \npercent of each facade as trims or accents (e.g. flashing, \nprojecting features, ornamentation, etc.).\nS2. Buildings shall not utilize materials listed as prohibited.\nS3. Fencing materials shall be durable, maintainable and \nattractive.\nExisting Development \nS4. Existing Buildings: If renovations include facade modifications, \nmodified sections shall comply with standards specified in \nSection 7.0503(B)(7).\nS5. Existing brick and stone buildings undergoing facade \nrenovations shall remove any paint, paneling or other covering \napplied to these materials to reveal original surfaces.\nIntent: To promote the use of high-quality, durable and attractive \nmaterials in buildings which contribute to the aesthetic \nquality of the development and to the urban design fabric of \nthe community.\nApplicable Rockwood Design Principles from Section 7.0502: \nC.  \nSafe Design \nH.  \nArchitectural Quality\nI. \n \nSustainable Architectural Design\nJ. \n \nRehabilitation\nL.  \nHigh-Quality Materials\nD\u009bÝ®¦Ä Gç®\u0097\u009b½®Ä\u009bÝ\nAll Development \nG1. Materials:\na. The predominant building \nmaterials shall be high-quality, \ndurable and attractive.\nb. The predominant building material \nmay be complemented with other \nsecondary materials which may \nnot be appropriate on large areas \nof the facade.\nc. Accent materials, which would \ngenerally not be acceptable on \nlarge areas of the facade, may be \nused in limited areas of the facade \nto highlight architectural features.\nG2. Prohibited Materials: Materials \nidentified as prohibited in Table \n7.0503.B.7 shall not be used on any \nbuilding.\nG3. Fencing shall be durable, maintainable \nand attractive.\nExisting Development \nG4. Existing Buildings: Renovated facade \nsections shall utilize high-quality, \nattractive and durable materials.\nG5. When buildings are renovated, high-\nquality original materials shall be \nexposed.\nFig B.7.G1.a: Finished wood complements the brick, \nconcrete, and glass structure.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 72,
      "text": "City of Gresham Development Code\n[7.05] - 72\n(06/22)\n7. M\u0083ã\u009bÙ®\u0083½Ý, CÊÄã®Äç\u009b\u0097\nT\u0083\u0090½\u009b 7.0503.B.7: PÙ®Ã\u0083Ùù, S\u009b\u0091ÊÄ\u0097\u0083Ùù, A\u0091\u0091\u009bÄã, \u0083Ä\u0097 PÙÊ«®\u0090®ã\u009b\u0097 \nM\u0083ã\u009bÙ®\u0083½Ý\nP:  Primary Material\nS:  Secondary Material\nA: Accent Material\nN: Prohibited Material or\n     Prohibited Fencing Type\nMaterial\nCommercial,  \nMixed-Use, or Civic\nMultifamily \nResidential\nBrick (full dimensional)\nP\nP\nStone/masonry1\nP\nP\nStucco2\nP\nP\nGlass (transparent, spandrel)\nP\nP\nFinished wood, wood veneers, and wood siding\nP\nP\nFactory or naturally finished flat, profiled, \nfluted, or ribbed metal3 panels\nP\nP\nFiber reinforced cement siding and panels\nS\nP\nConcrete blocks with integral color (ground, \npolished, or glazed finishes)\nS\nS\nConcrete (poured in place or precast)\nS\nS\nCeramic tile\nS\nS\nStanding seam metal3\nS\nS\nOther material as approved by the Manager or \nDesign Commission\nP/S\nP/S\nConcrete blocks with integral color (split face \nfinish)\nA\nA\nCorrugated metal\nA\nA\nGlass block\nA\nA\nVegetated wall panels or trellises\nA\nA\nVinyl siding\nN\nN\nT-111 Plywood\nN\nN\nExterior Insulation Finishing System (EIFS)\nN\nN\nPlastic or vinyl fencing\nN\nN\nChain link fencing\nN\nN\nTable 7.0503.B.7 Notes: \n 1 Stone shall be natural, not manufactured or panelized, and shall have \nsufficient depth to clearly project beyond adjacent wall planes, such as \nwith the use of full bed depth stone.\n2 See Section 3.0103 definition for more information on Stucco application \nrequirements.\n3 Metals shall be of a size, thickness and detailing that will remain free of \nvisual defects and visual distortion such as oil canning, ski sloping, and \nshadowing.\nFig B.7.G1.b: A brick storefront enhanced with ceramic \ntiles highlighting the windows.\nFig B.7.G1.c: Stone can create a simple yet elegant \nfacade.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:21.529021",
  "extractor_version": "1.0.0"
}