{
  "metadata": {
    "filename": "dc-section-4.0200.pdf_id7834",
    "extracted_at": "2025-05-22T06:15:21.469451",
    "num_pages": 6,
    "title": "DC Section 4.0200",
    "author": "City Staff",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.58",
    "creation_date": "D:20230105095653-08'00'",
    "modification_date": "D:20230105095712-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[4.02]-1 \nCity of Gresham Development Code \n \n(11/20) \nSECTION 4.0200   \nCOMMERCIAL LAND USE DISTRICTS \nGeneral \n4.0201  Purpose   \nLand Use District Characteristics \n4.0210  Neighborhood Commercial District (NC)  \n4.0212  Central Rockwood and Corridor Districts \nPermitted Uses \n4.0220  Permitted Uses  \nCommercial Land Use District Standards \n4.0230  Commercial Land Use District Standards \n4.0231  Additional Commercial Land Use District Standards \n4.0232  Solar Energy Standards for Commercial Districts \n4.0233  Wind Energy Standards for Commercial Districts \n4.0234  Biomass Energy Standards for Commercial Districts \n4.0235  Geothermal Energy Standards for Commercial Districts \n4.0236  Micro-Hydro Energy Standards for Commercial Districts \nGeneral \n4.0201  Purpose   \nDevelopment on lands designated Neighborhood Commercial District is permitted when consistent with \nthe provisions of this section and all other applicable requirements of the Community Development Code. \nLand Use District Characteristics \n4.0210  Neighborhood Commercial District (NC)   \nThe Neighborhood Commercial District is intended to provide for small to medium sized shopping and \nservice facilities and limited office uses adjacent to residential neighborhoods.  The district is intended to \nmeet the shopping and service needs of the immediate neighborhood and to have minimal negative \nimpacts on surrounding residential uses.  Areas determined appropriate for Neighborhood Commercial \nDistricts are identified on the Community Development Plan Map. \n4.0212  Central Rockwood and Corridor Districts \nAdditional Commercial Development Districts unique to the Corridor Districts are listed in Section \n4.0400.  The Gresham Community Development Plan map identifies the location of these additional \ndevelopment districts. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[4.02]-2 \nCity of Gresham Development Code \n \n(11/20) \nPermitted Uses \n4.0220  Permitted Uses \nTable 4.0220 lists those uses that are permitted in each Commercial District.   \n• \nP = Permitted use \n• \nL = Use is permitted, but is limited in the extent to which it may be permitted \n• \nNP = Use not permitted \n• \nSUR = Use permitted subject to a Special Use Review \n \nEach of these uses must comply with the site development requirements of Section 4.0230-4.0231 and all \nother applicable requirements of the Community Development Code. \nTable 4.0220:  Permitted Uses in the Commercial Land Use Districts \nUSES \nNC \nRESIDENTIAL1 \nSingle Detached Dwelling \nNP \nDuplex \nNP \nTriplex \nNP \nQuadplex \nNP \nTownhouse \nNP  \nCottage Cluster \nNP \nMultifamily \nNP \nElderly Housing \nNP \nManufactured Dwelling Park \nNP \nResidential Facility \nNP \nResidential Home \nNP \nAffordable Housing \nP2 \nCOMMERCIAL \nAuto-Dependent Use \nL3 \nBusiness and Retail Service and Trade \nL4 \nClinics \nNP \nCommercial Parking \nSUR \nDaycare Facilities \nSUR \nLive-Work \nNP \nMajor Event Entertainment \nSUR \nMini-Storage Facilities \nNP \nOutdoor Commercial \nNP \n \nINDUSTRIAL \nConstruction \nNP \nExclusive Heavy Industrial Uses \nNP \nIndustrial Office \nNP \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[4.02]-3 \nCity of Gresham Development Code \n \n(11/20) \nUSES \nNC \nInformation Services \nNP \nManufacturing \nNP \nMiscellaneous Industrial \nNP \nTrade Schools \nNP \nTransportation/Distribution \nNP \nWarehousing/Storage \nNP \nWaste Management \nNP \nWholesale Trade \nNP \nINSTITUTIONAL USES \nCivic Use \nSUR \nCommunity Services \nSUR \nMedical \nSUR \nParks, Open Spaces and Trails \nSUR \nReligious Institutions \nSUR \nSchools \nSUR \nRENEWABLE ENERGY6 \nSolar Energy Systems \nL/SUR7 \nWind Energy Systems \nL8 \nBiomass Energy Systems \nL9 \nGeothermal Energy Systems \nL/SUR10 \nMicro-Hydro Energy Systems \nL11 \nOTHER \nBasic Utilities \n  Minor basic utilities \n  Major basic utilities \n \nP \nSUR \nHeliports5 \nNP \nWireless Communication Facilities \nSUR \nTemporary, Intermittent & Interim Uses \nP \nMarijuana Businesses \nL12 \nTable 4.0220 Notes \n1. Home occupations may be permitted with a pre-existing dwelling in the NC district.  Temporary health hardship dwellings may \nbe permitted with a pre-existing single detached dwelling home in the NC district. \n2. Affordable Housing Development is permitted. See Section 10.1700. \n3. Limited to gas stations and similar retail uses with a maximum gross floor area of 10,000 square feet. \n4. Business and Retail Service and Trade are limited to the following: \n• Eating and drinking establishments with a maximum gross floor area of 3,500 square feet  \n• Insurance, real estate, and other similar offices with a maximum gross floor area of 5,000 square feet \n• Laundries, dry cleaners, barber salons, and other similar personal services with a maximum gross floor area of 5,000 \nsquare feet \n• Clothing, drug stores, and similar retail trade uses with a maximum gross floor area of 10,000 square feet \n• Grocery store with a maximum gross floor area of 35,000 square feet \n5. Permitted as an accessory use to Medical and Civic Uses through the Special Use Review process. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[4.02]-4 \nCity of Gresham Development Code \n \n(11/20) \n6. See Section 10.0900 for additional standards that apply. \n7. For limitations, see Section 4.0232 Solar Energy System Standards for Commercial Districts. \n8. For limitations, see Section 4.0233 Wind Energy System Standards for Commercial Districts. \n9. For limitations, see Section 4.0234 Biomass Energy System Standards for Commercial Districts. \n10. For limitations, see Section 4.0235 Geothermal Energy System Standards for Commercial Districts. \n11. For limitations, see Section 4.0236 Micro-Hydro Energy System Standards for Commercial Districts. \n12. For limitations, see GRC 9.63.090. \nCommercial Land Use District Standards \n4.0230  Commercial Land Use District Standards \nThe site development requirements listed in Table 4.0230 are applicable to all development within the \nNeighborhood Commercial district.  Development within this district shall also be consistent with all \nother applicable requirements of the Community Development Code. \n \nNC \nA. Maximum Site Size \n4 acres1 \nB. Minimum Lot Size \n10,000 square feet \nC. Minimum Lot Dimensions \n \nWidth \n60 feet \nDepth \n70 feet \nD. Minimum Yard Setbacks2 \n \nFront \n20 feet \nSide - interior lot \n0 feet \nSide - corner lot \n0 feet on the interior side, and  \n15 feet on the side abutting the \nstreet3. \nRear \n0 feet \nE. Maximum Building Height \n35 feet4 \nF. Maximum Lot Coverage \n50% \nG. On-Site Activities \nSee Section 4.0231(B)5 \nH. Public Facilities, Site and Supplementary Requirements \nSee Section 4.0231(C) \nTable 4.0230 Notes: \n1 This requirement does not apply to the Springwater Plan District. \n2 Buffering and screening may be required in addition to these setbacks.  See Section 9.0100 for the buffering and screening \nrequirements.  Also, refer to the height transition area requirement found in the Maximum Building Height Section 4.0231(A) \nsince it can increase the minimum yard setbacks where a development abuts a residential district. \n3 However, for up to fifty percent (50%) of the length of the side yard abutting a street (excluding that portion of the side yard \nwhich overlaps the required front yard), the street-side setback may be reduced to five (5) feet. \n4 See Section 9.0600 - Height Transition \n5 At least ninety-five percent (95%) of the business activities must be conducted within a completely enclosed structure.  No \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[4.02]-5 \nCity of Gresham Development Code \n \n(11/20) \nmore than five percent (5%) of the area devoted to business use may be used for outdoor business activities, product display, \nor storage. \n4.0231  Additional Commercial Land Use District Standards \nA. \nMaximum Building Height:  Three (3) stories or forty (40) feet unless equipped with a built-in \nfire protection system. When fire sprinklers, alarms, and when needed, enclosed, pressurized exit \nstairwell systems are provided, the building height can be increased to sixty-five (65) feet. \nB. \nOn Site Activities: \n1. \nNo outdoor business activities, product display or storage shall be located within yard \nsetback or buffering and screening areas. \n2. \nAreas devoted to on-site outdoor business activities, product display or storage must be \nlocated so that they do not interfere with pedestrian circulation. \nC. \nPublic Facilities. Site and Supplementary Requirements.  All developments shall also be subject \nto the applicable requirements of Section 4.0230 - Commercial Land Use District Standards; \nArticle 9-Common Requirements; and Appendix 5.000 - Public Facilities. \n4.0232  Solar Energy Standards for Commercial Districts  \nSolar energy systems are limited in all commercial districts as follows: \nA. \nScale. Small and medium scale solar energy systems are permitted in these districts. Large scale \nsystems are permitted with a Special Use Review. \nB. \nType.  Roof-top, flat-roof, integrated and ground-mounted solar energy systems are permitted. \nC. \nHeight. The following limitations on maximum height apply to all solar energy systems: \n1. \nRoof-top, Flat-roof and Integrated. \na. \nFor roofs that are flat or the horizontal portion of mansard roofs, the solar energy \nsystems on frames shall not exceed 10 feet above the roof height on which the system \nis installed. \nb. \nFor pitched, hipped or gambrel roofs, the solar energy system panels shall not exceed \n18 inches in height from the surface of the roof on which the system is installed.  \n2. \nGround-mounted. Ground-mounted solar energy systems shall not exceed 20 feet in height. \nD. \nSetbacks and Yards. Solar energy systems are not allowed in the required front or in the street-\nside setbacks. \n4.0233  Wind Energy Standards for Commercial Districts \nWind energy systems are limited in all commercial districts as follows: \nA. \nScale. Small and medium scale wind energy systems are permitted. \nB. \nType.  Roof-top and ground-mounted wind energy systems are permitted. \nC. \nHeight.  The following limitations on maximum height apply to all wind energy systems: \n1. \nRoof-top.  Wind energy system height shall not exceed a value equal to the building height \nwhen the building height is 35 feet or less. For example, a 30 foot tall building could have a \n30 foot tall wind energy system installed on its roof for a total height of 60 feet from the \nground to top of the wind energy system. In no case can the wind energy system exceed 35 \nfeet in height.  \n2. \nGround-mounted.  Ground-mounted wind energy systems shall not exceed 45 feet in \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[4.02]-6 \nCity of Gresham Development Code \n \n(11/20) \nheight.  \nD. \nSetbacks and Yards.  Wind energy systems are not allowed in required front, street-side, side or \nrear setbacks and are not allowed in the front or street-side yards between the building and the \nstreet. \n4.0234  Biomass Energy Standards for Commercial Districts \nBiomass energy systems are limited in all commercial districts as follows: \nA. \nScale.  Small scale biomass energy systems are permitted. \nB. \nType.  Non-hazardous biomass systems are permitted. \nC. \nHeight.  Biomass energy systems shall not exceed the maximum district height limits. \nD. \nSetbacks and Yards.  Biomass energy systems are not allowed in the required front, street-side, \nside or rear setbacks, and are not allowed in the front or street-side yards between the building \nand the street. \n4.0235  Geothermal Energy Standards for Commercial Districts \nGeothermal energy systems are limited in all commercial districts as follows: \nA. \nScale.  Small scale geothermal energy systems are permitted. Large scale systems are permitted \nwith a Special Use Review. \nB. \nType.  Closed-loop geothermal energy systems that are not in any well field protection areas are \npermitted. \nC. \nHeight.  Geothermal energy systems shall not exceed the maximum district height limits. \nD. \nSetbacks and Yards.  Geothermal energy systems are not allowed in the required front, street-\nside, side or rear setbacks, except that small geothermal heating and cooling units like heat pumps \ncan project into the setbacks per Section 9.0900 Projections. \n4.0236  Micro-Hydro Energy Standards for Commercial Districts \nMicro-hydro energy systems are limited in all commercial districts as follows: \nA. \nScale.  Small scale micro-hydro energy systems are permitted. \nB. \nType.  In-pipe micro-hydro energy systems such as systems within water, stormwater or \nwastewater pipe are permitted. \nC. \nHeight.  Generally the district height limits apply. However, in-pipe systems may exceed the \ndistrict height limit as allowed for mechanical equipment. If supplemental equipment structures \naccompany the in-pipe systems, then the district height limit would apply.  \nD. \nSetbacks and Yards.  Micro-hydro energy systems contained within piping are allowed and pipe \ncan run within the required setbacks. However, if supplemental equipment structures accompany \nthe in-pipe systems, then the district setback limits apply. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:21.469959",
  "extractor_version": "1.0.0"
}