{
  "metadata": {
    "filename": "dc-section-5.0200.pdf_id7845",
    "extracted_at": "2025-05-22T06:15:23.786251",
    "num_pages": 19,
    "title": "DC Section 5.0200",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220623120318-07'00'",
    "modification_date": "D:20220628092448-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[5.02]-1 \nCity of Gresham Development Code \n \n(06/22) \n \nSECTION 5.0200 \nHILLSIDE AND GEOLOGIC RISK OVERLAY (HGRO) \nGeneral \n5.0201  Purpose \n5.0202  Definition and Applicability \n5.0203  Applicability \n5.0204  Prohibitions \n5.0205  Exempt Uses and Activities \n5.0206  Permit Required \n5.0207  HGRO Application Requirements \nStandards \n5.0208  Tree and Vegetation Standards within the Hillside and Geologic Risk Overlay (HGRO) \n5.0209  General Standards for Development within the Hillside and Geologic Risk Overlay (HGRO) \n5.0210  Standards for Specific Development Types within the Hillside and Geologic Risk Overlay (HGRO) \n5.0211  Additional Development Standards for Highly Sloped Subareas (HSS) \nProcess \n5.0212  Alternative Review \n5.0213  Modification of HGRO Standards \n5.0214  HGRO Mapping Protocols \n5.0215  HGRO Map Administration and Correction \n5.0216  Violations \n \n5.0201  Purpose \nThe purpose of the Hillside and Geologic Risk Overlay (HGRO) is to ensure that development in or adjacent to \nhillside areas occurs in such a manner as to: \n \nA. \nMinimize the potential for earth movement and resultant hazards to life and property; \nB. \nMinimize soil erosion and siltation; \nC. \nProtect water quality; \nD. \nMinimize vegetation removal in sloped areas; \nE. \nProtect the aesthetic and scenic qualities of hillside areas; \nF. \nAssure the compatibility of a new development with surrounding areas; \nG. \nEncourage site and building design which is consistent with the natural topography; and \nH. \nMinimize the cost of public infrastructure provision. \nI. \nProvide for adequate access for emergency services. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[5.02]-2 \nCity of Gresham Development Code \n \n(06/22) \n \n \n5.0202  Coordination with Other Regulations \nA. \nAllowed Uses.  Uses permitted in the Hillside and Geologic Risk Overlay shall be those listed as \npermitted in the underlying district designated for the site unless conflicting standards apply. \nB. \nConflicting Standards.  The requirements of this Hillside and Geologic Risk Overlay (HGRO) apply in \naddition to other applicable local, state, regional, and federal development requirements. Conflicts \nbetween standards for allowed and conflicting uses shall be resolved as follows: \n1. \nWhere there is a conflict between the standards of the underlying district or the Planned \nDevelopment standards and the standards of this HGRO, the standards of the HGRO shall apply. \n2. \nWhere there is a conflict between the standards of the HGRO and other overlay districts the most \nrestrictive will apply. \n3. \nStreet Trees, Parking Lot Trees, Buffer Trees and all trees within approved Permanent \nDisturbance Areas are subject to the tree removal and mitigation requirements of Section 9.1000. \nAll other trees within the HGRO are subject to the tree removal, protection and mitigation \nrequirements of the HGRO. \n4. \nIn all other situations, the most stringent of the conflicting standards apply. \nC. \nGresham Environmental Technical Guidance Manual.  Clarifications, commentary and examples are \ngiven in the Gresham Environmental Technical Guidance Manual. Content of the Guidance Manual is \nto be used in tandem with development code and does not substitute for amend, or supersede \ndevelopment code. \nD. \nFor the purposes of Section 5.0200 “land division” does not include middle housing land divisions \npursuant to Section 6.0500 and “lot” does not include middle housing lots created by middle housing \nland divisions. \n \n5.0203  Applicability \nA. \nUnless exempt pursuant to Section 5.0205 the regulations of this chapter apply when the following \nregulated activities are proposed within the boundaries of the Hillside and Geologic Risk Overlay \n(HGRO) on the City’s Community Development Plan Map. \n1. \nDevelopment or redevelopment. \n2. \nAll land divisions or property line adjustments. \n3. \nRemoving, cutting, mowing, clearing, burning, or application or herbicides to vegetation. \n4. \nChanging topography, grading, excavating, or filling. \n5. \nResource Enhancement. \n6. \nConstruction or expansions of right-of-way improvements. \n7. \nPlacement or stockpiling of woody debris. \n \nB. \nDevelopment within an HGRO in accordance with the provisions of this Overlay shall not result in a \nchange of the HGRO status of such developed areas on a property. In the case of a later development \nrequest seeking to develop within previously undisturbed HGRO on a property where a prior \ndevelopment request was subject to the provisions of this Overlay, the calculation of the maximum \ndisturbance area allowed on the property shall be based on the location of the HGRO (or predecessor) at \nthe time the previous development was approved. \nC. \nFor the purposes of this section “Lots created prior to January 15, 2021” means lots created through an \napplication for tentative land division made prior to January 15, 2021 which did not expire Development \nStandards \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[5.02]-3 \nCity of Gresham Development Code \n \n(06/22) \n \n \n5.0204  Prohibitions \nThe following prohibitions apply within the HGRO. These prohibitions do not apply to the continuation, in the \nsame manner, of activities which were lawfully begun before the effective date of this ordinance, activities \napproved pursuant to the provisions of this Overlay under Section 5.0208-5.0213, or activities which are exempt \nin accordance with Section 5.0205. An activity continuing in the same manner means that there is no expansion \nin the scope of that activity within the HGRO. \nA. \nStockpiling of woody debris is prohibited as follows: \n1. \nOn or within 30 feet of a mapped landslide deposit or associated head and flank scarps (per \ncurrent Department of Geology and Mineral Industries’ SLIDO database); \n2. \nWithin 30 feet of a stream, as measured in horizontal feet from stream centerline; or \n3. \nWithin the Highly Sloped Subarea (HSS). \nB. \nAny new gardens, lawns, structures, or development other than those allowed outright (exempted) or \nthat is part of a regulated use that is approved by an HGRO permit. \nC. \nThe dumping of materials of any kind. \nD. \nGrading, placement of fill, or the removal of native vegetation other than those allowed outright \n(exempted) or that is part of a regulated use that is approved by an HGRO permit. \n \n5.0205  Exempt Uses and Activities \nAn exemption from obtaining a permit under this section does not exempt development from obtaining permits \nrequired by other sections of the code. \nA. \nExemptions for HGRO Areas including HSS. Uses and activities meeting one or more of the \nfollowing descriptions are exempt from the permit requirements of the HGRO standards: \n1. \nA building permit for a phased development project for which the Applicant has previously met \nthe application requirements, as long as the area of new construction was identified on the original \npermit and no new portion of the HGRO will be disturbed \n2. \nOperation, maintenance or repair of existing improvements. \n3. \nAlteration or replacement of existing structures that do not alter building footprint. \n4. \nThe trenchless subsurface installation of utilities (e.g., via boring, jacking, or microtunneling), \nprovided there is no vegetation removal beyond the limits of this section, no earth movement, and \nno impacts to trees (e.g., damage to the root zone). \n5. \nThe planting of trees as designated and identified on the Gresham Native Plant List. \n6. \nThe planting, removal, or maintenance of Street, Parking Lot, or Buffer Trees as defined in \nSection 9.1014. \n7, \nThe planting and maintenance of landscaped areas within an approved permanent disturbance \narea, including tree removal. \n8, \nPruning and maintenance of trees which adheres to ANSI pruning standards. \n9. \nRestoration work including stand management-related removal of no more than 3 trees when \nconducted as part of an annual restoration plan approved by the City. \n10. \nFencing, excluding construction of walls. \nB. \nAdditional Exemptions for HGRO Areas other than Highly Sloped Subarea (HSS). Except within \nthe HSS, the following uses and activities are exempt from the permit requirements of the HGRO \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[5.02]-4 \nCity of Gresham Development Code \n \n(06/22) \n \nstandards provided that in no case shall the activity result in the removal of any non-required trees over \n6 inches DBH (see definition of “Required Tree” in Section 3.0103) outside of a permanent disturbance \narea or leave more than 500 square feet of ground exposed (devoid of stabilizing vegetation) between \nOctober 1 and May 1. \n1. \nOne time excavation or filling of land (including temporary stockpiles) not exceeding 10 cubic \nyards per lot. \n2. \nOne time installation of impervious surface not exceeding 1,000 square-feet per site. \n3. \nConstruction of retaining walls not exceeding 4 feet in height. \n4. \nConstruction of ponds and in ground swimming pools not exceeding 1.5 cubic yards. \n5. \nAny development that does not require a building permit except for development activities which \nexceed one or more of the thresholds in 1 through 4, above. \n6. \nOutdoor bike and pedestrian recreation facilities for public use, limited to accessways, trails, \npicnic areas, or interpretive and educational displays and overlooks that include benches and \noutdoor furniture. \n \n5.0206  Permit Required \nUnless exempt pursuant to Section 5.0205, a Hillside and Geologic Risk Overlay (HGRO) permit is required for \nall regulated activities within the HGRO as specified in Table 5.0206-1. \nTable 5.0206-1 Permit Procedure and Applicable Standards for Development within an HGRO \nProposed Activity or Request \nPermit \nProcedure \nApplicable  \nStandards \nHillside and Geologic Risk Overlay permits review \nconcurrent with land use application except as specified \nbelow \nSame as \nconcurrent \nland use \napplication \nvaries \nProgrammatic Permit \nType II \nSection 5.0208(D) \nAlternate Review \nType II \nSection 5.0212 \nModification of HGRO Standards \nType II/III \nSection 5.0213 \nVerification of a Disturbance Area boundary on a developed \nlot with no concurrent land use application \nType I \nSection 5.0207(E) \nAll other Hillside and Geologic Risk Overlay permits with no \nconcurrent land use application \nType I \nvaries \n \n5.0207  HGRO Application Requirements \nApplications must include the items required for the applicable procedure type in accordance with Article 11, \nother applicable sections of the code, Gresham Environmental Technical Guidance Manual, and the HGRO \napplication submittal requirements as specified in Table 5.0207-1. Applications for Alternative Review must \nalso include the submittal requirements specified in Section 5.0212. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[5.02]-5 \nCity of Gresham Development Code \n \n(06/22) \n \nTable 5.0207-1 HGRO Submittal Requirements \nProposed Development Activity \nSubmittal Requirements in 5.0207 \nTree removal (non-exempt) \n(other than tree removal pursuant to a \nprogrammatic permit submitted in \naccordance with Section 5.0208(D)) \n \n• \nTree Removal / Protection / Revegetation Plan \nand Documentation (Subsection (A)) \n \nTree removal pursuant to a programmatic \npermit in accordance with Section \n5.0208(D) \n• \nTree Removal / Protection / Revegetation Plan \nand Documentation (Subsection (A)) \n• \nCertification and Documentation (Subsection \n(C)) if storage of woody debris exceeds \ndimensions \n• \nAdditional Plans and Narrative  Subsection (D) \nAll other non-exempt development \nactivities (e.g., design review, special use \nreview, building permits, land divisions, \netc.) \n• \nTree Removal / Protection / Revegetation Plan \nand Documentation (Subsection (A)) \n• \nConstruction Management and Preliminary \nGrading Plan (Subsection (B)) \n• \nCertification and Documentation (Subsection \n(C)) \n• \nAdditional Plans and Narrative (Subsection (D)) \nVerification or establishment of a \ndisturbance area boundary on a developed \nlot with no concurrent land use \napplication \n• \nDisturbance Area Boundary Verification \n(Subsection (E)) \n \nA. \nTree Removal, Protection, and Revegetation Plan.  A Tree Removal, Protection, and Revegetation \nPlan that includes, at a minimum, the following: \n1. \nEvidence regarding the credentials of the qualified professional (e.g. certified arborist, \ngeotechnical professional, or landscape architect) who made assessments or prepared the plan. \n2. \nIf Applicant is requesting tree removal on the basis that the tree(s) is on the City of Gresham \nInvasive Plant List, the identity of the species including in-focus, high resolution photographs \nsupporting identification of species such as habitat, trunk, crown, flowers, fruits, branches, twigs, \nand leaves. \n3. \nIf Applicant is requesting tree removal on the basis that the tree(s) meets the definition of \ndangerous tree, an International Society of Arboriculture (ISA) basic tree risk assessment \nprepared by a qualified arborist is required. \n4. \nIf tree replacement is required but cannot be achieved onsite (per Section 5.0208(C)(6)), a \nstatement that the Applicant proposes to make a payment-in-lieu and documentation supporting \nthis request. \n5. \nA tree removal / revegetation map identifying the following: \na. The boundary of the entire project site and the boundary of the HGRO (and HSS, if \napplicable) on the site; \nb. The location on the site where tree removal is proposed; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[5.02]-6 \nCity of Gresham Development Code \n \n(06/22) \n \nc. The species, size, and location of individual trees over 6 inches DBH that are proposed for \nremoval; \nd. All trees 6 inches DBH or greater (numbered) within 50 feet of trees to be removed; \ne. The methods used to protect all other trees over 6 inches DBH on the site; and \nf. \nThe species, size and location of mitigation trees (if proposed). \nB. \nConstruction Management and Preliminary Grading Plan. In addition to any other plan required by \nSection 9.0500, the application shall include a construction management and preliminary grading plan \nthat includes, at a minimum, the following:  \n1. \nLocation of site access and egress that construction equipment will use. \n2. \nEquipment and material staging and stockpile areas. \n3. \nErosion and sediment control measures in accordance with the City of Gresham “Erosion \nPrevention and Sediment Control Manual” appendix of the Gresham Stormwater Management \nManual.  \n4. \nCritical Root Zone of all trees to be preserved within the Disturbance Area and within 50 feet of \nthe Disturbance Area (measured in horizontal distance from the edge of Disturbance Area) and \nlocation and type of tree protection (per Gresham Environmental Technical Guidance Manual). \n5. \nLocation and square footage of all disturbance areas to be cut, filled or cleared, including but not \nlimited to roads, sidewalks, utilities, yards and landscaping, building envelopes or pads (buildable \nareas), driveways, and other accessways. The total square footage shall also be summed and \nexpressed as a percentage of the total area of the parcel. Grading area limitations are described in \nSections 5.0209, 5.0210 and 5.0211. \nC.  \nCertification. A certification form (provided by the City) must be prepared, or reviewed and stamped \nby a Certified Engineering Geologist or Geotechnical Engineer and submitted along with any \ndocumentation and plans relied on in issuing the certification. The purpose of the Certification is to \nensure that development in or adjacent to hillside areas is evaluated by a Certified Engineering \nGeologist or Geotechnical Engineer to ensure it is designed in a manner that provides for public health, \nsafety, and welfare.  \n1.  \nWhere certification is required for a permit, a permit shall only be issued if a Certified \nEngineering Geologist or Geotechnical Engineer affirms and certifies the following based on \ntheir professional opinion. A permit shall not be granted if a Certified Engineering Geologist or \nGeotechnical Engineer does not affirm and certify the following based on their professional \nopinion:  \na.  Potential landslide hazards identified for this site and nearby and the DOGAMI Interpretive \nMap Series 57 (IMS-57) Landslide hazard and risk study of central and western Multnomah \nCounty, Oregon, by William J. Burns, Nancy C. Calhoun, Jon J. Franczyk, Kassandra O. \nLindsey, and Lina Ma, 2018 (Report and Data) have been reviewed;  \nb.  The proposed development activity was reviewed according to industry standards for \ngeologic engineering in Oregon;  \nc.  \nEither:  \ni.  That the proposed development activity will not be negatively impacted by, or cause \nnegative impacts to onsite and offsite engineering geological conditions, processes, and \nhazards, including but not limited to, existing or post development soil stability or any of \nthe following site features: springs or seeps, depth of soil to bedrock, variations in soil \ntypes, or a combination of these conditions; or  \nii.  If proposed development activity will be negatively impacted by, or cause negative \nimpacts to onsite and offsite engineering geological conditions, processes, and hazards, \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[5.02]-7 \nCity of Gresham Development Code \n \n(06/22) \n \nincluding but not limited to, any of the features listed in Subsection (C)(1)(c)(i) above, \nthe plans incorporated the methods for safely mitigating the impact(s).  \nd.  \nWhere applicable, attest to the following certification requirements stated in Subsections \n5.0208(D), 5.0209(A), 5.0209(D), 5.0211(B), 5.0212(B), or 5.0212(C).  \n2.  \nCertification that is submitted pursuant to Subsection (1) shall include the Applicant’s statement \nthat they will develop the site in accordance with the Certified Engineering Geologist’s or \nGeotechnical Engineer’s certification and that they will schedule and perform the recommended \ngeotechnical engineer or certified engineering geologist site inspections.  \n3.  \nIn determining if the Certification satisfies the permit requirements, the City shall review the \nCertification only to determine whether a Certified Engineering Geologist or Geotechnical \nEngineer has affirmed and certified that the proposal meets the above listed requirements. The \nCity shall not substitute its judgement or discretion for the professional judgement of the \nCertified Engineering Geologist or Geotechnical Engineer. \nD. \nAdditional Plans and Narrative. Additional plans and narrative necessary as determined by the City to \ndemonstrate compliance with the applicable standards of the HGRO. \nE. \nDisturbance Area Boundary Verification.  Owners of individual legal lots created and developed with \na single detached dwelling or middle housing prior to January 15, 2021 who wish to establish or verify \nan approved permanent disturbance area boundary on that lot may submit a Disturbance Area Boundary \nVerification request form (provided by the City).  The form shall be accompanied by aerial photography \nor other evidence that predates January 15, 2021 which identifies the location of all areas meeting the \ndefinition of permanent disturbance area.  The date of the evidence must be verifiable by the City. \n \n5.0208  Tree and Vegetation Standards within the Hillside and Geologic Risk Overlay (HGRO) \nTrees and vegetation provide protection against soil erosion and earth movement as well as enhance the \naesthetic value of those hillside areas that may be highly visible to the surrounding community.: \nA. \nTrees and Vegetation Protection. Except as provided in Subsections (1) through (4) below, land \nwithin the HGRO that is outside of a previously approved permanent disturbance area shall be retained \nin a natural state. Lands to be retained in a natural state shall be protected from damage during \nconstruction. Protection methods shall be in accordance with the Gresham Environmental Technical \nGuidance Manual.  All trees within approved Permanent Disturbance Areas are subject to the tree \nremoval and mitigation requirements of Section 9.1000. The following standards apply outside of an \napproved Permanent Disturbance Area: \n1. \nA tree over 6 inches DBH can be removed in the following circumstances if mitigation is \nprovided in accordance with Subsection (B): \na. The tree is identified as a species on Gresham Invasive Plant List by an arborist, \nprofessional wetland scientist, or landscape architect.  Applications must include in-focus, \nhigh resolution photographs supporting identification to species such as habitat, trunk, \ncrown, flowers, fruits, branches, twigs, and leaves; \nb. The tree is found to meet the definition of dangerous tree by a qualified arborist who has \ncompleted a basic tree risk assessment.  The risk assessment shall be included with \napplication. Conversion of a dangerous tree to a snag which involves the removal of part of \nthe tree and retention as a habitat tree may be allowed with the dangerous tree permit; or \nc. The tree is within an approved temporary disturbance area and is less than 24 inches DBH. \n2. \nTrees 6 inches DBH or less and other vegetation may be removed provided that the area is \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[5.02]-8 \nCity of Gresham Development Code \n \n(06/22) \n \nstabilized with vegetation as follows: \na. No more than 500 square feet of ground shall be left exposed between October 1 and May 1 \neach year, and \nb. Disturbed soils shall be stabilized with new native vegetative cover prior to October 1 in \nany given year. \n3. \nTrees shall not be removed before public facility construction plans are approved, building \npermits are issued, or relevant development permits are issued. When removing a tree, other \ntrees on the site shall be protected from damage during construction, and any disturbed soils \nshall be stabilized with new vegetative cover by seeding. Protection methods shall be in \naccordance with the Gresham Environmental Technical Guidance Manual. \n4. \nAll required revegetation shall be installed per Section 5.0208(C). \nB. \nTree Replacement Quantity. The number of replacement trees required for tree removal shall be as \nspecified below.  Replacement trees shall be planted in accordance with Subsection (C).  \n1. Dangerous Tree Removal, including conversion to Habitat Tree (snag). For each dangerous tree \nremoved one replacement tree shall be planted. \n2. Other tree replacement. Each tree removed for reasons other than dangerous tree replacement is \nsubject to the replacement rates in Table 5.0208-1. \nTable 5.0208-1 Tree Replacement  \nDiameter of Removed Tree \n(measured 4.5 feet above \nground) \nNumber of \nreplacement trees \nrequired \n6” up to 24” DBH \n2 trees \nAbove 24” up to 36” DBH \n3 trees \nAbove 36” DBH \n6 trees \n \nC. \n   Replacement Trees and Vegetation \n1. Location. Replacement trees shall be located as follows: \na. Replacement of trees removed from the Highly Sloped Subarea (HSS) shall be located within \nthe HSS. \nb. Replacement of trees removed from the HGRO outside the HSS shall be located within the \nHGRO outside of the Permanent Disturbance Area. \n2. Species. Replacement trees and vegetation shall be as specified in the Gresham Environmental \nTechnical Guidance Manual. \n3. Size. Replacement Trees shall be one gallon, bareroot, plugs, or stakes as specified in the \nGresham Environmental Technical Guidance Manual or at the discretion of the Applicant, as \nspecified by an arborist.   \n4. Timing.  Vegetation and trees required by Subsections (A) and (B) shall be installed prior to \nacceptance of public facilities in the case of land division or approval of a final building \ninspection.  Within the temporary disturbance area ground cover shall be planted before the next \nwet-weather period and trees shall be planted before the end of next wet-weather period (October \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n[5.02]-9 \nCity of Gresham Development Code \n \n(06/22) \n \n15 to March 15) or as otherwise specified in the permit. In the case of dangerous tree removal \nreplacement trees shall be planted during the wet weather season following the removal. \n5. Payment-in-lieu. The cost of payment-in-lieu of on-site tree replacement shall be determined by \nthe City Council based upon the area of canopy loss for the removed trees, less than any canopy \ngain from the new plantings that were installed on site. Payment-in-lieu of replanting is only \nallowed if the City determines: \na. There is insufficient area on the lot to meet the standard tree replacement standards in Section \n5.0208(B); or \nb. Tree replacement or management provided within public open space, public right-of-way or a \nnearby Resource Area will be of greater benefit to area slope stability. \nD. \nProgrammatic Permit. Programmatic Permits may only be obtained by Public Agencies and Utilities \nwith a Gresham franchise license to allow for routine public facility or utility operation, repair and \nreplacement, and/or on-going maintenance or enhancement programs. The purpose of a Programmatic \nPermit is to eliminate the need for individual tree removal permits for ongoing activities within the \nHGRO.  Programmatic permits do not cover tree protection, removal, planting, or mitigation associated \nwith a development permit. \n1. Time Limits. The Manager may approve a Programmatic Permit for a period of up to 2 years. An \nannual report from the Applicant on activity conducted under the permit is required to be submitted \nto the Manager by June 30 each year.  Failure to submit the annual report will result in \ncancellation/suspension of the Programmatic Permit. \n2. Work Standards.  All work conducted under a programmatic permit must be conducted in \naccordance with proper arboricultural practices as detailed in the most recent version of ANSI A300 \nstandards. \n3. Review Factors.  The Manager may approve a Programmatic Permit for work in the HGRO and \nHSS upon finding that the following review factors are met or will be met with conditions, \naccording to the Gresham Environmental Technical Guidance Manual: \na. Biodiversity:  The activities will result in the same or better species diversity within each \nproject area treated under the programmatic permit. \nb. Erosion Control: Activities will be planned to prevent exposed soil areas of greater than 500 \nsquare feet during the wet weather window of October 1 to May 1. \nc. Mitigation of Impacts:  The activities will protect or improve project area conditions as they \nrelate to water quality, critical habitat protection, and forest health. \nd. Risk reduction: \ni. \nIgnition fuel reduction at the private-public property interface shall occur before any \nadditional coarse woody debris (CWD) is placed as part of stand management activities. \nii. CWD shall be placed in a manner not likely to increase wildfire, slope movement, or public \nsafety risks. \niii. Deciduous vegetation will be preferred for retention in defined firebreak areas. \niv. Coniferous vegetation will not be planted in defined firebreak areas. \nv. Suspended branch material is addressed as part of site activities. \nvi. Allowance for amount and location limitations for cut or chipped CWD are observed. \nvii. Snags or habitat tree retention is incorporated into project areas where retention of such \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": " \n[5.02]-10 \nCity of Gresham Development Code \n \n(06/22) \n \nfeatures poses no risk to structures or active use areas. \nviii. Within areas mapped as past landslides according to DOGAMI IMS-57, or mapped as HSS, \na Certified Engineering Geologist or Geotechnical Engineer must certify according to \n5.0207(C) that vegetation removal, with the exception of dangerous tree removal, or \ndeposition of CWD will not increase geologic risk or otherwise cause negative impacts to \nonsite and offsite geologic conditions or processes.   \n4. Application Requirements. The application requirements in Section 5.0207 do not apply.  In \naddition to the requirements for a Type II application, an application for a programmatic permit \nshall include: \na. A narrative description of proposed activities and locations. \nb. A map of the areas in which work will occur, including generalized locations of each type of \nwork. \nc. Sufficient documentation to describe compliance with approval factors above. \n5. Permit Specifications. Approved permits issued by the City shall include the following \nspecifications. The Manager may modify these specifications during the permit period in order to \nrespond to public safety concerns, changes in regulations, or previously unforeseen issues, provided \nthe Applicant is notified in writing and provided an opportunity to appeal the change: \na. Duration of permit. \nb. Geographic area covered by the permit. \nc. Permitted activities and any restrictions on the method, number, type, location or timing of \nactivities. \nd. Procedures and thresholds for informing neighboring residents, businesses and the City of \nupcoming permitted activities. \ne. Monitoring, performance tracking and reporting requirements. The Manager may prescribe \nrules or procedures that specify the manner in which such tracking and reporting occur. \n6. Revocation. The Manager may revoke a Programmatic Permit upon finding the Applicant is not \nadhering to the limitations imposed or is acting beyond the activities permitted by the Programmatic \nPermit. Noncompliance with the Programmatic Permit may also be cause for any other enforcement \naction as stated in Section 5.0216. \n \n5.0209  General Standards for Development within the Hillside and Geologic Risk Overlay \n(HGRO) \nIn addition to other applicable standards in the code, the standards in this section apply to all regulated \ndevelopment within the HGRO. Development within the HGRO is also subject to the applicable standards for \nspecific development types in Section 5.0210. In addition, development within the HSS is subject to the \nstandards in Section 5.0211: \nA. \nGrading, Retaining Wall Design, Footings, Foundations, Changes to Site Drainage, Ponds, Pools, \nand Erosion Control Plans. All grading, retaining wall design, footings, foundations, changes to site \ndrainage, ponds, pools, and erosion control plans for development within the HGRO shall be shown on \nsite plan(s) and be designed by a licensed design professional and must be certified according to \n5.0207(C) to be in accordance with the recommendations and guidelines provided by a Certified \nEngineering Geologist or Geotechnical Engineer. \nB. \nClearing, Cuts, Grading, or Fills. Only land within an approved disturbance area shall be graded, \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": " \n[5.02]-11 \nCity of Gresham Development Code \n \n(06/22) \n \ncleared or otherwise disturbed.  All cuts, grading, or fills shall conform to the International Building \nCode and be consistent with the provisions of this ordinance. Erosion control measures shall conform to \nthe City of Gresham Erosion Prevention and Sediment Control (EPSC) requirements as included in the \nCity of Gresham’s Stormwater Management Manual.  Perimeter protection and protection of bare soils \nare required for ground disturbance exceeding 500 square feet. \nC. \nTrees and Vegetation. Tree and vegetation removal shall comply with the standards in Section 5.0208. \nD. \nSurface and Groundwater Drainage. All facilities for the collection of stormwater runoff for any \ndevelopment in the HGRO shall be required to be constructed on the site and in accordance with Section \n9.0500 and the following requirements: \n1. Stormwater systems which infiltrate shall not be utilized within the HGRO except as provided in \nSubsection 2, below. \n2. A Type II Alternate Review may be approved pursuant to Section 5.0213 if a Certified Engineering \nGeologist or Geotechnical Engineer certifies according to Section 5.0207(C) that geologic \nconditions, processes, and hazards onsite and offsite will not be negatively impacted by the \nproposed infiltration of stormwater on the site. \n \n5.0210  Standards for Specific Development Types within the Hillside and Geologic Risk Overlay \n(HGRO) \nThe addition to the general development standards in Section 5.0209, the standards in this section are applicable \nto specified types of development. \nA. \nSingle detached dwellings and middle housing. The following standards apply to proposed single \ndetached dwellings and middle housing and to additions or alterations of existing single detached \ndwellings and middle housing and related accessory structures on existing legal lots created prior to \nJanuary 15, 2021 unless otherwise exempt under Section 5.0205. \nThe disturbance area allowed within the HGRO shall meet the following standards: \n1. The maximum disturbance area allowed on a lot is determined by subtracting all portions of the lot \noutside the HGRO from 6,000 square feet.  If there is 6,000 square feet of contiguous land with a \nminimum depth and width of at least 40 feet outside of the HGRO, all permanent and temporary \ndisturbance must occur outside the HGRO.  If there is not a contiguous area of 6,000 square feet \nwith a depth and width of at least 40 feet outside the HGRO, encroachment into HGRO shall be \nlimited to the amount of area needed to make up for the deficit. \n2. The disturbance area must be entirely outside the HSS except as provided in Section 5.0212. \n3. Of the 6,000 square feet maximum disturbance area, no more than 4,000 square feet shall be \npermanent disturbance area. \n4. Trees may be removed within the permanent disturbance area.  Only trees less than 24-inch DBH \nmay be removed in the temporary disturbance area. Replacement shall be in accordance with \nSection 5.0208. \n5. Temporary disturbance areas shall be restored to predevelopment grade. \n6. On lots where existing developed areas meeting the definition of permanent disturbance area exceed \nthe standards of this subsection, such areas can be maintained or modified, but may not be \nexpanded. \nB. \nLand Divisions and Lot Line Adjustments.  The following standards apply to all land divisions \n(including Planned Developments) and Lot Line Adjustments. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": " \n[5.02]-12 \nCity of Gresham Development Code \n \n(06/22) \n \n1. No density credit is permitted for portions of the site that are within the HGRO, except through a \nPlanned Development, as provided by Section 6.0300.  \n2. On each proposed developable lot, Applicants shall identify a contiguous permanent disturbance \narea of at least 2,000 square feet with a minimum depth and width of at least 40 feet.  Larger \npermanent and temporary disturbance areas may be shown on a lot, but all disturbance areas shall \nbe included in the calculation of maximum disturbance area in Subsection 3. \n3. No more than 55% of the total HGRO area on the site shall be included within a disturbance area \n(temporary and permanent). The disturbance area identified on each proposed developable lot \nshall be included in the calculation of maximum disturbance area for the land division or Planned \nDevelopment.  In order to meet this requirement, Applicants are encouraged to employ innovative \nsite design techniques such as: \n• \nLimiting grading on building lots only to that area needed for driveways, walkways, \nbuilding pads, and necessary retaining walls; \n• \nLimiting the total area of the site dedicated to roadways and paths while maintaining \nadequate connectivity and providing for adequate emergency access consistent with the \nroadway standards; \n• \nLocating roads and paths on less steeply sloped areas to minimize the width of graded areas \nneeded for roads; \n• \nDesigning and locating structures so that they fit into the contour of the hillside rather than \naltering the hillside to fit the structure; \n• \nUsing retaining structures as an alternative to banks of cuts and fills; \n• \nBuilding designs, which require less grading, such as split-level and stair-stepping \nfoundations and the use of piers; \n• \nPlacing structures as close as possible to the street so as to minimize driveway construction \nin the sloped areas; and \n• \nFocusing development on areas outside the HGRO. \n4. All disturbance areas must be entirely outside the Highly Sloped Subarea (HSS) except as provided \nin Section 5.0212. \n5. Areas outside the permanent disturbance area shall be placed in an easement (public or private) or \ntract. If preservation is proposed to be private, it can be either by tract or as a part of an individual \nlot (with an easement). Public preservation shall be by tract only. Easement types shall be natural \nresource, open space, or public access easements, in accordance with Section 9.0300 provided \nthat the easement ensures that the land within the easement shall be left undisturbed and protected \nfrom construction and post-development impacts.  Acceptance of proposed dedication of open \nspace shall be at the City’s discretion. \nC. \nMultifamily, Commercial, Industrial and Institutional Development.  The following standards apply \nto all Multifamily, Commercial, Industrial, and Institutional development. \n1. \nNo more than 55% of the total HGRO area on the site shall be included within a disturbance area \n(temporary and permanent).  In order to meet this requirement, Applicants are encouraged to \nemploy innovative site design techniques such as: \n• \nLimiting grading to that area needed for driveways, walkways, building pads, minimum \nparking, solid waste collection facilities and necessary retaining walls. \n• \nLimiting the total area of the site dedicated to roadways, paths, and internal driveways \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": " \n[5.02]-13 \nCity of Gresham Development Code \n \n(06/22) \n \nwhile maintaining adequate connectivity and providing for adequate emergency access \nconsistent with the roadway and parking lot standards. \n• \nLocating roads, paths, parking lots, and internal driveways on less steeply sloped areas to \nminimize the width of graded areas needed for roads. \n• \nDesigning and locating structures so that they fit into the contour of the hillside rather than \naltering the hillside to fit the structure. \n• \nUsing retaining structures as an alternative to banks of cuts and fills. \n• \nPlacing structures as close as possible to the street so as to minimize driveway construction \nin the sloped areas. \n• \nFocusing development on areas outside the HGRO.  \n2. All disturbance areas must be entirely outside the Highly Sloped Subarea (HSS) except as provided \nin Section 5.0212. \n \n5.0211  Additional Development Standards for Highly Sloped Subareas (HSS) \nThe HSS is a subarea of the HGRO.  In addition to the general development standards in Section 5.0210 and the \napplicable development standards in Section 5.0211, the standards of this section apply to regulated \ndevelopment within HSS. \nA. \nProhibited Uses. Triplex, Quadplex, Townhouses, and Cottage Clusters are prohibited in HSS. \nB. \nSingle detached and duplexes. The following standards apply to proposed single detached dwellings, \nduplexes, and additions or alterations of existing single detached dwellings, duplexes, and related \naccessory structures located in the HSS either on existing legal lots that were created prior to January \n15, 2021 or which were created through a PD in accordance with Section (B).  The disturbance area \nallowed within the HSS shall meet the following standards.   \n1. The maximum disturbance area (permanent and temporary) allowed within the HSS is determined \nby subtracting all portions of the lot outside the HSS from 2,000 square feet.  If there is an area of \n2,000 contiguous square feet at least 40 feet in width and depth outside of the HSS, all permanent \nand temporary disturbance must occur outside the HSS.  If there is not 2,000 square feet of land \noutside the HSS, encroachment into HSS shall be limited to the amount of area needed to make up \nfor the deficit. \n2. On lots where existing developed areas meeting the definition of permanent disturbance area exceed \nthe standards of this subsection, such areas can be maintained and modified, but may not be \nexpanded. \nC. \nLand Divisions and Lot Line Adjustments. The following standards apply to all land divisions \n(including Planned Developments) and Lot Line Adjustments. \n1. No new lots which include HSS shall be created except through a Planned Development (PD). \n2. The following standards apply to all Planned Developments that include HSS. \na. Permanent disturbance areas may include HSS only when the PD is 10 acres or more in size; \nb. No more than 30 percent of the total HSS on the site may be included within permanent \ndisturbance; and \nc. A Certified Engineering Geologist or Geotechnical Engineer must certify (according to \nSubsection 5.0207(C)) that disturbance area within the HSS are not susceptible to earth \nmovement nor landslide hazard; and the proposed construction and design techniques will \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": " \n[5.02]-14 \nCity of Gresham Development Code \n \n(06/22) \n \nminimize cuts, fills, and potential adverse impacts to existing vegetation and have no adverse \nimpacts to existing drainage ways, water quality, and slope stability. \nD. \nOpen Space Improvements.  Open spaces may be improved with private walking/hiking trails, or with \npublic trails or paths. Public trails or paths shall be limited to public open spaces, and private trails or \npaths shall be limited to private open spaces and conservation easements.   \nE. \nPublic Facilities and Utilities.  Public facilities (including streets) and utilities are not allowed within \nthe Highly Sloped Subarea (HSS) except through the HGRO Alternative Review process as provided in \nSection 5.0212. \nF. \nTechnical Review. When a Geotechnical Report or Impact Evaluation and Alternatives Analysis is \nsubmitted it shall be reviewed by a third-party reviewer. The Manager shall select and consult with a \nGeotechnical Engineer and/or Certified Engineering Geologist to evaluate the methodology, \nconclusions, and recommendations of the Applicant’s submittals regarding site conditions and potential \ngeologic hazards.  The consultant for the City may conduct a site visit prior to submitting an evaluation \nto the City.  The written evaluation and recommendation from the City’s consultant shall include an \nevaluation regarding the following:   \n• \nThe acceptability of the observations, procedure, data, reports, methods, and assumptions relied \nupon; and \n• \nThe support of the conclusions and recommendations by evidence provided. \nIf required, the written evaluation and recommendation from the City’s Consultant shall be received \nprior to a recommendation for a Type III process, or before a decision for a Type II process. Costs for \nsuch consultation shall be paid by the Applicant, in accordance with the City of Gresham’s \nDevelopment Fee Resolution.     \n \n5.0212  Alternate Review \nApplicants who cannot or choose not to comply with the standards of Section 5.0209, 5.0210, or 5.0211, may \napply for Alternative Review in accordance with this Section. \nA. \nApplication Requirements. In addition to the items described in Section 5.0208 (further clarified in the \nGresham Environmental Technical Guidance Manual), the Applicant shall also provide information \ndescribed in Subsections (1) through (3) and any additional information needed to demonstrate \ncompliance with the approval criteria in Subsection B. For utility projects undertaken by public utilities \nacross property that is not owned by the utility, the utility is not required to map or provide any \ninformation about the property except for the area within 100 feet of the location of the proposed \ndisturbance area of the utility’s project. \n1. Impact Evaluation and Alternatives Analysis. An impact evaluation and alternatives analysis is \nrequired to determine compliance with the approval criteria and to evaluate development \nalternatives for a particular property.  At a minimum, the analysis should evaluate three alternatives: \n1) no project, 2) the applicant’s preferred alternative, and 3) a second practicable alternative that \nproposes less development within HGRO and HSS. The impact evaluation shall include all the \nfollowing items: \na. Identification of on- and off-site engineering geological conditions, processes, and hazards. \nb. An explanation of proposed unavoidable impacts to on and offsite engineering geological \nconditions, processes, and hazards. \nc. Evaluation of alternative locations, design modifications, or alternative methods of development \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": " \n[5.02]-15 \nCity of Gresham Development Code \n \n(06/22) \n \nto determine which option best reduces the impacts on the HGRO provided on the property.  \n2. The Impact Evaluation and Alternatives Analysis shall be prepared and signed by a Geotechnical \nEngineer and/or Certified Engineering Geologist and shall meet the current standard of practice. \nB. \nPublic Facilities and Utilities. \n1. When the applicant demonstrates through the alternatives analysis that either (a) and/or (b) below \nwill reduce the amount of HGRO which will be disturbed.  The City may approve an alternate that: \na. Adjusts the “minimum block spacing and maximum block perimeter standards for local queuing \nand transitional street types in Section A5.501 by up to 50 percent. \nb. Adjust the standard street cross section within the HSS to omit the median, parking lane, and \nlandscape strip, or combination thereof. \n2. The City may approve public facilities not meeting the standards of Section 5.0211(E), if it \ndetermines that the street location is necessary to provide street connectivity or for emergency \nvehicle access. Public facilities (including streets) and utilities may be constructed if the following \nis certified according to Section 5.0207(C) by a Certified Engineering Geologist or Geotechnical \nEngineer: \na. That these facilities can be constructed given the geologic and topographic conditions of the \narea of development; and \nb. That these facilities can be constructed in a manner that does not increase the risk of earth \nmovement or erosion. \nC. \nAll other development.  The City may approve an application which does not comply with the clear \nand objective standards of this code if the applicant shows through the Impact Evaluation and \nAlternatives Analysis that the following conditions are met: \n1. The applicant shows that the development has less detrimental impact to the slope than development \nmeeting the standards would. If there is HSS on a property then the Applicant shall first avoid the \nintrusion of development into the HSS, to the extent practicable. \n2. A Certified Engineering Geologist or Geotechnical Engineer certifies according to Section \n5.0207(C) that the proposed alternative (including consideration of any proposed mitigation) will \nnot increase the risk of earth movement or landslide hazard; and the proposed construction and \ndesign techniques will minimize cuts, fills and potential adverse impacts to existing vegetation and \nhave no adverse impacts to existing drainage ways, water quality and slope stability. \nD. \nAdditional disturbance on flat land.  When a land division is proposed which includes a contiguous \narea of HGRO at least an acre in size located on a DOGAMI mapped landslide deposit and which is \ncomprised of slope less than 15%, such area can be exempted from of 5.0210(B)(3).  Such and \napplication is not required to submit the Impact Evaluation and Alternatives Analysis of Section \n5.0212(A) however, it shall be accompanied by: \n1. A slope analysis showing the area with slopes of less than 15%. Areas shall be identified using \nraster analysis of the LiDAR-derived Bare-Earth DEM created as part of the Oregon LiDAR \nConsortium Metro 2014 Project.  The DEM is processed to reflect percent slope rise and then slope \nis averaged for each cell across a 45-foot radius circle.  Cells with an average surrounding slope of \n15% or less are included. \n2. A soils and geology report of sufficient detail to describe the geologic conditions of the parcel and \nimmediate vicinity and evaluate the potential geologic hazards associated with the site and prepared \nby Geotechnical Engineer and/or Certified Engineering Geologist.  The report must meet current \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": " \n[5.02]-16 \nCity of Gresham Development Code \n \n(06/22) \n \nstandard of practice and contain: \n• \nA review of the geologic history and history of prior excavation and fills \n• \nField reconnaissance of the site and its vicinity \n• \nScope of work done, investigative methods, sampling methods, logs of borings or \ntest pits, elevations of borings or test pits for reference of materials and samples to \nfinished grade or footing elevations, and the identification of the elevations \n• \nLocation of all samples taken, surface and subsurface \n• \nGroundwater conditions and potential future natural and artificial seepage effects \n• \n(USCM) Unified Soil Classifications of Materials \n• \nMaterial competency and strength of the existing soils \n• \nPertinent engineering geologic attributes (clayey, weak, loose, alignments, fissility, \nplanar boundaries, pervious or water-bearing parts, susceptibility to mass wasting, \nerosion, piping or compressibility) \n• \nBearing capacity and/or shear strength of sample areas \n• \nConsolidation or settlement potential \n• \nExpansion potential \n \n5.0213  Modification of HGRO Standards \nWhere the compliance with the HGRO would cause unreasonable hardship, applicants may seek a Type II \nMinor Variance or a Type III Major Variance pursuant to Section 10.1500. \n \n5.0214  HGRO Mapping Protocols \nThe boundaries of the Hillside and Geologic Risk Overlay (HGRO) and Highly Sloped Subarea (HSS) are based \non a GIS-supported application of the following mapping protocols. All buffer measurements are based on \nhorizontal distance rather than a slope distance. \nA. \nThe HGRO includes all lands with the following attributes: \n1.  The boundaries of the Hillside and Geologic Risk Overlay (HGRO) and Highly Sloped Subarea \n(HSS) are based on a GIS-supported application of the following mapping protocols. All buffer \nmeasurements are based on horizontal distance rather than a slope distance. \n2. Deep Landslide Hazards – All lands identified in IMS-57 as having high or moderate susceptibility \nto deep landslide hazards. \n3. Shallow Landslide Hazards – Prioritized concentrations of lands identified an IMS-57 raster dataset \nas having high susceptibility to shallow landslide hazards. Prioritized concentrations were \ndetermined using further mapping protocols as follows: \na. Edit the hazard raster to remove the following lands: \ni. Lands with prioritized hazard areas that represent temporary slope features that are not \nlonger present, such as stockpiles that have been removed. \nii. Areas of hazard inaccurately identified due to underlying LiDAR-derived Bare-Earth \nDigital Elevation Model (DEM) (created as part of the 2014 Oregon LiDAR Consortium \nMetro 2014 Project) data quality issues, such as uncommonly low spots or “pits” caused by \natmospheric interference. Acceptable quality levels are established by the 2014 Oregon \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 17,
      "text": " \n[5.02]-17 \nCity of Gresham Development Code \n \n(06/22) \n \nLiDAR Consortium Metro 2014 Project. \niii. Existing stormwater ponds unless in, or within 100 feet of, the HSS. \niv. Concentrations of hazards on lands with an average slope less than 15%, except within 200 \nfeet of a mapped stream.  Average slope is calculated across a 120-foot radius circle for \neach slope raster cell (using Focal Statistics). \nb. Perform raster analysis to prioritize resultant hazard data where at least 1/3 of surrounding cells \nwithin a 45-foot radius circle were also designated as high risk (using Focal Statistics). \nc. Remove lands with prioritized hazard areas less than 6,000 square feet in area when located \nmore than 200 feet away from a mapped stream. \nd. Buffer resultant prioritized concentrations by 30 feet. \n4. Butte tops – All lands 700 feet above sea level or higher. \n5. Gaps – Resultant gaps of less than 55,000 square feet after combining the above lands. \n6. Excluded areas – The following lands were excluded: \na. Lands regulated by DOGAMI for surface mining. \nb. Lands north of Glisan Street \nB. \nHighly Sloped Subarea (HSS) includes all lands within the Hillside and Geologic Risk Overlay with \nthe following attributes: \n1. Lands with concentrations of slopes of 35% or greater. Concentrations are identified using raster \nanalysis of the LiDAR-derived Bare-Earth DEM created as part of the Oregon LiDAR Consortium \nMetro 2014 Project.  The DEM is processed into percent slope rise and then slope is averaged for \neach cell across the surrounding cells within a 45-foot radius circle. Cells with an average \nsurrounding slope of 35% or greater are included. Prior to analysis, the DEM is edited to remove the \nfollowing lands: \na. Lands that represent temporary slope features that are no longer present. \nb. Areas with underlying DEM data quality issues. \n2. Lands within 5 feet of areas identified in accordance with Subsection (1). \n \n5.0215  HGRO Map Administration and Correction \nA. \nMap Administration. The City shall incorporate all map updates associated with development permit \napplications and corrections to the location of the HSS and HGRO as necessary.  This shall be processed \nunder a Type I procedure and is not considered a comprehensive plan map amendment.  \nB. \nMap Corrections. All Applicants who believe that the HGRO and/or HSS was mapped based upon \nincorrect data may file a verification request consistent with this Subsection, and as described in the \nGresham Environmental Technical Guidance Manual. Verification requests will be processed under the \nType I development permit procedure. \n1. HGRO Boundary. Applicants may request a site-specific correction of the HGRO boundary and the \nCity shall incorporate such corrections to the HGRO using the protocols in 5.0214 with \nmodifications to the input data allowed under the following scenarios: \na. DEM Data Issues: Data issues with the Oregon LiDAR Consortium Metro 2014 Project Bare-\nEarth DEM used in the creation of DOGAMI IMS-57 Shallow Landslide Susceptibility Hazard \nraster may be addressed where provided for here. Such issues must be delineated to within 3 \nfeet of the data issue(s) and submitted as an ESRI Shapefile (polygon) accompanied by two \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 18,
      "text": " \n[5.02]-18 \nCity of Gresham Development Code \n \n(06/22) \n \nmaps and a narrative. The narrative must describe the data errors in detail and methods for \nmapping them. The two maps must delineate the data issues at a scale of no less than 1 inch to \n100 feet. One map must show the data issue(s), current HGRO boundary, and the Oregon \nLiDAR Consortium Metro 2014 Project Bare-Earth DEM. A second map must show the data \nissue(s), current HGRO boundary, and the DOGAMI IMS-57 Shallow Landslide Susceptibility \nHigh hazard data.  The following DEM Data Issues may be addressed: \ni. Temporary Slope Features. Lands with prioritized hazard areas that represent temporary \nslope features that are no longer present, such as stockpiles that have been removed, may be \nextracted from the Shallow Landslide Hazard dataset. \nii. DEM Data Quality Issues: Areas of hazard inaccurately identified due to underlying \nLiDAR-derived Bare-Earth Digital Elevation Model (DEM) data quality issues related to \nstructures may be extracted from the Shallow Landslide Hazard Dataset. Acceptable data \nquality issues are those defined in the “Oregon LiDAR Consortium Metro 2014 Lidar \nProject Quality Control Report – November 30, 2016” and which are related to structures. \nThe data issue narrative must identify the specific data quality issue(s) for each polygon \nsubmitted. \nb. Mapped Stream Changes: Mapped stream changes incorporated through Section 5.0715(C) \n(NRO Map Corrections). \nc. Newly mapped landslide(s): Newly mapped landslide deposit(s) and scarp flank(s) which have \nbeen mapped by a Registered Geologist or Certified Engineering Geologist. \n2. HSS Boundary. Applicants may request a site-specific correction of the HSS boundary by providing \non-site slope survey data, new HSS boundary, and an HSS analysis map prepared in accordance \nwith the following: \na. On-site survey data: A survey shall be submitted of the natural/existing topography for the site \nof the proposed area of correction and a 50-foot buffer around it, stamped by a registered Civil \nEngineer or licensed Land Surveyor. If access in the 50-foot buffer cannot be acquired, data \nfrom the Oregon LiDAR Consortium Metro 2014 Project Bare-Earth DEM may be substituted. \nSurvey data must be provided as bare-earth DEM raster as well as a percent slope raster \ncalculated using the bare-earth DEM. Survey data must meet or exceed standards set in “Oregon \nLiDAR Consortium Metro 2014 Lidar Project Quality Control Report – November 30, 2016” \nincluding an absolute vertical error of less than 0.20 meters. \nb. New HSS boundary data: The new slope raster must be processed according to the mapping \nprotocol in Section 5.0214(B) and provided as a raster dataset. \nc. HSS analysis map: A map shall be provided having a scale of not less than 1 inch to 100 feet \nand a contour interval of not more than 10 feet with two-foot intermediates. The map shall also \nindicate the datum, source, and scale of topographic data used in the slope analysis and shall \nattest to the fact that the slope analysis has been accurately calculated. The map shall clearly \ndelineate/identify the slopes of 35% or greater and new HSS boundary. The map shall be \nprepared using CAD-based, GIS-based, or other type of software specifically designed for such \npurpose. \nd. Raster data requirements: Raster datasets must be provided as outlined in the Gresham \nEnvironmental Technical Guidance Manual. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 19,
      "text": " \n[5.02]-19 \nCity of Gresham Development Code \n \n(06/22) \n \n5.0216  Violations \nA. \nActions that violate the HGRO regulations are subject to the abatement and penalty provisions of \nSection 2.0008 of the Gresham Community Development Code. The following activities shall be \nconsidered immediate hazards: \n1. Unpermitted work in the HSS; \n2. Dumping; \n3. Depositing any material on public property; \n4. Bare earth over 500 square feet during the wet weather period of October 1 to May 1; and \n5. Other situations as determined by the Manager. \nB. \nUnpermitted alterations will not be deemed valid buildable/developable area. \nC. \nFor correcting violations regarding unauthorized activity, the responsible party must submit and ensure \nimplementation of a remediation plan that meets all applicable standards of the HGRO. The plan must \nbe developed by an Oregon licensed Certified Engineering Geologist or Geotechnical Engineer. \nD. \nFor correcting violations regarding unauthorized activity, the responsible party shall submit an \napplication that meets all applicable standards of the HGRO including appropriate mitigation if \napplicable.   \nE. \nThe plan must be developed by an Oregon licensed Certified Engineering Geologist or Geotechnical \nEngineer. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.790408",
  "extractor_version": "1.0.0"
}