{
  "metadata": {
    "filename": "dc-section-6.0100.pdf_id7851",
    "extracted_at": "2025-05-22T06:15:23.015312",
    "num_pages": 1,
    "title": "DC Section 6.0100",
    "author": "Sarale Hickson",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220615154534-07'00'",
    "modification_date": "D:20220615154552-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "Section 6.0100 Lot Line Adjustments and Lot Consolidations (8/2010) \nPage 6.01-1 \nSection 6.0100 Lot Line Adjustments and Lot Consolidations \nTABLE OF CONTENTS \nGeneral \n6.0101 Lot Line Adjustments and Lot Consolidations \n6.0111 Lot Line Adjustment - Final Survey Map  \n6.0112 Lot Consolidations  \nGENERAL \n6.0101 LOT LINE ADJUSTMENTS AND LOT CONSOLIDATIONS \nA. A. Lot line adjustments and lot consolidations shall be processed under the Type I procedure and shall be \napproved by the Manager provided that the adjusted lots comply with the applicable requirements of the \nCommunity Development Code with the exception of Sections 5.0100, 5.0210, 5.0300, 5.0400, 5.0500, \n9.0100, and 9.0500 and Appendix 5.000 - Public Facilities Standards.  If the lot line adjustment application \nis processed with another development application, all the applicable requirements of the Community \nDevelopment Code shall apply. \nB. B. Approval of a lot line adjustment or lot consolidation may be conditioned to require the abandonment \nof existing utility facilities if the resulting property line configuration renders them unusable or redundant. \nC. C. Approval of a lot line adjustment or lot consolidation may be conditioned to require any necessary \neasements described in Section 9.0300 Easements. \n6.0111 LOT LINE ADJUSTMENT - FINAL SURVEY MAP \nThe applicant shall submit three paper copies of the final survey map and adjusted legal descriptions. \nAdditional copies may be required if deemed necessary. The final map shall comply with the approved \npreliminary plan and shall comply with the applicable requirements of ORS Chapters 92 and 209. The approved \nfinal map, along with the deeds transferring ownership, must be recorded with Multnomah County Deed \nRecords. \n6.0112 LOT CONSOLIDATIONS \nUpon approval of a Type I lot consolidation by the Manager, and upon demonstrating compliance with \napproval conditions: \nA. For the consolidation of lots or parcels of a recorded plat, the lot consolidation shall be finalized by a replat \nof the subdivision or partition. \nB. The County Assessor may consolidate parcels or tracts of land that are not within a recorded plat.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:23.015404",
  "extractor_version": "1.0.0"
}