{
  "metadata": {
    "filename": "dc-section-8.0100.pdf_id7861",
    "extracted_at": "2025-05-22T06:15:21.438427",
    "num_pages": 14,
    "title": "DC Section 8.0100",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.58",
    "creation_date": "D:20230105100708-08'00'",
    "modification_date": "D:20230105100726-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[8.01]-1 \nCity of Gresham Development Code \n \n(01/23) \n \nARTICLE 8   SPECIAL USES \nSECTION 8.0100  SPECIAL USE REVIEW \nGeneral \n8.0101  Purpose   \n8.0102  Applicability \n8.0103  General Standards \n8.0110  Special Use Review, Type II Procedure \n8.0111  Purpose and Review   \n8.0112  Applicability of the Type II Procedure   \n8.0114  Elderly Housing \n8.0115  Civic Uses \n8.0116  Community Services \n8.0117  Parks, Open Spaces, and Trails \n8.0118  Religious Institutions \n8.0119  Schools \n8.0120  Heliports \n8.0121  Major Basic Utilities \n8.0122  Wireless Communications Facilities  \n8.0123  Solar Energy Systems  \n8.0124  Wind Energy Systems  \n8.0125  Biomass Energy Systems  \n8.0126  Geothermal Energy Systems  \n8.0140  Special Use Review, Type III Procedure \n8.0141  Purpose   \n8.0142  Applicability of the Type III Procedure \n8.0143  Criteria \n8.0144  Major Event Entertainment \n8.0145  Waste Management \n8.0146  Medical Uses \n8.0147  Parks, Open Spaces, and Trails \n8.0148  Religious Institutions \n8.0149  Schools \n8.0150  Basic Utilities \n8.0151  Wireless Communication Facilities in the GBSV District \n8.0160  Modifications of a Special Use   \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[8.01]-2 \nCity of Gresham Development Code \n \n(01/23) \n \nSpecial Use Review, Generally \n8.0101  Purpose  \nThe purpose of the Special Use Review section is to provide a method for evaluating uses that may be \ncompatible in an underlying land use district, provide beneficial services, and serve important public interests, \nbut require case-by-case review because of their size, operation, uniqueness, impact, or other characteristic. \nThese uses are subject to the regulations in this section because they may, but do not necessarily, result in \nsignificant impacts upon the surrounding area, neighborhood, environment, or public facilities. This section \nprovides the procedures under which uses subject to the Special Use Review process may be permitted, \nmodified, enlarged or intensified. \n \nSpecial use reviews are reviewed through a Type II or Type III procedure.  Those uses that have a broader \npublic interest or impact are reviewed through the Type III procedure.  Both review procedures provide an \nopportunity to allow the use when there are minimal impacts, to allow the use but impose mitigation measures to \naddress identified concerns, or to deny the use if concerns cannot be resolved. \n \nApproval of a Special Use Review shall not constitute a change in the land use district and shall be granted only \nfor the specific use approved at the specific site. Approval is subject to such modifications, conditions, and \nrestrictions as may be deemed appropriate by the review authority. \n8.0102  Applicability   \nUses that require a Special Use Review and are subject to the regulations of this section are stated in the use \ntables in Article 4 that apply to the site, or in the Land Use Classification System found in Section 3.0200. This \nincludes the permitting of a new use subject to this section and the modification, enlargement, or intensification \nof an existing use subject to this section. Section 8.0112 highlights uses subject to the Type II procedure. \nSection 8.0142 highlights uses subject to the Type III procedure.  \n \nOver time, Development Code regulations applicable to a specific site may change. This may be a result of \nchanges to the content of the regulations for a specific district or from a change to the Community Plan Map. \nAfter one of these changes, if an existing use was allowed outright, approved through the Community Service \nUse or Special Use Review, or was a nonconforming use and is now subject to the Special Use Review, the use \nis considered de facto approved and may continue to operate. Any modifications to the use are subject to the \nprocedures in this section, and shall be reviewed through the Type II procedure. \n \nWhen a proposed use is located on a site that is in more than one land use district, and the proposed use is \nsubject to a Special Use Review in one district and an allowed or limited use in the other, the proposal shall be \nsubject to Special Use Review. \n8.0103  General Standards  \nAn applicant for a Special Use Review shall provide a narrative that describes how the proposed use fulfills the \napplicable requirements and standards for the use and for those found in Article 7, Section 8.0100, the \napplicable plan district(s) for the site, and other applicable Code sections.  In order to minimize adverse impacts \nof the proposed use, an approval of a Special Use Review may be conditioned based upon information provided \nin the narrative and staff findings. \nFor purposes of the Special Use Review, the narrative shall describe the following, as applicable: \n1. The proposed use and its operations; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[8.01]-3 \nCity of Gresham Development Code \n \n(01/23) \n \n2. Traffic generation; \n3. Location of parking and loading, including size, location, screening, drainage, landscaping, and \nsurfacing; \n4. Any effects on off-site parking; \n5. Street access points, including size, number, location and/or design; \n6. Hours of operation, including when certain activities are proposed to occur; \n7. Crime prevention measures; \n8. Noxious odors; \n9. Lighting; \n10. Effects on air and water quality; \n11. Environmental effects which may disturb neighboring property owners such as: \na. Glare. This may be described in terms of location, design, intensity and shielding; \nb. Noise; \nc. Dust; and \nd. Vibration; \n12. Height, size, setback, and location of buildings and activities;  \n13. Any diking, berms, screening or landscaping, and standards for their installation and maintenance; and \n14. Other resources. This description shall include information on protection and preservation of existing \ntrees, vegetation, water resources, habitat areas, drainage areas, historic resources, cultural resources, \nsensitive lands, or other significant natural resource. \n8.0110 Special Use Review, Type II Procedure \n8.0111  Purpose and Review \nA Type II procedure may be used to review certain uses subject to a Special Use Review. The review provides \nan opportunity to allow a use when there are minimal impacts, to allow the use but impose mitigation measures \nto address identified concerns, or to deny the use if the concerns cannot be resolved.   \n \nThis review considers general standards found in Section 8.0103, standards specific to the use found in Sections \n8.0114-8.0122 and other Development Code standards which are applicable to the proposal.  The criteria and \nstandards set forth in this section apply only when the particular use is subject to a Special Use Review in the \nunderlying land use district.  The narrative for Special Use Reviews through the Type II procedure shall describe \nhow the operating and physical characteristics of the proposal have been made reasonably compatible with and \nhave a minimal impact on livability, appropriate use, and development of properties in the surrounding area of \nthe subject site. \n8.0112  Applicability of the Type II Procedure  \nThe following uses may pursue a Special Use Review through the Type II procedure when they are specified as \nbeing subject to a Special Use Review in Article 4 or in the Land Use Classification System found in Section \n3.0200. \nA. Multifamily, limited to transitional housing for individuals transitioning from incarceration facilities, \nwhich does not qualify as affordable housing under Section 10.1700. \nB. Elderly Housing (Section 8.0114) \nC. Daycare Facilities \nD. Civic Uses, limited to police stations, fire stations, and other similar emergency service facilities \n(Section 8.0115) \nE. Community Services (Section 8.0116) \nF. Parks, Open Spaces, Trails and Paths, limited to public neighborhood parks; public urban plazas; and \npublic trails and paths and associated trail access points (Section 8.0117) \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[8.01]-4 \nCity of Gresham Development Code \n \n(01/23) \n \nG. Religious Institutions, limited to those where the principal place of assembly may accommodate no \nmore than 300 individuals (Section 8.0118) \nH. Schools, limited to elementary and middle schools (Section 8.0119) \nI. Heliport Facilities (Section 8.0120) \nJ. Major Basic Utilities, excluding electrical generating facilities (Section 8.0121) \nK. Wireless Communication Facilities (Section 8.0122) \nL. Renewable Energy Systems including: \n• \nSolar Energy Systems (Section 8.0123) \n• \nWind Energy Systems (Section 8.0124) \n• \nBiomass Energy Systems (Section 8.0125) \n• \nGeothermal Energy Systems (Section 8.0126) \n8.0114  Elderly Housing   \nIn addition to the standards in Section 8.0103, the following apply to elderly housing where it is allowed \nthrough the Type II Special Use Review procedure: \nA. \nElderly housing shall meet at least one of the following standards: \n1. Be located in the Station Center District; or \n2. Be located in the Downtown Plan District; or \n3. Be located in the Rockwood Town Center District; or \n4. Be located in the Civic Neighborhood Plan District; or \n5. Be located in the Townhouse Residential – Springwater District; or \n6. Have frontage on a Transit Street or a Transit Route;* or \n7. Be within 1,000 feet walking distance of a transit facility and have direct access to a street with a \nfunctional classification of minor arterial or greater. For the purposes of this section, a transit \nfacility includes a light rail transit station, a park and ride lot for transit riders, a transit center, or a \ntransit stop and their transit improvements, including a bus stop. \n \n*The following properties zoned MDR-12, MDR-24 and OFR meet the transit street or transit route \nstandard: \n• \nThose fronting Palmquist between Regner Road and Hogan Drive \n• \nThose within the borders of Hogan Drive, Palmquist, Powell and Mt. Hood Highway \n• \nThose fronting Hogan Drive/Road \n• \nThose fronting Cleveland Avenue between Burnside and Stark \n• \nThe MDR-12 lots fronting NE 185th Place north of Glisan Street \nB. \nElderly housing shall meet the minimum density, if any, of the underlying land use district and shall not \nexceed a maximum of 62 living units per acre in all other land use districts or the maximum allowed in \nthe land use district, whichever is greater. \n8.0115  Civic Uses   \nIn addition to the standards in Section 8.0103, the following apply to Civic Uses located in a residentially \ndesignated land use district and allowed through the Type II Special Use Review procedure: \nA. \nCivic uses shall have direct access to a street with a functional classification of minor arterial or greater. \n8.0116  Community Services   \nIn addition to the standards in Section 8.0103, the following apply to Community Services where they are \nallowed through the Type II Special Use Review procedure: \nA. \nCemeteries are exempt from floor area ratio and maximum setback requirements.  \nB. \nNew cemeteries are prohibited in the GBSV District. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[8.01]-5 \nCity of Gresham Development Code \n \n(01/23) \n \n8.0117  Parks, Open Spaces, and Trails   \nIn addition to the standards in Section 8.0103, the following apply to Parks, Open Spaces, and Trails, limited to \npublic neighborhood parks; public urban plazas; and public trails and paths and associated trail access points and \ntrailheads where they are allowed through the Type II Special Use Review procedure: \nA. \nExemptions. \n1. Open spaces are exempt from a Special Use Review. \n2. Those public trails and paths that pursuant to Section 11.0102(E)(1) do not require a Development \nPermit are exempt from the standards of this section. \nB. \nAll Parks, Open Spaces and Trails and Path uses are exempt from floor area ratio and maximum setback \nrequirements. \nC. \nFor Paths, Trails, Access Points and Trailheads: \n1. The applicant shall provide a narrative and plans that demonstrate the consistency of the proposal \nwith applicable district requirements and applicable provisions of the current Paths and Recreation \nTrails and Natural Areas Master Plan and the Public Works Standards. \n2. If the application includes a surface parking lot it shall be consistent with Section 9.0823 and any \napplicable district parking requirements, except that the applicant may prepare an alternative \nlandscaping plan and specifications which meets the intent of the requirement in Section \n9.0823(C)(1), (2) and (3). \n3. The Buffering and Screening Requirements of Section 9.0100 shall apply except in the following \nsituations:  \na. Where the proposed paths or trail development is more than 30 feet from an abutting property \nline; or  \nb. Where the abutting property is an open space parcel; or  \nc. Where the proposed paths or trail development abuts a street right-of-way.  \n4. When buffering and screening is required, an alternative buffering and screening plan may be \nsubmitted for approval. Such alternative plan shall be designed to afford the degree of desired \nbuffering. \n5. The application is exempt from the Site Design Criteria and Standards in Articles 4 and 7 relevant \nto: landscaping, energy conservation, loading, lighting, mechanical equipment screening and transit \ndesign. \n8.0118  Religious Institutions   \nIn addition to the standards in Section 8.0103, the following apply to Religious Institutions where they are \nallowed through the Type II Special Use Review procedure: \nA. \nThe principal place of assembly has seating for no more than 300 persons. Those religious institutions \nthat do not meet this standard shall be reviewed through the Type III procedure. \nB. \nStreet access: Proposed religious institutions shall have direct access to a street with a functional \nclassification of minor arterial or greater. \nC. \nReligious institutions where the principal place of assembly has seating for no more than 100 persons \nare exempt from a Special Use Review. \n8.0119 Schools \nIn addition to the standards in Section 8.0103, the following apply to Schools, including elementary and middle \nschools, where they are allowed through the Type II Special Use Review procedure: \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[8.01]-6 \nCity of Gresham Development Code \n \n(01/23) \n \nA. \nFor all school types, portable classrooms are exempt from floor area ratio, maximum setback \nrequirements, and are not subject to a Special Use Review.  They must still obtain a building permit. \nB. \nElementary and middle schools are prohibited in the GBSV District. \n8.0120 Heliports \nIn addition to the standards in Section 8.0103, the following apply to Heliports where they are allowed through \nthe Type II Special Use Review procedure: \nA. \nHelicopter landing facilities are exempt from floor area ratio and maximum setback requirements. \nB. \nThe applicant shall provide an acoustical and mitigation plan report that details the design and measures \nto be taken which will minimize noise impacts to noise sensitive units as defined in Article 7.20. Noise \nControl Code of the Gresham Revised Code. The report, at a minimum, shall discuss and make \nrecommendations for: \n1. \nBest management practices concerning preferred approach/departure flight paths;  \n2. \nPreferred approach/departure path slopes;  \n3. \nPreferred approach/departure air speeds;  \n4. \nPreferred times of use;  \n5. \nNearby existing natural flight corridors such as freeways and industrial areas that the helicopter \nlanding facility may utilize; and  \n6. \nOther relevant factors.  \n \nThe plan must include a discussion of the existing physical factors, such as topography and proposed \nphysical barriers such as walls, fences, structures or vegetation, and how these factors would be used to \nreduce noise impacts. The report shall be prepared by a professional consultant experienced in airport \nnoise evaluation and federal and state airport noise standards. \n \nThe report shall include the proposed hours of operation; the number, type and size of aircraft to be \nlocated at or expected to use the site; maximum number of helicopter trips on a daily, weekly and \nannual basis, and the purpose of the helicopter trips and an approach/departure flight path plan showing \nproposed flight path locations, widths, lengths and slopes. \nC. \nThe applicant shall demonstrate that an application has been made to the Oregon Department of \nTransportation, Aeronautics Section, by submitting a copy of the helicopter application made to OAD \nwhich identifies the following: direction, angles, and number of approaches; helipad size and surface; \nnearby obstructions; lighting and markings; tie-downs; number of trips; location; and fencing. \nD. \nMinor or emergency repairs and routine maintenance are allowed in all districts.  \nE. \nAll storage and repair shall be conducted in enclosed buildings. \nF. \nAll take-off, landing, and parking areas shall be surfaced with a dust proof and gravel free material. \nG. \nSetbacks. A setback distance of 200 feet shall be required for landing and take-off pads and refueling \nfacilities from abutting Residential Development Districts, Mixed-Use Development Districts and NC \nDistrict property lines. A setback distance of 50 feet shall be required for landing and take-off areas and \nrefueling facilities from all other abutting property lines. All setback distances will be measured from \nthe edge of the landing pad. This provision does not apply to landing and take-off pads located on top of \na building. Other site improvements shall be consistent with the applicable setback yard provisions of \nthe underlying district. \nH. \nBuffer and Screening. A 20-foot wide landscaped buffer and screening area shall be provided around the \nlanding and take-off pads and refueling facilities. Landscape plantings shall be consistent with the \nvegetative requirements of the 'C' buffer of Section 9.0100. This requirement is in addition to any \nbuffering and screening required by Section 9.0100 of the Community Development Code. The trees \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[8.01]-7 \nCity of Gresham Development Code \n \n(01/23) \n \nmust be located so as to not encroach into an 8 (horizontal) to 1 (vertical) flight path from the landing \npad in all directions. This provision does not apply to a helicopter landing facility on top of a building. \nI. \nPrior to occupancy of an approved helicopter landing facility, the applicant must submit a copy of the \nOregon Department of Transportation Aeronautics Section heliport application approval. \n8.0121 Major Basic Utilities \nIn addition to the standards in Section 8.0103, the following apply to major basic utilities where they are \nallowed through the Type II Special Use Review procedure: \nA. \nBasic utilities are exempt from floor area ratio and maximum setback requirements. \nB. \nElectrical generating facilities are subject to a Type III Special Use Review procedure. \nC. \nSewage treatment plants shall not be located in or adjacent to residentially designated land. \nD. \nTelephone switching stations,* new water storage reservoirs, major stormwater treatment facilities and \nsubstations are prohibited in the GBSV District.  \n*(Note: This is current code language that may be outdated. A more appropriate term may be \nTelecommunications Facilities.) \nE. \nIn the GBSV District, existing water storage facilities may be replaced when reviewed under the Type II \nSpecial Use Review process if the proposed height of the facility is no greater than the maximum height \nof the underlying land use district. If the proposed height exceeds the maximum height of the underlying \nland use district, a request for a Type III Variance to height must also be submitted as part of the \napplication. \n8.0122 Wireless Communications Facilities  \nIn addition to the standards in Section 8.0103, the following apply to new or replacement wireless \ncommunications facilities where allowed through the Type II Special Use Review procedure and the Type III \nSpecial Use Review procedure when located in the GBSV District.  \nA. \nAn applicant for a wireless communication facility that includes a WCF tower must demonstrate that the \nproposed facility cannot be feasibly co-located on an existing WCF tower in the service area, in which \ncase the new WCF tower shall be located at the same site as an existing WCF tower or located no closer \nthan 2,000 linear feet from another existing WCF tower.  \nB. \nNo wireless communication facility tower shall be located within the LDR-5, LDR-7, TLDR, TR, DRL-\n1, DLR-2, LDR-PV, MDR-PV, HDR-PV, VLDR-SW, LDR-SW, THR-SW and LDR/GB districts \nunless such location is absolutely necessary to close a significant gap in coverage and there is no \nfeasible alternative.  \nC. \nFor all wireless communication facility proposals that include a WCF tower subject to the Gresham \nCommunity Development Code, the WCF tower shall be located at least 200 feet from the nearest \nresidence and must be constructed to allow co-location of additional antenna facilities.  \nD. \nWireless communications facilities are exempt from floor area ratio and maximum setback \nrequirements. \n \nE. \n1.    All wireless communication facility proposals for personal wireless services shall be subject to the \nrequirements and limitations of 47 U.S.C. 332(c)(7), Preservation of Local Zoning Authority, and \nthe rules adopted by the Federal Communications Commission to implement said section. \n2.   All wireless communication facility proposals shall be subject to the requirements and limitations of \n47 U.S.C. 1455(a), Facility Modifications, and the rules adopted by the Federal Communications \nCommission to implement said section.    \n3.   In the event of any apparent conflict or inconsistency between the applicable federal laws or rules \nand Section 8.0103, Section 8.0122, Section 10.0601 or Section 10.0602, the applicability, and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[8.01]-8 \nCity of Gresham Development Code \n \n(01/23) \n \nwhere required, the application of the provisions of federal laws and rules shall be determined as \npart of the Special Use Review process. \nF. \nWireless Communications Facilities in the GBSV District are governed by the standards in Section \n8.0151. \nG. \nMini-Micro WCFs subject to the regulations of the Gresham Community Development Code are \nexempted from the Special Use Review process and are reviewed through the building permit process if \nthey can meet the following standards: \n1. The Mini-Micro WCF shall be located on a rooftop, or if on the side of a building, at least 15 \nfeet above the ground. \n2. The Mini-Micro WCF shall be no more than three cubic feet in size. \n3. The Mini-Micro WCF must be of a color that blends into the structure upon which it is attached. \n4. No signage is allowed, except for signs with standard public safety warnings, contact \ninformation or similar signage, or unless signage is required by the Federal Communications \nCommission (FCC) or other regulatory body with authority to regulate wireless communication \nfacilities. \n8.0123 Solar Energy Systems  \nIn addition to the standards in Section 8.0103, the following apply to solar energy systems where they are \nallowed through the Type II Special Use Review procedure: \nA. \nRenewable energy systems shall not be located on prominent building façade sections or on any facades \nor roof visible from the street of any listed landmark in Table 5.0324 Historic and Cultural Landmarks \nList, and shall comply with Section 5.0330.  \nB. \nHistoric materials and architectural features shall not be removed or damaged with the installation of \nrenewable energy systems per Section 5.0330.  \nC. \nVisual Impact:  In order to determine a potential adverse visual impact, the following shall be \nconsidered: \n1. \nThe extent to which the system is visible from the impacted location; \n2. \nThe type, number, height and proximity of existing structures;  \n3. \nThe amount of vegetated screening;  \n4. \nThe distance of the proposed system from the impacted location; and  \n5. \nThe available reasonable alternatives that would allow the facility to function efficiently at an \nalternate location.  \n8.0124 Wind Energy Systems  \nIn addition to the standards in Section 8.0103, the following apply to wind energy systems where they are \nallowed through the Type II Special Use Review procedure: \nA. \nRenewable energy systems shall not be located on prominent building façade sections or on any facades \nor roof visible from the street of any listed landmark in Table 5.0324 Historic and Cultural Landmarks \nList, and shall comply with Section 5.0330.  \nB. \nHistoric materials and architectural features shall not be removed or damaged with the installation of \nrenewable energy systems per Section 5.0330.  \nC. \nLandscape screening shall be located outside of any fencing surrounding the renewable energy systems \nor equipment requiring the shrub materials of a Type B buffer per Section 9.0111(A).  \nD. \nAll wind energy system equipment shall be coated in a neutral color or muted tones to minimize the \nvisual impact from the right-of-way, any public park or open space, or historic or cultural resource.  \nE. \nVisual Impact:  In order to determine a potential adverse visual impact, the following shall be \nconsidered: \n1. \nThe extent to which the system is visible from the impacted location; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n[8.01]-9 \nCity of Gresham Development Code \n \n(01/23) \n \n2. \nThe type, number, height and proximity of existing structures;  \n3. \nThe amount of vegetated screening;  \n4. \nThe distance of the proposed system from the impacted location; and  \n5. \nThe available reasonable alternatives that would allow the facility to function efficiently at an \nalternate location.  \n8.0125 Biomass Energy Systems  \nIn addition to the standards in Section 8.0103, the following apply to biomass energy systems where they are \nallowed through the Type II Special Use Review procedure: \nA. \nIn addition to the setback standards in Article 4, biomass energy systems shall be setback a minimum of \n300 feet from any residential dwelling and 1,000 feet from a residentially designated district or hospital \nto minimize any potential negative impacts.  \nB. \nThe Applicant shall identify the specific location, type and number of trips of all anticipated vehicular \ntraffic including delivery of the fuel to the site and export of fuel from the site.  \nC. \nThe biomass energy system shall be secured to prevent unauthorized access.  \nD. \nAll outdoor storage of biomass materials shall be screened from adjacent properties by an eight (8) foot \nwall.  \nE. \nBiomass energy systems shall provide a Type E buffer per Table 9.0111(A) or an alternate plan per \nSection 9.0100.  \nF. \nVisual Impact:  In order to determine a potential adverse visual impact, the following shall be \nconsidered: \n1. \nThe extent to which the system is visible from the impacted location; \n2. \nThe type, number, height and proximity of existing structures;  \n3. \nThe amount of vegetated screening;  \n4. \nThe distance of the proposed system from the impacted location; and  \n5. \nThe available reasonable alternatives that would allow the facility to function efficiently at an \nalternate location.  \n8.0126 Geothermal Energy Systems  \nIn addition to the standards in Section 8.0103, the following apply to geothermal energy systems where they are \nallowed through the Type II Special Use Review procedure: \nA. \nVisual Impact:  In order to determine a potential adverse visual impact, the following shall be \nconsidered: \n1. \nThe extent to which the system is visible from the impacted location; \n2. \nThe type, number, height and proximity of existing structures;  \n3. \nThe amount of vegetated screening;  \n4. \nThe distance of the proposed system from the impacted location; and  \n5. \nThe available reasonable alternatives that would allow the facility to function efficiently at an \nalternate location.  \n8.0140 Special Use Review, Type III Procedure \n8.0141  Purpose   \nA Type III procedure may be used to review certain uses subject to a Special Use Review. Uses subject to the \nType III procedure require the exercise of discretion and judgment, and about which there may be broad public \ninterest. The review provides an opportunity to allow a use when there are minimal impacts, to allow the use but \nimpose mitigation measures to address identified concerns, or to deny the use if the concerns cannot be resolved.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": " \n[8.01]-10 \nCity of Gresham Development Code \n \n(01/23) \n \nThe review considers standards found in Section 8.0103, standards specific to the use found in Sections 8.0144-\n8.0151, and other Development Code standards which are applicable to the proposal.  The criteria and standards \nset forth in this section apply only when the particular use is subject to a Special Use Review in the underlying \nland use district.  The Hearings Officer is the decision authority for Type III Special Use Reviews unless \notherwise noted, or if the proposed use is in a Design District, in which case the Design Commission is the \ndecision authority.   \n \nFor those Special Use Reviews where the Hearings Officer is the decision authority, appeals are heard by the \nPlanning Commission.  For those Special Use Reviews where the Planning Commission is the decision \nauthority, appeals are heard by the City Council. For those Special Use Reviews where the Design Commission \nis the decision authority, appeals are heard by the City Council. \n8.0142  Applicability of the Type III Procedure \nThe following uses are subject to the Type III Special Use Review procedure: \nA. \nCommercial Parking \nB. \nMajor Event Entertainment (Section 8.0144) \nC. \nWaste Management (Section 8.0145) \nD. \nCivic Uses, excluding those subject to the Type II procedure  \nE. \nMedical Uses (Section 8.0146) \nF. \nParks, Open Spaces, and Trails, limited to golf courses, community parks, and regional parks (Section \n8.0147) \nG. \nReligious Institutions, limited to those where the principal place of assembly may accommodate more \nthan 300 individuals (Section 8.0148) \nH. \nSchools, limited to high schools, community colleges and universities (Section 8.0149) \nI. \nMajor Basic Utilities, limited to electrical generating facilities (Section 8.0150) \n8.0143  Criteria  \nA. \nSpecial Use Reviews through the Type III procedure shall address the standards in Section 8.0103, \nstandards specific to the proposed use found in Sections 8.0144 to 8.0151, and development standards \ngenerally applicable to all uses and developments in the underlying land use district, unless specifically \nexempted by the provisions of this Section. \nB. \nThe narrative for Special Use Reviews through the Type III procedures shall describe how the operating \nand physical characteristics of the proposal have been made reasonably compatible with and have a \nminimal impact on livability, appropriate use, and development of properties in the surrounding area of \nthe subject site. \n8.0144 Major Event Entertainment  \nIn addition to Section 8.0143, the following apply to Major Event Entertainment where it is subject to a Type III \nSpecial Use Review: \nA. Major event entertainment shall have direct access to a street with a functional classification of major or \nstandard arterial or greater. \nB. Unless located in a Design District, the Planning Commission is the decision authority for review.  If in \na Design District, the Design Commission is the decision authority for review. \n8.0145 Waste Management \nIn addition to Section 8.0143, the following apply to Waste Management uses where they are subject to a Type \nIII Special Use Review: \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": " \n[8.01]-11 \nCity of Gresham Development Code \n \n(01/23) \n \nA. Solid waste transfer stations, composting facilities, and solid waste landfills shall not be located adjacent \nto residentially designated land. \nB. Solid waste transfer stations, composting facilities, and solid waste landfills shall have direct access to a \nstreet with a functional classification of major or standard arterial or greater. \n8.0146 Medical Uses \nIn addition to Section 8.0143, the following apply to Medical Uses where they are subject to a Type III Special \nUse Review: \nA. \nHospitals shall have direct access to a street with a functional classification of Arterial or greater. \nB. \nUnless in a Design District, the Planning Commission is the decision authority for review.  If in a \nDesign District, the Design Commission is the decision authority. \n8.0147 Parks, Open Spaces, and Trails \nIn addition to Section 8.0143, the following apply to Parks, Open Spaces, and Trails where they are subject to a \nType III Special Use Review: \nA. \nAll Parks, Open Spaces, and Trails uses are exempt from floor area ratio and maximum setback \nrequirements. \nB. \nGolf courses shall have direct access to a street with a functional classification of minor arterial or \ngreater. \n8.0148 Religious Institutions \nIn addition to Section 8.0143, the following apply to Religious Institutions where they are subject to a Type III \nSpecial Use Review: \nA. \nThis section is applicable to those religious institutions where the principal place of assembly can \naccommodate more than 300 individuals. \nB. \nReligious institutions shall have direct access to a street with a functional classification of minor arterial \nor greater. \n8.0149 Schools  \nIn addition to Section 8.0143, the following apply to Schools where they are subject to a Type III Special Use \nReview: \nA. \nFor all school types, portable classrooms are exempt from floor area ratio, maximum building height, \nand maximum setback requirements. \nB. \nHigh schools shall have direct access to a street with a functional classification of minor arterial or \ngreater. \nC. \nUnless in a Design District, the Planning Commission is the decision authority for review.  If in a \nDesign District, the Design Commission is the decision authority. \n8.0150 Major Basic Utilities \nIn addition to Section 8.0143, the following apply to Major Basic Utilities where they are subject to a Type III \nSpecial Use Review: \nA. \nElectrical generating facilities shall not be located in or adjacent to residentially designated land. \n8.0151 Wireless Communication Facilities in the GBSV District \nIn addition to Section 8.0122, the following apply to Wireless Communication Facilities in the GBSV District: \nA. \nThe Planning Commission is the decision authority. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": " \n[8.01]-12 \nCity of Gresham Development Code \n \n(01/23) \n \nB. \nThe application must include a study developed by an engineering firm with documented expertise in \nwireless communications which addresses the following: \n1. \nDocumentation that demonstrates that the facility is necessary to close a significant gap in service \ncoverage.  \n2. \nDocumentation that demonstrates that there are no feasible alternatives, including other sites, \nmultiple sites, other facility designs and other technologies that could fulfill the same function as \nthe proposed Wireless Communication Facility. \nC. \nThe Wireless Communication Facility shall not be visible from any parcels located outside of the GBSV \nDistrict. Demonstration of compliance with this standard must be provided as noted in Section \n8.0151.C.1 or 8.0151.C.2: \n1. \nA site plan and elevations documenting that: \na.  \nThe Wireless Communication Facility tower is no taller than the existing evergreen canopy \nas measured from the downslope side, or  \nb.  \nThe Wireless Communication Facility tower is topographically screened by its placement \nbehind a hill, is located in a ravine, or is screened by other natural features.  \n2. \nSubmittal of a photo simulation taken from parcels outside of the GBSV District using 3D \nAnalyst or another program as approved by the Manager accompanied by an analysis of the \ncontrast rating of the proposed Wireless Communication Facility using the Bureau of Land \nManagement’s Manual 8431-Visual Resource Contrast Rating or other tool approved by the \nManager. \nWireless Communication Facilities must meet the Class I or Class II Objectives found in \nAppendix 2 of the Bureau of Land Management’s Manual 8431-Visual Resource Contrast Rating \nwhen the Wireless Communication Facility is observed from viewpoints outside of the GBSV \nDistrict. \nIf other tools are used, the analysis of the siting of the Wireless Communication Facility shall \ndetermine that, when the Wireless Communication Facility is observed from viewpoints outside \nthe GBSV District: \na.  \nThe existing character of the landscape is preserved. The level of change to the character of \nGresham Butte is very low and does not attract attention away from the forested landscape \nof Gresham Butte, or  \nb.  \nThe existing character of the landscape is retained. The level of change is low and changes \nmust blend into the predominant natural features of the landscape.  \n3. \nIf vegetation used for screening is removed through natural circumstances such as disease or fire, \nreplacement vegetation must be planted within 6 months of the event and be of a species that will \ngrow to an equal or greater size, height, and canopy spread as the vegetation that was removed. \nReplacement plantings must be a minimum of 2.5 caliper inches for deciduous trees and a \nminimum of 8 feet in height for evergreen trees.  \nD. All wireless communication facility proposals shall be subject to the requirements and limitations of 47 \nU.S.C.332(c)(7), Preservation of Local Zoning Authority, and the rules adopted by the Federal \nCommunications Commission to implement said section. \nE. All wireless communication facility proposals shall be subject to the requirements and limitations of 47 \nU.S.C.1455(a), Facility Modifications, and the rules adopted by the Federal Communications \nCommission to implement said section. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": " \n[8.01]-13 \nCity of Gresham Development Code \n \n(01/23) \n \nF. In the event of any apparent conflict or inconsistency between the applicable federal laws or rules and \nSection 8.0151, the applicability, and where required, the application of the provisions of federal laws \nand rules shall be determined as part of the Special Use Review process. \n8.0160 Modifications of a Special Use \nA. Modifications to a Special Use Review that meet the threshold for Design Review A shall be reviewed \nthrough the Design Review A. This includes interior tenant improvements and expansions less than \n2,000 square feet. \nB. All other applications to modify, enlarge or intensify a use approved through the Special Use Review \nare through a Type II procedure, unless the following statements are true, in which case the Type III \nprocedure shall be used. \n1. \nThe use seeking modification, enlargement or intensification was originally subject to review \nthrough a Type III procedure; and  \n2. \nFor non-industrial uses, new floor area additions exceeds twenty-five percent of the existing floor \narea of the entire site or exceeds 10,000 square feet; or \n3. \nFor non-industrial uses, outdoor area additions exceeds twenty-five percent of the existing \noutdoor area of the entire site or exceeds 10,000 square feet; or \n4. \nFor industrial uses, new floor area additions exceeds twenty-five percent of the existing floor area \nof the site or exceeds 25,000 square feet. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": "",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:21.439013",
  "extractor_version": "1.0.0"
}