{
  "metadata": {
    "filename": "dc-section-9.1000.pdf_id7873",
    "extracted_at": "2025-05-22T06:15:20.593443",
    "num_pages": 21,
    "title": "DC Section 9.1000",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615193648-07'00'",
    "modification_date": "D:20220615194722-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[9.10]-1 \nCity of Gresham Development Code \n \n(06/22) \nSECTION 9.1000 \nTREE REGULATIONS \n9.1010 General \n9.1011   Purpose \n9.1012   Applicability \n9.1013   Exemptions \n9.1014   Tree Types: Required, Regulated, Significant  \n9.1020 Trees: Existing Development \n9.1021   Tree Removal: Existing Development \n9.1022   Tree Replacement: Existing Development \n9.1030 Trees: During Development \n9.1031   Tree Protection: During Development \n9.1032   Tree Removal: During Development \n9.1033   Tree Replacement: During Development \n9.1040 Tree Planting and Pruning \n9.1041   Approved Tree List for Required Trees \n9.1042   Tree Dimension Standards \n9.1043   Pruning of Required and Significant Trees \n9.1044   Street Tree Planting: During Development \n9.1050 Significant Trees \n9.1051   Purpose \n9.1052   Criteria for Designation of Significant Trees \n9.1053   Procedures for Designating, Maintaining, and De-Listing Significant Trees and Groves \n9.1054   Protection of Significant Trees/Significant Groves: During Development \n9.1055   Pruning of Significant Trees \n9.1056   Removal of Significant Trees \n9.1057   Significant Tree Education and Promotion \n9.1060 Civil Penalties \n \n \n \n \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[9.10]-2 \nCity of Gresham Development Code \n \n(06/22) \n9.1010 General \n9.1011  Purpose \nIt is the intent of this section to provide for tree protection and the safe, orderly removal and replacement of \ntrees on developed and undeveloped sites, and to provide for good stewardship of the urban forest. The city of \nGresham benefits from a large number of trees consisting both of natural growth and those planted throughout \nthe years. The retention and establishment of trees adds to the livability of the community by enhancing its \naesthetic beauty, minimizing surface water and groundwater run-off and diversion, filtering noise and air \npollution, and promoting soil stability. Because uncontrolled cutting or destruction of trees within the city \ndecreases the community’s livability, it is in the public interest to preserve significant trees, to control the \ncutting of trees, and to protect trees from damage during construction and from improper pruning. \n9.1012  Applicability  \nAll land within the city of Gresham is subject to the Tree Protection, Removal and Replacement regulations of \nSection 9.1000. \nA. \nWithin the Hillside and Geologic Risk Overlay and the Natural Resource Overlay regulations regarding \ntrees are as specified in Sections 5.0200 and 5.0700 respectively. This section applied within those \noverlays when specified in the overlay code. \nB. \nUnless otherwise noted, Tree Regulation standards marked as applicable to Other Uses do not include \nSingle Detached Dwellings and Middle Housing. Other Uses include but are not limited to: \n• \nMultifamily \n• \nElderly housing and residential facilities \n• \nManufactured dwelling parks \n• \nCommercial uses \n• \nIndustrial uses \n• \nInstitutional uses \n• \nLand divisions (not including middle housing land divisions) \nC. \nUnless exempted per Section 9.1013, the tree regulation standards of Section 9.1000 marked as \napplicable to Existing Development shall apply to activities such as, but not limited to: \n• \nTree removal not associated with a land use permit or building permit on a previously \ndeveloped site \nUnless exempted per Section 9.1013, the tree regulation standards of Section 9.1000 marked as \napplicable During Development shall apply to activities such as, but not limited to: \n• \nTree removal not associated with a land use permit or building permit on an undeveloped site \n• \nTree removal performed in conjunction with a land use permit or building permit \nD. \nNote: Most images, including photographs and illustrations that follow, are not part of the Development \nCode and do not act as Standards, unless labeled with a Development Code section number. These \nimages are provided to assist the readers in envisioning the intent of the standards. \n9.1013 Exemptions  \nA. \nRemoval of Regulated Trees will require either a Type 1 or Type II Tree Removal Permit, or a tree \nremoval exemption form. Removal of Regulated Trees (not Required Trees) are exempt from a tree \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[9.10]-3 \nCity of Gresham Development Code \n \n(06/22) \nremoval permit requirement under the conditions listed below: \n1. \nA tree removal exemption form is required to be filed with the Manager; and \n2. \nThe Regulated Trees are not subject to conditions of approval from a previous development \npermit; and \n3. \nThe Regulated Trees are not in the Floodplain Overlay District or the Gresham Butte Scenic View \nOverlay District; and \n4. \nThe Regulated Trees are not designated as Significant Trees; and \n5. \nThe number of Regulated Trees removed does not exceed the following thresholds per 12-month \nperiod from the time a tree removal exemptions form or Tree Removal Permit is issued: \na. For commonly owned, contiguous parcels less that 35,000 square feet: up to three Regulated \nTrees; or \nb. For commonly owned, contiguous parcels equal to or greater than 35,000 square feet: up to \nsix Regulated Trees. \nB. \nThe City of Gresham is exempt from Tree Removal Permit requirements when it undertakes activities \nthat are necessary for the protection of public health, safety and welfare; and when it performs \nmaintenance of street trees in the public right-of-way and trees within designated City parks, trails and \nopen space. Trees may be removed, or pruned in accordance with the pruning standards in Subsection \n9.1043(A), when the tree removal or pruning is necessary to accomplish a public purpose, which may \ninclude but is not limited to the installation of public facilities and utilities in the right-of-way or general \nutility easement, habitat restoration activities, or for construction of a public street, public trail or path, \npublic park or public urban plaza. \nC. \nAn electric utility is exempt from Tree Removal Permit requirements when pruning trees growing in the \npublic right of way or general utility easement, if such pruning is necessary and in accordance with state \nlaw to avoid contact with the electric facilities. \nD. \nExemption from a Tree Removal Permit under this section does not exempt development from permits \nrequired by other sections of the Development Code. \n9.1014  Tree Types: Required, Regulated, Significant  \nDefinitions and illustrations of common tree types are provided below for reference, see Section 3.0103 for the \nfull list of tree definitions. \nA. \nRequired Trees \n \n \nM\ni\nn\ni\nm\nu\nm\n  \n \n \nDefinitions of Required Tree Types: \n• \nStreet Tree – A tree within the right of way between the curb or edge of roadway, and \nthe property line and trees located in a median.  \n• \nBuffer Tree – An evergreen or deciduous tree that has been approved as part of a \nbuffering and screening plan.  \n• \nLandscape Tree – A tree that was approved as part of a landscaping plan, including \n“site” trees per Article 7.  \n• \nParking Lot Tree – A tree that was approved as part of a parking lot plan.  \n• \nPerimeter Tree – A tree located within 5 feet of either side of a property line. Does not \ninclude trees in the public right-of-way or within 5 feet of the public right-of-way.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[9.10]-4 \nCity of Gresham Development Code \n \n(06/22) \n \nIllustration of Required Tree Types \n \n \nB. \nRegulated Trees \nDefinition of Regulated Tree:   \nA tree that has a Diameter at Breast Height (DBH) of 8 inches or greater, including trees located in the \nFloodplain Overlay District or the Gresham Butte Scenic View Overlay District. Regulated Trees are \nnot Required or Significant Trees. \n \n \nIllustration of Regulated Trees \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[9.10]-5 \nCity of Gresham Development Code \n \n(06/22) \nC. \nSignificant Tree/Significant Grove. A tree or group of trees that have been designated by the City as \nhaving unique importance, and subject to the Significant Tree Regulations of Section 9.1000, Tree \nRegulations. \n9.1020 Trees: Existing Development \n9.1021  Tree Removal: Existing Development \nA. \nRequired Trees. Removal of all Required Trees except Required Perimeter Trees shall follow a Type I \nprocedure and meet the following standards: \n1. \nStreet Trees \na.  Single Detached Dwellings and Middle Housing. Street trees may be removed at the property \nowners’ discretion and shall be replaced in accordance with Section 9.1022. Replacement is \nrequired if the planter strip is at least 3 feet wide and tree planting is feasible given the tree \nspacing and locational standards of Section 9.1044. \nb. Other Uses. Street trees may be removed in accordance with the health and non-health related \nreasons in Section 9.1032(E)(6) and shall be replaced in accordance with Section 9.1022. \nReplacement is required if the plater strip is at least 3 feet wide and tree planting is feasible \ngiven the tree spacing and locational standards of Section 9.1044. \n2. \nBuffer Trees \na. Single Detached Dwellings and Middle Housing. Buffer trees may be removed at the property \nowners’ discretion and shall be replaced in accordance with Section 9.1022. \nb. Other Uses. Buffer trees may be removed in accordance with the health and non-health related \nreasons in Section 9.1032(E)(6) and shall be replaced in accordance with Section 9.1022. \n3. \nLandscape/Site Trees \na. Single Detached Dwellings and Middle Housing. Landscape/site trees may be removed at the \nproperty owners’ discretion and shall be replaced in accordance with Section 9.1022. \nb. Other Uses. Landscape trees may be removed in accordance with the health and non-health \nrelated reasons in Section 9.1032(E)(6) and shall be replaced in accordance with Section \n9.1022. \n4. \nParking Lot Trees \na. Parking lot trees may be removed in accordance with the health and non-health related \nreasons in Section 9.1032(E)(6) and shall be replaced in accordance with Section 9.1022. \nB. \nRegulated Trees. Removal of Regulated Trees, which includes topping, that exceed the thresholds in \nSection 9.1013 shall follow a Type II procedure. \nC. \nSignificant Trees. For removal of Significant Trees see Section 9.1056. \nD. \nHazardous and Imminent Hazard Trees. Removal of Required and Regulated Trees that meet the \ndefinition of Imminent Hazard Tree or Hazardous Tree, and which cannot be retained as a Habitat Tree \ndue to proximity of a target, such as a person or property, or that cannot be retained, moved, or altered \nto be non-hazardous, shall be reviewed under a Type I procedure and shall meet the following \nstandards: \n1. \nThe Type I application shall be accompanied by documentation of the hazard, such as a \nphotograph, a report from a Certified Arborist, a signed statement from a public safety official \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[9.10]-6 \nCity of Gresham Development Code \n \n(06/22) \n(such as a police or fire official), a signed statement from a City employee with responsibility for \ntree maintenance, or other evidence as determined by the Manager. \n2. \nImminent Hazard Trees. Imminent Hazard Trees, where the hazard cannot be ameliorated through \npruning or other horticultural methods, may be removed immediately. The Tree Removal \nApplication must be submitted within 10 business days after the tree is removed. \n3. \nA Hazardous or Imminent Hazard Tree removal shall not count toward the number of Regulated \nTrees removed in a 12-month period per Section 9.1013. \n4. \nSignificant Tree removal shall be reviewed as required by Section 9.1056. \nE. \nTree Removals in the Floodplain Overlay District or the Gresham Butte Scenic View Overlay District \nshall meet the standards of the applicable overlay district(s) and the following standards: \n1. \nRequired Trees. Street Trees, Buffer Trees, Landscape Trees, and Parking Lot Trees may be \nremoved in accordance with Section 9.1021(A) but shall be replaced when applicable in \naccordance with Section 9.1022. \n2. \nFor Regulated Trees: \na. Up to three non-native or invasive trees may be removed per 12-month period, with the start \nof the 12-month period defined by the issuance of the permit to remove the first tree. This tree \nremoval shall be reviewed under a Type I procedure, and an arborist report is not required. \nNon-native and invasive trees are identified on the official City Invasive Species List. \nb. Removal of more than three non-native or invasive trees, as shown on the official City \nInvasive Species List, per 12-month period from the time a permit is issued shall require a \nCertified Arborist report and be reviewed under a Type II procedure. \nc. Removal of native and non-hazardous trees shall be reviewed under a Type II procedure. \nd. Removal of Regulated Trees not specifically allowed as a Type I procedure shall follow a \nType II procedure. \ne. Type II tree removals shall meet the standards of Section 9.1032(E), and applicants shall \nprovide a mitigation/revegetation plan prepared at the expense of the applicant and approved \nby the Manager that accomplishes the purpose of the applicable overlay district or districts.. \nf. Removal of native or non-native trees that are determined to be hazardous or causing property \ndamage must follow the procedures outlined in Section 9.1021(D). The applicant shall \nprovide a mitigation/revegetation plan prepared at the expense of the applicant and approved \nby the Manager that meets the revegetation standards of the applicable overlay district or \ndistricts. \n3. \nSignificant Trees. Significant Trees may be removed in accordance with Section 9.1056. \n9.1022  Tree Replacement: Existing Development  \nA. \nReplacement of Required Trees shall meet the following standards as well as the replacement size, \nheight at maturity, and spread at maturity standards in Section 9.1042: \n1. \nStreet Trees \na. Single Detached Dwellings and Middle Housing. For street trees, one tree shall be planted for \neach tree removed in accordance with the street tree master plan or the spacing requirements \nin Section 9.1044. If replanting is not feasible because of site constraints, as determined by \nthe Manager, no replanting is required. \nb. Other Uses. Street trees shall be replaced in accordance with a street tree master plan or the \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[9.10]-7 \nCity of Gresham Development Code \n \n(06/22) \nspacing requirements in Section 9.1044. \n2. \nBuffer Trees \na. Single Detached Dwellings and Middle Housing. For buffer trees, one tree shall be planted for \neach tree removed in accordance with the originally approved landscape plan or consistent \nwith that plan and the current Code as approved by the Manager \nb. Other Uses \n \ni. \nFor trees less than 24 inches in diameter: Buffer trees shall be replaced in accordance with \nthe originally approved landscape plan or in accordance with a new landscape plan \napproved for the new development as determined by the Manager. \n \nii. For trees 24 inches in diameter or larger: Buffer trees shall be replaced at the rate of 1 \ncaliper inch per 4 inches of tree removed, although in no case shall that calculation result \nin fewer than one tree. \n \n3. \nLandscape/Site Trees \na. Single Detached Dwellings and Middle Housing. For landscape/site trees, one tree shall be \nplanted for each tree removed in accordance with the originally approved landscape plan or \nconsistent with that plan and the current Code as approved by the Manager. \nb. Other Uses. Landscape/site trees shall be replaced in accordance with the originally approved \nlandscape plan or in accordance with a new landscape plan approved for the new development \nas determined by the Manager. \n4. \nParking Lot Trees \na. Other Uses \n \ni. \nFor trees less than 24 inches in diameter: Parking lot trees shall be replaced in accordance \nwith the originally approved landscape plan or in accordance with a new landscape plan \napproved for the new development as determined by the Manager. \n \nii. For trees 24 inches in diameter or larger: Parking lot trees shall be replaced at the rate of 1 \ncaliper inch per 4 inches of tree removed, although in no case shall that calculation result \nin fewer than one tree. \nB. \nReplacement Species. Replacement of Required Trees shall be selected from the Approved Tree List or \nshall be trees appropriate for the available growing space, climate conditions, soil conditions and site \nconstraints as approved by the Manager. \nC. \nFee-in-Lieu/Tree Fund \n1. \nSingle Detached Dwellings and Middle Housing. Fee-in-Lieu is not applicable to Single Detached \nDwellings and Middle Housing. \n2. \nOther Uses: The intent of the Code is that Required Trees are planted when feasible. If site \nconstraints make it infeasible to plant all required trees as demonstrated by the applicant and \napproved by the Manager, the Manager may approve contributions to the tree fund in lieu of tree \nplanting. A contribution shall be made for each required street tree not planted. The fee \ncontribution shall be set by Council resolution. Tree fund contributions related to standards in \nSection 9.1022 shall be approved by the Manager only when: \na. One of the following conflicts exists that makes the planting infeasible: \n \ni. \nInfrastructure (such as but not limited to water lines, sewer lines, catch basins, and light \npoles) conflicts make it infeasible to plant a tree because insufficient room remains; or \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[9.10]-8 \nCity of Gresham Development Code \n \n(06/22) \n \nii. For Street Trees, the development does not include planter strips that are at least 3 feet \nwide to accommodate required street trees; or \n \niii. Planting all the Required Trees would create tree crowding that would affect tree health or \ninterfere with the use of the property in a way that cannot be avoided by pruning or other \naccepted arboricultural practices; or \n \niv. The applicant demonstrates that the tree planted at the location would create a potential \ntraffic, fire safety or building structural hazard; or \n \nv. Other similar site constraints make it physically infeasible to plant the required trees, as \ndetermined by the Manager; and \nb. The applicant provides evidence that generally accepted arboricultural methods to make tree \nplanting feasible have been considered but are not appropriate in this situation. Arboricultural \npractices include but are not limited to meandering a sidewalk; using permeable and/or \nflexible pavement; incorporating structural soil; root channels (soil volumes under pavement \nthat connect to larger soil areas); and/or enhanced drainage. \n9.1030 Trees: During Development \n9.1031  Tree Protection: During Development \nA. \nRegulated, Required, and Significant Trees. For any development permit that involves tree removal, \nconstruction, installation, or alteration of a building or other structures, including a home addition or \naccessory structure, that leads to construction equipment inside the protected area of Regulated, \nRequired, or Significant Trees to remain on the site, or: \n• \nAn increase in building area or impervious surface; \n• \nA new driveway; \n• \nDrilling, dredging, paving, excavating or clearing; or \n• \nOther construction activities; \nThe applicant shall provide facts and evidence sufficient to enable the approval authority, as determined \nby Section 11.0204, to make a determination in compliance with the criteria set forth in Section \n9.1031(B) through (G) including submittal requirements requested on relevant submittal checklists \nmaintained by the Manager. \nB. \nRegulated, Required, and Significant Trees/Significant Grove to Remain. A Tree Protection Plan is \nrequired and shall designate as protected all Regulated, Required, and Significant Trees/Significant \nGroves that are to remain on the site after development is complete and other trees recommended for \nprotection by the Certified Arborist preparing the plan, if a Certified Arborist is required below. The \nTree Protection Plan shall show all required tree protection, but is only required to be prepared by a \nCertified Arborist if activity (including but not limited to: construction equipment traffic/maneuvering, \nmaterial storage, and grading) is proposed within the tree protection zone. \n \nA tree protection zone shall be installed with protective fencing around all Regulated, Required, and \nSignificant Trees/Significant Grove to remain on site and shall be located in a radius from the tree at a \nrate of 1 foot of horizontal distance from the tree for each 1 inch diameter of tree, or as determined by a \nCertified Arborist. For a Significant Grove, the perimeter of the Grove shall be where the area of \nprotection is located with the radius measured from each tree located along the perimeter of the Grove, \nor as determined by a Certified Arborist. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n[9.10]-9 \nCity of Gresham Development Code \n \n(06/22) \n \nFigure 9.1031 Illustration of a Tree Protection Zone \n \n \nC. \nDesign Adjustments for Tree Protection. The Manager, pursuant to a Type II procedure, may allow \nadjustments meeting the criteria of Section 10.1521 (Modification of Regulations) in order to preserve \nany healthy tree that cannot be moved due to its size, but will contribute to the landscape character of \nthe area and will not present a foreseeable hazard if retained. \nD. \nSignificant Trees/Significant Grove. Also see Section 9.1054 Protection of Significant Trees and Grove \n(During Development). \nE. \nNo trees designated for protection or conservation shall be removed without prior written approval from \nthe manager. \nF. \nTree protection measures can be as recommended by a Certified Arborist or, shall as a minimum, \ninclude the following protective measures: \n1. \nPrior to any grubbing, clearing, grading, parking, preparation or storage of materials or \nmachinery, or other construction activity on the site, all trees to be protected on the project site \nand adjacent to the site shall be clearly identified and temporary fencing shall be installed at the \nperimeter of the Tree Protection Zone. Protective fencing shall be of a material that cannot easily \nbe moved, removed, or broken during construction activities. Chain link fencing a minimum of 4 \nfeet in height is preferred. An alternative Tree Protection Zone fencing material secured by metal \nposts staked at no more than 4 feet on center around the Tree Protection Zone, as illustrated in \nFigure 9.1031, of the tree or Grove may be used with the approval of the Manager. \n2. \nNo soil compaction or removal of vegetation or tree branches within the Tree Protection Zone \nshall be allowed during construction, except as outlined by a Certified Arborist in a submitted \nTree Protection Plan. \n3. \nNo machinery repair or cleaning shall be performed within 10 feet of the Tree Protection Zone of \nany trees identified for protection. \n4. \nDigging a trench for placement of public or private utilities or other structure within the critical \nroot zone of a tree to be protected is prohibited.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": " \n[9.10]-10 \nCity of Gresham Development Code \n \n(06/22) \n5. \nThe City may require that a Certified Arborist be present during any construction or grading \nactivities that may affect trees within the tree protection zone. \nG. \nChanges in soil hydrology and site drainage within the tree protection zone shall be minimized. \nExcessive site run-off shall be directed to appropriate storm drainage facilities and away from trees \ndesignated for conservation or protection. \n9.1032  Tree Removal: During Development  \nA. \nRegulated and Required Trees within 10 feet of the footprint of a proposed single detached or middle \nhousing dwelling, addition, or improvement may be removed with the issuance of a building permit. \nB. \nRemoval of Required and Significant Trees not removed in accordance with Section 9.1032(B) above, \nexcept for trees in Floodplain Overlay District or the Gresham Butte Scenic View Overlay District, shall \nmeet the following standards: \n1. \nBuffer Trees, Parking Lot Trees, Landscape/Site Trees and Street Trees. Buffer trees, parking lot \ntrees, landscape/site trees and street trees may be removed during construction in accordance with \nan approved land use permit but shall be replaced in accordance with Section 9.1033. \n2. \nSignificant Trees. For removal of Significant Trees during development also see Section 9.1056. \n3. \nPerimeter Trees. \na. Other Uses. Perimeter Trees may be removed during construction in accordance with an \napproved land use permit If no land use permit has been acquired, Perimeter Tree removal \nshall be reviewed under a Type I procedure. Applicants shall meet the removal standards in \nSection 9.1032(E)(6). Perimeter trees removed as a result of land division shall be replaced in \naccordance with Section 9.1033. \nC. \nRegulated Trees to be removed, which includes topping, during construction in excess of the thresholds \nin Section 9.1013(A), except trees in the Floodplain Overlay District or the Gresham Butte Scenic View \nOverlay District, shall be reviewed under a Type II procedure. \nD. \nAll Type II tree removal permits shall adhere to the following retention criteria: \n1. \nConifers shall be retained in sufficiently large areas and in dense stands to ensure against wind \nthrow. \n2. \nThe Manager may require a proposed structure to be relocated to retain trees if the relocation can \nbe accomplished within the required setbacks and without increasing costs to the proposed \ndevelopment by more than 2 percent of the total improvement value, excluding land cost. \n3. \nAny required mitigation shall be guaranteed prior to issuance of a grading permit for any portion \nof the site. \n4. \nThe Manager may require a mitigation plan or wind throw assessment to be provided by a \nCertified Arborist or a registered landscape architect. \n5. \nOther Uses. \na. Health reasons to remove a Required Tree include: \n \ni. \nThe tree shows an advanced state of decline with insufficient live foliage, branches, roots \nor other tissue to sustain life. \n \nii. The tree is infested with pests of disease that left untreated can lead to death. \n \niii. The tree has sustained physical damage that will cause the tree to die or enter an advanced \nstate of decline. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": " \n[9.10]-11 \nCity of Gresham Development Code \n \n(06/22) \nb. Non-Health reasons to remove a Required Tree include: \n \ni. \nThe tree blocks vision for motorists. \n \nii. The tree causes sidewalk upheaval. \n \niii. There is a crime prevention concern associated with the Required Tree that cannot be \nameliorated with proper pruning techniques. \n \niv. The tree interferes with right-of-way objects, such as driveways and light poles. \n \nv. The tree presents a potential hazard for property or people. \n \nvi. Other reason as approved by the Manager. \nE. \nClearcutting \n1. \nNon-Industrial Uses. When tree removal proposed is clear cutting, such clear cutting shall be \nallowed only when development occurs concurrently under the following conditions: \na.  Shall be reviewed under a design review tree removal permit or with the issuance of a \nbuilding permit when the use does not require the design review process. \nb. Clear cutting shall not begin until after the applicant has obtained all development permits \nincluding the issuance of any building permits, and/or any other applicable permits necessary \nto ensure completion of the proposed development, and after the applicant has filed with the \nCity a financial guarantee for landscape mitigation based on an approved plan; and \n \ni. \nErosion control measures as required under Section 9.0514 and the Building Code shall \nbe implemented on the site prior to the commencement of any clear cutting; and \n \nii. Landscaping shall be required and reviewed during the design review process to mitigate \nthe loss of existing vegetation that provides erosion control and tree canopy. \n2. \nIndustrial Uses. When the tree removal proposed is clear cutting for Industrial uses when \ndevelopment does not occur concurrently, such clear cutting shall only be allowed under the \nfollowing conditions: \na. Shall be reviewed under a Type II Development Permit for tree removal and if needed, a \ngrading permit. When the tree removal does not include grading, such as in the case of cutting \ntrees to stumps but not removing them, a grading permit is not required. \nb. Clear cutting shall not begin until after the applicant has: \n \ni. \nFiled with the City a financial guarantee for landscape mitigation based on an approved \nplan; and \n \nii. Landscaping shall be required and reviewed during the Type II procedure to mitigate the \nloss of existing vegetation that provides erosion control and tree canopy; and \n \niii. Erosion control measures as required under Section 9.0514 and the Building Code shall \nbe implemented on the site prior to the commencement of any clear cutting; and \n \niv. Erosion control measures, such as spraying the site with hydroseed, will be required after \nthe trees are removed. \nF. \nTree removal in the Floodplain Overlay District or the Gresham Butte Scenic View Overlay District  \nshall meet the applicable removal standards of Section 9.1000. All replacement requirements shall \ncomply with applicable provisions of the Special Purpose Overlay Districts: \n1. \nStreet trees, parking lot trees, buffer trees, perimeter trees and landscape trees may be removed in \naccordance with Subsection 9.1032(C) and shall be replaced when applicable in accordance with \nSection 9.1033; and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": " \n[9.10]-12 \nCity of Gresham Development Code \n \n(06/22) \n2. \nSignificant Trees may be removed in accordance with Section 9.1056; and \n3. \nFor Regulated Trees: \na. Up to three non-native or invasive trees may be removed per 12-month period, with the start \nof the 12-month period defined by the issuance of the permit to remove the first tree. The tree \nremoval shall be reviewed under a Type I procedure, and an arborist report is not required. \nNon-native and invasive trees are identified on the official City Invasive Species List; and \nb. Removal of more than three non-native or invasive trees, as shown on the official City \nInvasive Species List, per 12-month period from the time a permit is issued shall require a \nCertified Arborist report and be reviewed under a Type II procedure; and  \nc. Removal of native and non-hazardous trees shall be reviewed under a Type II procedure; and \nd. Removal of Regulated Trees not specifically allowed as a Type I procedure shall follow a \nType II procedure; and \ne. Type II tree removals shall meet the standards of Section 9.1032(E), and applicants shall \nprovide a mitigation/revegetation plan prepared at the expense of the applicant and approved \nby the Manager that accomplishes the purpose of the applicable overlay district or districts, \nsuch as slope stabilization, habitat provision and/or environmental benefits such as stream \nshading; and \nf. Removal of native or non-native trees that are determined to be hazardous or causing property \ndamage must follow the procedures outlined in Section 9.1021(D). The applicant shall \nprovide a mitigation/revegetation plan prepared at the expense of the applicant and approved \nby the Manager that meets the revegetation standards of the applicable overly district. \n9.1033  Tree Replacement: During Development  \nA. \nReplacement of Required Trees shall meet the following standards as well as the replacement size, \nheight at maturity, and spread at maturity standards in Section 9.1042: \n1. \nStreet Trees \na. Single Detached Dwellings and Middle Housing. Street trees shall meet the street tree plan or \nthe spacing requirements in Section 9.1044. If replanting is not feasible because of site \nconstraints, the standards of Section 9.1022(A) would apply. \nb. Other Uses. Street trees shall be replaced in accordance with a street tree plan or the spacing \nrequirements in Section 9.1044. \n2. \nBuffer Trees \na. Single Detached Dwellings and Middle Housing. Buffer trees shall be replaced in accordance \nwith 9.0100(H). \nb. Other Uses. \n \ni. \nFor trees less than 24 inches in diameter: Buffer trees shall be replaced in accordance with \nthe originally approved landscape plan or in accordance with a new landscape plan \napproved for the new development as determined by the Manager. \n \nii. For trees 24 inches in diameter or larger: Buffer trees shall be replaced at the rate of 1 \ncaliper inch per 4 inches of tree removed, although in no case shall that calculation result \nin fewer than one replacement tree for each tree removed. \n3. \nLandscape/Site Trees \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": " \n[9.10]-13 \nCity of Gresham Development Code \n \n(06/22) \na. Single Detached Dwellings and Middle Housing. Landscape/site trees shall be replaced in \naccordance with 7.0400. \nb. Other Uses. Landscape/site trees shall be replaced in accordance with the originally approved \nlandscape plan or in accordance with a new landscape plan approved for the new development \nas determined by the Manager. \n4. \nParking Lot Trees \na.  Other Uses \n \ni. \nFor trees less than 24 inches in diameter: Parking lot trees shall be replaced in accordance \nwith the originally approved landscape plan or in accordance with a new landscape plan \napproved for the new development as determined by the Manager. \n \nii. For trees 24 inches in diameter or larger: Parking lot trees shall be replaced at the rate of 1 \ncaliper inch per 4 inches of tree removed, although in no case shall that calculation result \nin fewer than one replacement tree for each tree removed. \n5. \nPerimeter Trees \na. Other Uses. \n \ni. \nFor trees less than 24 inches in diameter: For Perimeter Trees, each tree removed shall be \nreplaced by one replacement tree. \n \nii. For trees 24 inches in diameter or larger: For Perimeter Trees, each tree removed shall be \nreplaced at the rate of 1 caliper inch per 4 inches of tree removed, although in no case \nshall that calculation result in fewer than one replacement tree for each tree removed. \nB. \nReplacement Species. Replacement of Required Trees shall be selected from the Approved Tree List or \nshall be trees appropriate for the available growing space, climate conditions, soil conditions and site \nconstraints as approved by the Manager.  \nC. \nFee-in-Lieu/Tree Fund \n1. \nSingle Detached Dwellings and Middle Housing. Fee-in-Lieu is not applicable to Single Detached \nDwellings and Middle Housing except during the land division process. \n2. \nOther Uses. The intent of the Code is that Required Trees are planted when feasible. If site \nconstraints make it infeasible to plant all required trees as demonstrated by the applicant and \napproved by the Manager, the Manager may approve contributions to the tree fund in lieu of tree \nplanting. A contribution shall be made for each required tree not planted. The fee contribution \nshall be set by Council resolution. Tree fund contributions related to standards in Section 9.1033 \nshall be approved by the Manager only when: \na. One of the following conflicts exists that makes the planting infeasible: \n \ni. \nInfrastructure (such as but not limited to water lines, sewer lines, catch basins, and light \npoles) conflicts make it infeasible to plant a tree because insufficient room remains; or \n \nii. For Street Trees, the development does not include planter strips that are at least 3 feet \nwide to accommodate required street trees; or \n \niii. Planting all the Required Trees would create tree crowding that would affect tree health or \ninterfere with the use of the property in a way that cannot be avoiding by pruning or other \naccepted arboricultural practices; or \n \niv. The applicant demonstrates that the tree planted at the location would create a potential \ntraffic, fire safety or building structural hazard; or \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": " \n[9.10]-14 \nCity of Gresham Development Code \n \n(06/22) \n \nv. Other similar site constraints make it physically infeasible to plant the required trees, as \ndetermined by the Manager; and \nb. The applicant provides evidence that generally accepted arboricultural methods to make tree \nplanting feasible have been considered but are not appropriate in this situation. Arboricultural \npractices include but are not limited to meandering a sidewalk; using permeable and/or \nflexible pavement; incorporating structural soil; root channels (soil volumes under pavement \nthat connect to larger soil areas); and/or enhanced drainage. \n9.1040 Tree Planting and Pruning \n9.1041  Approved Tree List for Required Trees \nTo encourage trees to be planted in the right place where they can thrive and not cause unintended property \ndamage, all Required Trees planted within the city shall be selected from the Approved Tree List and be \nappropriate for the location, as approved by the Manager. Manager approval is required when a tree that is not \non the Approved Tree List is proposed to be planted. \n9.1042  Tree Dimension Standards \nFor all types of trees referenced in the Development Code, there are a number of dimension provisions related to \ntree replacement size as well as mature height and spread. The common tree dimension standards are listed in \nTable 9.1042 of this subsection and only apply to trees that are required to be planted. The table is frequently \nreferenced by standards in Section 9.1000 and those found in the Design Districts. The trees must meet the \nminimum size requirements or be approved by the Manager and shall be capable of meeting the minimum \nheight and spread dimensions at maturity. \nTable 9.1042 \nMinimum Size, Height and Spread Standards for Trees Planted in Accordance with the \nDevelopment Code \nTree Type \nMinimum Size \n(caliper inches, unless \nnoted otherwise) \nMinimum Height at \nMaturity \nMinimum Spread at \nMaturity \nStreet \n1.75 in. \nPer Approved Tree List  \nPer Approved Tree List  \nStreet (intersection \nclear vision) \n2.0 in. \nPer Approved Tree List \nPer Approved Tree List \nBuffer  \nDeciduous: 2.5 in. \nEvergreen: 8 ft. \nDeciduous: 25 ft. \nEvergreen:  none \nDeciduous: 25 ft. \nEvergreen: none \nLandscape/Site \n(Townhouses in RTC, \nSC, SC-RJ, CMF \n(except for those \nalong the NE Glisan \nAve. and NE 162nd \nAve. corridors), and \nCMU districts) \nDeciduous: 1.5 in. \nEvergreen: 6 ft. \n25 ft. \nnone \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": " \n[9.10]-15 \nCity of Gresham Development Code \n \n(06/22) \nLandscape/Site \n(deciduous / design \ndistrict) \n2.5 in. \n25 ft. \nnone \nLandscape/Site \n(ornamental/ design \ndistrict) \n2.0 in. \nnone \nnone \nParking Lot  \n2.0 in. \n35 ft. \n35 ft. \nPerimeter  \n1.75 in. \nnone \nnone \nSignificant  \n2.0 in. \nnone \nnone \n \n9.1043  Pruning of Required and Significant Trees \nA. \nStreet Trees shall be pruned in accordance with the most recent ANSI (American National Standards \nInstitute) A300-1995 standards or other more recent standard arboricultural practices approved by the \nCity. Major pruning (as identified in Article 3) of any street tree within the public right-of-way may be \nrequired by the Manager to be performed by a Certified Arborist. \nB. \nSignificant Trees. See Section 9.1055 Pruning of Significant Trees. \nC. \nTree Topping, as defined in Section 3.0150, of Required Trees must be replaced through the applicable \nType I Permit. \nTree Pruning Diagram \n \n \n9.1044  Street Tree Planting: During Development \nA. \nA Street Tree plan shall be submitted for approval with a building permit, tentative partition, \nsubdivision plan, planned development or design review. The Street Tree plan shall show tree spacing, \nnumber of trees and their location and meet all required characteristics noted in the submittal \nrequirements provided by the Manager. \nB. \nStreet Trees of a minimum 1.75-inch caliper are required when a land use or building permit requires \nstreet trees. \n1. \nSingle Detached Dwelling and Middle Housing. Street Trees shall be planted every 30 feet on all \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": " \n[9.10]-16 \nCity of Gresham Development Code \n \n(06/22) \nstreet classifications, with the following additional standards: \na. On streets with a collector or higher classification, each lot, with the exception of flag lots, \nshall have a minimum of one tree, in addition:  \ni. \nFrontages exceeding 30 feet shall require 2 trees. \nii. \nCorner lots shall require 3 trees. \n2. \nOther Uses. The number and spacing of required street trees shall meet the following standards: \na. Number: On all street classifications, one tree shall be required for every 30 feet of frontage \nminus the clear vision area and driveways. \nb. Spacing: Trees shall be placed a minimum of 20 feet and maximum of 40 feet apart. The \nspacing requirement may be modified by the Manager. \nc. For new development, if site constraints make it infeasible to plant all required street trees as \ndemonstrated by the applicant and approved by the Manager, the Manager may approve \ncontributions to the tree fund in lieu of street tree planting. A contribution shall be made for \neach required street tree not planted. For applications related to non-conforming development, \nas determined by the Manager, a contribution shall be made for each required street tree not \nplanted, but the contribution shall be limited by the 10 percent cost limitations found in \nSection 8.0202 Design Review Standards. The fee contribution shall be established by \nCouncil resolution. \nC. \nStreet trees shall be located at least 15 feet from streetlights, 15 feet from stormwater catch basins, and 5 \nfeet from driveway cuts or underground public utilities. \nD. \nNo Street Trees shall be planted in the right-of-way within 12 feet of the nearside of the crosswalk on \nthe vehicular approach side of the street as street intersections. \nE. \nStreet Trees shall be selected from the City’s Approved Tree List or other varieties as approved by the \nManager. \nF. \nFee-in-Lieu/Tree Fund \n1. \nSingle Detached Dwelling and Middle Housing. Fee-in-Lieu is not applicable to Single Detached \nDwelling and Middle Housing. \n2. \nOther Uses. The intent of the Code is that required Street Trees are planted when feasible. If site \nconstraints make it infeasible to plant all required Street Trees as demonstrated by the applicant \nand approved by the Manager, the Manager may approve contributions to the tree fund in lieu of \nstreet tree planting. A contribution shall be made for each required Street Tree not planted. The \nfee contribution shall be established by Council resolution. A tree fund contribution shall be \napproved by the Manager only when: \na. One of the following conflicts exists that makes planting infeasible: \n \ni. \nOne or more of the standards in Section 9.1044(C) through (D) make it infeasible to plant \na tree because insufficient room remains; or \n \nii. The development does not include planter strips that are at least 3 feet wide to \naccommodate the quired street trees; or \n \niii. The applicant demonstrates that the tree planted at the location would create a potential \ntraffic, fire safety or building structural hazard; or \n \niv. Other similar site constraints make it physically infeasible to plant the Street Tree(s), as \ndetermined by the Manager; and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 17,
      "text": " \n[9.10]-17 \nCity of Gresham Development Code \n \n(06/22) \nb. The applicant provides evidence that generally accepted arboricultural methods to make tree \nplanting feasible have been considered but are not appropriate in this situation. Arboricultural \npractices include but are not limited to meandering the sidewalk; using permeable and/or \nflexible pavement; incorporating structural soil; root channels (soil volumes under pavement \nthat connect to larger soil areas); and/or enhanced drainage. \n9.1050 Significant Trees \n9.1051  Purpose \nThe City has developed standards and procedures to protect Significant Trees/Significant Groves, as defined in \nSection 3.0103, because they have been determined to be of significant value to the community because of their \nexceptional beauty, distinctive size or shape, association with an historic person or event, or a functional \naesthetic relationship to a visual or natural resource. \nThe following provisions are intended to help protect the natural beauty of the City for future generations and to \nenhance the long-term value of those trees that meet the criteria for inclusion in the Significant Tree Inventory. \nSignificant Tree protection rules are located in this section as well as in Section 9.0131. Significant Tree \nremoval rules are located in Section 9.1056. Significant Tree pruning rules are in this section as well as Section \n9.1043. \n9.1052  Criteria for Designation of Significant Trees \nA. \nAn individual tree may be considered Significant if it is apparently in a healthy growing condition and \non of the following exist: \n1. \nThe tree has a distinctive size, shape, or location, or is of a distinctive species or age which \nwarrants a Significant status; or \n2. \nThe tree possesses exceptional beauty which warrants a Significant status; or \n3. \nThe tree is Significant due to a functional or aesthetic relationship to a natural resource, such as \ntrees located along stream banks or trees located along ridgelines; or \n4. \nThe tree has a documented association with a historical figure, property, or significant historic \nevent. \nB. \nA Grove may be considered Significant if it is apparently in a healthy growing condition and one of the \nfollowing exist: \n1. \nThe Grove is relatively mature and evenly aged and has a purity of species composition or is of a \nrare or unusual nature; or \n2. \nThe Grove has a crucial functional and/or aesthetic relationship to a natural resource; or \n3. \nThe Grove has a documented association with a historic figure, property, or significant historic \nevent. \nC. \nIn addition to subsections (A) and (B) above, the designation of the tree or Grove of trees as Significant \nwill not unreasonably interfere with the use of the property upon which it is located. \n9.1053  Procedures for Designating, Maintaining, and De-Listing of Significant Trees \nand Groves \nA. \nThe City has developed a list of Significant Trees, which may be updated on a periodic basis. \nB. \nThe Significant Tree designation may be applied to a tree or a grove of trees, and may be nominated by \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 18,
      "text": " \n[9.10]-18 \nCity of Gresham Development Code \n \n(06/22) \nany person, agency, or group, with property owner’s consent. \nC. \nThe Significant Tree list shall be reviewed by the Urban Forestry Subcommittee to consider \nmodifications. The review shall address any potential new candidates and may include a consideration \ncriterion for inclusion on the list. \nD. \nThe Urban Forestry Subcommittee shall complete the following steps as part of the review and update: \n1. \nSolicit Significant Tree nominations \n2. \nMake a physical evaluation of each potential new nominee. \n3. \nDevelop findings that evaluate the new candidates for conformance with the criteria found in \nSection 9.1052. \n4. \nSolicit written consent from affected property owners for the proposed final recommendations. \n5. \nDevelop a list of recommended Significant Trees, to include any potential new candidates. The \nrecommended list may also address the potential de-listing of any Significant Trees that no longer \nmeet standards for inclusion on the list (see also emergency removal provision below). \n6. \nThe Committee’s recommendations shall be submitted to the Manager for review and approval \npursuant to the Type II procedures. \n7. \nIn the event that a property owner wishes to remove a tree from the Significant Tree List at any \ntime other than during the Urban Forestry Subcommittee review and update, the property owner \nshall be subject to a Type II procedure unless one of the following occurs: \na. A majority of the Urban Forestry Subcommittee determines that the tree can be removed with \nthe written withdrawal of the owner consent, in which case the tree will automatically be de-\nlisted. \nb. A majority of the Urban Forestry Subcommittee determines that the tree has become a hazard \nin need of immediate removal, in which case the tree will automatically be de-listed; or \nc. The tree meets the criteria for immediate removal as an imminent hazard under the provisions \nof Section 9.1021. \n8. \nTo ensure the trees are qualified to remain on the list once designated, the Urban Forestry \nSubcommittee shall make a partial physical inventory and review all trees with each Tree and \nGrove to receive an on-site visit and analysis at least every four years. \n9.1054  Protection of Significant Trees/Significant Groves: During Development \nIn addition to the requirements of Section 9.1031, the following standards shall apply: \nA. \nSignificant Trees/Significant Grove. When development is proposed for property that includes or abuts \nthe dripline of a Significant Tree(s)/Significant Grove on an abutting site, the Significant \nTree(s)/Significant Grove abutting the site shall be preserved and protected, as specified in Subsection \n9.1031(B) during all development activities, including preliminary grubbing and clearing A \nconservation easement shall be imposed on the site of the development to ensure ongoing protection of \nthe Significant Tree(s)/Significant Grove on the abutting property. The conservation easement shall be \nlocated at the dripline in a radius from the tree at the rate of 1 foot of horizontal distance from the tree \nfor each 1inch of diameter of the tree unless a Certified Arborist determines that the tree can be \nprotected adequately with less distance, or as determined by a Certified Arborist. \n1. \nThe Manager, pursuant to a Type II procedure, may grant an adjustment to the side, front and rear \nyard setback standards by up to 50 percent if necessary to retain a Significant Tree or Trees. The \nadjustment shall be the minimum necessary to accomplish preservation of trees on site and shall \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 19,
      "text": " \n[9.10]-19 \nCity of Gresham Development Code \n \n(06/22) \nnot conflict with other conditions placed on the property. \n2. \nThe Manager, pursuant to a Type II procedure, may grant a five percent reduction to the lot size \nand ten percent reduction to the lot width and lot depth standards in approving a subdivision or \npartition if necessary to retain a Significant Tree or Trees.  \n3. \nThe Manager, pursuant to a Type II procedure, may allow a property owner to cut a specific \nnumber of trees within a Significant Grove of trees if preserving those trees would: \na. Cause the loss of ten percent or more of the total number of allowed lots or units, or \nb. Cause an increase of five percent or more in the cost of installing on-site utilities. \n9.1055  Pruning of Significant Trees \nIn addition to the standards required by Section 9.1043 the following shall apply: \nA. \nSignificant Trees may not be pruned more than 20 percent of their limb structure, nor may the root \nsystem be disturbed by more than 10 percent in any 12-month period without a development permit. All \npruning of a Significant Tree shall be performed by a Certified Arborist in accordance with ANSI \n(American National Standards Institute) A300-1995 standards or other more recent standard \narboricultural practices approved by the City. \n9.1056  Removal of Significant Trees \nA. \nRemoval of Significant Trees: Existing Development \n1. \nSignificant Trees that present an imminent hazard to the safety of people or protection of property \nwhere the hazard cannot be ameliorated through pruning less than 20 percent of the tree’s foliage \narea or other horticultural methods may be removed immediately. The following standards apply: \na. Such trees shall be automatically removed from the City’s Significant Tree List by the \nManager. \nb. If a Significant Tree receives major pruning or is removed, the property owner shall notify the \nManager within two business days and an application shall be filed for a Type I tree removal \npermit. The applicant shall provide documentation of the emergency, such as a photograph, a \nreport from a certified arborist, a signed statement from a public safety official (such as a \npolice officer, fire official), a signed statement from a City employee with responsibility for \ntree maintenance, or other evidence as determined by the Manager. When documentation is \nprovided by someone other than a City employee, photographic evidence of the emergency \nand written documentation of the imminent hazard is required.  \nc. If a Significant Tree receives major pruning or is removed, the Manager shall notify the \nrelevant Council Advisory Committee(s) or subcommittee(s). \n2. \nExcept for trees removed during development or in accordance with imminent hazard provisions \nin subsection (1) above, no person may remove a Significant Tree without obtaining a \ndevelopment permit through a Type II procedure. The application shall meet at least one of the \nfollowing criteria: \na. The tree needs to be removed to construct proposed improvements and no practical alternative \nexists without significantly increasing cost or inconvenience, or reducing safety. \nb. The tree has lost its significance as a Significant Tree due to damage from natural or \naccidental causes, or for some other reason it can be established that is no longer of historic or \nnatural significance. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 20,
      "text": " \n[9.10]-20 \nCity of Gresham Development Code \n \n(06/22) \nc. The tree needs to be removed to accomplish a public purpose and no practical alternative \nexists. \nB. \nRemoval of Significant Trees: During Development \n \nSignificant Trees shall be preserved unless the Manager determines under a Type II procedure that the \ntree may be removed by meeting at least one of the following criteria: \n1. The tree needs to be removed to construct proposed improvements (including but not limited to the \nbuildings; access for construction equipment; essential grade changes needed to implement \nstandards common to standard engineering or architectural practices; space for driveways or other \nimprovements; solar energy equipment) and no practical alternative exists without increasing the \ncost by more than 5 percent or reducing construction or development safety; or \n2. The tree needs to be removed consistent with good urban forestry practices or cannot be maintained \nbecause of its health and has become a hazard to public safety, to the subject property or adjacent \nproperty, to personal property or to any improvements as stated in a Certified Arborist Report; or \n3. The tree has lost its significance as a Significant Tree due to damage from natural or accidental \ncauses, or for some other reason it can be established that it is no longer of historic or natural \nsignificance as stated in a Certified Arborist report; or \n4. The tree needs to be removed due to a disease as stated in a Certified Arborist report and to \naccomplish a public purpose and no practical alternative exists. \n9.1057  Significant Tree Education and Promotion \nThe Council may establish public information and education programs to encourage the protection of trees. At a \nminimum, the City shall review its inventory of Significant Trees and notify property owners at four-year \nintervals by first class mail of the existence of a Significant Tree or Trees on their property. The notice shall \ninclude a description of the tree preservation regulations and suggested maintenance standards for the tree or \ntrees. \nAlthough not mandatory, owners of Significant Trees or Groves are encouraged to file a document with \nMultnomah County Deed Records that identifies the presence of the Significant Tree or Trees on their property.  \nThe City’s updated list of Significant Trees and Groves shall be maintained on-line and shall also be available to \nthe public in printed form.  \n9.160 Civil Penalties \n \nA. \nA violation shall have occurred when any requirement or provision of Section 9.1000 has not been \ncomplied with. Violation of any provision of Section 9.1000 may be subject to enforcement action by \nthe Manager and may be enforced pursuant to Gresham Revised Code Article 7.50. \nB. \nEach day a violation continues to exist shall constitute a separate violation for which a separate civil \npenalty may be assessed. The provisions of Gresham Revised Code 7.50.730 through Gresham \nRevised Code 7.50.760 shall apply to the imposition of civil penalties under Section 9.1000. \nC. \nIn addition to any other penalty provided by law and the remedies established in Article 2 of the \nGresham Community Development Code, any person determined to be responsible for violation of \nany of the provision of Section 9.1000 may be required to pay a penalty in the amount of up to three \ntimes the arboricultural value of the lost tree or trees, as determined by an independent consulting \narborist and pay for the cost of the arborist review and report. The person determined to be responsible \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 21,
      "text": " \n[9.10]-21 \nCity of Gresham Development Code \n \n(06/22) \nfor violation of the provision of Section 9.1000 shall also replace the removed trees with like trees as \nspecified by the City or pay into the City’s designated tree fund the equal replacement value  of \nremoved trees.  \nD. \nThe Manager may enter any property in accordance with Gresham Revised Code 7.50.500 through \nGresham Revised Code 7.50.520, to perform an inspection in order to ensure compliance with any \nprovision of Section 9.1000. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.598106",
  "extractor_version": "1.0.0"
}