{
  "metadata": {
    "filename": "dc-section-8.0200.pdf_id7862",
    "extracted_at": "2025-05-22T06:15:20.844858",
    "num_pages": 8,
    "title": "DC Section 8.0200",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.58",
    "creation_date": "D:20230105100740-08'00'",
    "modification_date": "D:20230105100759-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[8.02]-1 \nCity of Gresham Development Code \n \n(01/23) \n \nSECTION 8.0200 \nEXISTING AND NONCONFORMING USES \nAND DEVELOPMENT \nGeneral \n8.0201  Purpose  \n8.0202  Design Review Standards \nContinuation of Nonconforming Situations \n8.0210  Nonconforming Situations \n8.0211  Legal Nonconforming Situation  \nAlteration, Enlargement, Expansion, Movement or Replacement of \nNonconforming Situations \n8.0220  Changes to Nonconforming Uses and Developments  \n8.0221  Alteration, Enlargement, Expansion, Movement or Replacement of a Nonconforming Development   \n8.0222  Alteration, Enlargement, Expansion, Movement or Replacement of a Nonconforming Use   \nLoss of Nonconforming Status \n8.0230  Damages to Nonconforming Situations   \n8.0231  Discontinuation or Vacation of Nonconforming Situations   \nSpecial Requirements for Nonconforming Uses in Land Use Districts \n8.0240  Nonconforming Uses in Residential Land Use Districts  \nProcess For Establishing Or Altering Nonconforming Situations \n8.0250  Documentation of Existing Conditions and Continuance \n8.0251  Nonconforming Procedures  \nGeneral \n8.0201  Purpose  \nIt is the intent of the Community Development Code to permit nonconforming uses and developments to \ncontinue until they are removed, but not to encourage their perpetuation.  It is further the intent of the Code that \nnonconforming uses and developments shall not be enlarged or moved, nor be used as grounds for adding other \nstructures or uses not permitted elsewhere in the same district, except as specifically provided in this section. \n8.0202  Design Review Standards \nAll design review requests shall comply with all applicable standards in the Community Development Code.   \nDevelopment which only affects a portion of a site shall conform with the applicable standards for that portion of \nthe site where development is proposed.  With the exception of industrial development in  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[8.02]-2 \nCity of Gresham Development Code \n \n(01/23) \n \nindustrial land use districts subject to a Design Review A, where non-conforming development exists on part of a \nsite (not being re-developed) compliance with the following standards for the entire developed site is required: \nA. \nStreet facing façade upgrades when located in a Design District with adopted design principles, design \nguidelines, and design standards. \nB. \nThe screening requirements in Section 9.0100 - Buffering and Screening, if applicable. \nC. \nThe street tree planting requirements in Sections 9.1044. \nD. \nThe parking lot landscaping requirements in Section 9.0823(C)(1), (2), (3), and (4). \nE. \nThe pedestrian circulation connection requirements in Section 7.0310(K) and in Section 7.0320(G) for \nindustrial uses. \nF. \nThe bicycle parking requirements in Section 9.0830 - Parking. \nG. \nThe Carpool /Vanpool requirements in Section 9.0857. \nThe applicant shall not be required to spend more than 10% of project costs on these improvements if they are \non that portion of the site not being developed.  If full compliance with the above requirements cannot be \nachieved within the 10% project cost limitation, the applicant shall comply with the above requirements in the \norder of priority as listed.  However, the Manager may vary the listed priority if it is determined that the adjacent \nneighborhood or the public would be better served by applying a different order of the above standards on a \nparticular site. \nContinuation of Nonconforming Situations \n8.0210  Nonconforming Situation \nNonconforming situations are created when prior uses, development and structures were developed in \ncompliance with specific land use districts, but are no longer in conformance due to changes to the land use \ndistrict or changes to the regulations of the Code.  Nonconforming situations can be made up of either a \nnonconforming use or a nonconforming development, which are defined in Section 3.0100, Definitions. \n8.0211  Legal Nonconforming Situations  \nLegal non-conforming (“Grandfather”) situations recognize that all uses and developments are not required to \nconform automatically to changes in the Community Development Code.  The following subsections may be \nconsidered a legal non-conforming situation: \nA. \nExcept as otherwise provided in this section, any situation lawfully existing prior to the implementation \nof this development code on August 27, 1992  or subsequent amendments to the development code shall \nbe defined as a legal nonconforming situation and may be continued so long as it remains otherwise \nlawful. \nB. \nA lot of record or a parcel of land for which a deed or other instrument dividing the land was recorded \nwith Multnomah County prior to December 16, 1975, or either approved by Multnomah County or \nrecorded prior to July 26, 1979, if annexed after that date, may be occupied by uses as provided in \nArticle 4 - Land Use Districts of this ordinance. \nC. \nA pre-existing address that is determined not to conform to current City standards as specified in the \nDevelopment Code and City of Gresham Street Naming and Property Addressing Guidelines is not \nconsidered a legal non-conforming situation and is not allowed to remain, once identified.  A non-\nconforming address or property number is subject to correction upon notice. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[8.02]-3 \nCity of Gresham Development Code \n \n(01/23) \n \nAlteration, Enlargement, Expansion, Movement or Replacement of \nNonconforming Situations \n8.0220  Changes to Nonconforming Uses and Developments  \nA. \nIn order to avoid undue hardship, nothing in this section shall require any change in the location, plans, \nconstruction, size, or designated use of any building, structure, or part thereof, for which a valid \ndevelopment permit has been granted prior to the enactment of the Community Development Plan. \nB. \nWhere alteration, enlargement, expansion, or movement of a nonconforming use or nonconforming \ndevelopment is permitted, it shall be limited to the lot or parcel on which the original use and/or \ndevelopment was located when the use or development was first established, or to an abutting lot or \nparcel under the same ownership at the time the nonconforming use or nonconforming development \nbecame nonconforming, provided the abutting lot or parcel is contiguous and not separated by right-of-\nway from the lot or parcel on which the nonconforming use or development is located. If the abutting lot \nor parcel has a different district designation than the nonconforming use or nonconforming \ndevelopment, alteration, enlargement, expansion or movement of the nonconforming use or \nnonconforming development onto that lot or parcel shall be permitted only if the use is permitted within \nthat district. \nC. \nA nonconforming use may be extended throughout any existing parts of a building which were clearly \narranged or designed for such use at the time the use became nonconforming. \nD. \nFor any existing structure on the site of a nonconforming use or development, normal maintenance and \nrepairs or replacement of walls, fixtures, wiring, or plumbing shall be performed in a manner not in \nconflict with the other provisions of this section.  Nothing in this section shall be deemed to prevent the \nstrengthening or restoring to a safe condition of any structure or part thereof declared to be unsafe by \nany official charged with protecting the public safety, upon order of such official. \nE. \nThe alteration, enlargement, or moving of a nonconforming use or development shall not increase \ndetrimental effects (i.e. noise, vehicle traffic, vibration, dust, odor, fumes, smoke, or glare) in the \nsurrounding area greater than the effects from the existing use or development generated at the time it \nbecame nonconforming.  Findings to this effect shall be made by the Manager under the Type II \nprocedure. \nF. \nThe enlargement, moving, or structural alteration of a nonconforming use or development shall not: \n1. \nPlace any structure associated with the nonconforming use or development in a different \noccupancy group as defined by the Building Code. \n2. \nIncrease the risk to life or risk of fire hazard of the use or development, or of any structure \nassociated with the use or development, as defined by the Building Code Occupancy Group \nClassification. \nG. \nFull conformance with the following requirements and standards of the Community Development Code \nshall be required in connection with the enlargement or moving of any nonconforming use or \ndevelopment that does not require a design review as per Section 7.0000: \n1. \nPublic facilities standards of Section A5.000, et. seq.; \n2. \nScreening and buffering requirements of Section 9.0100; \n3. \nThe requirements of Section 8.0202. \nH. \nFull conformance with applicable standards which specify the proportion of the site to be landscaped, \nshall be achieved in connection with the enlargement or moving of a nonconforming use or \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[8.02]-4 \nCity of Gresham Development Code \n \n(01/23) \n \ndevelopment. \nI. \nA legally established nonconforming use may be replaced by another nonconforming use that is deemed \nto be essentially identical to the legally established nonconforming use under the Type I procedure.  An \nexample would be the replacement of a nonconforming hair salon by a barber shop.  Any such \nreplacement is subject to compliance with Sections 8.0220 and 8.0231. \nJ. \nA legally established nonconforming use shall only be replaced by another such use that is deemed \nsubstantially similar to the legally established use after review under the Type II procedure.  An \nexample would be the replacement of an automotive tire and brake repair facility by an automotive \nmuffler shop.  Any such replacement is subject to compliance with Sections 8.0220 and 8.0231. \nK. \nAn alteration to a nonconforming development that requires a design review as per Section 7.0000 shall \nbe subject to all current standards with the exception that existing nonconforming structures are allowed \nto remain in a nonconforming condition.  Enlargement of a nonconforming structure is subject to this \nsection and Section 8.0221, and to applicable design review standards.  New development and \nstructures on a nonconforming development site are subject to all current standards. \nL. \nThe conversion of a legally established nonconforming hotel or motel to an emergency shelter or to \naffordable housing is permitted. The conversion shall not expand the footprint of the building. The \nconversion does not require a development permit. See Section 10.0420. \n8.0221  Alteration, Enlargement, Expansion, Movement or Replacement of a \nNonconforming Development \nA nonconforming development may be enlarged or moved as authorized by meeting the requirements of this \nsection, following Type II procedures. \nA. \nWhere a nonconforming development is substandard with respect to setbacks, enlargement or moving of \na development which maintains the existing, substandard setback may be permitted, but further \nencroachment into required setbacks shall not be permitted.  Any new development other than \nenlargement or moving of an existing development feature shall conform with applicable setback \nrequirements for the district in which the site is located. Actions which would cause encroachment into \nan abutting public street right-of-way shall not be permitted. \nB. \nAny portion of a nonconforming development to be relocated on site or enlarged shall be subject to \nheight limits applying to the district in which the development is located except that minimum height \nstandards shall not apply to one-time additions or expansions of non-conforming buildings of no more \nthan 25% and less than 1,000 square feet.  In undertaking any enlargement or moving, the development \nas a whole shall conform with applicable lot coverage standards. \nC. \nWhere a nonconforming development is substandard with respect to the minimum floor area ratio \n(FAR), the nonconforming development may be expanded without meeting the minimum FAR \nstandards of the district, provided the expansion has the effect of moving towards and increasing \ncompliance with the FAR standards of the district and not reducing compliance with the FAR standards \nin the district, and provided the combination of new and old developments are sited so as not to preclude \nmeeting the minimum FAR in the future. \nD. \nConformance with applicable minimum lot size, minimum street frontage, and lot dimension \nrequirements shall not be required in connection with the enlargement or moving of a development \nwhich is deficient in these areas, provided the Manager finds full conformance with all other provisions \nof this section. \n8.0222  Alteration, Enlargement, Expansion, Movement or Replacement of a \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[8.02]-5 \nCity of Gresham Development Code \n \n(01/23) \n \nNonconforming Use  \nExcept as provided in Section 8.0222 and except as provided in Subsections (F) and (G), a non-conforming use \nmay be enlarged or moved as authorized by this section, following the Type II procedure. \nA. \nBuildings associated with a nonconforming use may be enlarged as provided in this section, but shall \nnot be moved.  Non-building elements of a nonconforming use, such as off-street parking or outdoor \nstorage areas, may be moved in conformance with provisions of this section. \nB. \nExcept as provided in Subsections (F) and (G), a nonconforming use may be permitted to enlarge by no \nmore than 20% of the floor area or land area occupied by the use.  Any such enlargement of building \narea or of land area occupied by a nonconforming use may be permitted one time only during the life of \nthe nonconforming use.  \nC. \nExcept for nonconforming single detached dwellings and duplexes (see Subsection (F)), and except for \nnonconforming uses approved through the Special Use Review process (see Subsection (G)), any \nportion of a nonconforming use proposed to be enlarged or moved shall be subject to height, setback, \nand lot coverage standards applying in the district in which the use is located. \nD. \nNon-building elements of a nonconforming use may be moved within the same lot or parcel, or within \nan abutting lot or parcel under the same ownership at the time the use became nonconforming, provided \nthe abutting lot or parcel is contiguous and not separated by right-of-way from the lot or parcel on which \nthe nonconforming use is located.  If the abutting lot or parcel has a different district designation than \nthe nonconforming use, movement of the use onto that lot or parcel shall be permitted only if the use is \npermitted within that district. \nE. \nExcept as provided in Subsections (F) and (G), the enlargement or moving of a nonconforming use \nshall not result in a greater number of structures associated with the use than the number of structures \nexisting prior to the action.  Any enlargement of a nonconforming residential use shall not result in an \nincrease in the number of dwelling units on the site. \nF. \nUnder the Type I procedure, a single detached dwelling, or a duplex which is a nonconforming use, may \nbe altered or enlarged any number of times in conformance with standards of Table 4.0130(E), (F), and \n(G) and Table 4.0131 of the Community Development Code.  Accessory structures on the same site as \nnonconforming single detached dwellings and nonconforming duplexes may, under the Type I \nprocedure, be constructed or enlarged in conformance with standards of Section 10.0200 of the \nCommunity Development Code.  \nG. \nA nonconforming institutional use that was once approved through the Community Service Use Review \nor Special Use Review process or was permitted outright but is now subject to a Special Use Review, \nand is now a nonconforming use may be altered or enlarged any number of times, subject to provisions \nof Section 8.0100.  Where enlargement or alteration of such a use is permitted, it shall be limited to the \nlot or parcel on which the use is located, or to an abutting lot or parcel under the same ownership at the \ntime the use became nonconforming. \nH. \nA single detached dwelling or a duplex which is a nonconforming use, may be converted into middle \nhousing through a building permit procedure provided that middle housing or multifamily housing is \nallowed in the district. \nLoss of Nonconforming Status \n8.0230  Damages to Nonconforming Situations   \nA. \nExcept as provided in Section 8.0240 when a nonconforming development or a structure on the site of a \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[8.02]-6 \nCity of Gresham Development Code \n \n(01/23) \n \nnonconforming use or where one or more structures on the site of a nonconforming use (other than a \nnonconforming single detached dwellings or middle housing) is damaged by fire or other cause beyond \nthe control of the owner, if the estimated cost of repairing the development or structure is more than \n80% of its current value, the development or structure may be repaired or reused only in full \nconformance with all provisions of the Community Development Code for the district in which the site \nis located. \nB. \nExcept as provided in Section 8.0240, nonconforming single detached dwellings or middle housing \nwhich has been damaged beyond 80% of its current value may be reconstructed, under Type III \nprocedure, provided the cause of damage was beyond the control of the owner. \nC. \nNonconforming single detached dwellings or middle housing may only be intentionally demolished and \nreplaced by a new single detached dwelling or middle housing if the new structure is permitted by the \ndistrict in which the site is located and is conforming to all district development standards.  A \nnonconforming single detached dwelling or middle housing may not be replaced or reconstructed in a \ndistrict where single detached dwellings or middle housing are not permitted except as allowed in \nSections 8.0230(A) and (B) above. \n8.0231  Discontinuation or Vacation of Nonconforming Situations   \nWhen a nonconforming use or development is discontinued or vacated for one year or longer, the site and any \nstructures on the site shall be occupied only by a use or uses which are permitted in the district in which the site \nis located.  For purposes of this subsection, a use shall be considered discontinued or vacated upon the \noccurrence of the first of any of the following events, as determined by the Manager under the Type II \nprocedure: \nA. \nThe date on which the structure(s) and/or site are vacated; \nB. \nThe date of termination of any lease or contract under which the nonconforming use has occupied the \nsite; \nC. \nThe date when outwardly visible activity associated with the nonconforming use ceases; \nD. \nThe date for which close out billing for water or sewer service for the nonconforming use is requested; \nE. \nThe date on which payment for water or sewer service for the nonconforming use becomes 60 days past \ndue. \nF. \nThe expiration date of a valid City business license that was not renewed. \nSpecial Requirements for Nonconforming Use in Land Use Districts \n8.0240  Nonconforming Uses in Residential Land Use Districts   \nNotwithstanding the provisions of this section, any nonconforming use engaged in manufacturing, processing, \nstorage, sales, or personal or business services which is located in the LDR-5, LDR-7, TLDR, TR, MDR-12, \nMDR-24, or CMF districts shall be subject to the following limitations: \nA. \nThe detrimental effects of the nonconforming use in the surrounding area due to noise, vehicle traffic, \nvibration, dust, odor, fumes, smoke, or glare shall not increase beyond the levels existing at the time of \nthe effective date of this section. \nB. \nThe hours of operation and number of employees of the nonconforming use shall not increase beyond \nthe hours of operation and number of employees existing at the time of the effective date of this section. \nC. \nThere shall be no enlargement or moving of the nonconforming use, or any development associated with \nthe use, after the effective date of this section. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[8.02]-7 \nCity of Gresham Development Code \n \n(01/23) \n \nD. \nThe extent of existing buffering and screening between the nonconforming use and abutting conforming \nuses shall not be diminished after the effective date of this section. \nE. \nWhere one or more structures on the site of a nonconforming use is damaged by fire or other cause, and \nthe estimated cost of repairing the damaged structure or structures amounts to more than 50% of the \nvalue of all improvements on the site, the nonconforming use shall be terminated.  The estimated cost of \nrepair shall be determined by the Manager under the Type II procedure, based on best available \ninformation. \nProcess For Establishing Nonconforming Situations \n8.0250  Documentation of Existing Conditions and Continuance \nNonconforming situations must provide evidence indicating the nonconforming situation was allowed when the \ndevelopment code was established and the situation has been continued over time.  The Manager, under the \nType I procedure, shall review documentation to determine establishment and continuance of lawful \nnonconforming situations.  The following are lists of potentially accepted evidence of allowed and continued \nnonconforming situations: \nA. \nDocumentation showing allowed nonconforming situations: \n1. \nBuilding, land use, or development permits; \n2. \nPlan District codes and maps; or \n3. \nOther documentation accepted by the Manager. \nB. \nDocumentation showing a nonconforming situation has been continued over time: \n1. \nUtility Bills; \n2. \nIncome Tax Records; \n3. \nBusiness licenses; \n4. \nListings in telephone or business directories; \n5. \nAdvertisements in dated publications; \n6. \nBuilding, land use, or development permits; or \n7. \nOther documentation accepted by the Manager. \n8.0251  Nonconforming Procedures   \nA. \nExcept as provided in Section 8.0240, a nonconforming development or a structure may be permitted to \nbe repaired or reconstructed under Type II procedures following compliance with one of the following \nsubsections:   \n1. \nA nonconforming use that has been damaged due to causes beyond the owner's control if the \nestimated cost of repairing or reconstructing the development or structure is less than 80% of its \ncurrent value.  The estimated cost of repair shall be determined by the Manager based on best \navailable information.   \n2. \nThe owner of the damaged development or structure must obtain a permit to repair or reconstruct \nwithin one calendar year of the damage.  If the permit is not obtained the development or structure \nshall conform fully to all provisions of the Community Development Code for the district in \nwhich the site is located.   \na. \nThe proposed repair or reconstruction will not result in a greater degree of \nnoncompliance with the requirements of Community Development Code Standards that \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[8.02]-8 \nCity of Gresham Development Code \n \n(01/23) \n \nexisted prior to the damage or destruction.   \nb. \nIf the application for a development permit sought under this section indicates that the \nowner is proposing enlargement or movement of the damaged development or structure, \nthen Sections 8.0221 and 8.0222 shall also apply to nonconforming developments and \nnonconforming uses, respectively. \nc. \nThe Manager may attach conditions of approval to a development permit issued for this \npurpose in order to ensure that the degree of noncompliance with requirements of the \nGresham Community Development Code will not be increased.  Conformance with \nDesign Review requirements may also be required in connection with the enlargement \nor moving of a nonconforming development, as provided in Section 7.0000. \nB. \nExcept as provided in Section 8.0240, nonconforming single detached dwellings or middle housing \nwhich has been damaged beyond 80% of its current value may be reconstructed, under the Type III \nprocedure, provided the cause of damage was beyond the control of the owner.  In seeking a \ndevelopment permit for reconstruction of a damaged or destroyed nonconforming, single detached \ndwellings or middle housing, the applicant shall present findings to satisfy the following criteria: \n1. \nRemoval of the dwelling would result in a substantial hardship to its owners or occupants; \n2. \nReconstruction of the dwelling would not result in serious conflicts between the dwelling and \nexisting, conforming uses in the area; and \n3. \nReconstruction of the dwelling would not seriously interfere with potential development of new, \nconforming uses on adjacent sites. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.845211",
  "extractor_version": "1.0.0"
}