{
  "metadata": {
    "filename": "dc-section-10.0500.pdf_id7878",
    "extracted_at": "2025-05-22T06:15:20.916908",
    "num_pages": 4,
    "title": "DC Section 10.0500",
    "author": "patty boyden",
    "creator": "Microsoft® Word for Microsoft 365",
    "producer": "Microsoft® Word for Microsoft 365",
    "creation_date": "D:20240131095448-08'00'",
    "modification_date": "D:20240131095515-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.05]-1 \nCity of Gresham Development Code \n \n(06/22) \n \nSECTION 10.0500 \nHOME OCCUPATIONS \nHome Occupations \n10.0501  Purpose \n10.0502  Home Occupation General Requirements \n10.0503  Home Occupation Considerations \n10.0504  Home Occupation Review Exception Standards \n10.0505  Performance Standards for a Home Occupation \n10.0506  Home Occupation Prohibited Uses \n10.0507  Home Occupation Time Limits and Renewal \n10.0508  Home Occupation Enforcement and Revocation \n10.0509  Variances to Standards \n10.0510  Unsubstantiated Complaints  \nHome Occupations \n10.0501  Purpose  \nThe purpose of this section is to: \nA. \nProtect residential areas from adverse impacts created by home based business/commercial activities. \nB. \nProvide the alternative to residents to use their dwelling and any associated living quarters as a place of \nbusiness or commercial activity when such complies with the standards and purpose of this section. \nC. \nProvide a process for reviewing home occupations so as to protect the rights of neighboring residents to \nthe peaceful enjoyment of their neighborhood and dwellings. \n10.0502  Home Occupation General Requirements  \nA. \nHome based business or commercial activities may be allowed as a home occupation subject to the \nrequirements of this section. \nB. \nAn application for a home occupation shall be reviewed by the Manager under the Type II procedure of \nSection 11.0400, unless the home occupation meets the review exception standards of Section 10.0504, \nin which case the application process shall be under the Type I procedure of Section 11.0300, and will \nbe processed as part of the Business License application.  Application for the development permit shall \nbe made by the person desiring to conduct the use, and, the owner or authorized representative of the \nproperty on forms provided by the City. \nC. \nBesides meeting the requirements of this section, the business or commercial use of any home for a \nhome occupation must be supported by an active City business license. \nD. \nFor the purposes of this section “home” refers to the residential location, including any type of dwelling \nunit and associated garage, of the home occupation. All “homes” as described here may seek approval \nof a home occupation. \nIn addition, a Home Occupation must cease its operation if the “permanent residents” do not reside in \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.05]-2 \nCity of Gresham Development Code \n \n(06/22) \n \nthe dwelling for more than 30 consecutive days. \nE. \nNo home occupation permit is required in order to conduct short-term personal sales (such as a garage \nsale or the sale of an individual personal item such as a couch or bicycle) from a residence.  The \nmaximum duration of garage/yard type sales is three consecutive days and/or 10 days total in a calendar \nyear. \nNo person shall carry on a home occupation without first obtaining a permit for such use in the manner \nprovided by this section. \nF. \nAn application for a home occupation subject to a Type II review procedure shall include a narrative \nthat provides the following information: \n1. \nWhether the applicant’s business or commercial activity will be conducted entirely at the home or \nonly partly at home. \n2. \nWhether the applicant’s use would be full-time or occasional and involve employees. \n3. \nWhether the customers of the home occupation come to the home to do business or not. \n4. \nWhether the home occupation requires any physical changes to the home that would not ordinarily \nbe there if not for the presence of the business use. \n5. \nWhether the home occupation activity is similar to other in-home versus out-of-home businesses. \n6. \nWhether the home occupation activity is similar to non-commercial activities that routinely take \nplace at home so as to ensure minimal to no impacts on the surrounding neighborhood. \n7. \nA statement from the applicant that the applicant has or has not reviewed any applicable deed \ncovenants, conditions, and restrictions that might relate to the proposed home occupation. \nG. \nApplication for a home occupation subject to a Type I review procedure shall include a signed statement \nthat the applicant complies with the exception standards of Section 10.0504. \n10.0503  Home Occupation Considerations   \nAll home occupations shall be reviewed pursuant to the purpose and standards of this section in consideration of \nthe application information.  A home occupation proposal need not comply with Appendix 5.000, Public \nFacilities Standards, of the Community Development Code. \n10.0504 Home Occupation Review Exception Standards \nHome occupations which meet the following exception standards may be processed following a Type I review, \nmust obtain a valid City business license, and must comply with the performance standards in Subsections \n10.0505(A)-(E) and (G)-(I): \nA. The home occupation does not involve customers or clients coming to the resident of the applicant.  \nB. The home occupation does not include non-family members and/or non-residents as employees. \nC. No deliveries shall be made to the residence other than by traditional small-scale means normally found \nin a residential area, such as the United States Postal Service, United Parcel Service, Federal Express, \nmessenger services, etc.  \nD. Activities of or pertaining to the home occupation that occur at the home shall remain within the \nconfines of the dwelling unit and/or garage, with the exception of those outdoor uses described in \nSection 10.0504.E. \nE. The growing of plants, vegetables, fruits, and flowers is allowed in “home” yards of home based \nbusinesses. Egg production that meets the requirements of the GRC Article 7.17 and honey production \nthat meets the requirements of GRC Article 7.18 are also allowed.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[10.05]-3 \nCity of Gresham Development Code \n \n(06/22) \n \nHome occupations which do not meet the above standards must follow the Type II review process as described \nin Section 10.0502. \n10.0505  Performance Standards for a Home Occupation  \nAll the following standards are established for Type II reviewed home occupations:  \nA. \nNo signs shall be used indicating the existence of the home occupation. \nB. \nThere is no display or other evidence that will indicate from public rights-of-way or abutting residences \nthat the dwelling unit is used in whole or in part for any purpose other than as a dwelling. \nC. \nThe home occupation shall not change the occupancy classification other than allowed in the residential \nBuilding Code. \nD. \nNo more than an area equivalent to 50% of the total floor area of the home may be used in connection \nwith a home occupation or for storage purposes in connection with a home occupation.  Home \noccupation area may be located within a portion of the dwelling building and/or an attached or detached \ngarage.  However, home occupations shall not be located in other accessory structures. Outdoor uses are \nallowed pursuant to Section 10.0504.E. \nE. \nWith the exception of the uses described in 10.0504.E, there shall be no outside storage of materials or \nequipment associated with the home occupation.  Nor shall there be any storage or use of explosive, \nflammable, radioactive, toxic or other hazardous materials that are not normally found in the home nor \nin amounts not normally associated with a residence.  Specific limitations and requirements for the \nstorage of hazardous materials in a residence are found in and regulated by the Uniform Fire Code. \nF. \nNo more than one employee other than permanent residents of the dwelling shall be engaged in the \nhome occupation at the dwelling site at any one time. \nG. \nNo commercially-licensed vehicle in excess of 3/4 ton manufacturer’s rating shall be utilized or parked \nat the dwelling unit by any resident of the premises in connection with the home occupation. \nH. \nNo deliveries shall be made to the residence other than by traditional small-scale means normally found \nin a residential area, such as the United States Postal Service, United Parcel Service, Federal Express, \nmessenger services, etc.  Such deliveries shall not restrict traffic circulation on the public street and \nsidewalks. \nI. \nThe generation on a regular or ongoing time period of noise, vibrations, odors, heat, glare or visual or \naudible electrical interference detectable beyond any property line is prohibited. \nJ. \nNo customers shall be on the premises between 10:00 pm and 7:00 am. \nK. \nTwo on-site parking spaces shall be provided for the home occupation in addition to those spaces \nalready required for the dwelling.  No more than two customer vehicles may visit the home occupation \nlocation at any one time and these must use the designated parking spaces onsite. \nL. \nThe proposed use is appropriate as a home occupation considering the purpose of this section, preceding \nstandards, and the narrative informational items from Subsections 10.0502(F) (1) – (6) as provided with \nthe application. \nUpon approval of the home occupation development permit the applicant shall provide proof that he/she has \nobtained a current City business license. \n10.0506 Home Occupation Prohibited Uses \nThe following business uses shall be prohibited as home occupations:  vehicle repair, maintenance or \ndismantling activities, vehicle sales, employee/crew staging, and industrial uses (including but not limited to \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[10.05]-4 \nCity of Gresham Development Code \n \n(06/22) \n \nsuch activities as manufacturing, fabrication, warehousing, industrial services, and welding). \n10.0507  Home Occupation Time Limits and Renewal   \nThe approval for a Type I reviewed home occupation shall be valid as long as an active business license is \nmaintained and renewed annually.  The development permit for a Type II reviewed home occupation is valid for \na period of two (2) years, but must include the annual renewal of an active business license.  Renewal of the \nType II permit shall then follow the Type I review process.  However, any home occupation for which the City \nof Gresham receives more than two (2) verified complaints from property owners or any occupants of property \nwithin a radius of 300 feet of the home occupation site, or, a verified complaint is received from the applicable \nneighborhood association as authorized at a neighborhood association meeting, or, the home occupation is \nsubject to City enforcement action within a calendar year, that permit must be renewed following the Type II \nprocess in the same manner as an application for a new permit.  In such a case, the complaints and/or \nenforcement action shall be considerations for renewal. \n10.0508  Home Occupation Enforcement and Revocation \nThe permit for a home occupation may be revoked by the Manager at any time for: \nA. \nA violation of any provision of this ordinance. \nB. \nA violation of any term or condition of the permit. \nC. \nFailure to renew the City business license when due. \nEnforcement shall follow the Abatement and Penalty provisions of Article 2.  \n10.0509  Variances to Standards \nVariances to standards may be considered only for the performance standards of Subsections 10.0505(A)-(K) \nfollowing the process and procedures of Section 10.1500 of the City of Gresham Community Development \nCode. \n10.0510  Unsubstantiated Complaints \nCity Code Enforcement staff shall have the discretion to determine the appropriate follow-up for unsubstantiated \ncomplaints.  Such may include non-action or recommendations for mediation to affected parties. \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.917293",
  "extractor_version": "1.0.0"
}