{
  "metadata": {
    "filename": "dc-section-6.0400.pdf_id7854",
    "extracted_at": "2025-05-22T06:15:22.891514",
    "num_pages": 3,
    "title": "DC Section 6.0400",
    "author": "Sarale Hickson",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220615154656-07'00'",
    "modification_date": "D:20220615154711-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \nSection 6.0400 Land Division Final Plat Requirements (6/2022) \nPage 6.04-1 \nSection 6.0400 Land Division Final Plat Requirements \n TABLE OF CONTENTS \nGeneral \n6.0401 Surveys Required  \n6.0403 Partitions and Subdivision - Final Plat \n6.0404 Approval Signatures for Final Subdivision Plat \n6.0405 Approval Signatures for Final Partition Plat \nApproval Timeline \n6.0411 Reinstatement of Tentative Plan Approval Status  \n6.0412 Effective Date for Final Plat Approval  \nGENERAL \n6.0401 SURVEYS REQUIRED   \nAll land divisions and lot line adjustments shall be surveyed and monumented in compliance with ORS \nChapters 92 and 209. Parcels and tracts adjusted or created greater than 10 acres in size shall also be subject \nto these requirements.  An applicant may submit final plat for review by the County Surveyor concurrent with \nCity review. \n6.0403 PARTITIONS AND SUBDIVISIONS - FINAL PLAT  \nA. The applicant shall submit two (2) originals of the final plat on 7 mil mylar that complies with ORS Chapters \n92 and 209 on a material and of a size required by the Multnomah County Surveyor.  The applicant shall \nfirst submit an electronic copy of the final plat. The final plat shall comply with the Tentative Plan \nconditions of approval. The following data requirements, if applicable, shall also be shown on the final plat. \n1. All tracts of land intended to be deeded or dedicated for public use; \n2. Street names as approved by the Manager on the preliminary final plat copies in accordance with the \nCity of Gresham Street Naming and Property Addressing Guidelines; \n3. Any non-access strips. \nB. A final subdivision or partition plat shall be submitted to the Manager for final approval under the Type I \nprocedure prior to expiration of the tentative plan pursuant to Section 11.0105.  Within 20 days of \nsubmission, the Manager shall determine whether the material conforms with the approved tentative plan \nand with the applicable requirements of this code.  If the Manager determines that the material does not \nconform, the applicant may make corrections prior to issuance of a final decision. \nC. The Manager shall approve a final subdivision or partition plat when the plat conforms with the approved \ntentative plan, other applicable requirements of this code and the following are submitted: \n1. Lands to be deeded or dedicated for public use are provided for on the final plat or on separate \ndocuments. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0400 Land Division Final Plat Requirements (6/2022) \nPage 6.04-2 \n2. An approved guarantee of completion for required public improvements that have not been \ncompleted and accepted by the City. \n3. An approved grading and drainage plan if grading is required. \n4. Approved construction drawings for required public improvements. \nD. When the Manager determines that the plat conforms, the Manager shall sign and date the plat if the \nother requirements for a development permit have been fulfilled. \nE. A final condominium plat may be approved by the Manager when all criteria of subsection (C) are met and \nwhen the condominium plat meets applicable ORS provisions for Condominium Platting. \nF. Prior to City signature, all street names on the Final Plat shall conform to the City of Gresham Street \nNaming and Property Addressing Guidelines and the City of Gresham Development Code. \n6.0404 APPROVAL SIGNATURES FOR FINAL SUBDIVISION PLAT  \nFollowing the review and Manager’s approval of a subdivision plat, the applicant shall take the following \nactions: \nA. Obtain the approval signature on the final subdivision plat of the County Surveyor certifying that the \nsubdivision plat complies with applicable survey laws.  Before certifying, the surveyor may make field \ninvestigations to verify that the plat survey is sufficiently accurate. If the surveyor determines that \nsubdivision plat does not comply, the applicant shall make corrections.  When the surveyor determines \nthat the plat conforms, the surveyor shall sign and date the plat. \nB. As required by ORS 92.090, obtain the approval signature on the final subdivision plat of the board of \ndirectors, or board's delegate, of any irrigation district, drainage district, water control district, or district \nimprovement company if the subdivision is within such district. \nC. Obtain the approval signatures on the final subdivision plat of the directors certifying that the plat is \napproved. \nD. Obtain the approval signature on the final subdivision plat of the county assessor certifying that all taxes \non the property have been paid or bonded for in accordance with state law. \nE. File a statement of water right, and if a water right is appurtenant, a copy of the acknowledgment from the \nWater Resources Department. \nF. Deliver the approved subdivision plat and accompanying documents to the County Recorder for recording. \nG. Return a copy of each associated recorded document to the City for filing. \n6.0405 APPROVAL SIGNATURES FOR FINAL PARTITION PLAT   \nFollowing review and Manager’s approval of a final partition plat, the applicant shall take the following actions: \nA. Obtain the approval signature on the final partition plat by the County Surveyor certifying that the final \npartition plat complies with all applicable survey laws.  Before certifying, the surveyor may make field \ninvestigations to verify that the plat survey is sufficiently accurate.  If the surveyor determines that the \npartition plat does not comply, the applicant shall make corrections.  When the surveyor determines that \nthe plat conforms, the surveyor shall sign and date the plat. \nB. File a statement of water right and, if a water right is appurtenant, a copy of the acknowledgment from the \nWater Resources Department. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0400 Land Division Final Plat Requirements (6/2022) \nPage 6.04-3 \nC. Deliver the approved final partition plat and accompanying documents to the county recorder for \nrecording. \nD. Return a copy of each associated recorded document to the City for filing. \nAPPROVAL TIMELINE \n6.0411 REINSTATEMENT OF TENTATIVE PLAN APPROVAL STATUS   \nA. Prior to the expiration date of a tentative plan extension the Manager may, upon written request of the \napplicant, assign an inactive status to the tentative plan. \nB. An inactive plan may have its tentative plan approval status reinstated, under the Type II procedure, if the \nplan is found to be consistent with the following criteria: \n1. There have been no changes in the Community Development Code that would necessitate a \nmodification of the tentative plan; \n2. The facts upon which the approval was based have not changed to an extent sufficient to warrant \nrefiling of the tentative plan; and \n3. There are no other development approvals that would be affected. \nC. If the tentative plan approval status is reinstated the applicant shall comply with the City's final plan \ntechnical information requirements in effect at the time of reinstatement.  A land division that has been \nreinstated shall be recorded with Multnomah County within three years from the date the inactive plan \nwas reinstated. \n6.0412 EFFECTIVE DATE FOR FINAL PLAT APPROVAL  \nA plat shall be final upon the recording with the county of the approved plat and any required document.  \nApproved plats shall become void if not recorded within one year after approval of the final plat.  Work \nspecifically authorized following tentative approval may take place prior to issuance of the final plat \ndevelopment permit.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.891692",
  "extractor_version": "1.0.0"
}