{
  "metadata": {
    "filename": "dc-section-6.0000.pdf_id7850",
    "extracted_at": "2025-05-22T06:15:20.864231",
    "num_pages": 4,
    "title": "DC Section 6.0000",
    "author": "Sarale Hickson",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220615154457-07'00'",
    "modification_date": "D:20220615154517-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "Section 6.0000 Introductory Provisions (6/2022) \nPage 6.00-1 \nARTICLE 6 LAND DIVISIONS \nSection 6.0000  Introductory Provisions  \nTABLE OF CONTENTS \nGeneral \n6.0001 Purpose and Authority \nLot Design Standards \n6.0010 Lot Arrangement  \n6.0011 Residential District Lot and Parcel Configuration  \n6.0012 Lots in Excessively Sloped Areas  \n6.0013  Lot of Record \n6.0014  Land Division with Leftover Parcels \nCondominiums \n6.0020 Condominiums \nGENERAL  \n6.0001 PURPOSE AND AUTHORITY  \nNo land may be divided without first obtaining a development permit. \nA. No land or ownerships may be divided prior to approval of a partition or subdivision in accordance with \nthis code.  Except as provided for in 6.0001(B), if a development permit application to divide land is \nsubmitted that does not involve other proposed development, the application shall state an intended form \nof future development for the resulting land parcels.  This intended future development will then be \nprocessed along with the land division processing just as though the applicant were intending to proceed \nwith the further development. \nB. For non-residential land divisions where it is more practical to determine how public facilities will be \nprovided in a required subsequent development permit application, the proposed land division may be \napproved if: \n1. It is feasible to provide public facilities to each lot; and  \n2. Adequate public facilities are provided with further development.  \nC. A land division is processed by approving a tentative plan prior to approval of the final plat.  If there is \ncompliance with the approved tentative plan, the Manager may approve final plats for land divisions under \nthe Type I procedure. \nD. An application for an expedited land division will be processed in accordance with the provisions of ORS \n197.360 through 197.380. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0000 Introductory Provisions (6/2022) \nPage 6.00-2 \nLOT DESIGN STANDARDS \n6.0010 LOT ARRANGEMENT  \nThe lot arrangement shall be such that there will be no foreseeable difficulties, for reason of topography or \nother condition, in securing building permits to build on all lots in compliance with the requirements of the \nGresham Development Code. \n6.0011 RESIDENTIAL DISTRICT LOT AND PARCEL CONFIGURATION  \nA. Subdivision lots and partition parcels created through the subdivision and partition process shall be \nrectilinear.  Irregular shaped subdivision lots and partition parcels are not allowed, except at the discretion \nof the Manager when based upon existing parent lot shape.  Exceptions shall not be granted to comply \nwith minimum lot size requirements or minimum setback requirements for existing structures. This \nstandard does not apply to lots or parcels created through a Middle Housing Land Division Section 6.0500. \nB. Split-zoned lots \n1. When a single development site is split by two or more residential land use districts (as described in \nArticle 4, Section 4.0100), the creation of lots or parcels through the subdivision and partition process \nor the adjustment of lots through the lot line adjustment process that have more than one land use \ndistrict is not allowed unless the applicant demonstrates to the satisfaction of the Manager that a \nlogical lotting pattern is not feasible without creating split-zoned lots or parcels.  \n2. If the Manager determines a logical lotting pattern is not feasible, the applicant may create lots or \nparcels split by two or more land use districts as long as all split lots or parcels comply with the \nstandards of the least intensive land-use district applied to the split lots.  For the purposes of this \nsection, least intense to most intense is: LDR-7, LDR-5, TR, TLDR, MDR-12, MDR-24. \n6.0012 LOTS IN ENVIRONMENTAL OVERLAY DISTRICTS  \nDevelopment permit requests in Floodplain Overlay District, Hillside and Geologic Overlay, Natural Resource \nOverlay may be developed in accordance with the provisions of the underlying district the relevant sections of \nArticle V, and if applicable, Section 6.0300. \n6.0013 LOT OF RECORD \nA. No sale or conveyance of any portion of a lot for other than a public purpose, shall leave a structure on the \nremainder of the lot with less than the minimum lot area, lot dimensions, yard setbacks or result in a lot \nwith less than the minimum buffering and screening requirements of this ordinance. \nB. The lot of record provisions do not include land divisions that were recorded with Multnomah County after \nDecember 16, 1975, where the City’s approval was required but not sought and granted prior to \nrecordation.  Such land divisions are not recognized as lots of record as defined in this ordinance. \n6.0014 LAND DIVISION WITH LEFTOVER PARCEL \nA. Applicability. This provision applies within the LDR-7, LDR-5, TLDR, TR, LDR-PV, MDR-PV, and LDR-SW \nsubdistricts, or on lots where there is an existing single detached or middle housing unit which will be on \nthe left-over parcel in the HDR-PV, TC-PV, MUE-PV, EC-PV, and THR-SW sub-districts. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0000 Introductory Provisions (6/2022) \nPage 6.00-3 \nB. Conditions. An application for a land division may have a maximum of two “leftover” parcels, or portions \nof the property which are capable of further development and which are not included as part of a phased \nsubdivision if the following conditions are met: \n1. In the HDR-PV, TC-PV, MUE-PV, EC-PV, and THR-SW sub-districts, the parent parcel has an existing \nhabitable home on it built on or before April 6, 2018. \n2. The leftover parcel(s) must be capable of further development. \n3. The land division will not preclude ultimate buildout of the parent parcel per an adopted or submitted \nand approved Master Plan, as applicable. \n4. The area of up to two leftover parcels may be excluded from the average lot size calculation provided \nthat a future development plan is submitted which demonstrates that the parcel(s) can be developed \nconsistent with applicable standards. \n5. As required per Section 10.0120(C) and Section 10.0203(F)(2), when a land division places the primary \nresidence on a separate parcel than an accessory structure or an accessory dwelling, the accessory \nstructure or dwelling must be: \na. Removed upon transfer of ownership of either parcel; or \nb. An accessory dwelling be converted to a conforming primary dwelling as part of the land division \napplication. \nC. Development of Leftover Parcels. Parcels created under this provision may not be developed until: \n1. Lots are created pursuant to Article 6 – Land Divisions and to the Master Plan, where applicable. Lots \nshall be consistent with the standards of the applicable underlying sub-district(s) and other applicable \nprovisions of the Community Development Code; or \n2. The development is approved through the Special Use Review process found in Section 8.0100. \nD. Submittal Requirements. The following must be provided with submittal for the land division: \n1. Payment-in-lieu of required future improvements along the existing street frontage(s) of the leftover \nparcel(s). \n2. In the LDR-PV, MDR-PV, HDR-PV, TC-PV, MUE-PV, and EC-PV sub-districts, dedication or all perimeter \nright(s)-of-way of the created leftover parcel(s). Dedications shall be in compliance with the Master \nPlan, where applicable.  \n3. A deed restriction requiring removal of any applicable accessory structure or accessory dwelling \npursuant to Section 6.0014(B)(5) above upon transfer of ownership of either parcel. \n4. A site plan shall be provided showing the minimum density build-out of the leftover parcel(s). In \napplicable Pleasant Valley and Springwater sub-districts the site plan shall be per the approved, or \nsubmitted and approved, Master Plan. Site plans shall include the following: \na. For single detached dwelling and middle housing developments; \ni. A conceptual plot plan. \nii. Access and street layout, as applicable. \niii. Plan requirements of other applicable provisions of the Community Development Code. \nb. For all other uses, including but not limited to multifamily, commercial, mixed-use, and Special use \nReviews: \ni. A conceptual plot plan. \nii. Future uses. \niii. Building footprints. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "City of Gresham Development Code \n \n Article 6: Land Divisions \nSection 6.0000 Introductory Provisions (6/2022) \nPage 6.00-4 \niv. Parking areas. \nv. Access and street layout (as applicable). \nvi. Plan requirements of other applicable provisions of the Community Development Code. \nCONDOMINIUMS \n6.0020 CONDOMINIUMS  \nA. Condominium Review.  A request to create condominiums shall be reviewed under the Type II Procedure \nas part of the Design Review or Land Division process. \nB. Plat Approval for a Condominium. \n1. Upon approval by the Manager, the applicant shall submit all necessary documents and final plat \ncopies following the applicable requirements of Section 6.0400 of this document and applicable \nsections of ORS 94.550 to 94.785, ORS Chapter 100, and the platting requirements of ORS Chapter 92. \n2. Public improvements must comply with the standards of Appendix 5.000. \n3. Plat recording shall not occur until the County Recording Officer has received a written approval from \nthe Manager establishing compliance of the proposal with all applicable City of Gresham Development \nCodes.\n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.864442",
  "extractor_version": "1.0.0"
}