{
  "metadata": {
    "filename": "dc-section-5.0600.pdf_id7849",
    "extracted_at": "2025-05-22T06:15:22.733345",
    "num_pages": 4,
    "title": "DC Section 5.0600",
    "author": "patty boyden",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.1.149",
    "creation_date": "D:20220615154124-07'00'",
    "modification_date": "D:20220615154154-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[5.06]-1 \nCity of Gresham Development Code \n \n(06/22) \n \nSECTION 5.0600 \nGRESHAM BUTTE SCENIC VIEW OVERLAY DISTRICT \nGeneral \n5.0601  Purpose \n5.0602  Applicability  \nDevelopment Standards \n5.0603  Permitted Uses  \n5.0604  Restricted Development Types  \nAdditional Development Requirements  \n5.0605  Additional Standards in the Gresham Butte Scenic View Overlay District   \nMaps \n5.0610  Gresham Butte Scenic Overlay District Map   \n \nGeneral \n5.0601  Purpose   \nThe Gresham Butte Scenic View (GBSV) District is an overlay district designed to provide additional \nregulations that will help protect and enhance the scenic vista provided by the Butte. Contained in this section \nare special requirements for development within this area that will help to preserve the natural beauty of \nGresham Butte. \nDue to the impact of certain uses, allowed projections above maximum height, amateur radio antenna structures \nand the effects of artificial light on Gresham Butte, additional regulations apply. \n5.0602  Applicability \nThe boundaries of the GBSV Overlay District are shown on Map 5.0610. \n \nDevelopment Standards \n5.0603  Permitted Uses    \nThe uses permitted and standards applied generally are those of the Low Density Residential-5 District and the \nGresham Butte Plan District unless modified by this section. Unless otherwise amended by Section 5.0604 or \nSection 5.0605: \nA. \nThe permitted uses of Table 4.0120 under LDR-5 apply for those properties with an underlying LDR-5 \nDistrict. \nB. \nThe permitted uses in Section 4.1310 apply for those properties designated Gresham Butte Plan District. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[5.06]-2 \nCity of Gresham Development Code \n \n(06/22) \n \n5.0604  Restricted Development Types    \nThe following development types are restricted in the GBSV District as follows: \nA. \nThe following uses are prohibited: \n1. \nNew Cemeteries \n2. \nElementary Schools \n3. \nMiddle Schools \n4. \nTelephone Switching Stations/Telecommunication Facilities \n5. \nNew Water Storage Facilities \n6. \nMajor Stormwater Treatment Facilities \n7. \nSubstations \n8. \nTriplexes \n9. \nQuadplexes \n10. \nTownhouses \n11. \nCottage Clusters \nB. \nThe following Special Use Review is required to be reviewed through the Type III process and is \nsubject to the requirements in Section 8.0140: \n1. \nWireless Communication Facilities \nC. \nThe following Special Use Review is required to be reviewed through the Type II process under Section \n8.0110: \n1. \nReplacement Water Storage Facilities meeting the underlying district height requirements. \nD. \nThe following Special Use Review is required to be reviewed under the standards outlined in Section \n8.0110 and the Type III Major Variance criteria set forth in Section 10.1530. \n1. \nReplacement Water Storage Facilities exceeding the underlying district height requirements. The \nhearing body is the Planning Commission. \n \nAdditional Development Requirements \n5.0605  Additional Standards for the GBSV District    \nThe Site Development Requirements of LDR-5 and the Gresham Butte Plan District shall apply unless modified \nby this section. These additional requirements have been included to help protect the scenic and aesthetic views \nprovided by the Butte. \nA. \nThe following regulations are designed to minimize the effect of tall structures on the scenic resource: \n1. \nAll variances to maximum height shall be reviewed under the Type III procedures and under the \ncriteria in Section 10.1530. \n2. \nResidential adjustments to height allowed by Section 10.1521.B.3 are prohibited in the GBSV \nDistrict. \n3. \nAdditional regulations regarding the height of and process required for the placement of Amateur \nRadio Antennas in the GBSV as found in Section 10.1011 shall apply. \n4. \nProjections above maximum height as allowed by Section 9.0901 shall be required to be reviewed \nunder the Type II process and meet the criteria of Section 10.1510 or demonstrate the need for \nsuch projections as part of a Special Use Review as found in Section 8.0100. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[5.06]-3 \nCity of Gresham Development Code \n \n(06/22) \n \nB. \nThe following regulations are designed to help ensure that developments are complementary to the \nscenic nature of Gresham Butte. These regulations apply to all structures including but not limited to \nsingle detached dwellings and accessory structures: \n1. \nAll exterior lighting must be directed downward, hooded and shielded by opaque materials. The \nlight bulb shall not be visible from adjacent properties. The use of lower wattage lights is \nencouraged. Exceptions are: \na. \nStreet lighting necessary for safety purposes, \nb. \nLighting required by emergency response agencies, \nc. \nLighting fixtures required by the Federal Communication Commission, the Federal \nAviation Administration, the Federal Occupational Safety and Health Administrations or \nother federal, state, county or municipal agencies, \nd. \nLandscape lighting aimed away from adjacent properties that is contained by an \noverhanging architectural element or evergreen landscaping such that light is not directed \nto the night sky, \ne. \nResidential decorative low wattage lighting used for yards and driveways that do not \nshine glare, emit illumination or cast a shadow onto adjoining properties, \nf. \nLighting required to illuminate the flag of the United States of America. Such lighting \nmust be shielded and not visible off of the property. \n2. \nColors used for all structures are encouraged to be dark earth tones that are present in the \nlandscape at or near the proposed structures. Dark earth tone colors recommended are browns, \ntans, greens and grays that should be as dark or darker than the surrounding area. \n3. \nReflective materials (including, but not limited to mirrored glass, aluminum and smooth metals) \nare discouraged. The maximum reflectivity of glass is encouraged to be no more than 20%. \nPainted structures are encouraged to be of an eggshell or flat finish. \n \n \n \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[5.06]-4 \nCity of Gresham Development Code \n \n(06/22) \n \nMaps \nMap 5.0610  Gresham Butte Scenic Overlay District Map    \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:22.733869",
  "extractor_version": "1.0.0"
}