{
  "metadata": {
    "filename": "dc-section-11.1100.pdf_id7897",
    "extracted_at": "2025-05-22T06:15:20.731984",
    "num_pages": 4,
    "title": "DC Section 11.1100",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.39",
    "creation_date": "D:20241015162754-07'00'",
    "modification_date": "D:20241018132837-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[11.11]-1 \nCity of Gresham Development Code \n \n(07/24) \nSECTION 11.1100 \nAPPEALS \n11.1100  Appeals \n11.1101  General \n11.1102  Notice of Appeal \n11.1103  General Procedures Applicable to All Appeals \n11.1104  Specific Provisions for Appeals of a Type I Decision \n11.1105  Specific Provisions for Appeal of a Type II Decision \n11.1106  Specific Provisions for Appeal of a Type III Decision \n11.1107   Remand from the Land Use Board of Appeals \n \n11.1100 \nAppeals \n11.1101  General  \nA decision on the issuance of a Type I, II or III development permit may be appealed by an affected party by \nfiling a Notice of Appeal with the Manager within twelve (12) calendar days of the date on the written Notice of \nDecision, or, in the case of weekends and holidays, by the end of the next business day.  Table 11.0204 \nidentifies the decision authority and appeal authority for each application type.  \n11.1102  Notice of Appeal  \nA. \nA notice of appeal shall contain:  \n1. \nIdentification of the decision sought to be reviewed, including the date of the decision.  \n2. \nStatement of the appellant documenting that they were a party to the initial proceedings.  \n3. \nDetailed statement of the decision that is being appealed and a statement regarding the basis of \nthe appeal, including what approval criteria were improperly evaluated or applied to the decision.  \nB. \nThe notice of appeal shall be filed with the Manager, together with the filing fee.  \nC. \nTimely filing of the notice of appeal and filing fee are jurisdictional acts.  If these items are not filed \nwithin the time period as provided for in Section 11.1101, or if the notice of appeal does not contain the \nrequired content items specified in Section 11.1102(A), the notice of appeal shall not be accepted by the \nManager.  A decision by the Manager to not accept an appeal within the specified appeal period shall be \nconsidered final.  \n11.1103  General Procedures Applicable to All Appeals \nA. \nPublic Hearing.  Appeal hearings before the appropriate appeal authority as specified in Table 11.0204 \nshall be conducted in accordance with the public hearing provisions in Section 11.1000 of this code.   \nB. \nStaff Report.  Not less than 7 days before the date of the appeal hearing, the Manager shall prepare and \nmake available to the public a copy of the staff report regarding the appeal.  A copy of the staff report \nand recommendation shall be provided to the appeal authority, the applicant and to the appellant.  The \nManager shall provide a copy of the staff report to the public at reasonable cost upon request.  \nC. \nAction of Appeal Authority.  At the conclusion of the hearing on the appeal, the appeal authority shall \ntake one of the following actions:  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[11.11]-2 \nCity of Gresham Development Code \n \n(07/24) \n1. \nContinue the hearing to a date, time, and location certain, which shall be announced by the \npresiding officer.  Notice of the date, time, and location certain of the continued hearing is not \nrequired to be mailed, published, or posted, unless the hearing is continued without announcing a \ndate, time and location certain, in which case notice of the continued hearing shall be given as \nthough it was the initial hearing.  \n2. \nReverse or affirm the decision under appeal, with or without conditions or changes.  \n3. \nProvisions for holding a record open or continuing a hearing set forth in ORS 197.763 shall apply \nunder this Code in a manner consistent with state law.  \nD. \nWritten Decision of Appeal Authority.  After the public record on the appeal closes, a written decision \nregarding the application shall be prepared and contain the following:  \n1. \nA statement of the facts that the appeal authority has relied on which demonstrate the decision \nunder appeal is reversed or affirmed based on the criteria relevant to the appeal.  \n2. \nA statement of conclusions based on the findings.  \n3. \nIf the appeal authority changes conditions of approval, changes denial to approval, changes denial \nto approval subject to conditions, or changes approval to denial, the written decision shall include \nfindings explaining the basis for such change.  \n4. \nWithin approximately 14 days from the date that the appeal authority adopts a decision on the \nappeal, the Manager shall cause the decision to be signed, dated, and mailed to the appellant and \nother persons who appeared orally or in writing before the public record closed.   \n11.1104  Specific Provisions for Appeal of a Type I Decision   \nA. \nA Type I decision may only be appealed by the applicant, who is the property owner or the property \nowner’s representative.   \nB. \nThe Manager shall mail written notice of the appeal hearing to the applicant/appellant not less than 20 \ndays prior to the appeal hearing. The appeal shall be posted on the subject property. \nC. \nThe appeal hearing shall be de novo, which means new evidence and argument can be introduced in \nwriting, orally, or both.    \nD. \nThe scope of the appeal hearing shall be focused on the specific approval criteria, condition, or both \nbeing appealed, and reasons why a finding, condition, or both is or is not in error as a matter of fact, law \nor both.  \nE. \nThe decision of the designated appeal authority for appeals of Type I decisions shall be the final local \ndecision.  \n11.1105  Specific Provisions for Appeal of a Type II Decision   \nA. \nA Type II decision may be appealed by the applicant or by any other person who submitted written \ncomments prior to the decision of the Manager. \nB. \nThe Manager shall mail written notice of the appeal hearing to the parties listed in Section 11.1105(A) \nnot less than 20 days prior to the appeal hearing. The appeal shall be posted on the subject property. \nC. \nThe appeal hearing shall be de novo, which means new evidence and argument can be introduced in \nwriting, orally, or both.  \nD. \nThe decision of the designated appeal body for appeals of Type II decisions shall be the final local \ndecision.  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[11.11]-3 \nCity of Gresham Development Code \n \n(07/24) \n \n11.1106  Specific Provisions for Appeal of a Type III Decision   \nA. \nA Type III decision may be appealed only by the applicant or any other person who participated by \nproviding either oral or written evidence on the record leading to the decision by the decision authority.  \nB. \nThe Manager shall mail written notice of the appeal hearing to the parties listed in Section 11.1106(A) \nnot less than 20 days prior to the appeal hearing.  The appeal shall be posted on the subject property. \nC. \nThe scope of review for an appeal of a Type III decision shall be a review of the record with the right of \nargument.  \nD. \nThe record shall include:  \n1. \nA factual report prepared by the Manager.  \n2. \nAll exhibits, materials, pleadings, memoranda, stipulations, and motions submitted by any party \nand reviewed or considered in reaching the decision under review.  \n3. \nThe transcript of the hearing and a detailed summary of the evidence.  \nE. \nThe decision of the designated appeal authority for the appeal of a Type III decision shall be the final \nlocal decision.  \nF. \n \n1. \nThe City Council may, by the process described in 11.1106.F.2, initiate a hearing as a “Council \nReview” of a Type III Decision made by the designated Decision Authority as identified in Table \n11.0204. City Council may take this action both where City Council is the designated “Appeal \nAuthority” indicated under 11.0204, and where City Council would be taking the place of another \nAppeal Authority. Where City Council is the “Decision Authority” or there is no available local \nappeal, City Council may not initiate Council Review.  \n2. \nThe Council Type III Review process is initiated by the following procedures. The requirements \nof Section 11.1101 and 11.1102, Notice of Appeal, do not apply. \na. \nAn individual City Councilor or the Mayor shall notify the City Manager or their \ndesignee of the intent to initiate a Council Review process within twelve (12) calendar \ndays of the written Notice of Decision, or, in the case of weekends and holidays, by the \nend of the next business day. Staff shall begin the process of scheduling a tentative \nCouncil Review hearing, pending confirmation by majority vote of City Council to \nproceed with the Council Review hearing as described in Section (b) below. \nb. \nThe City Council shall then hold a vote at the next available City Council meeting after \nthe individual initiation described, and before the tentative hearing date. Majority vote \nshall be required to confirm the decision to proceed with the Council Review.  \nc. \nIf the majority of City Council does not vote to proceed with Council Review, the \ntentatively scheduled hearing will be canceled. Unless a separate Notice of Appeal has \nbeen accepted per Section 11.1101 and 11.1102, the decision will be final. If a separate \nNotice of Appeal has been accepted, the appeal hearing shall be held with City Council \nas the Appeal Authority.  \n3. \nA Council Review hearing shall be a review of the record with the right of argument and \nproceed under the appeal procedures of Sections 11.1103 and 11.1106, with City Council acting \nas the Appeal Authority. Only those parties that presented testimony on the record of the initial \nType III hearing may participate. No new evidence is permitted; however, new legal argument \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[11.11]-4 \nCity of Gresham Development Code \n \n(07/24) \nis permitted. Testimony and/or argument is permitted in writing or orally, by those that are \nparties to the evidentiary hearing record. The decision of City Council as part of the Council \nReview hearing shall be the final local decision. Any further appeal shall be to the Land Use \nBoard of Appeals (LUBA).   \n4. \nIn the even that a separate Notice of Appeal is filed where City Council votes to initiate a \nCouncil Review, the City Council will take the place of any other Appeal Authority designated \nin Table 11.0204. Other appellants who have filed in a timely Notice of Appeal may still \nparticipate as appellants in the hearing process and retain the same rights to participate and \nreceive notice as otherwise indicated in Article 11. \n11.1107  Remand from the Land Use Board of Appeals  \nCity of Gresham decisions remanded by the Land Use Board of Appeals (LUBA) shall be heard and decided \nwithin 90 calendar days from the date of the remand following the procedures of Section 11.1100. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.732197",
  "extractor_version": "1.0.0"
}