{
  "metadata": {
    "filename": "dc-section-4.0300.pdf_id7835",
    "extracted_at": "2025-05-22T06:15:25.374675",
    "num_pages": 10,
    "title": "DC Section 4.0300",
    "author": "City Staff",
    "creator": "Acrobat PDFMaker 22 for Word",
    "producer": "Adobe PDF Library 22.3.58",
    "creation_date": "D:20230105095738-08'00'",
    "modification_date": "D:20230105095801-08'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[4.03]-1 \nCity of Gresham Development Code \n \n(01/19) \nSECTION 4.0300  \nINDUSTRIAL LAND USE DISTRICTS \nGeneral Provisions \n4.0301  Purpose  \nIndustrial Land Use Districts Characteristics \n4.0310  Heavy Industrial (HI) \n4.0311  General Industrial (GI) \nPermitted Uses \n4.0320  Permitted Uses \nDevelopment Standards \n4.0330  Development Standards Table \n4.0331  Additional Industrial District Standards \n4.0332  Solar Energy Standards for Industrial Districts \n4.0333  Wind Energy Standards for Industrial Districts \n4.0334  Biomass Energy Standards for Industrial Districts \n4.0335  Geothermal Energy Standards for Industrial Districts \n4.0336  Micro-Hydro Energy Standards for Industrial Districts \n4.0341  Stormwater Green Development Practices \nGeneral Provisions \n4.0301  Purpose   \nThis section of the Community Development Code implements Section 10.313 - Industrial Land Use \nwithin Volume 2 of the Comprehensive Plan.  The purposes of the Industrial Land Use Districts are to: \n(1) implement the Comprehensive Plan’s goals, policies, and action measures to promote economic \ndevelopment (2) include provisions to support viable industrial trends; and, (3) provide clear and \nobjective standards so that implementation of the Industrial Land Use Districts is efficient, effective, and \nfair.   \nCharacteristics \n4.0310  Heavy Industrial (HI) \nThe Heavy Industrial District (HI) is intended to provide space for industrial users that may include \noperational characteristics that could create compatibility issues for adjacent land uses (such as noise \nand/or air emissions).  This district also permits certain uses from the General Industrial District. \n4.0311  General Industrial (GI) \nThe General Industrial District (GI) is primarily intended to provide space for a wide range of industrial \nuses, related enterprises serving primarily industrial clients, and employment oriented uses in office-type  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[4.03]-2 \nCity of Gresham Development Code \n \n(01/19) \nbuildings.  Primary uses shall include manufacturing and associated industrial uses, knowledge-based \nindustries (graphic communications, creative services, and information technology), research and \ndevelopment facilities, professional services primarily serving industrial and business clients and other \nindustry focused uses and limited retail and commercial professional services that cater to the general \npublic.   \nPermitted Uses \n4.0320  Permitted Uses \nTable 4.0320 lists those uses that are permitted in each Industrial District.   \n• \nP = Permitted use \n• \nL = Use is permitted, but is limited in the extent to which it may be permitted \n• \nNP = Use not permitted \n• \nSUR = Use permitted subject to a Special Use Review \nEach of these uses must comply with the land use district standards of this section and all other applicable \nrequirements of the Community Development Code. \n \nTable 4.0320:  Permitted Uses in the Industrial Land Use Districts \nUSES  \nHI \nGI \nRESIDENTIAL \nSingle Detached Dwelling \nNP \nNP \nDuplex \nNP \nNP \nTriplex \nNP \nNP \nQuadplex \nNP \nNP \nTownhouse \nNP  \nNP \nCottage Cluster \nNP \nNP \nMultifamily \nNP \nNP \nElderly Housing \nNP \nNP \nManufactured Dwelling Park \nNP \nNP \nResidential Facility \nNP \nNP \nResidential Home \nNP \nNP \nAffordable Housing \nNP \nP1 \nCOMMERCIAL \nAuto-Dependent Use \nNP \nNP \nBusiness and Retail Service and Trade  \nL2 \nL2 \nClinics \nL2 \nL2 \nCommercial Parking \nNP \nNP \nDaycare Facilities \nSUR \nSUR \nLive-Work \nNP \nNP \nMajor Event Entertainment \nSUR \nSUR \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[4.03]-3 \nCity of Gresham Development Code \n \n(01/19) \nUSES  \nHI \nGI \nMini-Storage Facilities \nNP \nNP \nOutdoor Commercial \nNP \nNP \nINDUSTRIAL \nConstruction \nP \nP \nExclusive Heavy Industrial Uses \nP \nNP \nIndustrial Office \nL3 \nP \nInformation Services \nNP \nP \nManufacturing \nP \nP \nMiscellaneous Industrial \nP \nL4 \nTrade Schools \nNP \nP \nTransportation/Distribution \nP \nP \nWarehousing/Storage \nP \nP \nWaste Management \nP/SUR5 \nP/SUR5 \nWholesale Trade \nNP \nP \nINSTITUTIONAL USES \nCivic Uses \nSUR \nSUR \nCommunity Services \nL/SUR6 \nL/SUR6 \nMedical \nNP \nNP \nParks, Open Spaces and Trails \nL/SUR7 \nL/SUR7 \nReligious Institutions \nL/SUR8 \nL/SUR8 \nSchools \nL/SUR8 \nL/SUR8 \nRENEABLE ENERGY9 \nSolar Energy Systems \nP10 \nP10 \nWind Energy Systems \nL/SUR11 \nL/SUR11 \nBiomass Energy Systems \nL/SUR12 \nL/SUR12 \nGeothermal Energy Systems \nP13 \nP13 \nHydro-Micro Energy Systems \nL14 \nL14 \nOTHER \nBasic Utilities \n  Minor basic utilities \n  Major basic utilities \n \nP \nSUR \n \nP \nSUR \nHeliports \nSUR \nSUR \nWireless Communication Facilities \nSUR \nSUR \nTemporary, Intermittent & Interim Uses \nP \nP \nMarijuana Businesses \nL15 \nL15 \nNotes: \n1. \nAffordable housing development is permitted: \na. \nOn property owned by a public body, and adjacent to property where residential or school uses are \npermitted, or \nb. \nWhen an applicant demonstrates that the title for the parcel(s) where the facility is to be developed was held \nby the governing body for the applicant as of April 2, 2009. See Section 10.1700. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[4.03]-4 \nCity of Gresham Development Code \n \n(01/19) \n2. \nThis includes the sale of goods and materials and of professional services to the general public. Examples include \nrestaurants, stores, mini-marts, factory outlet stores and office supplies. Examples of professional services that cater to \ndaily general public customers include bank branches, financial, insurance, real estate, legal, medical and dental \noffices.   \n In order to ensure that these uses are primarily intended to serve the needs of workers in the immediate area the \nfollowing standards apply: \n  The total gross leasable square footage shall not exceed 3,000 square feet per use and shall not exceed 5,000 square \nfeet cumulative gross leasable square footage within the same development project. For the purposes of this section, a \ndevelopment project is: a) a single building with less than 50,000 square feet of gross floor area that does not share \ncommon development features (such as access, parking, or utilities) with another building that has less than 50,000 \nsquare feet of gross floor area, whether or not the second building is located on the same or a different parcel or lot; or b) \nmore than one building with less than 50,000 square feet of gross floor area that shares common development features \n(such as access, parking, or utilities) with another building that has less than 50,000 square feet of gross floor area, \nwhether or not the buildings are located on the same or a different parcel or lot; or c) a single building with 50,000 square \nfeet or more of gross floor area. \n  Shall not be permitted in a stand-alone building and instead be included within a building whose primary purpose is for \nan industrial use. \n3. \nOnly administrative offices which are related to the operation of the industrial use of the property are permitted in the \nHI. Up to 20% of the total floor area may consist of these administrative offices. Multiple tenant office buildings are \nprohibited. \n4. \nAuto and truck salvaging and wrecking are not permitted in GI. All other miscellaneous industrial uses located adjacent \nto properties that are residentially designated land shall be located at least 100 feet from the residential property.  \n5. \nWaste Management uses are permitted uses, except for solid waste transfer station, composting facilities, and landfills, \nwhich are subject to a Special Use Review.  When located in the GI, waste management uses adjacent to residentially \ndesignated land shall be located at least 100 feet from the residential property. \n6. \nThe following Community Service Uses are not permitted in the HI and GI districts: adult or senior centers, drug and \nalcohol treatment facilities, cemeteries, and mausoleums. \n7. \nThe following Parks, Open Spaces, and Trails are not permitted in the HI and GI districts: public urban plazas, public \nneighborhood parks, public community parks, and golf courses.  However, public urban plazas, public neighborhood \nparks, and public community parks are permitted in the HI and GI districts when an applicant demonstrates that title for \nthe parcel(s) where the facility is to be developed was held by the governing body for the applicant as of April 2, 2009. \n8. \nReligious institutions, elementary schools, middle schools and high schools are permitted in the HI and GI districts \nwhen an applicant demonstrates that title for the parcel(s) where the facility is to be developed was held by the \ngoverning body for the applicant as of April 2, 2009. \n9. \nSee Section 10.900 for additional standards that apply. \n10. For limitations, see Section 4.0332 Solar Energy System Standards for Industrial Districts. \n11. For limitations, see Section 4.0333 Wind Energy System Standards for Industrial Districts. \n12. For limitations, see Section 4.0334 Biomass Energy System Standards for Industrial Districts. \n13. For limitations, see Section 4.0335 Geothermal Energy System Standards for Industrial Districts. \n14. For limitations, see Section 4.0336 Micro-Hydro Energy System Standards for Industrial Districts. \n15. For limitations, see GRC 9.63.090. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[4.03]-5 \nCity of Gresham Development Code \n \n(01/19) \nDevelopment Standards \n4.0330  Development Standards Table \nTable 4.0330 summarizes development standards which apply within the Industrial Land Use Districts. \nThe standards contained in this table are supplemented by the referenced subsections and footnotes, \nwhich provide additional clarification and guidance.   \nTable 4.0330 Development Standards for the Heavy Industrial and General \nIndustrial Districts \n \nHI \nGI \nA. Minimum Lot Size  \nNone: See Section \n4.0331(A) \nNone: See Section \n4.0331(A) \nB. Minimum Average Floor Area Ratio (FAR) \nNone \nNone \nC. Minimum Building Setbacks \n20 feet front & street side; 0 \nfeet for  interior side and rear \n20 feet front & street side; 0 \nfeet for  interior side and rear \nD. Minimum Building Height  \nNone \nNone \nE. Maximum Building Height  \nNone \nNone \nF. Height Transition Standards \nSee Section 9.0600 \nSee Section 9.0600 \nG. Minimum Off-Street Parking Required \nSee Section 9.0851 \nSee Section 9.0851 \nH. Maximum Off-Street Parking  \nSee Section 9.0851 \nSee Section 9.0851 \nI. Pedestrian Circulation and Standards  \nSee Section 7.0320 \nSee Section 7.0320 \nJ. Screening & Buffering  \nSee Section 9.0100 \nSee Section 9.0100 \nK. Landscaping  \nSee Section 7.0320 \nSee Section 7.0320 \nL. Outdoor Uses and Outdoor Storage Uses \nYes; 100% of the site area \nmay include outdoor uses \nand outdoor storage \nassociated with industrial \nuses.  Screening required, \nsee Sections 4.0331(B) and \n9.0100 \nYes; no more than 50% of \nthe site area may include \noutdoor uses and storage \nassociated with industrial \nuses.  Screening required, \nsee Sections 4.0331(B) and \n9.0100 \nM. Parking, Loading and Unloading Area \nStandards \nSee Section 4.0331(C) and \n9.0800 \nSee Section 4.0331(C) and \n9.0800 \nN. External Effects \nSee Section 4.0331(D) \nSee Section 4.0331(D) \nO. Mechanical Equipment Screening \nSee Section 4.0331(E) \nSee Section 4.0331(E) \nP. Exterior Building Treatment \nSee Section 4.0331(F) \nSee Section 4.0331(F) \nQ. Well Field Protection \nSee Section 4.0331(G) \nSee Section 4.0331(G) \nR. Public Facility Site and Supplementary \nRequirements \nSee Section 4.0331(H) \nSee Section 4.0331(H) \nS. Stormwater Management \nSee Section 4.0341  \nSee Section 4.0341 \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[4.03]-6 \nCity of Gresham Development Code \n \n(01/19) \n4.0331  Additional Industrial Land Use District Standards \nA. \nLot Area.  Division of lots or parcels are permitted as follows: \n1. \nLots or parcels 50 acres or smaller may be divided into any number of smaller lots or \nparcels. \n2. \nUndeveloped lots, parcels, or tracts larger than 50 acres in size may be divided into smaller \nlots, parcels, or tracts so long as the resulting land division yields at least one lot, parcel, or \ntract of at least 50 acres in size.  If a land division results in more than one lot, parcel, or \ntract of 50 acres or greater in size, only one of those 50+ acre lots, parcels, or tracts, if \nfurther divided, must yield a lot, parcel, or tract of at least 50 acres in size. \n3. \nDevelopment lots or parcels 50 acres or larger in size may be divided into any number of \nsmaller lots or parcels pursuant to a master plan approved by the city so long as at least 40 \npercent of the net area or the lot or parcel has already been developed with industrial uses \nor uses accessory to industrial uses, and no portion of the lot is developed, or proposed to \nbe developed, with uses considered Business and Retail Service and Trade. \n4. \nNotwithstanding parts (2) and (3) of this subsection, any lot or parcel may be divided into \nsmaller lots or parcels or made subject to right-of-ways for the following purposes: \na. \nTo provide public facilities and services; \nb. \nTo separate a portion of a lot or parcel in order to protect a natural resource, to \nprovide a public amenity, or to implement a remediation plan for a site identified \nby the Oregon Department of Environmental Quality pursuant to ORS 465.225: \nc. \nTo separate a portion of a lot or parcel containing a nonconforming use from the \nremainder of the lot or parcel in order to render the remainder more practical for \na permitted use; or \nd. \nTo allow the creation of a lot for financing purposes when the created lot is part \nof a master planned development. \nB. \nOutdoor Uses to be Screened \n1. \nAll outdoor storage uses shall be screened from adjacent properties by a six foot high sight-\nobscuring fence or wall. \n2. \nAll screened or walled outdoor use and storage areas which abut a public street shall be set \nback a minimum of 25 feet from the property line(s).  Within that setback area trees and \nevergreen shrubs shall be planted.  The plants shall be of such a variety and arranged so as \nto allow only minimum gaps between foliage of mature trees and plants within four years \nof planting. \n3. \nAlternate plan:  an applicant may propose a reduction in the minimum setback required in \n(2) above to a minimum of at least 20 feet by providing a detailed plan with specifications \nfor landscaping and screening, including plantings, fences, walls, walks, berms and other \nfeatures designed to afford the degree of the desired screening.  The manager may approve \nan alternative plan if proposed buffering and screening makes up for the lack of horizontal \ndistance and the result minimizes any impact that the storage has to the public street.   \nC. \nParking, Loading and Unloading Areas  \n1. \nParking, loading and unloading areas shall not be located within the required setback. \n2. \nNo loading or unloading facilities shall be located adjacent to lands designated for  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[4.03]-7 \nCity of Gresham Development Code \n \n(01/19) \n \nresidential uses or parks if there is an alternative location of adequate size adjacent to \ncommercial, industrial or other institutional uses. \nD. \nExternal Effects \n1. \nIn the GI district, the emission of air pollutants or odorous gasses and changes in \ntemperature detectable by the human senses without the aid of instruments at any point \nbeyond the property line is prohibited. \n2. \nIn both the HI and GI districts, electrical disturbances which interfere with the normal \noperation of equipment or instruments on adjacent properties are prohibited. \n3. \nIn the GI district, except for exterior lighting, operations producing heat or glare shall be \nconducted entirely within an enclosed building. \n4. \nIn the GI district, loud, unnecessary, or unusual noise which endangers health, peace or \nsafety is prohibited. \n5. \nPrior to the City taking any action on a Type I, Type II or Type III land use application or \non issuance of certificate of occupancy information sufficient to determine the degree of \ncompliance shall be furnished by the applicant.  Such request may include continuous \nrecords of operations, for periodic checks to ensure maintenance of standards, or for special \nsurveys. \nE. \nMechanical Equipment  \nRoof mounted mechanical equipment such as ventilators and ducts for buildings located adjacent \nto residential districts, major arterial or standard arterial streets or transit streets shall be contained \nwithin a completely enclosed structure that may include louvers, latticework, etc.  Screening shall \nobscure mechanical equipment at elevation. \nF. \nExterior Building Treatment in the GI District \nIn the GI District, unfinished metal structure siding shall not be the major (over 50%) exterior \nmaterial.  Materials such as finished metal, wood, tilt-up concrete, masonry or glass should be the \nprimary structural siding materials. \nG. \nWell Field Protection \nIndustrial and commercial development may be subject to the provisions of Gresham Revised \nCode Article 5.75 Well Field Protection. \nH. \nPublic Facility Site and Supplementary Requirements  \nAll developments shall also be subject to the applicable requirements of Sections 4.0320 and \n4.0341; Article 9 – Common Requirements and Appendix 5.000 - Public Facilities. \n4.0332  Solar Energy Standards for Industrial Districts  \nSolar energy systems are limited in all industrial districts as follows: \nA. \nScale. Small, medium and large scale solar energy systems are permitted. \nB. \nType.  Roof-top, flat-roof, integrated and ground-mounted solar energy systems are permitted. \nC. \nHeight. The following limitations on maximum height apply to all solar energy systems: \n1. \nRoof-top, Flat-roof and Integrated. The solar energy systems on frames shall not exceed 10 \nfeet above the roof height on which the system is installed. \n2. \nGround-mounted. Ground-mounted solar energy systems shall not exceed 20 feet in height. \n \nD. \nSetbacks and Yards. Solar energy systems are not allowed in the required front or street-side \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[4.03]-8 \nCity of Gresham Development Code \n \n(01/19) \nsetbacks. \n4.0333  Wind Energy Standards for Industrial Districts \nWind energy systems are limited in all industrial districts as follows: \nA. \nScale. Small, medium and large scale wind energy systems are permitted. Large scale systems \nrequire a Special Use Review when the system is: \n1. \nLocated on a building or on a site that is a historic, cultural or archeological resource; or  \n2. \nLocated adjacent to residentially designated lands.  \nB. \nType.  Roof-top and ground-mounted wind energy systems are permitted. \nC. \nHeight.  The following limitations on maximum height apply to all wind energy systems: \n1. \nRoof-top.  Wind energy system height shall not exceed a value equal to 45 feet above the \nroof top.  \n2. \nGround-mounted.  Ground-mounted wind energy systems shall not exceed 110 feet in \nheight.  \nD. \nSetbacks and Yards.  Wind energy systems are not allowed in the required front, street-side, side \nor rear setbacks. \n4.0334  Biomass Energy Standards for Industrial Districts \nBiomass energy systems are limited in all industrial districts as follows:  \nA. \nScale.  Small scale biomass energy systems are permitted. Large scale systems are permitted with \na Special Use Review. \nB. \nType.  Non-hazardous biomass systems are permitted. \nC. \nHeight.  Biomass energy systems shall not exceed the maximum district height limits. \nD. \nSetbacks and Yards.  Biomass energy systems are not allowed in the required front, street-side, \nside or rear setbacks. \n4.0335  Geothermal Energy Standards for Industrial Districts \nGeothermal energy systems are limited in all commercial districts as follows: \nA. \nScale.  Small or large scale geothermal energy systems are permitted.  \nB. \nType.  Closed-loop geothermal energy systems that are not in any well field protection areas are \npermitted. \nC. \nHeight.  Geothermal energy systems shall not exceed the maximum district height limits. \nD. \nSetbacks and Yards.  Geothermal energy systems are not allowed in the required front, street-\nside, side or rear setbacks, except that small geothermal heating and cooling units like heat pumps \ncan project into the setbacks per Section 9.0900 Projections. \n4.0336  Micro-Hydro Energy Standards for Industrial Districts \nMicro-hydro energy systems are limited in all industrial districts as follows: \nA. \nScale.  Small scale micro-hydro energy systems are permitted. \nB. \nType.  In-pipe micro-hydro energy systems such as systems within water, stormwater or \nwastewater pipe are permitted. \nC. \nHeight.  Generally the district height limits apply. However, in-pipe systems may exceed the \ndistrict height limit as allowed for mechanical equipment. If supplemental equipment structures \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n[4.03]-9 \nCity of Gresham Development Code \n \n(01/19) \naccompany the in-pipe systems, then the district height limit would apply.  \nD. \nSetbacks and Yards.  Micro-hydro energy systems contained within piping are allowed and pipe \ncan run within the required setbacks. However, if supplemental equipment structures accompany \nthe in-pipe systems, then the district setback limits apply. \n4.0341  Green Development Practices for Stormwater Management \nThe City requires prioritization of Green Development Practices, such as rain gardens, stormwater \nplanters, ecoroofs, and porous pavement to manage stormwater runoff as close as possible to its source \nand use natural processes such as retention, infiltration, and evapotranspiration to treat and reduce the \nvolume of stormwater runoff that drains into downstream water bodies.  The implementation of Green \nDevelopment Practices detailed in the Stormwater Management Manual will minimize local and \ndownstream flooding, improve water quality, and protect aquatic habitat to the maximum extent \npracticable. \nA. \nStormwater runoff from new or redevelopment shall be managed on-site with Green \nDevelopment Practices and Green Streets to the maximum extent practicable. Green \nDevelopment Practices shall be designed in accordance with the requirements set forth in the \nStormwater Management Manual and Green Streets shall be designed in accordance with the \nPublic Works Standards.  \nB. \nSubmittal Requirements Prior to Tentative Land Division or Site Design Approval.  Prior to \ntentative land division or site design approval, applicants for new or redevelopment must submit a \nstormwater report with the development permit application. The stormwater report shall contain \nthe information required by the Stormwater Management Manual to demonstrate the development \nis consistent with this section. \nC. \nSubmittal Requirements Prior to Building Permit Approval.  Prior to building permit approval, \napplicants for development on private property must meet submittal requirements as specified in \nthe Stormwater Management Manual.  \nD. \nParking lot landscaping may be used as Green Development Practice for parking lots, if designed \nas provided by the Stormwater Management Manual. \n1. \nPurpose: This section is enacted with the purpose of achieving multiple functions from \nparking lot landscaping by using it for on-site stormwater management. \n2. \nAppropriate designs are contained in the Stormwater Management Manual.  \n3. \nLandscaping for stormwater management within parking lots will count towards total \npercentage of landscaping required on site. \nE. \nAfter management in Green Development Practices, excess stormwater from private property \nshall be conveyed to an approved discharge point. \nF. \nA grading or building permit may not be issued for a property until a stormwater report has been \napproved that meets the requirements listed in the Stormwater Management Manual. \nG. \nOperations and maintenance requirements.  The property owner, or its successors or assigns, shall \nadequately maintain the on-site Green Development Practices according to guidelines in the \nStormwater Management Manual and/or contained in a recorded operations and maintenance \nagreement. \nH. \nLandscaping \n1. \nLandscaping shall provide multiple purposes, whenever possible, including: protecting and \nenhancing water quality and aquatic habitat by providing for the infiltration, storage, and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": " \n[4.03]-10 \nCity of Gresham Development Code \n \n(01/19) \ntreatment of surface water runoff. \n2. \nLandscaping for stormwater management will count towards total percentage of \nlandscaping required on site and for parking lots.  \n3. \nDetailed landscaping requirements for Green Development Practices are included in the \nStormwater Management Manual.  \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.375405",
  "extractor_version": "1.0.0"
}