{
  "metadata": {
    "filename": "dc-section-10.1400.pdf_id7884",
    "extracted_at": "2025-05-22T06:15:20.661934",
    "num_pages": 16,
    "title": "DC Section 10.1400",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615200006-07'00'",
    "modification_date": "D:20220615200023-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[10.14]-1 \nCity of Gresham Development Code \n \n(06/22) \nSECTION 10.1400 \nTEMPORARY, INTERMITTENT AND INTERIM USES \nGeneral \n10.1401  Temporary Uses  \n10.1402  Intermittent Uses  \n10.1403  Interim Uses  \nPermitted Uses \n10.1420  Permitted Temporary, Intermittent and Interim Uses \nDevelopment Standards \n10.1430  Standards and Review Processes \n10.1431  Standards for All Temporary, Intermittent and Interim Uses   \n10.1432  Temporary Uses – Time Between Permits   \n10.1440  Additional Standards for Temporary Uses \n10.1450 Additional Standards for Intermittent Uses \n10.1460 Additional Standards for Interim Uses   \nGeneral \nThis section applies to Temporary, Intermittent and Interim Uses.  \n10.1401 Temporary Uses \nTemporary uses are characterized by their short-term or seasonal nature.  \n10.1402 Intermittent Uses \nIntermittent uses are characterized by their short-term or seasonal nature, although they occupy a site \noccasionally rather than continuously.  \n10.1403 Interim Uses \nInterim uses can be seasonal or long-term uses that can occupy the site continuously on an interim basis until the \nsite is developed more intensely or with permanent structures/uses.  \nDefinitions for Temporary, Intermittent and Interim Uses are found in Article 3, Section 3.0160. \nPermitted Uses \n10.1420 Permitted Temporary, Intermittent and Interim Uses \nTable 10.1420 identifies where Temporary, Intermittent and Interim Uses are allowed. They are allowed in \naddition to the uses normally allowed in the underlying land-use district. \n• \nP = Permitted use. \n• \nL = Use is permitted, but is limited in the extent to which it may be permitted. \n• \nNP = Use not permitted. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[10.14]-2 \nCity of Gresham Development Code \n \n(06/22) \nTable 10.1420: Where Uses are Permitted \n \nLow-\ndensity \nresidential \ndistricts 1  \n \nMulti-\nfamily \ndistricts 2 \nCommercial \nand mixed-\nuse \ndistricts 3 \nIndustrial \ndistricts \n(GI, HI, \nRTI-SW, \nIND-SW) \nSites of \napproved \ninstitutional \nuses 4 \nTemporary Uses: \n \n \n \n \n \nAgricultural Product Sales, Short Term \nP \nP \nP \nP \nP \nChristmas Tree Sales \nP \nP \nP \nP \nP \nCommercial Stands, Short Term 5, 6 \nNP \nNP \nP  \nNP \nL7 \nFilm Production Studios and Trailers \nP \nP \nP \nP \nP \nFireworks Sales \nP \nP \nP \nP \nP \nReal Estate Sales Offices \nP \nP \nP \nP \nNP \nSpecial Events \nNP \nNP \nP \nP \nP \nTemporary Commercial, Institutional or \nIndustrial Building \nL9 \nL9 \nP \nP \nP \nTemporary Dwelling \nP \nL 8 \nNP \nNP \nNP \nOther Temporary Uses \nP \nP \nP \nP \nP \nIntermittent Uses: \n \n \n \n \n \nIntermittent Lodging \nNP \nP \nP \nNP \nP \nSpecial Events \nNP \nNP \nP \nP \nP \nFarmers’ Markets \nNP \nNP \nP \nP \nP \nWarming/cooling Shelters \nNP \nNP \nP \nP \nP \nOther Intermittent Uses \nP \nP \nP \nP \nP \nInterim Uses: \n \n \n \n \n \nAgricultural Product Sales, Long Term \nP \nP \nP \nP \nP \nCommercial Stands, Long Term 5 \nNP \nNP \nP \nNP \nL7 \nOther Interim Uses \nP \nP \nP \nP \nP \nTable 10.1420 Notes: \n1  \nLDR-5, LDR-7, TLDR, TR, LDR-PV, VLDR-SW, LDR-SW, THR-SW.  \n2  \nMDR-12, MDR-24, CMF, DRL-1, CNRM, MDR-PV, HDR-PV. \n3 \nIncludes districts that allow commercial that are not listed in footnote 1 or 2 and that are not listed as industrial districts in Table 10.1420. \nThese are CC, CMU, DCC, DMU, DRL-2, DTM, DEM, DCL, MC, CNRM, MUE-PV, NC-PV, OFR, RTC, SC, SC-RJ, TC-PV, CNTH, CNTM, \nVC-SW, EC-PV, GC, NC, NC-SW. \n4 \nPermitted uses are allowed on approved institutional sites even if they fall under another category in this table where the Temporary, \nIntermittent or Interim Use is not permitted. \n5 \nDrive-through Commercial Stands (both long-term and short-term) are permitted only where drive-through Business and Retail Services and \nTrade uses are permitted. \n6 \nCommercial Stands, Short Term also may be permitted as an accessory use to Christmas Tree Sales, Farmers’ Markets or Special Events. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[10.14]-3 \nCity of Gresham Development Code \n \n(06/22) \nWhen conducted as an accessory use, they are exempt from the standards specified for Commercial Stands, Short Term in Section \n10.1440.  \n7 \nPermitted for institutions with a minimum site size of 10 acres if consistent with commercial activity allowed as part of the Institutional \nClassifications in Section 3.0270. For example, \"support commercial\" is listed as an accessory use in Section 3.0276 Schools. \n8 \nPermitted on lots where a single detached dwelling or middle housing exists. \n9 \nTemporary buildings for commercial kitchens are permitted only where a facility has been approved through a Special Use Review and the \nmain kitchen facility(Ies) is/are being renovated. \nDevelopment Standards \n10.1430 Standards and Review Processes  \nTable 10.1430 designates time limits and review processes for Temporary, Intermittent and Interim uses. \nApplications shall be reviewed as specified in Article 11. \nA. All Temporary, Intermittent and Interim Uses shall be required to acquire a development permit, \nexcept: \n1. Christmas Tree Sales; Commercial Stands, Short Term; and Film Production Studios and Trailers \nshall be required to acquire a development permit only if they: \na. Remain on the site more than six hours in any one day; or \nb. More than three days in any week (Monday through Sunday). \nTable 10.1430: Permit Duration, Renewals, Review Processes  \nand Additional Standards \n \nMaximum \npermit \nduration \nAre renewals \npermitted? 1 \nReview process \nAdditional standards \nTEMPORARY USES \n \n \n \n \nAgricultural Product Sales, Short Term \n90 days \nNo \nType I  \nSection 10.1440(B) \nChristmas Tree Sales \n50 days \nNo \nType I \nNot applicable \nCommercial Stands, Short Term \n90 days \nNo \nType I \nSection 10.1440(C) \nFilm Production Studios and Trailers \n180 days \nYes \nType I \nNot applicable \nFireworks Sales \n20 days \nNo \nType I \nNot applicable \nReal Estate Sales Offices  \n1 year \nYes, until \nhomes or lots \nare sold \nType I \nSection 10.1440(D) \nSpecial Events \n14 days \nNo \nType I \nSection 10.1440(E) \nTemporary Commercial, Institutional or \nIndustrial Buildings \n1 year \nYes \nType I \nSection 10.1440(F) \nTemporary Dwellings \n1 year \nYes \nType I \nSection 10.1440(G) \nOther Temporary Use \n30 days \nNo \nType I \nSection 10.1440(H) \nINTERMITTENT USES \n \n \n \n \nIntermittent Lodging \n1 year \nYes \nType I \nNot applicable \nFarmers’ Markets \n1 year \nYes \nType I \nSection 10.1450(B) \nSpecial Events \n1 year \nYes \nType I \nSection 10.1450(C) \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[10.14]-4 \nCity of Gresham Development Code \n \n(06/22) \n \nMaximum \npermit \nduration \nAre renewals \npermitted? 1 \nReview process \nAdditional standards \nWarming/cooling Shelters \n1 year \nYes \nType I \nSection 10.1450(D) \nOther Intermittent Use \n1 year \nYes \nType I \nSection 10.1440(E) \nINTERIM USES \n \n \n \n \nAgricultural Product Sales, Long Term \n1 year \nYes2 \nType II, new or \nexpanding site3 \nType I, \nreplacement use \non previously \napproved site4  \nSection 10.1460(D) \nCommercial Stands, Long Term \n1 year \nYes2 \nType II, new or \nexpanding site3 \nType I, \nreplacement use \non previously \napproved site4 \nSection 10.1460(E) \nOther Interim Use \n1 year \nYes2 \nType II \nSection 10.1460(F) \nTable 10.1430 Notes: \n1 \nFor Temporary Uses, a \"No\" in this column refers to whether renewals are allowed for the same use on the same site during a calendar year. \nApplicants may apply for the use the following year. Agricultural Products Sales, Commercial Stands or Other Temporary Uses  that wish to \nexceed the maximum permit duration may apply for an Interim Use permit. \n2 \nInterim Uses permits would renew automatically with the business license or, if no business license is required, at the one-year anniversary \nof when the initial Interim Use permit was issued, except when the use has been subject to a City Code Compliance enforcement action to \naddress an uncorrected violation as provided for in Gresham Revised Code Article 7.50. Enforcement actions include but are not limited to \ncivil penalties, citations and abatement. If an enforcement action has occurred, the use shall be reviewed at the time of renewal following the \nType II process in the same manner as an application for a new permit. In such a case, the enforcement action shall be considered during \nthe renewal application review, such as when determining conditions of approval. \n3 \nThe initial review for Interim Uses on a site shall be a Type II review. This would apply the first time any Agricultural Product Sales or \nCommercial Stands, Long Term application was filed for a site. In addition, a Type II process is required if additional uses occupy the site \nbeyond the number originally approved, such as a site adding a third Commercial Stand on a site approved for two stands.  \n4 \nFor these uses, a new Agricultural Product Sales use or Commercial Stand, Long Term can replace a previously approved like use under a \nType I process, as long as the permit obtained through a Type II review is active at the time of the Type I permit or was active within the last \n12 months prior to the Type I permit. For example, if a Commercial Stand leaves the site, it can be replaced by another Commercial Stand \nusing a Type I process if the Type II permit is current or was active within the last 12 months. Changing from a Commercial Stand to an \nAgricultural Product Sales use would require a Type II process. Applications from new owners shall comply with the latest Development \nCode standards.  \n10.1431 Standards for All Temporary, Intermittent and Interim Uses \nThe following standards apply to all uses in this section: \nA. Uses shall meet land-use district minimum setbacks for the site perimeter. \nB. Except for Temporary Dwellings, Intermittent Lodging and Warming/cooling Shelters, if a site where a \nTemporary, Intermittent or Interim Use is located abuts a lot with a residential use, the Temporary, \nIntermittent or Interim Use shall meet the minimum buffer width required in Section 9.0100 as shown \nin Table 9.0111(B). The Option 2 buffer width, when available, shall satisfy this standard. Buffer trees, \nshrubs and screening from that table are not required. Buffer widths shall be allowed to overlap with \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[10.14]-5 \nCity of Gresham Development Code \n \n(06/22) \nsetback requirements. \n \nFigure 10.431(B): Buffer Width \n \nC. The use shall provide adequate vision clearance as required by Section 9.0200. (Clear vision \nexceptions in land-use districts and Plan Districts still apply.) \nD. Ingress and egress shall be safe and adequate when combined with the other uses of the property as \nrequired by Appendix 5. \nE. Uses shall not create tripping hazards in pedestrian or vehicular areas with items such as cords, cables \nand pipes.  \nF. Signs shall comply with applicable requirements of Appendix 6. \nG. Uses shall be required to post City Temporary, Intermittent or Interim Use permits; City business \nlicenses; and Multnomah County Health Department food service licenses, where applicable, in a \nlocation visible to customers and/or from the street.  \nH. Unless otherwise specified in this section,  Temporary or Intermittent Uses shall be exempt from a \nfinding of adequate public facilities and Interim Uses shall be exempt from a finding of adequate public \nfacilities unless it is determined that the proposed use exceeds the capacity of existing public facilities \nor causes unsafe conditions. \nI. The Manager may impose conditions on any approval intended to minimize adverse impacts created by \nthe use on surrounding property and uses.  \nJ. Temporary, Intermittent and Interim Uses are exempt from land-use district density, floor-area ratio \nand Design District design guidelines and standards. \nK. Uses where at least 50 percent of sales is a combination of food and beverages shall not be allowed. \nThis does not prohibit the sale of food and beverages as described in the definition for each use. \nTemporary, Intermittent \nor Interim Use \n(use and related items) \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 6,
      "text": " \n[10.14]-6 \nCity of Gresham Development Code \n \n(06/22) \n10.1432 Temporary Uses – Time Between Permits \nA. No time period is required between Temporary Use permits on sites, except: \n2. For Commercial Stands, Short Term and Agricultural Product Sales, Short Term, at least four \ncalendar days shall pass between the end of one Temporary Use permit and the beginning of another \nat the same site; and \n3. For Other Temporary Uses in low-density residential and multifamily districts, at least four calendar \ndays shall pass between the end of one Temporary Use permit and the beginning of another at the \nsame site. This does not apply to Temporary Uses at approved institutional sites.  \n10.1440 Additional Standards for Temporary Uses \nA. Temporary Uses may occupy parking required for another use. \nB. Agricultural Product Sales, Short Term \n1. Tents, structures and product display or storage areas shall not be located within 25 feet of an active \ndriveway entrance as measured in all directions from where the driveway enters the site at the edge \nof the street right of way, as shown in Figure 10.1440(B)(1). \nFigure 10.1440(B)(1): Distance from active driveway entrance \n \n \n2. Shall be located at least 3 feet from the right of way or back of sidewalk, whichever provides the \ngreater distance from the right of way. \n3. Shall provide at least 5 feet between service windows or other customer service points and an active \ndrive aisle. The distance shall be measured perpendicular to the service window/point as shown in \nFigure 10.1440(B)(3). \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 7,
      "text": " \n[10.14]-7 \nCity of Gresham Development Code \n \n(06/22) \nFigure 10.1440(B)(3): Space between customer service point and active drive aisles \n \n4. Shall not occupy fire lanes or drive aisles necessary for vehicular circulation or fire/emergency \nvehicle access as determined by the Manager. Agricultural Product Sales may occupy other drive \naisles. In cases where a portion of a drive aisle is occupied, at least 4 feet of clear maneuvering \nspace shall be provided between the closed portion of the drive aisle and the abutting active parking \nspaces, as shown in Figure 10.1440(B)(4). \n \nFigure 10.1440(B(4): Space between active parking and closed parking \n \n \n5. Shall limit the visual effect of accessory items not used by customers, including but not limited to \ntanks, barrels and miscellaneous items, such as by using screening or storing them in containers to \nsubstantially limit views of such items from the street. Screening could be temporary fencing or \nlandscaping (such as landscaping in pots or planters). Storage containers could be small sheds or \nstorage units. Screening shall: \na. Significantly limit views of items within 3 feet of the ground; and  \nb. Allow views through the site between 3 and 10 feet to ensure surveillance of the site \nremains possible for crime prevention purposes. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 8,
      "text": " \n[10.14]-8 \nCity of Gresham Development Code \n \n(06/22) \n6. For Agricultural Product Sales uses that have food service components, the following health and \nsanitation standards shall apply: \na. Applicants shall provide wastewater/graywater disposal documentation that indicates how \nthe outputs will be stored (if applicable) and what wastewater/graywater disposal method \nwill be used. The documentation shall indicate a proper disposal method that ensures fats, \noils and grease do not enter the City’s wastewater infrastructure. Non-stormwater \ndischarges to the City’s stormwater system are prohibited.   \nb. Uses shall ensure the availability of a restroom with hand washing facilities for employees. \nUses that serve food to walk-up customers shall ensure the availability of a restroom with \nhand washing facilities for customers. The restrooms must be within one-quarter mile or \nwithin 5 minutes walking distance and be available during the hours of operation. \nApplicants shall provide the City with documentation that restrooms are available. \n7. Shall not occupy pedestrian walkways or required landscape areas. \n8. Drive-through Agricultural Product Sales are not allowed in low-density and multifamily residential \ndistricts as designated in Table 10.1420 and are not allowed at institutional sites in those districts. \nThey are allowed in commercial and industrial districts where drive-throughs for Commercial \nStands are allowed. They shall meet all drive-through standards applicable to Commercial Stands. \nC. Commercial Stands, Short Term \n1. Shall be on a paved surface such as but not limited to concrete, asphalt, pavers and other surfaces as \napproved by the Manager. \n2. Shall not be located within 25 feet of an active driveway entrance as measured in all directions from \nwhere the driveway enters the site at the edge of the street right of way, as shown in Figure \n10.1440(C)(2). \nFigure 10.1440(C)(2): Distance from active driveway entrance \n \n \n3. Shall be located at least 3 feet from the right of way or back of sidewalk, whichever provides the \ngreater distance from the right of way. \n4. Shall not occupy pedestrian walkways or required landscape areas. \n5. Shall provide at least 5 feet between service windows or other customer service points and an active \ndrive aisle. The distance shall be measured perpendicular to the service window/point as shown in \nFigure 10.1440(C)(5). \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 9,
      "text": " \n[10.14]-9 \nCity of Gresham Development Code \n \n(06/22) \nFigure 10.1440(C)(5): Space between customer service point and active drive aisles \n \n6. Shall not occupy fire lanes or drive aisles necessary for vehicular circulation or fire/emergency \nvehicle access as determined by the Manager. Stands may occupy other drive aisles. In cases where \na portion of a drive aisle is occupied, at least 4 feet of clear maneuvering space shall be provided \nbetween the closed portion of the drive aisle and the abutting active parking spaces, as shown in \nFigure 10.1440(C)(6). \nFigure 10.1440(C)(6): Space between active parking and closed parking \n \n \n7. Shall limit the visual effect of accessory items not used by customers, including but not limited to \ntanks, barrels and miscellaneous items, such as by using screening or storing them in containers to \nsubstantially limit views of such items from the street. Screening could be temporary fencing or \nlandscaping (such as landscaping in pots or planters). Storage containers could be small sheds or \nstorage units. Screening shall: \na. Significantly limit views of items within 3 feet of the ground; and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 10,
      "text": " \n[10.14]-10 \nCity of Gresham Development Code \n \n(06/22) \nb. Allow views through the site between 3 and 10 feet to ensure surveillance of the site \nremains possible for crime prevention purposes.   \n8. To ensure adequate distance for at least three vehicles to line up behind the vehicle ordering at the \ndrive-through, drive-through Commercial Stands shall have at least 85 feet in queuing distance \nbehind each drive-through window where sales occur. Required queuing distance may be increased \nas determined by the Manager if a change in distance will promote traffic and pedestrian safety. \nQueuing distance shall be measured from the rear of the service window or point of service, along \nthe queuing path (see Figure 10.1440(C)(8)), to where the driveway from the street crosses from \nthe right of way into the property. The measurement method can be adjusted by the Manager for \nunusual circumstances or if needed to meet the intent of this standard. \nFigure 10.1440(C)(8): Queuing Path \n \n9. Drive-through stacking lanes and service areas shall not be located between the street and the \nCommercial Stand along Design Streets, in Design Districts and other locations where those \nelements are not allowed between a building and the street. \n10. Awnings attached to the Commercial Stand shall have a minimum of 7 feet of clearance between \nthe ground and the awning to allow access for pedestrians under the awning. \n11. For Commercial Stands that have food service components, the following health and sanitation \nstandards shall apply: \na. Applicants shall provide wastewater/graywater disposal documentation that indicates how \nthe outputs will be stored (if applicable) and what wastewater/graywater disposal method \nwill be used. The documentation shall indicate a proper disposal method that ensures fats, \noils and grease do not enter the City’s wastewater infrastructure. Non-stormwater \ndischarges to the City’s stormwater system are prohibited.   \nb. Stands shall ensure the availability of a restroom with hand washing facilities for \nemployees. Stands that serve food to walk-up customers shall ensure the availability of a \nrestroom with hand washing facilities for customers. The restrooms must be within one-\nquarter mile or within 5 minutes walking distance and be available during the stands’ hours \nof operation. Applicants shall provide the City with documentation that restrooms are \navailable. \nD. Real Estate Sales Offices \n1. The following standards apply to temporary real estate sales offices: \na. The office shall be located within the boundaries of the subdivision or site in which the real \nproperty is to be sold; and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 11,
      "text": " \n[10.14]-11 \nCity of Gresham Development Code \n \n(06/22) \nb. Except for model homes, the property to be used for a temporary sales office shall not be \npermanently improved for that purpose; and \nc. The Manager may impose conditions regarding: \n1. Temporary utility connections,  \n2. The provision of adequate parking for office employees and visitors; and \n3. The duration of time the office shall be allowed to remain on the site. \nE. Special Events \n2. For Special Event activities that include food service, applicants shall provide wastewater/graywater \ndisposal documentation that indicates how the outputs will be stored (if applicable) and what \nwastewater/graywater disposal method will be used. The documentation shall indicate a proper \ndisposal method that ensures fats, oils and grease do not enter the City’s wastewater infrastructure. \nNon-stormwater discharges to the City’s stormwater system are prohibited.   \nF. Temporary Commercial, Institutional or Industrial Buildings \n3. The temporary buildings shall be associated with the primary use on the property. \n4. Once a Temporary Use permit is approved for a temporary building, the applicant shall have one \nyear to receive a Building Permit for the temporary building and the reconstruction of the primary \nuse’s building(s). The Temporary Use permit shall remain in effect as long as an active Building \nPermit exists for construction on the primary use’s building(s) for reasons described in the \n“Temporary Commercial, Institutional or Industrial Buildings” definition in Article 3.  \n5. The temporary building shall be removed from the site within 30 days of the approval of the \ntemporary certificate of occupancy for the primary use’s building(s). \n6. The temporary building shall be located within the site on which the primary use is located. \n7. Temporary buildings are only allowed on sites where the primary use is already developed. \n8. The temporary building shall comply with applicable Building Codes. \n9. The use shall be able to be adequately served by public facilities, if applicable. The Manager may \nimpose conditions regarding temporary utility connections. \n10. \nThe temporary building shall not be used as a dwelling or for sleeping. \nG. Temporary Dwellings \n11. \nThe following standards apply for Temporary Dwellings intended for habitation during \nconstruction of another house on the same lot: \na. The Temporary Dwelling may remain on the site in conjunction with an active Building \nPermit for construction of the other house in the same lot.  \nb. The Temporary Dwelling must be removed within one month after approval of final \noccupancy for the new residence. A performance bond or other surety shall be posted to \nensure removal of the Temporary Dwelling. \nc. Conditions may be imposed regarding temporary utility connections as necessary to protect \npublic health, safety or welfare. \n12. \nThe following standards apply for Temporary Dwellings intended for habitation during \nrecovery from an unforeseen event such as a fire, windstorm or flood: \na. The need for the use shall be the direct result of a casualty loss such as fire, windstorm, \nflood or other severe damage by the elements to a pre-existing residential structure on the \npremises for which the permit is sought. \nb. The use may remain on the site for the maximum amount of time needed to address the \nhardship but no longer than one year, with the exception that the approval may be renewed \nby the Manager as long as there exists an active Building Permit for repair or construction \nof another home on the lot. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 12,
      "text": " \n[10.14]-12 \nCity of Gresham Development Code \n \n(06/22) \nc. Conditions may be imposed regarding temporary utility connections as necessary to protect \npublic health, safety or welfare. \nH. Other Temporary Uses \n13. \nApplicants may submit applications for other temporary uses not specifically listed in this \nsection. The uses shall: \na. Be an allowed use in the land-use district; or \nb. Be of a temporary nature and not have greater negative impacts than allowed uses in the \nland-use district. \n10.1450 Additional Standards for Intermittent Uses \nA. Intermittent Uses may occupy parking required for another use. \nB. Farmers’ Markets \n1. Shall be limited to 70 days of operation per year per site. \n2. For activities that include food service, applicants shall provide wastewater/graywater disposal \ndocumentation that indicates how the outputs will be stored (if applicable) and what \nwastewater/graywater disposal method will be used. The documentation shall indicate a proper \ndisposal method that ensures fats, oils and grease do not enter the City’s wastewater infrastructure. \nNon-stormwater discharges to the City’s stormwater system are prohibited. \nC. Special Events \n1. An Intermittent Special Event shall be limited to not more than two days per week (Monday through \nSunday). \n2. For Special Events that provide food service, applicants shall provide wastewater/graywater \ndisposal documentation that indicates how the outputs will be stored (if applicable) and what \nwastewater/graywater disposal method will be used. The documentation shall indicate a proper \ndisposal method that ensures fats, oils and grease do not enter the City’s wastewater infrastructure. \nNon-stormwater discharges to the City’s stormwater system are prohibited. \nD. Warming/cooling Shelters \n1. Shall be approved by the City Office of Emergency Management or similar responsible City office; \nand \n2. Shall only provide shelter on City-designated days/nights. \nE. Other Intermittent Uses \n1. Applicants may submit applications for Intermittent Uses not specifically listed in this section. The \nuses shall: \na. Not occur more than two days in any week (Monday through Sunday); and \nb. Be an allowed use in the land-use district; or \nc. Not have greater negative impacts than allowed uses in the land-use district. \n \n10.1460 Additional Standards for Interim Uses \nA. Temporary Uses currently in operation with a valid temporary use permit as of Dec. 5, 2013, that \nqualify for an Interim Use permit can be approved under the standards in effect at the time their last \npermit prior to Dec. 5, 2013, was issued, except the following new standards apply and supersede the \nstandards in effect before Dec. 5, 2013: \n1. Review processes as specified in Section 10.1430; and \n2. Section 10.1431, except for (A), (B) and (K).; and  \n3. For Agricultural Product Sales, Section 10.1460(D)(1), (3), (4) and (5); and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 13,
      "text": " \n[10.14]-13 \nCity of Gresham Development Code \n \n(06/22) \n4. For Commercial Stands, Long Term, Section 10.1460(E)(4), (6), (7), and (8). \nTemporary Uses currently in operation also have the option of applying under the standards in effect at \nthe time of application. A new application on the same site, such as for a different owner, shall comply \nwith the standards in effect at the time of application.  \nB. Interim Uses shall not occupy parking needed to meet the minimum bicycle or automobile parking \nrequirement for another use under Section 9.0800. Blocking automobile access to parking spaces shall \nbe considered occupying the spaces. \nC. Uses shall not occupy required landscape or pedestrian areas. \nD. Agricultural Product Sales, Long Term \n1. Agricultural Product Sales that are Interim Uses may sell Christmas trees during the holiday season \nwithout acquiring a separate Christmas Tree Sales permit. \n2. Shall comply with all standards in Section 10.1440(B) for Agricultural Product Sales, Short Term. \n3. The applicant shall provide an estimate of the parking demand on the site and provide information \nabout how parking demand will be accommodated, such as through off-street parking or on-street \nparking on adjacent blocks. That analysis shall consider parking needs of other uses on the site. Off-\nstreet parking may be required by the Manager if the applicant cannot demonstrate adequate parking \nis available to meet demand or it has been determined that a renewing Interim Use has experienced \nparking or related traffic issues on the site or on adjacent blocks. \n4. Shall have lighting to ensure a safe environment for customers. If permanent lighting, such as \nparking lot lighting, already exists on the site, the Manager may determine that the lighting satisfies \nthis requirement. Otherwise, lighting (such as temporary lighting) shall be added that complies with \nthe following: \na. At a minimum, areas intended to be occupied by customers, such as areas near service \nwindows and customer seating, shall be illuminated when the use is in operation during \nhours of darkness; and \nb. No direct light source shall be visible at the property line adjacent to residential at 3 feet \nabove ground level; and \nc. Lighting fixtures shall be oriented and/or shielded so as not to create glare on abutting \nproperties; and \nd. The Manager may modify lighting standards if such modifications are deemed necessary \nand appropriate for the use and surrounding area and help meet the intent of the standard. \n5. Tents, structures and greenhouses associated with Agricultural Product Sales uses that are visible \nfrom the street shall be kept in good repair and be maintained in a safe and clean condition in \ncompliance with the following: \na. Tents, structure and greenhouses shall not have:  \n1. Missing siding, skirting or roofing; or \n2. More than 10 percent of any side experiencing rust, peeling paint, corrosion or other \ndeterioration; or \n3. Components or attachments in disrepair in a manner that causes an unsafe condition; \nand \nb. Tents and canopies associated with the use shall not have: \n1. Tears in the tent/canopy material that exceed 6 inches; or \n2. Mold on more than 10 percent of the material; or \n3. A lack of anchoring; or \n4. Broken or non-functioning supports. \nE. Commercial Stands, Long Term \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 14,
      "text": " \n[10.14]-14 \nCity of Gresham Development Code \n \n(06/22) \n1. Shall comply with all standards in Section 10.1440(C) for Commercial Stands, Short Term. \n2. Shall be on a paved surface such as but not limited to concrete, asphalt, pavers and other surfaces as \napproved by the Manager. If new paved surface is added to a site to accommodate a Commercial \nStand, the parking area shall comply with applicable parking lot standards, including those in \nSection 9.0800. \n3. For sites with more than one Commercial Stand, at least one-third of the stands within 25 feet of a \nstreet right of way shall have a service window or other point of service facing the street on each \nstreet frontage. If the service window or point of service faces a landscape area between the stand \nand the sidewalk and no sidewalk entrance is located in within 30 feet of the service window or \npoint of service, a paved pedestrian path is required between the stand and the sidewalk. A grouping \nof stands can share one path.  \nFigure 10.1460(E)(3): Street-facing service  \n \n4. The applicant shall provide an estimate of the parking demand on the site and provide information \nabout how parking demand will be accommodated, such as through off-street parking or on-street \nparking on adjacent blocks. That analysis shall consider parking needs of other uses on the site. Off-\nstreet parking may be required by the Manager if the applicant cannot demonstrate adequate parking \nis available to meet demand or it has been determined that a renewing Interim Use has experienced \nparking or related traffic issues on the site or on adjacent blocks. \n5. For Commercial Stands that have a food service component, the following health and sanitation \nstandards shall apply: \na. If the applicant intends to contract with a third party for wastewater/graywater disposal, a \ncopy of the contract must be provided to the City within 30 days of receiving a permit.  \nb. The City may require the food or beverage service operator to provide proof of payment or \nother documentation that wastewater and graywater are being disposed of properly. \n6. Shall have lighting to ensure a safe environment for customers. If permanent lighting, such as \nparking lot lighting, already exists on the site, the Manager may determine that the lighting satisfies \nthis requirement. Otherwise, lighting (such as temporary lighting) shall be added that complies with \nthe following: \na. At a minimum, areas intended to be occupied by customers, such as areas near Commercial \nStand service windows and customer seating, shall be illuminated when stands are in \noperation during hours of darkness; and \nb. No direct light source shall be visible at the property line adjacent to residential at 3 feet \nabove ground level; and \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 15,
      "text": " \n[10.14]-15 \nCity of Gresham Development Code \n \n(06/22) \nc. Lighting fixtures shall be oriented and/or shielded so as not to create glare on abutting \nproperties; and \nd. The Manager may modify lighting standards if such modifications are deemed necessary \nand appropriate for the use and surrounding area and help meet the intent of the standard. \n7. Commercial Stands and their accessory items visible from the street shall be kept in good repair and \nbe maintained in a safe and clean condition in compliance with the following: \na. Stands shall not have missing siding, skirting or roofing. \nb. Stands shall not have more than 10 percent of any side experiencing rust, peeling paint, \ncorrosion or other deterioration. \nc. Stands shall not have components or attachments in disrepair in a manner that causes an \nunsafe condition. \nd. Tents and canopies associated with the stand shall not have: \n1. Tears in the tent/canopy material that exceed 6 inches. \n2. Mold on more than 10 percent of the material. \n3. A lack of anchoring. \n4. Broken or non-functioning supports.  \n8. Structures used to provide shelter to customers shall only be tents, canopies and similar membrane \nstructures. Other structures for customer shelter are not allowed. This does not preclude the use of \nawnings attached to and supported by a mobile unit or umbrellas designed for café or picnic tables. \nAll canopies, tents and other membrane structures erected shall comply with Building Code \nanchoring and engineering standards and Fire Code standards. \nF. Other Interim Uses \n1. Applicants may submit applications for other Interim Uses not specifically listed in this section. \n2. The proposed Interim Use shall: \na. Be an allowed use in the land-use district; or \nb. Be of an interim nature and not have greater negative impacts than allowed uses in the land-\nuse district. \n3. The proposal shall not have substantial adverse impacts on the City’s infrastructure, including \nwater, stormwater, wastewater, transportation, or parks systems. \n4. For purposes of the review, the application narrative shall describe the following, as applicable: \na. The proposed use and its operations. \nb. Location of parking and loading. \nc. Street access points, including size, number, and location. \nd. Hours of operation, including when certain activities are proposed to occur. \ne. Crime prevention measures. \nf. Environmental effects which may disturb neighboring property owners such as: \n1. Glare. This may be described in terms of location, design, intensity, orientation and \nshielding; and \n2. Noise; and \n3. Odors; and \n4. Dust; and \n5. Vibration. \n5. The Manager may establish as a condition of approval a termination date for the Interim Use. \n6. Interim Use permits for other uses not specifically listed shall expire at the earlier of:  \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 16,
      "text": " \n[10.14]-16 \nCity of Gresham Development Code \n \n(06/22) \na. The expiration date established by the Manager at the time of approval; or \nb. The occurrence of any event identified in the Interim Use permit for the termination of the \nuse. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.663192",
  "extractor_version": "1.0.0"
}