{
  "metadata": {
    "filename": "dc-section-7.0300.pdf_id7858",
    "extracted_at": "2025-05-22T06:15:25.552556",
    "num_pages": 5,
    "title": "DC Section 7.0300",
    "subject": "Development Code Section 7.0300 Commercial, Institutional and Industrial Design Standards",
    "creator": "Acrobat PDFMaker 25 for Word",
    "producer": "Adobe PDF Library 25.1.211",
    "creation_date": "D:20250416150559-07'00'",
    "modification_date": "D:20250416170412-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": "Section 7.0300 Commercial, Institutional, and Industrial Design Standards (04/2025) \nPage 7.03-1 \nSECTION 7.0300  \nCOMMERCIAL, INSTITUTIONAL, & INDUSTRIAL DESIGN \nSTANDARDS \nTABLE OF CONTENTS \n7.0310 Commercial (except those in a Design District), Institutional, and Mixed Use Developments (Non-\nResidential Component) \n7.0320 Industrial Developments  \n7.0310 COMMERCIAL (EXCEPT THOSE IN A DESIGN DISTRICT), \nINSTITUTIONAL, AND MIXED-USE DEVELOPMENTS (NON-RESIDENTIAL \nCOMPONENT) \nExcept those developments in and reviewed under a Design District, the following design review criteria and \nstandards shall apply to Commercial, Institutional, and the non-residential portions of Mixed-Use \nDevelopments. The Downtown Plan District, Civic Neighborhood Plan District, and the Corridor Design \nDistrict are exempt. Industrial development in the Pleasant Valley Plan District is exempt. In designing the \nsite development plan and landscaping plan the following design criteria and standards shall apply: \nIn designing the site development plan and landscaping plan the following design criteria and standards shall \napply: \nA. Areas to be landscaped as defined in Section 3.0100 – Definitions.  Decorative walkways, when \nintegrated within the landscaped area, may not contribute more than 5% of the overall required \nlandscaping area: \n1. Institutional Uses \nAll areas not occupied by structures, pavement, or outdoor business activity, display or storage \nareas.  In no case shall less than fifteen percent (15%) of the gross site area be landscaped. \n2. Commercial and Mixed-Use Developments \na. A minimum of fifteen percent (15%) of the gross site area: \n-  \nOffice/Residential District \n-  \nNeighborhood Commercial District \nb. Setback areas shall be landscaped or provided with enhanced pedestrian spaces such as \nbenches and drinking fountains: \n- \nNeighborhood Commercial District \nB. Energy conservation is promoted by one or all of the following measures: \n1. Evergreens are planted on the north and east sides of the proposed structure so that the trees will \nbe within 10 feet of the structure at maturity to buffer against the cold north and east winds. \n2. Large areas of window glass and unprotected entry doors are avoided on the north and east sides of \nthe structure. Where north and east facing entries cannot be avoided, there shall be an effective \nwindbreak such as a wall, fence or double entry door. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0300 Commercial, Institutional, and Industrial Design Standards (04/2025) \nPage 7.03-2 \n3. The long axis of the building is oriented east and west with unobstructed solar access to the south \nwall and roof. \n4. The majority of the windows are located on the south side of the structure to take advantage of \npassive solar collection and architectural shading devices (such as window overhangs) are \nincorporated to reduce summer heat gain. \nC. Newly planted trees shall be supported (by the use of stakes and wire) to prevent damage by the strong \nnortheast wind; \nD. Landscaping shall be irrigated by an underground system except that landscaping certified by a licensed \nlandscape architect as being able to survive without irrigation shall be excluded. \nE. When frequent deliveries coincide with customer hours the loading and delivery areas are separated \nfrom parking and pedestrian areas. \nF. Where possible, the loading and delivery areas are oriented to avoid the cold northeast wind. \nG. All outdoor storage areas and garbage collection areas, are entirely screened by the employment of \nvegetative materials or alternative as deemed appropriate by the approval authority. Exceptions to the \npreceding requirements include: New or used cars, cycles, and truck sales (but not including car parts or \ndamaged vehicles); new or used boat sales; recreational vehicle sales; mobile homes sales; new or used \nlarge equipment sales or rentals; florists and plant nurseries. \nH. An identification system, as approved by the Manager shall be designed and posted in such a manner as \nto allow the quick location of on-site buildings and entries. \nI. \nTraffic Impacts and Transit Facilities.  Based on the anticipated vehicular and pedestrian traffic \ngeneration, and the policies of the Community Development Plan, adequate right-of-way and \nimprovements to abutting streets shall be provided by the applicant and shall meet the street standards \nof the City.  Required right-of-way improvements may include but not be limited to installation of \nlighting, signalization, turn lanes, paving, curbs, sidewalks, street signs, bikeways and other facilities \nneeded because of anticipated vehicular and pedestrian traffic generation (refer to Sections A5.400 and \nA5.500). \nJ. In designing accesses for the development, efforts shall be made to mitigate adverse traffic impacts on \nadjacent, low-density residential neighborhoods. In assessing such impacts, the typical daily street \nvolumes shall be considered as specified in Sections A5.501. \nK. On-Site Pedestrian Circulation.  Developments shall include an on-site Pedestrian Circulation system \nconnecting building entrances, public sidewalks, bicycle and auto parking spaces, transit facilities, and \nother parts of a site or abutting properties that may attract pedestrians. All developments must comply \nwith the following Standards for On-Site Pedestrian Circulation Systems: \n1. On-Site exterior pedestrian circulation path facilities and improvements must be provided, and meet \naccessibility standards of the Building Code. Pedestrian circulation paths within the site, connections \nto the public sidewalk, and external connections off site shall provide convenient, accessible, and \nthe most practical direct, barrier-free route design. \n2. The on-site pedestrian circulation shall connect the street to the main entrance of the primary \nstructure on the site; walks shall be aligned to minimize out-of-direction travel. \n3. On-site pedestrian walks must be hard surfaced, and be at least 5 feet wide. A pedestrian walk must \nbe increased to 7 feet wide when bordering parking spaces and surface material shall contrast \nvisually with adjoining surfaces. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0300 Commercial, Institutional, and Industrial Design Standards (04/2025) \nPage 7.03-3 \n4. Where the pedestrian pathways are parallel and adjacent to an auto travel lane, the pathway shall \nuse a raised walk or be separated from the auto travel lane by a raised curb, bollards, landscaping or \nother physical barrier. If a raised walk is used the ends of the raised portions must be equipped with \ncurb ramps. \n5. On-site pedestrian circulation pathways must be lighted to a level where the system can be used at \nnight by employees, residents, customers or the public to an average of 1.5 foot-candles and a \nminimum of 0.5 foot-candles.  Pedestrian pathway lighting through parking lots shall be designed to \nlight the walkway and to enhance pedestrian safety. \n6. Pedestrian facilities must be designed and constructed to provide a direct connection to existing \npublic rights-of-way, public accessways and other on-site pedestrian facilities. Pedestrian walkways \nand facilities shall be constructed: \na. Between all primary building entrances and all streets adjacent to the development site. \nb. To connect any new building entrances on a development site to all other new and existing \nbuilding entrances except those used for loading and unloading freight. \nc. At least one access point must connect to any frontage transit stop. \nd. To provide a reasonable direct connection between pedestrian destinations and limiting out of \ndirection of travel. \nWhere berms, landscaping, fencing or other factors create or would create a site frontage \nimpenetrable to pedestrians and bicyclists, there shall be no less than 1 point of pedestrian \naccess every 200 feet of street frontage where feasible. \n7. Sidewalks or pedestrian paths must connect to other pedestrian-use areas on site such as other \nbuildings, parking areas, recreation or play areas, common outdoor areas, and any pedestrian \namenities such as plazas, resting areas and viewpoints. \n8. Pedestrian pathways must also connect to adjacent developments, when mutually agreed upon \nbetween uses. Development patterns must not preclude eventual site-to-site pedestrian \nconnections, even if infeasible at the time of development. \n9. Public or Private Schools and Parks over one acre lot size, in addition, shall provide direct pedestrian \naccess from adjacent neighborhoods, using multiple pedestrian access points in all directions, which \nminimize neighborhood walking distance to a site. \n10. On-site vehicular and pedestrian circulation shall be designed to minimize vehicular/pedestrian \nconflicts through measures such as minimizing driveway crossings, creating separate pedestrian \npaths through the site and parking areas, designating areas for pedestrians by marking crossings \nwith changes in textural material, and other techniques for minimizing vehicular/pedestrian \nconflicts. Painted stripes are not allowed as permanent marked crossings. \nL. The grading and contouring of the site takes place and site surface drainage and on-site storage of \nsurface water facilities are constructed, when necessary, so that there is no adverse effect on \nneighboring properties, public right-of-way or the public storm drainage system. \nM. The circulation pattern is safe and efficient within the boundaries of the site. Consideration shall include \nthe layout of the site with respect to the location, number, design and dimensions of vehicular and \npedestrian access, exits, drives, walkways, bikeways, emergency equipment ways and other related \nfacilities. \nN. Attempts to preserve significant wildlife habitat have been made. \nO. The development is designed in such a manner that as many trees as possible can be preserved. \nPreserved trees and shrubs shall be protected during construction. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0300 Commercial, Institutional, and Industrial Design Standards (04/2025) \nPage 7.03-4 \nP. Crime prevention elements shall be included in the design, with specific attention to landscaping, \nparking areas, walkways, lighting, entries (with clear, visible address or unit number), exits and visibility. \nQ. All mechanical equipment on roofs shall be screened when abutting a residentially designated property \nor a major or standard arterial street. Screening shall obscure mechanical equipment at elevation. \nR. For mixed use developments including townhouses, the residential or townhouse component shall \naddress the standards within Section 7.0101-7.0103 or 7.0201 as applicable while the commercial \ncomponent shall address the standards of Section 7.0202. \n7.0320 INDUSTRIAL DEVELOPMENTS \nThe following design review criteria and standards shall apply to Industrial developments, unless stated \nelsewhere in the Development Code. Industrial developments in the Downtown Plan District, Civic \nNeighborhood Plan District, and Pleasant Valley Plan District are exempt. \nA. No less than 15 percent of the net site area shall be landscaping, as defined in Section 3.0100. For \npurposes of this subsection, net site area is the gross site area minus area dedicated to public right-of-\nway and area in a public access easement. Decorative walkways, when integrated within the landscaped \narea, may not contribute more than 5 percent of the overall required landscaping area. Landscaping, \nexcept for buffer and screening landscaping, shall allow for visibility between 3 and 6 feet to allow for \nnatural surveillance. Up to 75 percent of the required landscaping may include preserved natural area \nand vegetated stormwater detention/retention facilities.  \nB. Newly planted trees shall be supported by the use of stakes and wire.  \nC. Landscaping shall be irrigated by an underground system, except that landscaping certified by a licensed \nlandscape architect as being able to survive without irrigation shall be excluded.  \nD. An identification system shall be designed and posted as per the Oregon Fire Code as administered by \nthe Gresham Fire Marshal, and as described in GRC 10.25.070.  \nE. Traffic Impacts.  Based on the anticipated vehicular and pedestrian traffic generation, and the policies of \nthe Community Development Plan, adequate right-of-way and improvements to abutting streets shall \nbe provided by the applicant and shall meet the street standards of the City. Required right-of-way \nimprovements may include but not be limited to installation of lighting, signalization, turn lanes, paving, \ncurbs, sidewalks, street signs, bikeways and other facilities needed because of anticipated vehicular and \npedestrian traffic generation (see Sections A5.400 and A5.500).   \nF. In designing accesses for the development, efforts shall be made to mitigate adverse traffic impacts on \nadjacent, low-density residential neighborhoods. In assessing such impacts, the typical daily street \nvolumes shall be considered as specified in Section A5.501.  \nG. On-Site Pedestrian Circulation.  Developments shall include an on-site pedestrian circulation system \nconnecting building entrances, public sidewalks, bicycle and auto parking spaces, transit facilities, and \nother parts of a site that may attract pedestrian movement.  \n1. To the extent possible, pedestrian circulation paths shall provide convenient, practical barrier-free \nroute design. \n2. The on-site pedestrian circulation shall connect the street to the primary entry of the primary \nstructure on the site. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": "City of Gresham Development Code \n \n Article 7: Design Review \nSection 7.0300 Commercial, Institutional, and Industrial Design Standards (04/2025) \nPage 7.03-5 \n3. On-site pedestrian walks must be hard surfaced and at least five feet wide. A pedestrian walk must \nbe increased to seven feet wide when bordering parking spaces and surface materials shall contrast \nvisually with adjoining surface. \n4. Where a pedestrian pathway is parallel and adjacent to an auto travel lane, the pathway shall use a \nraised walk or be separated from the auto travel lane by a raised curb, bollards, landscaping or other \nphysical barrier. If a raised walk is used the ends of the raised portions must be equipped with curb \nramps. \n5. Where a pedestrian pathway crosses an auto travel lane, the crossing shall incorporate a change in \ntextural material or other technique to minimize vehicular / pedestrian conflicts. Painted stripes are \nnot allowed as permanent marked crossings. \n6. On-site pedestrian circulation pathways must be lighted to a level where the system can be used at \nnight – with a minimum of 0.5 foot candles and an average of 1.5 foot-candles. Pedestrian pathway \nlighting through parking lots shall be designed to light the walkway and to enhance pedestrian \nsafety. \n7. Pedestrian facilities must be designed and constructed to provide a direct connection to existing \npublic rights-of-way, public accessways and other on-site pedestrian facilities. Pedestrian walkways \nand facilities shall be constructed: \na. To connect any new building entrances on a development site to all other new and existing \nbuilding entrances except those used for loading and unloading freight. \nb. To connect to a frontage transit stop, if present. \nc. To provide a reasonable direct connection between pedestrian destinations while limiting out-\nof-direction travel. Where berms, landscaping, fencing or other factors create or would create a \nsite frontage impenetrable to pedestrians and bicyclists, there shall be at least one point of \npedestrian access to the site. \nH. The grading and contouring of the site takes place and site surface drainage and on-site storage of \nsurface water facilities are constructed, when necessary, so that there is no adverse effect on \nneighboring properties, public right-of-way or the public storm drainage system.  \n \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.552806",
  "extractor_version": "1.0.0"
}