{
  "metadata": {
    "filename": "dc-section-9.0900.pdf_id7872",
    "extracted_at": "2025-05-22T06:15:20.837713",
    "num_pages": 2,
    "title": "DC Section 9.0900",
    "author": "patty boyden",
    "creator": "Microsoft Word",
    "creation_date": "D:20220615194630-07'00'",
    "modification_date": "D:20220615194652-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n \n[9.09]-1 \nCity of Gresham Development Code \n \n(06/22) \nSECTION 9.0900 \nPROJECTIONS \n \nGeneral \n9.0901  Projections Into Required Yards And Above The Maximum Building Height   \n \nGeneral \n9.0901  Projections Into Required Yards And Above The Maximum Building Height \nA. \nProjections into Required Yards. The following objects and structures may project into the required \nyard: \n1. \nPaved terraces, decks, and stairs may project into required front, side or rear yards provided that \nno structures thereon shall violate other requirements of this Ordinance or the Building Code; \n2. \nUnroofed landings and stairs may project into required front and rear yards only; \n3. \nWindow sills, belt courses, bay windows, eaves and similar incidental architectural features may \nproject no more than two feet into any required yard when not in violation of the Building Code; \n4. \nEaves may project 1 foot over a public side yard utility easement if there is a vertical clearance of \nat least 15 ft. and there is no violation of the Building Code. \n5. \nOpen fire escapes shall not project more than 4.5 feet into any required yard; and, \n6. \nChimneys shall not project more than 30 inches into any required yard. \n7. \nSolar energy collecting structures when attached to a single detached dwelling, middle housing, or \na mobile home in a mobile home subdivision may project into required rear yards as provided \nbelow when such structures meet the criteria of Article 4 and Section 10.0900. \na. \nRear Yard Setback - The rear yard minimum setback may be reduced to 9 feet as \nmeasured from the rear property line; except that an attached solar collecting structure \nwhich occupies over 50% of the horizontal linear dimension of the building's rear \nelevation shall maintain a minimum setback of 13 feet. \n8. \nHeating, air conditioning units, residential fuel cells, small micro-hydro energy systems and small \ngeothermal renewable energy systems (heat pumps). This may be to the side and rear yards only. \nSee Article 4 and Section 10.0940. \n9. \nCustomary yard accessories, ornaments and furniture such as flag poles and landscape ponds. \n10. \nMicro/mini Wireless Communication Facilities. \nB. \nProjections above the Maximum Building Height. Except in the GBSV District as described in Section \n9.0901.D, the following structures may project above the maximum building height: \n1. \nMedium and large scale solar energy systems; \n2. \nSmall and medium scale wind energy systems for the private generation of energy. Medium and \nlarge scale wind energy systems up to 45 feet; \n3. \nAntennas; \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n \n[9.09]-2 \nCity of Gresham Development Code \n \n(06/22) \n4. \nSpires or Turrets; \n5. \nElevator equipment and stair enclosures, on flat roofs only; \n6. \nHeating, ventilation, air conditioning equipment enclosures, small scale biomass energy systems, \nsmall or large scaled geothermal energy systems, and micro-hydro energy systems on flat roofs \nonly; \n7. \nRoof gardens, courtyards and ancillary structures, not to exceed 10 feet in height, on flat roofs \nonly. \n8. \nMicro/mini Wireless Communication Facilities. \nC. \nOther Projections.  Except for parcels in the GBSV District which are governed by Section 9.0901.D, \nthe following structures may project above the maximum building height and into required yards: \n1. \nYard Accessories; \n2. \nReligious Symbols. \nD. \nIn the GBSV District, projections above maximum height allowed by Section 9.0901.B and Section \n9.0901.C will be reviewed under the criteria set forth in Section 8.0100 for Special Uses or by Section \n10.1510 for structures not undergoing a Special Use Review. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:20.837973",
  "extractor_version": "1.0.0"
}