{
  "metadata": {
    "filename": "development-code-appendix-1.pdf",
    "extracted_at": "2025-05-22T06:15:25.416870",
    "num_pages": 5,
    "title": "Development Code Appendix 1",
    "subject": "Development Code Appendix 1.000 Annexations",
    "creator": "Acrobat PDFMaker 25 for Word",
    "producer": "Adobe PDF Library 25.1.211",
    "creation_date": "D:20250416121109-07'00'",
    "modification_date": "D:20250416170528-07'00'",
    "page_sizes": [
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      },
      {
        "width": 612.0,
        "height": 792.0
      }
    ]
  },
  "pages": [
    {
      "page_number": 1,
      "text": " \n[A.1]-1 \nCity of Gresham Development Code \n \n(04/2025) \nAPPENDIX 1.000 \nANNEXATIONS \nPurpose \nA1.001  Purpose \nProcedures \nA1.002  General Procedures \nA1.003  Initiation Procedures \nA1.004  Expedited Annexation Procedures   \nRequirements and Criteria \nA1.005  Submittal Requirements \nA1.006  Approval Criteria \nA1.007  Fiscal Impact Statement \nAppeals \nA1.008  Appeals \nPURPOSE \nA1.001  PURPOSE   \nThe purpose of this section is to establish procedures and criteria under the provisions of Metro Code \nChapter 3.09 and Oregon Revised Statutes including, but not limited to, ORS Chapter 222.  The provisions \nof this section are adopted to achieve the orderly and efficient annexation of lands to the City that will \nresult in providing a complete range of urban services and consistency with the Community Development \nPlan. \nFor the purpose of this section, the term “annexation” means a “boundary change” as used in Metro Code \nChapter 3.09.  The term includes a “major boundary change”, the formation, merger, consolidation, or \ndissolution of a city or district; and a “minor boundary change”, the annexation or withdrawal of territory \nto or from a city or district, or from a city/county to a city. \n \nA petition for any type of boundary change, other than annexation, shall be processed as provided by \nstate law and Metro Code Chapter 3.09. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 2,
      "text": " \n[A.1]-2 \nCity of Gresham Development Code \n \n(04/2025) \nPROCEDURES \nA1.002  GENERAL PROCEDURES   \nGeneral procedures apply to all annexation proposals except as modified by Section A1.004 – Expedited \nAnnexation Procedures. \nA. \nA pre-application conference pursuant to Section 11.0700 is required prior to the submittal of an \nannexation petition. Early neighborhood involvement as provided in Section 11.0800 is not \nrequired. At the pre-application conference, requirements of annexation will be explained and the \nappropriate forms as specified in Section A1.005 will be provided.  \nB. \nAnnexation proposals shall be considered by the City Council pursuant to Section 11.0600, the \nType IV legislative process except there shall be no Planning Commission hearing or \nrecommendation.  The Council decision on the proposal shall be considered the “Final Decision” \nfor purposes of compliance with Metro Code Chapter 3.09. \nC. \nNotice of the Council hearing to consider the boundary change proposal shall follow the \nnotification procedures as required for a Type IV Vacations and/or Historic Designations, as well \nas the uniform notice requirements provided in Metro Code Section 3.09.030. \nD. \nA staff report shall be issued prior to the hearing pursuant to the requirements of Metro Code \n3.09.050(b). \nE. \nThe Council shall make, by resolution or by ordinance, the final decision after the public hearing.  \nThe decision shall be in writing and shall follow the uniform notice requirements of Metro Code \nSection 3.09.030(e). \nA1.003  INITIATION PROCEDURES   \nInitiation Procedures apply to annexation proposals except as modified by A1.004 – Expedited Annexation \nProcedures. \nA. \nAn annexation proposal may be initiated by petition of property owner(s) of the area to be \nannexed as set forth in this section. \n1. \nWhen all owners of land in the territory to be annexed and not less than 50% of the \nelectors, if any, residing in the territory to be annexed, consent in writing to the annexation \nof their land in the territory and file a statement of their consent with the City. \n2. \nWhen a majority of the electors registered in the territory proposed to be annexed consent \nin writing to the annexation and the owners of more than half of the land in the territory \nconsent in writing to the annexation of their land in the territory and file a statement of \ntheir consent with the City. \nB. \nAn annexation proposal may be initiated by Council, on its own motion, as set forth in this \nsection.  The Council may terminate proceedings under this section at any time. \nC. \nAn annexation proposal may be initiated pursuant to the state law Health Hazard Abatement \nannexation process. \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 3,
      "text": " \n[A.1]-3 \nCity of Gresham Development Code \n \n(04/2025) \nD. \nAn annexation proposal may be initiated pursuant to the state law Island annexation process. \nA1.004  EXPEDITED ANNEXATION PROCEDURES   \nA. \nSubject to approval of the Manager a petition for any type of minor boundary change may be \nprocessed through an expedited process as provided by Metro Code Chapter 3.09. \nB. \nAn expedited boundary change proposal shall be considered by the City Council without a public \nhearing and may be placed on the Council consent agenda.  The Council decision on the proposal \nshall be considered the “Final Decision” for purposes of compliance with Metro Code Chapter 3.09. \nC. \nThe petition requirements for expedited applications must be accompanied by the written \nconsent of 100% of the property owners and at least 50% of the electors, if any, within the \naffected territory pursuant to Metro Code 3.09.045(a). \nD. \nNotice of petition for an expedited process must be provided a minimum of 20 days prior to the \nfinal decision and shall follow the notification procedures as required for Type IV Comprehensive \nPlan amendments, as well as follow the expedited notice requirements provided in Metro Code \nSection 3.09.045(b). \nE. \nA brief report shall be issued at least seven days prior to the decision date pursuant to the \nrequirements of Metro Code 3.09.045(c).  The decision record shall demonstrate compliance with \nthe criteria contained in Metro Code 3.09.045(d) and (e). \nF. \nAn expedited process cannot be used if a necessary party gives written notice to contest the \ndecision pursuant to Metro Code 3.09.045(b). \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 4,
      "text": " \n[A.1]-4 \nCity of Gresham Development Code \n \n(04/2025) \nREQUIREMENTS AND CRITERIA \nA1.005 SUBMITTAL REQUIREMENTS   \nAn applicant for annexation shall submit the following application materials in the format and quantity \nrequired at the time of submittal. The application materials shall include: \nA. \nA completed and signed annexation application packet of forms provided by the City. \nB. \nA petition, on City forms, completed by property owners and/or electors residing in the affected \nterritory that meets the minimum petition requirements of Metro Code Section 3.09.040 and \nSection A1.003(A) or Section A1.004(C). \nC. \nA metes and bounds legal description of the territory to be annexed, meeting the relevant \nrequirements of ORS 308.225.  A lot and block description may be substituted if the area is \nplatted.  If the legal description contains any deed or book and page references, legible copies of \nthese shall be submitted with the legal description. \nD. \nA map showing the affected territory, any public streets to be annexed and parcels within 300 \nfeet of the affected territory including any public streets.  The affected territory shall be identified \non the map.  The map shall show scale and a north arrow. \nE. \nA narrative which addresses the approval criteria set forth in Section A1.006 and Metro Code \nSections 3.09.050(d) and, if applicable, (e). \nF. \nA request for an expedited procedure if desired by the applicant. \nG. \nThe applicant shall pay the requisite City fee and remittance deposit for the Metro fee.  The City \nshall forward the Metro fee along with the final decision report pursuant to Metro 3.09.030(e). \nA1.006  APPROVAL CRITERIA   \nThe City Council shall approve or deny an annexation proposal based on findings and conclusions \naddressing the following criteria: \nA. \nThe affected territory must be located within the City’s Urban Services Boundary. \nB. \nThe affected territory must be subject to an adopted plan map or land use designation table in \nVolume 2 of the Community Development Plan. For annexations that are not within an adopted \nplan map, the adopted Multnomah County - City of Gresham Land Use Conversion table shall \napply. \nC. \nThe affected territory is contiguous to the existing city limits. \nD. \nThe proposal complies with the criteria of Metro Code Sections 3.09.045(d) and (e) and \n3.09.050(d) if applicable.  For purposes of this section, public facilities and services mean “urban \nservices” as defined by Metro Code 3.09 to include sanitary sewers, water, fire protection, parks, \nopen space, recreation and streets, roads and mass transit.  It shall also mean police protection \nand storm water utility services. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    },
    {
      "page_number": 5,
      "text": " \n[A.1]-5 \nCity of Gresham Development Code \n \n(04/2025) \nE. \nA Covenant of Waiver of Rights and Remedies City form has been executed by all owners of the \nproperty to be annexed and all owners of any interest in the property to be annexed regarding \nwaiver of any statutory or constitutional regulatory provisions, including but not limited to, Ballot \nMeasure 37 (effective December 2, 2004) as amended by Ballot Measure 49.  This subsection only \napplies to those property owners who have consented in writing to annexation. \nF. \nThat either that funding mechanisms required to construct transportation, wastewater, water, \nstormwater and park facilities consistent with their associated adopted master plans and/or \nTransportation System Plans are in place or; an agreement is executed that funding will be in \nplace prior to or concurrent with a development permit application. \nG. \nThat an agreement is executed to convey to the City any land, within the annexation area \ndesignated in the adopted Parks Master Plan, concurrent with a development permit application.  \nH. \nThat the public interest would be furthered by the annexation. \nA1.007  FISCAL IMPACT STATEMENT   \nThe City shall prepare a fiscal impact statement, which shall estimate the fiscal impact that the proposed \nannexation would have on the City’s general fund.  The fiscal impact information shall be utilized in the \ndetermination of whether the public interest would be furthered by the approval of the annexation. \nAPPEALS \nA1.008  APPEALS   \nThe City Council decision may be appealed according to state law. \n \n",
      "tables": [],
      "footnotes": [],
      "dimensions": {
        "width": 612.0,
        "height": 792.0
      }
    }
  ],
  "tables": [],
  "footnotes": [],
  "references": [],
  "extracted_at": "2025-05-22T06:15:25.417061",
  "extractor_version": "1.0.0"
}